{
 "submission_id": "18rl4o9",
 "title": "What did a teacher say that stuck with you?",
 "selftext": "",
 "created_utc": 1703632264,
 "permalink": "/r/AskReddit/comments/18rl4o9/what_did_a_teacher_say_that_stuck_with_you/",
 "score": 100,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rl4o9/what_did_a_teacher_say_that_stuck_with_you/",
 "comments": [
  {
   "comment_id": "kf23tsq",
   "message": "\"People laugh when they hear truth.\"\n\nIf you wanna do comedy, you gotta remember this.",
   "created_utc": 1703637240,
   "score": 53,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24fn6",
   "message": "My 3rd grade teacher. She told my parents that my brother (1 year ahead of me) should probably be tested for ADHD because he showed A LOT of signs. My dad threatened to have her fired over it. When I was in her class the following year, she saw that I was deeply struggling too, this time with probable Dyslexia. Instead of going to my parents because she knew that would get nowhere, she would have the other kids read their chapters and have me come sit at her desk because she knew I’d have already read the chapter on my own for fun. She taught me little tricks to remember how to keep letters in the correct order, like “wearing a shirt is necessary, that’s why it has one Collar and two Sleeves.” One C and two S’s. Or “the aura of a restAURAnt is important.” There’s a handful more I still reference once in a while at 27 years old. I passed 3rd grade with an A+ in spelling when I’d been averaging a D for the first several months. She was my Ms. Honey. Thanks Mrs. M.",
   "created_utc": 1703637497,
   "score": 125,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1xvd5",
   "message": "My tenth-grade history teacher: \"Beware of any political candidate who offers simple solutions to complex problems.\"\n\nI can only imagine what his reaction would be to what passes for political discourse in America (and elsewhere) these days.",
   "created_utc": 1703634703,
   "score": 72,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1sz4o",
   "message": "I had a middle school teacher who taught us about the stock market.  While I am by no means a millionaire, I am living much more comfortably due to what he taught me.",
   "created_utc": 1703632641,
   "score": 73,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1s6ju",
   "message": "*”nice tits”*",
   "created_utc": 1703632304,
   "score": 69,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1su87",
   "message": "“Let me measure your height”. This teacher apparently loves to measure his female students’ heights. I was also one of the victims. When he measured our heights, he also placed his hands on our breasts. We were just middle schoolers at the time.",
   "created_utc": 1703632583,
   "score": 65,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1xi1a",
   "message": "Grade 11 English teacher\n\n\"In a regular conversion there is a back and forth, clarification can be requested, additional details can be provided. When communicating in writing these opportunities rarely exist and so it is important to be precise and clear in what we say. It is also important to learn to read properly so you can understand what you're reading without additional communication being required.\"\n\n\nIt is painful how many arguments I see online from people who can neither write effectively nor read correctly.",
   "created_utc": 1703634547,
   "score": 59,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1tapb",
   "message": "I was a young girl who didn't care much about her dialect, until my teacher told me that an important part of a pleasant and positive personality was to be articulate, polite and humble, I will never forget that because of how it changed my life and my perception after that.",
   "created_utc": 1703632777,
   "score": 45,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf22qje",
   "message": "\"It's my job to lecture. It's your job to be a sieve, not a sponge.\"\n\nBasically sift out the good information, or find what works for you. Don't just absorb and repeat whatever is said",
   "created_utc": 1703636778,
   "score": 25,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf27jyt",
   "message": "Nothing she said, but something she did. I called her when I was stranded downtown. I was crying. And she came to pick me up. She sat down next to me and talked to me to find out why I was crying. She learned that I was just raped and instead of taking me home. She took me to the hospital. And started taking me to therapy every week.",
   "created_utc": 1703638824,
   "score": 19,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1tvm7",
   "message": "In middle school, I was reading a particularly period piece themed novel. \nThere was a word I couldn't quite figure out even with the sentence content. \nDuring downtime, in which we were allowed to do what we wanted quietly, I asked my instructor what the word meant. \n\nImmediately they scoffed that I didn't know myself and said I shouldn't be reading books of that level if I didn't know the words. Mind you this was the only time I had ever asked for a word definition and merely asked because I wasn't around any other resources in the moment to seek it out (dictionary, computer, etc).\nFrom then on I made a point not to ask teachers questions.\n\nIt sticks with me because of how one small statement or interaction can pave the course of an education for a child.  \nI was in an abusive neglectful home; something that no teacher ever inquired into even at times when there were signs. I grew up thinking I couldn't be good enough let alone for higher education. \nIt wasnt until later in my 20s i convinced myself to try to go to college and, with some amazing instructors, I graduated magna cum laude. A little kindness goes a long way.",
   "created_utc": 1703633017,
   "score": 35,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1yr64",
   "message": "Your integrity is not worth a few points",
   "created_utc": 1703635080,
   "score": 12,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1t7hh",
   "message": "Freshman undergrad advisor said I shouldn’t try to get into med school cuz I didn’t ace my high school state wide chem and physics regents exams. Currently in med school.",
   "created_utc": 1703632740,
   "score": 34,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1sxuu",
   "message": "You're either stupid or lazy.",
   "created_utc": 1703632626,
   "score": 9,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1zicd",
   "message": "6th grade\n\n*\"What's wrong with you?\"*",
   "created_utc": 1703635408,
   "score": 11,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1xsly",
   "message": "Correlation is not causation.",
   "created_utc": 1703634670,
   "score": 9,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf29o0f",
   "message": "Freedom is not the right to as you please, it's the right to do as you should. \n\nThank you Mr. Seguin at Duluth Denfeld HS.",
   "created_utc": 1703639738,
   "score": 10,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf29z8m",
   "message": "Middle school English teacher told my mom I was horrible at writing and first ever D in my life. I wrote a best selling book as an adult.",
   "created_utc": 1703639874,
   "score": 9,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1wby3",
   "message": "I had an AP biology teacher who gave our class a very random lecture about how we were all failing his class because we were getting angry with the material and that anger makes everything more difficult.\n\nIt was a really strange class and it was actually his awful instruction that was making us all fail, but what he said about anger I found to be true and it actually has helped in the long run.\n\nSide note, he quit after that year to go back to med school. I think he was wrestling with feelings of remorse about his career path 😂",
   "created_utc": 1703634054,
   "score": 18,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1sh8y",
   "message": "“Look at you, doing nothing but blowing spit bubbles. Get back to work and pay attention!”",
   "created_utc": 1703632430,
   "score": 8,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24oxj",
   "message": "Anytime you blow steam, you lose power.",
   "created_utc": 1703637608,
   "score": 9,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf25oks",
   "message": "“Even if I have no other reason to respect someone, I’ll still respect them for the fact that they’re human”- my band director last year",
   "created_utc": 1703638031,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1sdl8",
   "message": "'Interesting, your brother does it differently'",
   "created_utc": 1703632387,
   "score": 7,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1thtb",
   "message": "\"Sit your goofy ass down, son.\"",
   "created_utc": 1703632858,
   "score": 7,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24ekp",
   "message": "My 10th grade History teacher to someone picking on another student for their bad grade. He stopped him and told the whole class that “Being smart isn’t the only factor in success and that being rude to others can sabotage your own future”.  That was followed by a 15 minute talk about qualities employers look for and how get get along with coworkers. I think he was talking about networking long before it was a term. BTW the not so bright guy was well liked by everyone and became successful in sales because he could talk to anyone. The other guy became a CPA so it’s not like he wasn’t successful in the end either.",
   "created_utc": 1703637484,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf25xsc",
   "message": "**Elementary (Public):**\n\n*(To class):* \"The sad truth is that people will remember the times people were unkind to them more than they will remember people being kind. So always be kind to people so they won't have bad memories here.\"\n\n**High School (Private):**\n\n**Art Teacher I previously admired** *(to class):* \"If gays are allowed to marry, it will open the door for pedophiles in this country.\" *(I was gay and in the closet)*\n\n**Religion Teacher** *(a priest, in a rage when I tried to diffuse a situation between him and other students he was yelling at for making a simple mistake):* \"Shut up \\[name\\]! Nobody cares what you think!\"\n\nMy elementary school teacher was right.",
   "created_utc": 1703638139,
   "score": 7,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2como",
   "message": "\"Don't give directions that can be understood, give directions that cannot be *mis*understood\"",
   "created_utc": 1703641048,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1sfnh",
   "message": "She said I have a face meant for radio",
   "created_utc": 1703632411,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1uunq",
   "message": "\"I don't like the way you look, the way you talk, the way you laugh,  the way you breathe.\" Good ol, Mrs. Sullivan, 8th grade English",
   "created_utc": 1703633425,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1v6je",
   "message": "High school physical science teacher:\n\n\"If you're bored here, you should just drop out\".",
   "created_utc": 1703633566,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1wdb4",
   "message": "Psychology teacher:  \"107.  You will never forget this number for the rest of your life.\"",
   "created_utc": 1703634070,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1x2e3",
   "message": "It was actually the most important thing I learned in high school, and I learned it from our music teacher. On the upper left corner of the board he had written \"no excuses, just results\" in sharpie. Whenever someone was trying to come up with a bs excuse he wouldnt say anything, but turn and point to the board.\n\nHe was pretty lenient if you took responsibility.",
   "created_utc": 1703634365,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf20plh",
   "message": "“Writing will never be easy, nor will you ever be rich from it. And if you try to get rich off of it, you’ll probably wind up like me with a laundry list of felonies committed in an attempt to support your writing career. Just get a day job you can stand, and let your talent and work ethic run amok when you’re off the clock. Blue skies, brother.”\n\nMy mentor in undergrad told me this. Hands down it was the best advice I ever received, not only for writing but for life in general.",
   "created_utc": 1703635922,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf225tj",
   "message": "2 different things.\n\n6th grade history teacher told the class we would see our own version of the great depression, not like our grand/great parents but something close. This was back in '03, kinda stuck with me.\n\nHS teacher, never was sure what her title was, but that I wasn't going anywhere and would not amount to anything. Jokes on you, got out of that town, happily married with a good job.",
   "created_utc": 1703636534,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24oxq",
   "message": "One 10 second decision can impact the rest of your life.",
   "created_utc": 1703637608,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2ecqu",
   "message": "\"Cancer isn't a death sentence.\" For context that teacher had just found out about me having cancer (Thankfully it was caught early and easily treated) my freshman year of high school and this teacher was the one I liked the most of all my teachers that year because he was completely honest about him fighting cancer two times in the past twenty years. He also invited me to after school tutoring so I could ask him questions about cancer treatment so I wouldn't be scared or nervous going into treatment. That teacher passed away this year from late-stage cancer, but he had cheered the loudest for me at my high school graduation.",
   "created_utc": 1703641774,
   "score": 7,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2gv6m",
   "message": "One day, I was feeling some of my worst. Maybe not physically, aside from being tired, but mentally. This was high school, Sophomore year. I go to my first class of the day early, sit down, lay my head on the table and stare off into space. My English teacher, bless her heart, walked in and saw me, and actually asked me if I was alright. I have never *once* been checked up on like that by a teacher before or since. Folks, if you get a teacher that cares about your wellbeing, be a good student for them even if you aren’t for anyone else.",
   "created_utc": 1703642880,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1si02",
   "message": "She's never going to go out with you .\n\n\n\nLost my virginity 2 years later to the girl she said would never go out with me ... it sucks to suck don't it bitch!",
   "created_utc": 1703632439,
   "score": 11,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1y7qp",
   "message": "That the word ”impactful” is absolutely meaningless and you should avoid using it at all costs if you actually want to convey the impact of something.\n\nNot super important or anything, but damn if I don’t notice how often the word “impactful” is used lol",
   "created_utc": 1703634851,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf21gqu",
   "message": "“I believe it should be legal to kill Nazis.”",
   "created_utc": 1703636239,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2bepr",
   "message": "I was always considered the funny guy in high school. I got close enough to my computers teacher my senior year where I was able to crack jokes and he knew about this girl I was trying to get with at the time(I actually ended up dating her but not the story) and I was never in anyway disrespectful to anybody so as I’m about to graduate, he pulls me to the side and tells me “don’t take this the wrong way, I like you and I’m sure you’ll be successful at whatever you decide but six flags is hiring mascots if you need a summer job. You would be the perfect fit with your character and I’m sure people will love you” and it’s always stuck with me since for some reason.",
   "created_utc": 1703640490,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2c3qb",
   "message": "You should always use as few words as possible to get your thoughts across to people.  Using more, complex words than are necessary does not make you smarter than everyone else, it just wastes their time.  I continue to live by that rule 40 years later.",
   "created_utc": 1703640797,
   "score": 6,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2n47c",
   "message": "Had  professor wrote “you can do better” as the on,y comment on a paper.  Got a B+ or A-.  Hurt especially since I knew she was right and had just rushed last minute to churn something out.\n\nWhen exam rolled around I wrote like a man possessed.  Ended up cutting my wrist on the paper and bled all over the exam.  Then the comment was “WHAT DID YOU DO?!?”.",
   "created_utc": 1703645687,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2queb",
   "message": "My law school professor second year. “Be the hero of your own paper trail.” I cannot stress enough how important it is to DOCUMENT EVERYTHING and do it properly!!!!",
   "created_utc": 1703647404,
   "score": 4,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf22pzc",
   "message": "Junior high teacher. Class was full of degenerates and would always test his patience at the beginning of class. He walked in one day and exclaimed, \"Please come over for gay sex\". Everyone stopped talking and immediately stated in awe. Then he started explaining how to classify an organism. phylum, class, order, family, genus, species",
   "created_utc": 1703636771,
   "score": 8,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1zsgk",
   "message": "If in doubt look it up!  (Never skip by a word if you don't know what it means, it affects your overall reading comprehension).",
   "created_utc": 1703635530,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf29qsx",
   "message": "“No matter what you do, there’s always gonna be someone out there who is better at it than you.”",
   "created_utc": 1703639772,
   "score": 4,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2cx3a",
   "message": "“That’s what you get.”\n\n I fell down the stairs at school and my third grade substitute teacher thought I was playing on the stairs but I actually just tripped and fell. It just goes to show you how important it is to lead with kindness and choose your words carefully.",
   "created_utc": 1703641150,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2e1u6",
   "message": "You'll never amount to anything.  A few years later he called me for advice.  I married his niece.",
   "created_utc": 1703641641,
   "score": 4,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2e8xx",
   "message": "\"Be good, and if you can't be good, be safe\" - last words my high school chemistry teacher said to me (in reference to unsubstantiated rumors that I'd caught an STD)",
   "created_utc": 1703641727,
   "score": 4,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2eahc",
   "message": "I said my shop teacher would die soon because he’s old and he said “It’s not the age that gets you it’s the mileage, and you’ll be dead long before me.”",
   "created_utc": 1703641746,
   "score": 4,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2ij1y",
   "message": "Was told my writing wasn’t good enough to be put into honors English. My mom forced the school to put me in honors and I did just fine. It was at that moment in high school I realized I had to start writing my essays based on how the teacher liked it written. Two years after I wrote an entire essay for a friend who was in her class and I got him an A on it because I wrote it exactly how she liked it. She likes everything simplified and direct where you HAD TO STATE “this is________becauee_________” and I hated that way of writing and tried to go beyond that in her class which is why she said my writing wasn’t good enough when in actual reality, her way of writing wasn’t good enough to be an honors teacher.",
   "created_utc": 1703643629,
   "score": 4,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf20gea",
   "message": "\"You gotta be the dumbest student I ever had. Call your mother to come pick you up.\"\n\nI was glueing paper together and glued the papers to the desk.",
   "created_utc": 1703635812,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf22qua",
   "message": "Everytime you look at the clock is every second you're watching your life slip away",
   "created_utc": 1703636781,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf27xhp",
   "message": "I ran away twice in my freshman year of high school due to abuse from my mother at home. Upon my (safe) return to school after being found at a friends several days later, my algebra teacher came up to me, during a pop quiz, and loudly asked me “*Do you plan to actually stick around this time, or should I put this back on the shelf?*” while he handed me a replacement book because my mother had destroyed mine and told the school I must’ve done it in a fit of rage. I ran away again exactly 14 days later \u0026amp; was gone for months. I never returned to that school \u0026amp; actively avoided speaking to any teachers after that. He was aware I was being abused at home, to add.",
   "created_utc": 1703638986,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf28ps6",
   "message": "During my graduating year my middle school teacher gave us quite a stressful speech. He told us that down the line 25% of us would go to college, 25% would go to university, 25% would go straight to work after high school, and 25% would go to jail. Back then this really had me worried, even though I am an engineer now I still think about what he said...",
   "created_utc": 1703639326,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2st6h",
   "message": "College professor. I had a few classes with her over the years and she knew I was a single mom. The last exam of the last class for my degree was with her. When I handed it in. She looked me in my eyes and said, “The kids in this room will never understand what you’ve just accomplished. You are head and shoulders above everyone else here.”I walked outside and cried. Took me until 27 to get my degree, but I got it 🙂.",
   "created_utc": 1703648316,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf298kl",
   "message": "\"God blessed you with a big brain, now, be brave, and you'll have a great life.\"",
   "created_utc": 1703639552,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1t1y1",
   "message": "“Don’t expect fair treatment between you and girls.”",
   "created_utc": 1703632674,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1xg3d",
   "message": "“I think you just want attention because you clearly aren’t getting enough at home” I was misbehaving and had an abusive stepfather which they knew about",
   "created_utc": 1703634525,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf20fti",
   "message": "“i want to drop out and do my HSC at a college”\n\n“what?! no! don’t do that!!”\n\ni did it anyway, passed with flying colours, on my way to university to do law",
   "created_utc": 1703635805,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf217k8",
   "message": "\"You can't fix stupid.\" I still quote it very often.",
   "created_utc": 1703636132,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf21945",
   "message": "\"it's ok, you just learned it from a different indian\"\n\nI'm setting aside the potential racism of it, - it's mostly about how people can learn things from different sources, but still get similar results.",
   "created_utc": 1703636150,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf21acm",
   "message": "After taping a shooting target to his chest he looked at a group of us in the back of the band stands and said \"Do you think you could hit that from the back of the auditorium?\" (speaking mostly to a smart ass of a kid)  He got escorted out.\n\nHe was a band teacher who had a bit of a meltdown. He was going through a nasty divorce and he had recently replaced the previous (beloved) band teacher who retired after like 40 years. There was no humor in his face when he said it. It scared the shit out of a couple students. The smartass asked \"pistol or rifle?\"",
   "created_utc": 1703636165,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf238tq",
   "message": "She told me I would never amount to anything.",
   "created_utc": 1703636993,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24qm5",
   "message": "That my long hair would eventually be tangled in a tree and I would be killed hanging there. (Christian school 8th grade teacher)",
   "created_utc": 1703637627,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf28m22",
   "message": "He took my phone away cause I needed to text my parents so I was angry and pushed my chair too hard into the desk to show my anger. He proceeds to take me into the next room grab me by the shirt and push me against the wall and told me I had anger problems and that'd I'd beat my wife and kids one day. Fucking nutcase but it definitely stuck with me lol",
   "created_utc": 1703639281,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2a3p1",
   "message": "I was in middle school.. my male home room teacher was prodding at my family living situation and had the balls to ask “is your mom into other women” … looking back holy shit what a creep show",
   "created_utc": 1703639927,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2a56b",
   "message": "“You need to pray to Jesus to help you correct your delinquent behavior.” And then she cried. She was my guidance counselor and that was the last day I attended high school. Looking back, I’d have to say peri-menopause got her good that day.",
   "created_utc": 1703639945,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2aqj1",
   "message": "IT Teacher: You better known what happens when you press \"enter.\"\n\nI scripted and automated my entire it business. Now, I'm attempting to automate a garden... free food.",
   "created_utc": 1703640198,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2b3xp",
   "message": "\"If you need further help, come ask.\"  \n\n\nAnd then when I asked, \"I just explained this to the entire class! What are you... stupid??\"",
   "created_utc": 1703640361,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2hpqf",
   "message": "*(to someone else)* “Once you graduate, there won’t be people getting paid to tolerate you anymore.”",
   "created_utc": 1703643261,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2knwk",
   "message": "\"Your failures are your own.  Your successes are the team's.\"  \n\n\nI really hate that it's true.",
   "created_utc": 1703644587,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2uq5m",
   "message": "My math teacher in 10th grade. I struggled with Math a lot but, all things considered, still had a spot in the honors program. This was known to the teacher who treated our classes for Algebra 2 with the expectation of rapid understanding of the concepts. I struggled most with simultaneous systems of equations which I look back now and laugh about. After a test (which I got a 20/100 on), the teacher approached me and said “you are terrible at math and should consider leaving the honors program.” I did not want to leave my friends who i’ve come to know from my years of schooling. I made this known to her and she responded, “then, be better.” Never forgot this. \n\n5 years later, I am studying Mathematics and Economics in college, doing independent studies for undergraduate research in applied theoretical math, and have this teachers quote in each notebook I use. “Be Better.” \n\nI resented her; now I look back and find her to be the best teacher I’ve ever had.",
   "created_utc": 1703649218,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2canq",
   "message": "“What happened to you…(asked rudely \u0026amp; rhetorically.)\n\nYou used to be my best student now you’re…this.”\n\nMy Gifted teacher I had for the second time after changing middle schools twice in a year. My parents had broken up \u0026amp; I was literally starving so I couldn’t sleep at nite. Mom took the food money from Dad \u0026amp; the food stamps to her new boyfriend’s house. \n\nNow I realize she thought I was on drugs. Wish she would have asked. FU Mrs. Crane.",
   "created_utc": 1703640880,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1turj",
   "message": "Never vote Republican.",
   "created_utc": 1703633007,
   "score": 5,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1y93z",
   "message": "A neat handwriting is the sign of a tidy mind.",
   "created_utc": 1703634867,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2f8hr",
   "message": "\"You are just a sarcastic brat, with your attitude, you will never amount to anything.\" -Mrs. Thurman, 7th grade English teacher. She was a raging bitch and made it a point to pick on me the most, thing is, if she hadn't been a bitch, I wouldn't have pushed her buttons. Teenagers are dicks.\n\n\"How are you this sweaty when you barely even ran?\" -Mr. Rassmussen, elementary school P.E. teacher. I was a sweaty kid even though I played sports regularly. Fuck you, jerk, thanks for pointing it out in front of everyone.\n\n\"This is NOT a spatula, IT'S A PANCAKE TURNER. KNOW THE DIFFERENCE!!!!\" -My high school Foods Class teacher. She would go off the rails if I called a \"pancake turner\" a spatula, and a spatula a \"spreader.\" She liked to argue and call the girl students \"little bitches.\" I think of her anytime I use a spatula when cooking burgers. \n\nI also had teachers who knew I liked creative writing and told me to try it out. They appreciated how different my thoughts were than some of my peers. I really had a lot of great teachers. I also remember my high school teacher who taught...something about family something...on the first day of class saying firmly,\n\n\"YOU DO NOT URINATE AND MENSTRUATE OUT OF THE SAME HOLE. PLEASE KNOW YOUR ANATOMY.\" It was great.",
   "created_utc": 1703642160,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2iqke",
   "message": "\"WHY CAN'T YOU JUST FOCUS!?\" Amanda, You Are Teaching A Special Needs Class. Have A Little More Patience",
   "created_utc": 1703643721,
   "score": 2,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1tvnw",
   "message": "English 11 teacher\n\nSomeONE (holding up the index finger)\nEveryONE\n\nto stress to the class those subjects use the pronoun his or her, not they.",
   "created_utc": 1703633018,
   "score": 3,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2063d",
   "message": "You never learn, unless you try.",
   "created_utc": 1703635690,
   "score": 0,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24dve",
   "message": "\"Just... lip-sync.\"\n\nsaid by my 8th grade choir teacher, a class I had taken in order to learn how to carry a damn tune. Bitch couldn't be bothered to teach, I guess...",
   "created_utc": 1703637476,
   "score": 0,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2kvij",
   "message": "A teacher told me not to go to school for teaching, so I didn't. I've always regretted it and wish I had a job with the perks and easier scheduling of a teacher.",
   "created_utc": 1703644679,
   "score": 254,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1sutg",
   "message": "you must be the dumb one out of all you siblings",
   "created_utc": 1703632590,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1uvpp",
   "message": "Said that i was going to Be a failure For The rest of My Life ( i was 3 minutes late For class )",
   "created_utc": 1703633438,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1v00r",
   "message": "Yeah Mmmmhmmm.\n\nShe would say it every 5 min",
   "created_utc": 1703633489,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf1zulq",
   "message": "One time when I was in kindergarten I asked if I could not eat one of the side dishes alot. I was a very picky eater but also very anxious and wouldn’t just throw away food cause it might make an adult mad. So if I didn’t like something I would ask if it was okay to not eat it. They never seemed to care until this one time my teacher blew up at me and said “DO WHATEVER YOU WANT, WHATEVER WE SAY IS WRONG ANYWAYS!” And I cried and didn’t throw it away. To this day (about 28 years later or so) I have no idea why she reacted that way.",
   "created_utc": 1703635555,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf208i4",
   "message": "Your opinion is wrong",
   "created_utc": 1703635718,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf22cb0",
   "message": "\"If you don't put those dice away, I'm gonna shove them up my ass!\" Said a flamboyantly gay substitute teacher to a group of kids gambling in class. That sub got fired for making us read a play about middle school girls masturbating. We were in band class and were supposed to practice playing Star Wars. Why did we need to read a play about ballet girls touching themselves? One of the girls in class recorded us reading the play as our given characters. Also, he groped one of my friends. The dude should've stayed in Spain.",
   "created_utc": 1703636611,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf244zh",
   "message": "Long story short. She said to stop touching my boyfriend's knee because it leads to other things right in front of the whole class. I flipped on her",
   "created_utc": 1703637373,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf247k0",
   "message": "Fractions are good people",
   "created_utc": 1703637402,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf24pan",
   "message": "\"your like an onion every time I think I know you, you peel back another layer\" and \"that sounds a lot more like LSD than pot\" were both said to me by one of my favorite teachers I was a known pothead in highschool and the second one was about a short story I had to write and read in front of the class",
   "created_utc": 1703637612,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf259sn",
   "message": "\"sometimes songs sound like colors and this song sounds very yellow to me\"",
   "created_utc": 1703637854,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf25gwt",
   "message": "“You have no right to be around good people”",
   "created_utc": 1703637937,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2602l",
   "message": "3rd grade art teacher: “You’re bad at art”",
   "created_utc": 1703638166,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf26gzs",
   "message": "Not particularly what she said but what she did. I was crying over something, it was just us two, and then she started to hysterically laugh. I asked her what was that and she just denied it happening. Definitely stuck with me.",
   "created_utc": 1703638365,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf26ups",
   "message": "When there was a one day substitute teacher in my 11th grade English class that quite literally said, to the entire class, that the only way I could get a blowjob was if I lined up behind portable 4 to see the special ed girl that was doing anybody that was there (a legitimate thing that happened at my school for a time). That substitute became the permanent teacher a month or so later and verbally threatened my life at least 3 times cause I waved at her riding my bicycle to school (her house was apparently on my daily route)",
   "created_utc": 1703638528,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf26viq",
   "message": "\"Open up your backpacks. Those of you who see general disorganization, papers crumbled underneath your binders, miscellaneous trash and debris everywhere.. It is too late for you. You will carry this with you through adulthood.\"\"\n\n6th grade",
   "created_utc": 1703638538,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf272aw",
   "message": "A high school history teacher said, “Intelligence is a behavior. What you are learning at this school are the behaviors that will mark you as intelligent over the course of your life.” \n\nIt is 40 years later and I’m not sure that was correct, but I still think about it.",
   "created_utc": 1703638617,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf278i5",
   "message": "You should write with the same passion and interest as you use to masturbate.",
   "created_utc": 1703638691,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2abct",
   "message": "STOP THINKING AND DO AS YOU'RE TOLD!!!",
   "created_utc": 1703640017,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2act4",
   "message": "my freshman year, a sub yelled \"if you don't sit down and shut up, i'm gonna beat you with a wet noodle!\" at a problem child",
   "created_utc": 1703640034,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2awr4",
   "message": "Why are you late?",
   "created_utc": 1703640274,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2bve7",
   "message": "3rd grade teacher seeing me drawing a bird.  \n\n\n\"You know, you're a wonderful reader. And you have such a beautiful singing voice. Maybe you should stick to those things instead of trying to draw.\"\n\n\u0026amp;#x200B;\n\nI was 48 years old before I tried art again. So what, 40 years after her comment?  \n\n\nNow I paint and draw. Teach art projects to kids. And I still sing. And read.\n\nMrs. 3rd grade teacher? Kiss my butt.",
   "created_utc": 1703640695,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2c5l9",
   "message": "That I was a wonderful person, had a great personality, and that the right people would see me one day. \n\nI was in hs. I was used and abused at this point. Assumed the worst of all people. Never had someone “see” me as far as I knew. Personality? What is that? Literally I didn’t know what a personality was. Like, my experience was that men used women for sex. Men were out for sex. Men never “saw” women as people. The fact he saw me meant nothing at the time. \n\nYears later, realizing I am human and a person, he was amazing. I was way past hs and couldn’t find him to tell him. But if he somehow sees this, thank you.",
   "created_utc": 1703640819,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2cdc1",
   "message": "You’re right, they only care about what everyone else thinks.",
   "created_utc": 1703640911,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2cloe",
   "message": "Give me your best effort so you can know what that looks like for one day when you come across a task that actually requires it",
   "created_utc": 1703641012,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2cqb2",
   "message": "“*cough wheeze* why the fuck does this room smell like tuna fish?! I don’t even eat tuna fish?!”",
   "created_utc": 1703641069,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2crnm",
   "message": "Do tell my husband or the principal.",
   "created_utc": 1703641085,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2d2rl",
   "message": "“plagiarism is bad”. Oh yea then explain how  every famous people on Tik Tok got famous.",
   "created_utc": 1703641217,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2dr1r",
   "message": "We are all lost. We are all trying to find ourselves constantly throughout our life.",
   "created_utc": 1703641509,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2duni",
   "message": "“you could have a baby right now, but only i could give you sperm to create one.” my science teacher said that to my thirteen year old friend, he was talking about the reproductive system. about how all the girls in the rooms had eggs to have children already, but the boys didn’t have sperm yet, he was the only male in the room with sperm.",
   "created_utc": 1703641553,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2dwcc",
   "message": "My women’s and gender studies teacher had a student pass out during the student’s presentation due to menstrual pain. The teacher (a female) proceeded to make the student move out into the hall to be inspected by EMT’s so that they could lecture to us for the last 5 minutes of class. A state university. I learned that just because someone studies something and even if they teach it, that doesn’t mean they know what anything about it’s application.",
   "created_utc": 1703641575,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2eil4",
   "message": "“You’re an idiot”",
   "created_utc": 1703641845,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2elt9",
   "message": "\"Your facility with words allows you to think less clearly than you would otherwise.\"  He was right.",
   "created_utc": 1703641885,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2eotv",
   "message": "“Reputation is the key to learning.” Which in a way can be true for many things, but not necessarily true for all things.",
   "created_utc": 1703641923,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2fl4d",
   "message": "It doesn't matter that you're smart, because you're too lazy to ever amount to anything.",
   "created_utc": 1703642315,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2fldd",
   "message": "Use it or lose it.",
   "created_utc": 1703642318,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2fr8t",
   "message": "“The moon landing isn’t real” in 6th grade",
   "created_utc": 1703642391,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2gc4d",
   "message": "If you don't pay attention in my class you're gonna end up like that good for nothing brother of yours",
   "created_utc": 1703642646,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2gi7j",
   "message": "That I am a white trash waste of human flesh",
   "created_utc": 1703642721,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2gibs",
   "message": "\"Never rub another mans rhuband\" Jack Nicholson as the Joker in Batman.\n\nLife is my classroom and everyone's a teacher....and a student!",
   "created_utc": 1703642722,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2h089",
   "message": "Do you want to put it in your mouth?",
   "created_utc": 1703642942,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2hbyk",
   "message": "\"Global warming is not a controversy. There are plenty of controversial topics in the scientific community, plenty of theories with a lot of debate around them. Global warming is not one of them. It is a political controversy. But it is not a scientific controversy.\"",
   "created_utc": 1703643089,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2hl8r",
   "message": "I had a supervisor in graduate school tell me \"Whenever you notice someone who is in constant conflict with everyone around them, it's best to start considering who the common denominator is.\". That stuck with me.",
   "created_utc": 1703643206,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2hln9",
   "message": "He screamed \"You're ignorant !\", over and over at me, because I didn't know some basic info about. I was raised in an atheist home. \nI was a TA and friend for his boss. My teacher was chewed out that afternoon. \nHe had to apologize to me, in front of the entire class.",
   "created_utc": 1703643211,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2hs2j",
   "message": "I'm extremely tired of \"extremely\".",
   "created_utc": 1703643289,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2hsjs",
   "message": "“Don’t use the word Hate. It’s such a strong word. Instead says “I strongly dislike”.”\n\nStuck with me forever",
   "created_utc": 1703643295,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2i1l8",
   "message": "\"If I want your opinion, I'll beat it out of you.\"",
   "created_utc": 1703643408,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2i40j",
   "message": "I was taking ESL classes during my kindergarten years and my teacher for some reason every time I try talking in Spanish she would say. Speak English you’re in American. A will thanks to that my parents now call me a racist when I tell them they need to learn English because we’re in America. \n\nPs they came here in 1993 they been living here for 30 years I’m 29",
   "created_utc": 1703643438,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2i56b",
   "message": "That I was content to “sit on my laurels” (grade 4) yup, nearly 60 and still am.",
   "created_utc": 1703643454,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2i73k",
   "message": "\"You'll never be anything but a street sweeper\".",
   "created_utc": 1703643479,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2i8i6",
   "message": "“I don’t give a fuck what classes you skip, you DON’T SKIP MY FUCKING ART CLASS!!”",
   "created_utc": 1703643496,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2i8kn",
   "message": "\"If all you do, is keep making jokes all the time, you will never amount to anything in your life. \".\n\nHe might have been on to something. We'll see.",
   "created_utc": 1703643496,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2ix8j",
   "message": "never memorize anything that can easily be looked up.  memorize how to use the information instead.  \n\nthe time between moving out of your parents and having kids is as good as your life is going to get.  stretch this time out as long as possible.",
   "created_utc": 1703643805,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2j00q",
   "message": "Why did you show up for the exam now the class average is going to be lower \n\nShe was correct it was in the 80s high school and I skipped that class many times.\n\nOld Ms Knuddson \n\nLol",
   "created_utc": 1703643840,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2ja65",
   "message": "The more you have to learn (actively study) in school the least successful you will become. \n\nIn my math teachers eyes, successful people never had to learn much in school, since most of it is just remembering thinks and very little is just using that knowledge. And that meant for him, that successful people see what is important to remember and hence can focus more on things they need to train.",
   "created_utc": 1703643969,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2jb15",
   "message": "Don’t walk around with a q-tip in your ear. Her husband did and he was trying to leave the bathroom when she opened the door and subsequently rammed the qtip into his ear canal.",
   "created_utc": 1703643980,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2je6q",
   "message": "My middle school home economics teacher one day went on a long tangent about how, “Life isn’t fair. Don’t expect anything. You’ll experience disappointments.” She spent half the class on this and it just seemed out of left field. Not sure why she felt the need to say all that. However, she was right.",
   "created_utc": 1703644019,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2jsc1",
   "message": "\"If he's quiet, he's doing something shady\"",
   "created_utc": 1703644195,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2jsqd",
   "message": "“life’s a bitch, and then you die. get over it” — my chemistry teacher",
   "created_utc": 1703644199,
   "score": 1,
   "submission_id": "18rl4o9"
  },
  {
   "comment_id": "kf2scnm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rl4o9"
  }
 ]
}