{
 "submission_id": "18rquzb",
 "title": "What’s your kink, and how long did it take you to tell your SO about it?",
 "selftext": "",
 "created_utc": 1703648560,
 "permalink": "/r/AskReddit/comments/18rquzb/whats_your_kink_and_how_long_did_it_take_you_to/",
 "score": 117,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rquzb/whats_your_kink_and_how_long_did_it_take_you_to/",
 "comments": [
  {
   "comment_id": "kf3ckt9",
   "message": "Just found this one out on the 23rd and it's fucking **weird**\n\nStarted seeing a girl, she's into aliens, like *really* into aliens. So much she has alien impregnation fantasies. I'm not vanilla, I'll try anything thrice, but this one... this one leapt off the page and before I knew it I was browsing alien dildos that pump fake cum through them. So yeah. Gonna fill this girl with an alien dildo and fake cum and get her pregnant with a hybrid alien baby.",
   "created_utc": 1703659085,
   "score": 177,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3sn67",
   "message": "Getting my tits sucked on. Any and all times. We are watching tv? Take them out and suck on them. Showering? Go ahead. About to sleep? Yes please. Told my ex SO about it almost immediately haha he didn’t seem to mind.",
   "created_utc": 1703671068,
   "score": 181,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf387h4",
   "message": "I don’t have a SO, but, I found out recently (and i swear I have an explanation) that I have a biting kink. Yeah I don’t know either, but I guess it’s not as bad as others ig.\n\nSo me and my friend are messing around on the bleachers (not like that), and I get her phone, ya’know, just as a tease. And she tries to get it back and everything, and she tries to bite my arm… and I don’t know what happened, but I just got flustered, and just stopped, and I could feel my face getting red and shit. I also had some… *other* reactions to it.  So I give her the phone back, and I just kinda sat there, she asked me what was up and I just nodded my head and just said that I was fine. \n\nI haven’t told her, and I don’t think I’ll ever tell her.",
   "created_utc": 1703656325,
   "score": 220,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3a2bw",
   "message": "I like to be ignored... let me set the scene: she's just lying down, watching a show or reading a book, or on her phone. I eat her out but I don't need any feedback. Obviously I want her to cum but a pat on the head and a \"thanks' is just fine. Last relationship I was in, it took maybe a year to act on it. She didn't mind it.",
   "created_utc": 1703657461,
   "score": 231,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf30txn",
   "message": "I’m pretty vanilla.  So black licorice on a woman’s breath drives me nuts.  Makes me want to have the hardest vanilla sex any woman’s ever put up with.  I told my wife this when we first started dating, and she said she hates black licorice.\n\nNevertheless she tried to chew some blackjack gum once to get me in the mood, but her grimace of disgust and revulsion was so obvious I was like, “please spit that out.  We can still have sex.”\n\nShe did, and we did, and it was probably the hardest I’ve ever vanilla’d her.  She got so missionaried that night we made a baby that eventually grew up to be a super normal and responsible young adult.",
   "created_utc": 1703652267,
   "score": 251,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf2tilx",
   "message": "Submission. 14 years. But to be fair, I didn't realize it was such a kink.",
   "created_utc": 1703648646,
   "score": 210,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3w5be",
   "message": "I like when a girl wears a one piece swimsuit. I always thought that was weird so I never told anyone",
   "created_utc": 1703673786,
   "score": 0,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3yqaf",
   "message": "My biggest kink right now is peace and quiet.",
   "created_utc": 1703675731,
   "score": 215,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf34efi",
   "message": "I'm an enthusiastic asslicker, and I have a steady FWB.  She found out on the second date.",
   "created_utc": 1703654161,
   "score": 33,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf39nk2",
   "message": "Ass play and domination. Give me a guy that loves my ass (licking, fucking...) and then shared domination (sometimes him and sometimes me)..  love it! I didn't realize I enjoyed it until we had been married for 15 years or so. Told him I wanted to do anal and have enjoyed it since!",
   "created_utc": 1703657201,
   "score": 27,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3o3gq",
   "message": "I don’t know what this is what it would be called, but I freaking love getting cream pied. If you’re going to cum PLEASE cum in me 🥹 I feel like it’s such a waste if it’s not inside me",
   "created_utc": 1703667529,
   "score": 233,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf4tv9w",
   "message": "This might sound dumb, or counterintuitive, but scheduling sex. \n\nMy wife and I have each worked from home since the pandemic. We’re on calls all day and sometimes it’s hard to get our schedules to align. But we both enjoy daytime sex because the kids aren’t home so there’s no risk of interruptions or worrying about being too loud. So when one of us is in the mood, we talk about a good time we’re both free. It might be the same day, or it may be a day or 2 out. \n\nI know this sounds so boring and not spontaneous but what’s happened is the anticipation of knowing the exact time I’m going to get laid has become this mental foreplay. I find my mind wandering leading up to sex and I’m just so turned on and ready to go when it’s finally time. She says she feels the same way, and our sex life feels so great as a result. \n\nSo I guess my kink is the calendar.",
   "created_utc": 1703691868,
   "score": 52,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3i3z9",
   "message": "I love being watched, I will drop just about anything if someone says they’ll watch me blow a load. \n\nIt’s a tough sell to any SOs because they’d rather be getting railed than just watching me have a good time.",
   "created_utc": 1703662967,
   "score": 75,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3d0bw",
   "message": "Kinky encouraging talk",
   "created_utc": 1703659377,
   "score": 151,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3aymn",
   "message": "Shibari! Had a FWB years ago who introduced me to it and… drove me insane. I usually ask before the first time with someone if they have any kinks, or right after the first time we have sex. \n\nEvery relationship I had since then, always the same response. “Oh that sounds like fun! I’d love to learn how to do it.” And it NEVER happens. When I ask, “oh that’s a lot of work, I’ll be bad at it, it’s too hard”. And still want me to cater to their kinks. I stayed in those relationships longer than I should have lol.",
   "created_utc": 1703658030,
   "score": 68,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3x42c",
   "message": "Goddess/worship kink. Never told my partners. I’ve only recently figured out that is what it is. I want to be completely fawned over. Every inch of my skin viewed as perfection as if any time you get with me, and touch you’re allowed is a blessing. I want to hear how in awe of me you are. Looks of adoration and a need to please me. I discovered this when I was mid grind atop a gentleman and the look in his eyes/tone of his voice/the way he held onto my hips while he said “fuuuuuck” made me feel like a goddess. Like he felt completely unworthy of me and knew he was experiencing something heavenly. I’m embarrassed about it because it sounds really narcissistic but I think I liked it so much because I’m usually sweet and submissive.",
   "created_utc": 1703674516,
   "score": 22,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3chxh",
   "message": "Don't have an SO, but I'm into commitment and eye contact.\n\nSo, like, sex acts that make you feel like when you're done you should ask \"so we're a thing, now. Right? After that, there's no going back...\" \n\nAnd eye contact like a staring contest while getting plowed until one of you involuntarily goes cross-eyed.",
   "created_utc": 1703659031,
   "score": 86,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf4iny8",
   "message": "I enjoy tearing clothes off. One of the first times we had sex, way before we were even engaged, my now-wife was wearing an old shirt with a few holes. And the pair of undies had lace on the waistband that were also getting frayed. \n\nI simply just pulled on the lace a bit to tear it ever so slightly and went, \"may I make this the last time you wear these?\"\n\nIt went over quite well. She makes a point to keep old shirts and undies for me.",
   "created_utc": 1703687195,
   "score": 51,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3en41",
   "message": "Tbh most of my kinks came up quick.\n\n1. I have a cum fetish. I fucking love swallowing cum, but I love getting a facial.\n\n2. Dominantion. I like it when my bf has his way with me. Pinning me down, being rough, pulling my hair, spanking\n\n3. Goes with #2 but verbal degrading. Calling me a slut, whore, bitch, things like that.\n\n4. I loooooove sucking dick. I love it love it love it \n\nI have some other smaller kinks but these represent 98% of it.",
   "created_utc": 1703660488,
   "score": 95,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf32mrp",
   "message": "Male brat. No takers so far. If men are submissive, we're supposed to be cowards that like humiliation.",
   "created_utc": 1703653215,
   "score": 190,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3jay2",
   "message": "I lean pretty heavily sub, so being the receiving of biting/teeth grazing, scratching, spanking, choking, hair pulling, wax play and bondage. If a man pulls my hair off to the side, grazes the back of my neck with his teeth with the orher hand comes up to hold my throat while whispering that I’m a good girl I’m fucking done. Puddy. Delicious.\n\nI also have a breeding kink but that’s all in the mind. I actually don’t want kids at all and have had an IUD for over a decade (got a new one when it was time). But for some reason I dunno, the breeding thing gets me.\n\nHonestly I found out when I was married (many years ago) because my ex was more experienced than I was and we just kinda figured it out together.",
   "created_utc": 1703663863,
   "score": 120,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf2w3dl",
   "message": "Being loved and cherished, but no SO",
   "created_utc": 1703649876,
   "score": 1,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3yusp",
   "message": "No current SO, but really gentle FDom (so Praise, Encouragement, Aftercare, and muscles are a plus. None of the harsher stuff like degradation or anything.). I’m really into the idea of a woman controlling me and telling me what to do. I personally don’t care that much about getting myself off, but making a woman get off and orgasm is music to my ears, I’ll never get tired of it. Constantly being praised and encouraged makes me feel fantastic too, it tells me that i’m doing something right.",
   "created_utc": 1703675823,
   "score": 113,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3pc59",
   "message": "Sucking on his tongue while kissing",
   "created_utc": 1703668488,
   "score": 36,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3e5q2",
   "message": "My primary kink is short hair on women, which is an easy one to disguise as a pretty passive interest, my wife knew about that by the first month when she first cut her hair short.\n\nThe ones revolving around sex acts I brought up right away after the first time we had sex.\n\nI only ever struggled to talk about my kinks with partners where I was between 18-20. After that I just started being like \"yo, I wanna do this, you game?\" because I was in my apex ho-phase so I needed to make sure I was getting what I was after each go around.",
   "created_utc": 1703660155,
   "score": 158,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3k9dq",
   "message": "I like to get my toes licked... and my feel tickled.\n\n\nI can actually orgasm from it, that's how sensetive my feets are.",
   "created_utc": 1703664576,
   "score": 252,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3nzgl",
   "message": "Girls that wear glasses . No idea why.",
   "created_utc": 1703667442,
   "score": 209,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf45nsq",
   "message": "My kink is being treated like a complete dirty slut ( deepthroating , having him spit in my mouth, spanks/slaps, getting choked , little ass play  \u0026amp; of course having my pussy ate and played with) \nthen after we eat dinner and cuddle ahha 😂",
   "created_utc": 1703680428,
   "score": 31,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3f8em",
   "message": "Thigh highs kink and yeahh i am very passionate about a woman thighs, my fav part. A professional thigh biter. DMs open for professional purposes",
   "created_utc": 1703660899,
   "score": 235,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf38h16",
   "message": "Pegging. I brought it up once about a year into our relationship. She tried to try it but just couldn’t do it.\n\nI then brought it up a couple more times between our 4th and 8th year of marriage and she was noncommittal. Earlier this year, she shut the back door on it and any other backside play, mine or hers.\n\nI recently told her that sometimes it’s “easier” but not better to occasionally bust out a dildo and sit on it while I play solo. She then said it was ok to use toys on myself when we have sex.",
   "created_utc": 1703656484,
   "score": 96,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3j247",
   "message": "I don’t have any yet, but my SO is so very vanilla (not a bad thing. I’m not shaming it) that if I do develop one I won’t tell him. The wildest thing we’ve ever done is have oral sex.",
   "created_utc": 1703663679,
   "score": 145,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf36ism",
   "message": "[deleted]",
   "created_utc": 1703655339,
   "score": 180,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3ktef",
   "message": "I desperately want to be a Brat. Goes hand in hand with my praise kink that I discovered I had while watching porn. Was not expecting that! Haven't told my SO of 15+ years cause I'm living that r/deadbedroom life. \n\nIs just getting railed a kink? Cause I have that too. But that might just be from the lack of sex..",
   "created_utc": 1703665001,
   "score": 24,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf32pf2",
   "message": "3 somes. \n\nUsually me and another dude pleasuring the lady.\n\nSome of my partners liked it, some of them didn’t.",
   "created_utc": 1703653254,
   "score": 131,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3jbrl",
   "message": "I like to bite the neck love hearing a guy moan so fun",
   "created_utc": 1703663881,
   "score": 133,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf2w528",
   "message": "Pee. She was surprisingly receptive the first time I told her I wanted her to sit on my face and pee while I was going to town.",
   "created_utc": 1703649899,
   "score": 49,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3hyc4",
   "message": "I definitely have a praise kink. And a domination kink, loved to have my hair pulled, spanked, pinned down and choked. New partner so slowly working into it, he is so vanilla but open to trying most!\nExcept pegging, he drew the line at that. Would have loved to try it but it is what it is.",
   "created_utc": 1703662854,
   "score": 87,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3egv2",
   "message": "I love the shape of hips. So doggystyle is my go to. My Exs loved it. But it's been a year and compliments don't work anymore",
   "created_utc": 1703660369,
   "score": 116,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3id0v",
   "message": "My fiancé said one if her fantasies is ti be 69’ing and be fucked by another guy with i go wild in her clit.    Since she told me the idea of it has been driving me wild and we use toys to replicate it and she orgasms hard!     \n\nBut we are way too nervous to try it with someone real for obvious reasons",
   "created_utc": 1703663156,
   "score": 20,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3izla",
   "message": "Domination, voyeurism and a bit of a muscle fetish: specifically i like telling guys to pose, flex and show off for me, and then have my way with them.\n\nI told my ex, and we tried it, but he was always self conscious about it. I've since met guys who are more into it and it's been great. Hoping i find someone whose interests align.",
   "created_utc": 1703663625,
   "score": 21,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3ztw9",
   "message": "Any type of tights/pantyhose or stockings. I genuinely don't know why but man they mess me up.",
   "created_utc": 1703676530,
   "score": 20,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf4qf4f",
   "message": "Her feet. Literally her feet. I never ever had a liking for feet until I met her. I literally don't know how it happened, just a switch flipped I guess. \n\nTold my SO after about a month. We tried stuff early on, after noticing I liked them so much, and she loves it, like a lot actually. I just started kissing her foot while having sex - then we just get more and more into it. She loved it so much and feels like I literally love her from head to toes (so I guess there's an emotional feeling she gets from it too). She took it a step further and wants for me to cum on them after I have my way with them at times. I kiss them all over, lick them all over, suck all of her toes, cum on her feet, and then clean up. After a while, she tells me to do it while she sleeps or while she's gaming or while we watch tv. She says it kind of feels like a massage and she really loves that I'm pleasing myself to her. I have my way with her feet, cum on them, clean up, kiss her on the forehead, and tell her I love her. I guess it's kind of like a modified free use? She loves it and I love it too. \n\nOther than that, we both share a breeding kink, the fulfilling purpose to get her pregnant (her to get pregnant), and love the taste of each other's sweat while we are going at each other. I feel like these are some kind of normal though. Evolution and all that.",
   "created_utc": 1703690503,
   "score": 18,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf2xsz5",
   "message": "CFNM, panties, face fucking, and not long.",
   "created_utc": 1703650728,
   "score": 154,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3e3p6",
   "message": "Bondage (being tied up), CNC/rapeplay, punishment and receiving pain. I find it impossible to talk about my kinks unless I already know that they have matching kinks",
   "created_utc": 1703660116,
   "score": 66,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3ef79",
   "message": "Anything bondage, forced orgasms, edging, spit roasting.....honestly it would be quicker to list the things i dont do.",
   "created_utc": 1703660337,
   "score": 79,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf2tjz0",
   "message": "1950s head of household power exchange and I told her the moment after she told me hers which was way worse.",
   "created_utc": 1703648663,
   "score": 156,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3o54h",
   "message": "I really love when a woman has body hair. Big bush is my favorite thing, but I also love hairy armpits, legs, and ass. I tell her the first time we are together.",
   "created_utc": 1703667567,
   "score": 34,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3behp",
   "message": "Role reversal, I like it when a woman takes charge both in and out of the bedroom.",
   "created_utc": 1703658314,
   "score": 119,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3c6gg",
   "message": "I love the idea of my wife sexting one of our friends. We were together for several years before I told her. She has done it a few times and she has told me about the photos/videos she's gotten in return.\n\nIt's not something we do often but it is fun and exciting and a turn on that other people are turned on by her.",
   "created_utc": 1703658822,
   "score": 71,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3qicu",
   "message": "[Green Slime](https://www.YSCDTOTV.com).\n\n1st date. 😅🙈\n\nGotta go with radical honesty. It’s the only way to find true sexual happiness.",
   "created_utc": 1703669397,
   "score": 16,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf4dqcr",
   "message": "Feet/tickling and post orgasm torture. \n\nI didn't really have to tell her, the first night we spent together she let me in the house and she was barefoot. Red toes, took alot to contain myself 😂 I distinctly remember following her up the stairs, trying not to trip😂\n\nLater on in the evening I tickled her feet playfully to gauge her reaction. We spent the night together but  didn't do anything sexual etc.\n\nAnyway fast forward a week and she's coming to my place, we've been flirty texting and I'd told her I was going to kiss her head to toe...  Food and a bottle of wine later and we're in bed and i make my move. Starting kissing her, making my way down, get to her ankles and I can still remember thinking in my head 'oh shit she's actually going to let me do this' which she does, few giggles etc followed by amazing sex. \n\nAs time goes on she's cool with the tickling and foot rubs and toe sucks, when I finally do man up and tell her she was like 'yeah I guessed that first night 😂'\n\nAnyway she's the first to make me feel completely comfortable with it, even admitting a little tickle kink of her own.",
   "created_utc": 1703684850,
   "score": 16,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf38445",
   "message": "Got a few but one that hasn't been mentioned is sharing our past sex experiences with previous partners with each other while we have sex. Basically giving every detail of a memorable sex experience we had with someone else 😆. Gets us super turned on.",
   "created_utc": 1703656271,
   "score": 121,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3lew3",
   "message": "i loove women sitting on my face, me sitting on womens face, its all fabulous. i asked my girlfriend in the right setting if it would be okay and she hesitated but decided yes so i sat myself down on her face and she was amazed.",
   "created_utc": 1703665455,
   "score": 42,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3jbqg",
   "message": "ABDL, i don't accept myself and have lots of shame and it has affected my past relationships. The brain is just weird. I wish I was normal.",
   "created_utc": 1703663880,
   "score": 59,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf41lcf",
   "message": "My kink is giving oral \u0026amp; I get off on seeing women cum, it's not exactly something I need to hide. My tinder profile just says \"I can cook and breathe through my ears\". It does the job lol.",
   "created_utc": 1703677759,
   "score": 15,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3hwcc",
   "message": "Facials. I told my wife pretty early on that i love to give facials/generally cum on her. On one valentines day 4 years ago, I had a lot saved up and damn near glued her left eye shut. She said no more after that sadly.",
   "created_utc": 1703662813,
   "score": 96,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3gku8",
   "message": "Piss. I didn't tell them for a pretty long time at least not the full extent of it. I find wetting really hot, either me or someone else, and I kept that a pretty tight secret, for obvious reasons. I have a humiliation kink, but it's pretty situational and I don't want someone to actually shame me for what I'm into. Shit I didn't even fully admit it to *myself* for years. \n\nAnyway, we're both happy now, and it all turned out well. I think I gave them a piss kink too, actually, or helped them discover it, idk.\n\nBut another was how much I love being dominated. Shove me against a wall, bite my neck, and claim me as yours. I love being tied up and tortured for my partners benefit. Make me feel small and helpless and take control of me. Sht is hard to admit, even on this account. Lol \n\nThey've taken it all pretty well, and we talk about kink pretty often.",
   "created_utc": 1703661852,
   "score": 28,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3lspt",
   "message": "It took a little bit, but when I told my fiancé (when we were still just boyfriend/girlfriend) that I have a breeding kink, he was actually really into it! He likes to be told I’m his. I’m serious. That’s his big one. Knowing I’m his.",
   "created_utc": 1703665756,
   "score": 46,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf43i02",
   "message": "Pegging, and about 45 minutes after they discovered it about themselves.\n\nWe were messing around in bed, and I jokingly backed up onto her, doggystyle. She ran her hands over my hips and my back, slowly. I went still, sensing Something Is Afoot. Both of her hands reached my hips, and I rocked back and forth slightly, like I was getting railed. She gasped.\n\nShe mimed thrusting. At the deepest point I ground myself against her crotch. She moaned, and kept \"fucking\" me.\n\nAfter five minutes she was so wet she had to take her underwear off. After ten she let her voice drop and called me her slut. I purred like a kitten and arched my back. She ran her nails down me and pulled me up to kiss her, still fucking my ass. I nearly melted. I can still feel her hands all over my body, grasping and desperate. She was never a pillow princess, but this was a new level. It felt like I was meeting the real her for the first time, and she was greeting me by giving me the hardest fucking of my life.\n\nEventually she rubbed herself enough that she was close to orgasm. By then I knew what was up, and told her to cum in me. Make me hers. Put a fucking baby in me.\n\nShe and I had great sexual chemistry, our entire relationship. She would happy cry after sex about once a month.\n\nSo when I say she orgasmed harder than any other time in our relationship, I hope you understand what that means. It was a grunting, shuddering, prolonged, foul-mouthed thing. She flipped me over and kept grinding while she jerked me over the line; I came on our stomachs in about five seconds.\n\nWe bought a strap-on the next day. My dick and her pussy never touched again. She would walk around the house wearing it under her clothes, then pull it out when it was time to use me. I couldn't get enough of it.\n\nHonestly? Best relationship of my life.\n\nWe have both come out as trans since then. Writing about him using the wrong pronouns feels weird and disrespectful, but it's necessary to make the twist work.",
   "created_utc": 1703679047,
   "score": 211,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3f43w",
   "message": "Told my partner that I was into the idea of her sucking off or fucking another guy with a significantly bigger cock and me watching or her doing it and telling me all about it. Don’t think she’d be able to actually do it but it doesn’t stop her from bringing it up in the bedroom which leads to some hot ass sex lol",
   "created_utc": 1703660815,
   "score": 87,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3sbz2",
   "message": "anal play, about 4 months. he was the first and only guy I’ve met who was okay with me doing it to him even after we broke up still haven’t found a guy who doesn’t look at me crazy when I say that",
   "created_utc": 1703670825,
   "score": 13,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf60jwq",
   "message": "I mentioned once to my ex on the phone that she would look great as a cowgirl and an hour later she was at my door wearing tight jeans, brown cowgirl boots, a checked shirt and a cowgirl hat.\n\nI have never been so turned on and don't think I ever will again. Whatever the issues in the relationship I'll always have that memory. \n\nYee-haw indeed.",
   "created_utc": 1703707304,
   "score": 14,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf2xl1v",
   "message": "Being called racial slurs that apply to me...? Haven't told him, and I'm not sure I want to.",
   "created_utc": 1703650615,
   "score": 118,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3c97g",
   "message": "Not long at all. She’s an amazing woman. A couple months in, I told her all my kinks and what turns me on. She was so supportive. Open communication is so damn important.",
   "created_utc": 1703658873,
   "score": 41,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3d3bk",
   "message": "I like lickin’ butt, no SO but I test the waters with every girl that takes up my offer on a shower💪",
   "created_utc": 1703659433,
   "score": 77,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3dnr7",
   "message": "sex fighting. Many years before I gave the tiniest hint. still haven't said exactly those words.",
   "created_utc": 1703659819,
   "score": 48,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf4awuf",
   "message": "I'm a pleasure dom. I derive a lot of pleasure from giving my wife orgasms to the point it is overwhelming to her. Watching her unable to move or talk because I made her cum too much really turns me on.\n\nFor example, I like to build my wife up until she's begging with teases throughout the day. Then I'll make my wife cum a few times (eating clit; fingering g spot, a spot, p spot) until she's drenched the bed, shaking and unable to speak. Sometimes she soaks her ass in the process and I'll slip my fingers in, hitting the other side of the p spot (sometimes she'll squirt again). After a few minutes, she is on a hair trigger to cum from my cock. Sometimes she needs me to stop because cumming is almost overwhelming. \n\nMy wife wasn't aware that I enjoyed watching her cum almost as much as she enjoyed cumming until we were 10 years into our marriage. My wife likes to brag about me to her friends who complain about their sex lives. One time we were vacationing away from home, and she was really letting loose. After she was almost numb from cumming, she asked me to stop. During snuggle time (super important!) she asked if I was dissatisfied because she doesn't do the same to me. I had to confess my kink to her at that point.",
   "created_utc": 1703683404,
   "score": 11,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3hlji",
   "message": "Um not a kink but hickeys and neck kissing, not a secret",
   "created_utc": 1703662592,
   "score": 54,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3e1yw",
   "message": "Eat ass and suck toes... I'm pretty straight up about it from the start\n\nNot had any complaints yet 😉",
   "created_utc": 1703660083,
   "score": 23,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3fzxr",
   "message": "Dads, body hair, average dad bods, and the way a man smells at the end of the day.",
   "created_utc": 1703661442,
   "score": 28,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3mwok",
   "message": "I have a heartbeat fetish. I told my fiance about it right away and she loves it.",
   "created_utc": 1703666612,
   "score": 25,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3n05b",
   "message": "I doubt I will ever tell her, they're not particularly outlandish either, just to call her vanilla would be an understatement.\n\nFeel like it would just make her feel put out/on the spot or otherwise \"not enough\". Your partner not indulging your kinks is one thing, your partner reluctantly indulging your kinks is many times worse.",
   "created_utc": 1703666687,
   "score": 23,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf3o0yh",
   "message": "My kink is being watched, even online , i love when someone is watching me and the idea of that person getting horny because of me",
   "created_utc": 1703667476,
   "score": 23,
   "submission_id": "18rquzb"
  },
  {
   "comment_id": "kf6vn16",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rquzb"
  }
 ]
}