{
 "submission_id": "18rrh4c",
 "title": "What's the most unexpected or interesting encounter you've had with an ex-lover years after the breakup?",
 "selftext": "",
 "created_utc": 1703650449,
 "permalink": "/r/AskReddit/comments/18rrh4c/whats_the_most_unexpected_or_interesting/",
 "score": 17,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rrh4c/whats_the_most_unexpected_or_interesting/",
 "comments": [
  {
   "comment_id": "kf3bnv7",
   "message": "Well my ex contacted me years after the breakup and asked me to be his power of attorney and beneficiary for everything he owns…\n\nWe had split amicably, we were good friends but NOT meant to be a couple. Every six months or so he would call me just to catch up. We both dated others over about 3 years. \n\nI spent that time dating my former fiancé, who suddenly lost his mind and turned into a sociopath, became violent, stalkerish, etc. In the middle of the absolute worst of it, my nice ex called out of the blue and asked me to lunch. I thought that was odd, but I had literally nothing to lose and went. \n\nHe told me at lunch that he had a health scare. He didn’t have any younger relatives or girlfriend, and even though I was an ex, he trusted me more than anyone to take care of his mom should anything happen to him. So he wanted to will everything to me on the condition I would provide for his mother if he died first. As we filled out the forms, we were cracking up at how “ex girlfriend” was not an option when it asks what your relationship to the beneficiary is. \n\nI broke down and told him about the crazy situation with my fiancé. He let me crash at his place for two months, because I didn’t feel safe at mine, no expectations of sex or anything. We spent two months together like no time had passed, just old friends, cooking together, having a blast. When I got a new job, he helped me pack my car and move states. \n\nHe’s married now with a baby on the way. I haven’t had any luck with dating, but I smile when I hear from him occasionally. Sometimes you graduate from ex to chosen family. I do joke that his wife stole my inheritance. That bitch. I wish them nothing but the utmost happiness.",
   "created_utc": 1703658483,
   "score": 79,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf32hpk",
   "message": "We bumped into each other at an aquarium. We both had newborns. I saw her with her kid while my partner was feeding our kid. I ran off, got my kid, and was like 'ta da, I have one too'. We both laughed at the whole thing.\n\nWe kinda broke up in a bad way, but had a tonne of mutual friends. The years wore the animosity down and it was very obvious we had changed over the years.",
   "created_utc": 1703653141,
   "score": 160,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf317v1",
   "message": "We both had our weddings (to other people) called off on the same weekend.  A couple of years after we broke up.\n\nShe wanted to meet up again for a weekend (I had to fly in as she was far away) as she took it that it was perhaps a sign that we should get back together.\n\nI really liked her, but she broke up with me, so I was wary.  \n\nDuring the weekend, I kind of pieced together her dating history and why she broke up with me - that she was attracted to the \"bad boy\", would get her heart broken or be treated badly, and then run to the \"good guy.\"  I was the good guy, or, as I like to call it, the sucker.  She would get bored of the good guy and go look for the bad guy again.  Rinse and Repeat.  She was amazingly hot (she lived in Canada and dated NHL players after we broke up - which I guess is the ultimate conquest for a Canadian girl), so her trying someone new took no effort on her part.\n\nThe first time I was with her, I didn't know her history and thought she generally vibed with me.  And we did.  The second time around, I finally grew some balls and told her that we should remain friends.  And I wish we would have remained friends.  We were the type of people that had hour long conversations.  But, in the very end, she wanted me as a backup, not a friend, and I wasn't interested in any sort of romantic relationship, let alone any backup romantic relationship at all.  \n\nShe later contacted me like 6 years later.  She got married, got divorced, and was kind of feeling me out on Facebook.  Once I mentioned that kids are awesome, I have a 4 year old and another one on the way with my amazing wife, she again dropped off the face of the Earth again.\n\nI like to think say she was cursed with super hotness.  She was a sweet girl, but with guys throwing themselves at her, she never developed the requisite skills to work on a relationship or herself.  Imagine that each time you felt bored, alone, or got into a fight, a good look person would just show up and throw themselves at you.  You would have no incentive to work on any relationship.\n\nIf she was a 6/10, I think she would have had a much, much happier life.",
   "created_utc": 1703652471,
   "score": 33,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf2yatb",
   "message": "I once bumped into my ex at a costume party. We were both dressed as dinosaurs, and the awkwardness was quickly replaced by laughter as we roared and danced the night away. Sometimes, unexpected encounters bring unexpected joy",
   "created_utc": 1703650978,
   "score": 176,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf2zxuw",
   "message": "She randomly started talking to me again under the guise of wanting to be “friends”, but I suspected otherwise. She interviewed for a job near where I lived and asked if I thought she should take it and move there. I was indifferent and talked about women I was dating. She eventually stopped talking to me entirely and I found out she was knocked up and married six months after she attempted to rekindle our relationship.\n\nShe was pretty awful to me, so it felt good that I got to reject her.",
   "created_utc": 1703651812,
   "score": 69,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf313eb",
   "message": "I have one that texts me on my birthday every year and professes his love for me and how much he fucked up. \n\nOnce a year, every year. It’s like clockwork.",
   "created_utc": 1703652405,
   "score": 118,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf2zy3y",
   "message": "I ran into her in a hospital hallway.  We had lunch together and talked at length.  We didn’t break up angry.  It just wasn’t working. I still like and admire her.",
   "created_utc": 1703651815,
   "score": 51,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3cilm",
   "message": "I bumped into him and his boyfriend at a weekend market.\n\n I saw the exact moment he fell in love with his boyfriend. It was thirty years ago.  We were at a party.  Still a couple.  I'm female.  He turned to say hello to the now boyfriend and went bright pink and just stared.  He then did everything he could to act normal but the two of them were like magnets.  It was oddly painful yet fascinating to watch.\n\n  He would of stayed with me. He was loyal and did love me.  I explained to him that I think we needed to break up as I wasn't ready for anything serious.  \n\nI bumped into them thirty years later holding hands in matching fugly sweaters giggling about the fact they were wearing matching fugly sweaters buying a cactus at a market.",
   "created_utc": 1703659044,
   "score": 154,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3473d",
   "message": "When I was 17 my ex stalked me for 2 years after breaking up. I use to work close to where he lived, he would message my friends saying that “he could see me eating lunch” but I NEVER saw him (and i was in high alert). Still to this day I will get random DMs of him confessing his love, he is also a diagnosed schizophrenic.",
   "created_utc": 1703654051,
   "score": 40,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3cavm",
   "message": "3 years after my first GF and I broke up. She tried to get back with me. We were sitting in her car and she asked me out again which I promptly turned down because of the reason we originally broke up. She said, \"If you take me back I'll suck your dick right now.\" Hardest moment. While she did give good head, I was unwilling to get back with her. Just can't be with someone who doesn't believe in dinosaurs.",
   "created_utc": 1703658903,
   "score": 43,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf39fmh",
   "message": "I got a story. I bumped into my ex in front of a subway station 2 years after we broke up. We both blocked each other’s number at that time. Once we bumped into each other, we greeted and we hugged and we made the same mistake of let’s catch up over a cup of coffee. Then we both unblocked each other and dated for another 2 years to break up again !! This time I blocked ph, email, everything.",
   "created_utc": 1703657070,
   "score": 37,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3bp8d",
   "message": "Was using the motorized chair at Target on Black Friday because I had a broken ankle. I was there with my college boyfriend but we were in my hometown. We were leaving after getting a vacuum and the chair lost power in the crosswalk of the parking lot. Not one, but BOTH of my high school exes walked by me as I waited alone in the crosswalk.",
   "created_utc": 1703658507,
   "score": 39,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf2zaw2",
   "message": "I’m pretty sure I caught my ex boyfriend playing ding-dong-ditch with my doorbell around 2013. It was some time after my son was born. I heard the door bell and answered the door. I saw some guy, about his height and build, running South from our driveway, with a grey hoodie pulled over his head. He wouldn’t answer any texts I sent to him, after that. I still have no idea why he did that. He was happily married to a girl that went to high school with both of us, years prior to that.",
   "created_utc": 1703651489,
   "score": 51,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf375zy",
   "message": "Somehow we ended up taking the same elevator in an office building several years after we split. I was visiting the building for an appointment (and my hunch is that he worked in the building). We stood right next to each other during the ride down. However, we didn’t acknowledge one another and just pretended like the other wasn’t there. Most awkward elevator ride ever.",
   "created_utc": 1703655712,
   "score": 42,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3emk3",
   "message": "An ex from 8 years ago emailed my professional email saying she’s sorry for what she did and happy holidays",
   "created_utc": 1703660477,
   "score": 18,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf35gxq",
   "message": "I woke up to him in my bedroom. He said he rang the doorbell, and no one answered. \n\nApparently, I didn't lock the garage cardoor. Needless to say, I was not happy. He was wondering why I was sleeping naked. No one was ever in my bed, but I didn't correct him on his assumptions.",
   "created_utc": 1703654744,
   "score": 35,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3czfb",
   "message": "I moved to the other end of the country (from Durham to Aylesbury) for work, then a year later I was in London with friends I’d made down there, was at the bar talking with one of them while waiting to order and who walks up to the bar? My ex.\n\nI tapped her on the shoulder and said hello, both shocked, turns out she’d gone to London to see a show with her mum and her sister and was there all weekend.\n\nLong story short, got a text that night asking to go meet her at her hotel, she was in a different room on a different floor to her mum and sister and we slept together. After that, any time she was going to London for a show or a concert I’d get a text asking if I was gonna be free one of the days and I became a long distance booty call 🤷🏻‍♂️",
   "created_utc": 1703659361,
   "score": 13,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3i5yq",
   "message": "He randomly called me one night about two years after breaking up. He apologized for hurting my feelings and we got to catch up. Basically just talking about life and how it was going. No hard feelings, but we never spoke again after that and I’m fine with it. A good ending in my book.",
   "created_utc": 1703663008,
   "score": 13,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf30qx1",
   "message": "I never got over my first time. He really liked me but he stupidly told his best friend who told everyone. \nLet’s just say that was the end of that. \nIn my forties I suddenly felt like I needed to talk to him. Everyone told me to let it go and get over it. For whatever reason that made me more certain. I had so much shame around sex I needed to let go.\nI messaged him and he got right back to me like he also really needed to talk. It was super healing for both of us. \nKinda off topic? But maybe not.",
   "created_utc": 1703652224,
   "score": 43,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf342ac",
   "message": "I had an unexpected encounter with my ex girlfriend was while I was scuba diving in bohol in the Philippines. We had first met when I started to learn how to scuba dive in Oahu, but I simply didn’t expect to run into her, underwater on the other side of the ocean. I waved to her, hoping we could meet again at the surface, but she just squeaked at me and swam away.",
   "created_utc": 1703653979,
   "score": 26,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf39yrh",
   "message": "This girl I once dated in high school. I saw her again like twenty years later and she was a guy now. He also told me I was a nazi because I work in a prison. We dont talk anymore but sometimes Ill tell people I once dated a dude.",
   "created_utc": 1703657398,
   "score": 27,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3e57h",
   "message": "I had an ex message me on Facebook about ten years after I broke up with him to let me know he'd recently had a heart transplant. He then proceeded to recount the story of how he purchased a Porsche he probably couldn't afford while he was in the hospital. The conversation quickly reminded me why the relationship didn't work out initially.",
   "created_utc": 1703660144,
   "score": 11,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3dikf",
   "message": "Never saw her naked or anything when dating. Years later, when I was in a relationship me and my ex were talking about tatts and she said she wanted one on her ribs and sent me a topless pic and she was pointing to her ribs where she wanted the tatt. I was like uhh... yea that would be a cool spot *delete photo.",
   "created_utc": 1703659721,
   "score": 11,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf31rjc",
   "message": "I met my ex and she said she was a fairly famous actress. It was really remarkable, and sort of a wakeup call to realize she'd made so much of herself while i was still doing the same thing I'd done when we were togehter. To some degree, I wanted to believe that what she'd accomplished was due to dumb luck, and to another degree, i wanted to compliment her on making it so far past what either of us had expected for the other.",
   "created_utc": 1703652759,
   "score": 36,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf34pi9",
   "message": "An ex called me out of the blue about 3 years after the breakup offering to explain why she dumped me out of the blue (after a 2+ year relationship). She also offered to buy and deliver me a new couch since her cats peed on mine and it always kinda smelled. Preeeeety sure that was to get my address.",
   "created_utc": 1703654330,
   "score": 28,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3nqdg",
   "message": "He broke up with me and moved on pretty quickly... we were in the same friend group and I actually became really good friends with his new girlfriend. She's amazing and i love her dearly. I got invited to their wedding and it was so beautiful. Now they have a little girl and are super in love. I'm so happy for them both.",
   "created_utc": 1703667246,
   "score": 7,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3bdd5",
   "message": "First serious girlfriend was this hippy dippy girl, like she collected lake water, wrote a bunch of peace and love messages on the bottle to change it's vibrations or some shit, then returned it to the lake. We dated for a year then she ended up marrying a friend of mine down the road.\n\nLike 10 years later she added me on Facebook and had become a full blown, Trump loving, chemtrail spotting, anti vax nurse, which is scarily common. \n\nAt some point she said something about Trump helping people and I pointed out that he was actively trying to deny aid to US cities. She blocked me immediately.\n\nJust a couple days ago she sent me a friend request and I'm not sure what I'm gonna do. Her husband, my friend killed himself a couple years ago and it makes it more conflicted. I'd like to be nice or supportive and the relationship was so long ago I have no emotional connection anymore. But damn, I don't know if I want to be involved with that kinda crazy.",
   "created_utc": 1703658294,
   "score": 20,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3eqqf",
   "message": "This happened recently to me.  I live in a smallish town, where you can bump into people at times.  Went to breakfast with my current gf and son at a local restaurant that my ex and I went to a few times.  I thought I saw my ex on the way in, but wasn't 100% sure.  We sat a few booths away from her, with me and my son's back to her.  My gf could see my ex's face.  I never said anything about my ex, we just ate.  At one point my ex got up, walked past us to go to the bathroom (guessing), and then walked right by us coming back.  I never made eye contact.  We leave with nothing being said.  Keep in mind, my son knows her as well (we all lived together for a few years).\n\nFast forward about a week, and my gf and I are talking.  She says \"wasn't that your ex at the restaurant the other day?  Why didn't you or your son say anything?\".  I said \"I wasn't sure it was her\".  My gf says, \"I knew it was her!\".  I asked how she knew, because they had never met.  She says \"I looked at your Facebook when we started dating and saw pictures of her.\"   OK then!\n\nMy son never noticed my ex either; at least that's his story.",
   "created_utc": 1703660559,
   "score": 7,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3g1n4",
   "message": "Not really proud of this one, but about a year after I broke up with my ex I hooked up with his father. I was leaving his house in the morning as he was just getting home. It was really really fucking awkward so I just kept moving, blocked him and his dad and never went back.",
   "created_utc": 1703661476,
   "score": 12,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3ixhq",
   "message": "We met up after 7 years of not seeing each other or talking. We chatted for 8 hours and got drunk and it was like no time had passed at all, it was so comfortable. Now, back to no talking or being in each others lives. the entire experience feels like a fever dream…",
   "created_utc": 1703663579,
   "score": 6,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf346tw",
   "message": "Ex from undergrad, who I broke up with 6 years earlier for being a bit too 'intense', showed up in my building as a technical sales rep for a laboratory equipment company.\n\nI am on the East Coast, and her office (and I presume sales region) is on the west coast. This company is huge and sells a ton of equipment all over the U.S.\n\nI'm preeeeeetty sure she looked me up and cold-called some other guys in my building, just to coordinate a sales meeting.",
   "created_utc": 1703654047,
   "score": 16,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf356xs",
   "message": "Been waiting for an excuse to crack this story open. So in college, I had a year-ish-long-relationship with this guy who we'll call Ryan. Whenever I describe him my mental shortcut is to describe a golden retriever: happy no matter what, athletic as all get out, loves the outdoors, and often begging to be put on a leash. Last one's not a joke, things got spicy. Anyway, after the honeymoon period faded, Ryan and I figured out there were more than a couple reasons we couldn't work, and broke up amicably. Fell out of contact not long after, the way you do. A couple years after I'd graduated college, I began going by my first name after going by my middle name for most of my life (this will be important later). In a series of events too tedious to list here, I found a guy friend who got me through several tough times, accidentally fell in love with him at the same time he fell in love with me, and got proposed to on my 30th birthday under a meteor shower. We wanted to get married soon after, so the bachelorette party was kind of rushed, but my fantastic maid of honor still whipped up some fantastic activities. Escape room, Cheesecake Factory, and last but not least, the all important sausage fest to finish the night off. Was more impressed than surprised when she brought out the way-too-big cake that definitely didn't have a stripper inside wink wink. What *really* surprised me was when the top popped off, Ryan was inside. Wearing, and I swear I'm not making this up, a dog collar. Later on he'd confess he didn't recognize my name for the gig because he only knew me by my middle name, not my first name. Back to the cake, he and I stared at each other for what felt like forever but was probably like five seconds. Was long enough at least for everybody else to start staring at us staring at each other. After  the room got uncomfortably quiet, Ryan finally opened his mouth, and said \"You should have put a serious tag on this question.\"",
   "created_utc": 1703654590,
   "score": 63,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3dpoj",
   "message": "Ex came to a function I was at and informed me he would not agree to some of sons trust fund money being released to  help 20 yr old son travelling o. s for music.  Bear in mind he'd lived o.s for most of sons childhood and had no idea of his interests also no custody or visits.   He had just moved back and  decided this was wrong because he thought so.   I  looked at him and said don't worry it's all covered, trust fund was never thought of,  and  why on earth would you think your opinion  was ever needed or wanted  so f.off.  I still  relish the look on his face  so many years later.",
   "created_utc": 1703659854,
   "score": 9,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3ggaj",
   "message": "My abusive ex texted me a year after I broke up with him. He asked how I am, if I still worked at the same place, where I live now, and that he misses me. I almost replied to him until I realized that he was pretending to be his 9-year-old daughter (whom I was very close with) by using her mobile number to message me (I have blocked him in everything). He thought he was being smart by purposely making grammatical errors to make it seem like I was texting a child. Joke's on him 'cause I know how his daughter texts and he doesn't. He hasn't been able to contact me since.",
   "created_utc": 1703661762,
   "score": 8,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3ibaz",
   "message": "Oh 20 years later he told me he had started doing raw sex parties. He caught hiv and it was a strain that drugs weren’t very helpful for. He died of AIDS. He and I always used condoms and he was big on condoms and testing. He told me he just gave up and didn’t care anymore. I didn’t attend the funeral because I dated him 20 years ago and he died 1500 miles away from me. I wasn’t expecting the encounter at all.",
   "created_utc": 1703663122,
   "score": 9,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3cx8m",
   "message": "I’ve only had two exes, really, one of whom i haven’t actually seen in like 9-10yrs but had weird convos with as recent as a year ago and\nShe’s married- while the other I slept with last weekend and we chilled and repeated the next three days before I had to work. It was surreal af",
   "created_utc": 1703659318,
   "score": 4,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3l0wy",
   "message": "During the brief stint we spent together when I was in my early twenties, I found out he did a lot of lying about a lot of stuff right before he broke it off and moved away. Cut to 10 or 11 years later, I'm living in a different city halfway across the country and I get a random Facebook message from him asking to get dinner cause he happens to be in said city and noticed I lived there. I reluctantly agree. He apologizes for everything and says he knows he caused me a lot of pain, blah blah. It was pretty cathartic.\n\nWeirdest part is he tells me he decided to look me up while having a drink at a specific bar which, at the time, was only a block from my apartment at the time.",
   "created_utc": 1703665161,
   "score": 3,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf39g2c",
   "message": "I didn't have the experience but my friend told me about it. My gf at the time and my ex from a few years before met each other at my other friends baby shower. She tried to not bring me up in conversation so it wouldn't get awkward. Luckily it happened while I was stationed overseas.",
   "created_utc": 1703657077,
   "score": 3,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf371h5",
   "message": "I invited her to my wedding! We dated and at the time I figured \"Oh we've known each other for years, it didn't work out but hey now I met my person\" it'll be fine. She was lovely! However my person definitely struggled with the idea of her there. (It was an emotional breakup) but it turned out to be a nice time. My son was the best man and he stepped up and totally charmed everyone and sat with her daughter and just chilled with that part of my past.",
   "created_utc": 1703655637,
   "score": 8,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3hoe5",
   "message": "Ten years ago when I signed up to Facebook the first message I got when I signed up to Facebook was \"Are you $^#@^^\u0026amp;** that worked at #$@%^\u0026amp;*%$.?\n\nI was who she thought I was. She was the love of my life 20",
   "created_utc": 1703662650,
   "score": 5,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf35lg0",
   "message": "I was a guest at a wedding and he was working catering. He tried to run away from me, ended up having to ambush him to say hi",
   "created_utc": 1703654814,
   "score": 5,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3kfne",
   "message": "We hung out, then we fucked. the end.",
   "created_utc": 1703664707,
   "score": 6,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3mq09",
   "message": "I bumped into my ex while I was with my cousin at the Apple Store in the mall.\n\nHe was asking one of the employees for a job application. We got to talking. Turns out he dropped out of college, so his guinea-pig \"I wanna pick up college girls\" experiment in which I was the guinea pig was all for nothing. I never did find out if he got the job, though...",
   "created_utc": 1703666470,
   "score": 2,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3qxin",
   "message": "   Small town here, I once was kinda hung over and thought why not go eat breakfast at a nice restaurant alone and enjoy it while chilling on my phone looking up the usual random reddit threads, youtube, etc. As I get there I noticed a big red Tahoe brand new. It reminded me of my ex who drove a red Suburban and always would tell me how they wanted a red Tahoe fully loaded fresh off the lot. I sit down and notice there’s a girl behind me eating alone, I usually prefer not to eyeball people or blatantly stare. Yet as I got my food I hear “ I’m eating pancakes alone and no one knows that…”. I turn around and say “Mindy xxxxx ?” She turns around and it’s her my dead beat ex GF, who refused to take care of our pet Iguana and let it die while I was out in the oil fields for weeks at a time. She joins me and we hit it off, then I straight up asked her, “is that your Tahoe outside the one you’ve always wanted ? “ “Yes, I’ve been working for myself for the last 6 weeks and things have really taken off lately. I’m doing ASMR recordings of me eating at restaurants, and I send the recordings to people. We hung out that night hooked up and I never talked to her again after that, couldn’t after she killed Binxy the Iguana, refuses to apologize huge narcissist and gaslighter said it was my fault for working so far away. Long story short she became a stripper, got on onlyfans, then fizzled out around 2019 and sold her content to some website. Now does ASMR recordings only, makes 10k per month it’s super bizarre. Seems easy until you realize she has no real hobbies. She makes like 400 ASMR recordings a day doing random stuff. She spent $2k on a coffee table, $3k on swarovski crystal dinner plates, but wears only gym clothes from old Navy and that just doesn’t make any sense. She even offered me to join in on her ASMR, wanted me to legit fart into the microphone after eating Taco Bell and Chipotle. I noped out after that, and she was like no one’s gonna know, I feel like they’d know tbh.",
   "created_utc": 1703669729,
   "score": 2,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3vlf6",
   "message": "We were invited on a trip with friends about 7 years after splitting.\n\nReconnected on the trip and we are now married.",
   "created_utc": 1703673359,
   "score": 2,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3ep5h",
   "message": "Just recently met up with a friend from years ago, we decided to go and try and old spot on top of a hotel roof near LAX...luckily it was still unlocked and we were able to get up top and get a good roof top fuck in. Nothing like fucking a model on a roof near LAX with the planes coming in!",
   "created_utc": 1703660528,
   "score": 4,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3f9t4",
   "message": "My ex (we dated medium distance when we were like 13-15) and I really loved eachother. We never met in real life but for what we had, we thought it was love. Definitely have a trauma bond. We don’t keep in contact however we talk. There are so many things we know about eachother that no one else knows, and sometimes it feels nice to talk to a familiar face and just get it all out.",
   "created_utc": 1703660927,
   "score": 4,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3cya1",
   "message": "Paying for a dance from her in the strip club",
   "created_utc": 1703659339,
   "score": 3,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3k3d1",
   "message": "At the time we broke up I more or less had just started a job where I was about to make more money than I ever had in my life but right before that she more or less thought I was going nowhere and she thought I was a deadbeat or something as I was driving something that barely could be qualified as an automobile.  So she gave me the old dumpola.  Maybe 12-14 months after that was when I saw her.  It was a random encounter where I was filling the gas tank of my brand new sports car and she did a doubletake but didn't talk to me.   It was awkward since the parting was not any fun for me.  Sorry?   Not sorry.   For a second I had to laugh.",
   "created_utc": 1703664451,
   "score": 2,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf38zcc",
   "message": "I've answered a few posts but this is the hum dinger. Not a lover but potential. When I was married she was too. Bad partner but she became a mother of four with not great prospects. Divorced the husband, set herself up alone. We talked. I'm widowed, she's in her own space. Flirt, get close and then when I decide \"Well I need to work on myself\" she gets a bit clingy. Not great.",
   "created_utc": 1703656793,
   "score": 4,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3izhk",
   "message": "Ten years ago when I signed up to Facebook the first message I received was \"Are you $^#@^^\u0026amp;** that worked at #$@%^\u0026amp;*%$.?\nI was who she thought I was and she was the love of my life 25 years prior. She dumped me for somebody else back then. \nAt the same time that the later contact happened I had just started dating my now wife of 5 years. It didn't complicate anything as we are in different countries. She had a son but wasn't in the happiest of relationships by the sound of it.",
   "created_utc": 1703663623,
   "score": 2,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3yqgh",
   "message": "A who? \n\nEx lovers do not exist to me. \n\nI only care about the dick that’s in front of me at the moment. You leave me, you are dead to me. \n\nI can’t run into you. Mama don’t play that.",
   "created_utc": 1703675735,
   "score": 253,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf3w92y",
   "message": "Ran into a guy recently that I had a fling with 20 years ago(we were work friends and we had too much to drink one night and ended up sleeping together). To be honest, I barely recognized him because it was a brief friendship, and we were only together that once(I actually moved a couple of hours away). Anyway, he remembered my name, and said to me “you changed my life and opened up new avenues for me sexually”. Apparently he had been married for many years at this point. Sadly, I barely remember the sex we had but obviously I did something significant for him to remember me that many years later.😂",
   "created_utc": 1703673866,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf43e12",
   "message": "I was sitting outside my local pub enjoying a nice cold one on a summers day and all of a sudden some lad comes running out of the pub from over the road with his shirt and shorts all torn up and starts sprinting down the road....then behind him is my ex gf (I was a teenager when we dated for a few months so one of them) she was chasing him and he looked fucking scared...the police came and she got arrested not sure what she did but I managed to snap a picture of her getting arrested lol.",
   "created_utc": 1703678973,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf43fga",
   "message": "My ex called me after about 2 years of no contact when she was drunk on her wedding day with her new partner. Weird. Haven’t spoken since.",
   "created_utc": 1703678999,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf44zhi",
   "message": "I see him most of the time he is the supervisor at my local post office, plus since divorce I have suspicions he put a tracker on my car because I always see him at random times that I get out also during his working hours. And where he lives he have many short cuts to get to his work, restaurants and stores vs where I commute he goes in a big circle if he drives close to me.",
   "created_utc": 1703679999,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf45xbh",
   "message": "Not an ex lover, our relationship didn’t progress that far. We sorta dated for a week then she rejected me because she wasn’t really interested in a serious relationship, or something, at least not with me. I guess I came on pretty strong. She even warned one of her interested friends off me, saying I was too clingy.  \nA few years down the road, that friend and I are married, and the girl is engaged. We’re all still sorta friends and hang out from time to time but not super great friends. She and her fiancée have just moved in together and they wind up borrowing some stuff from us until they get their shit together, which includes my ps2, and after the agreed period of time I make arrangements to go over to their place to collect it from them.  \nWhen I get there we hang out for a bit (her fiancé is at work) and she collects all the cables and peripherals and not and we get to talking about anime and she offers to burn me some recent fan subs to DVDs for me. So while I’m hanging out waiting for the DVDs to burn she totally at random starts telling me about this crazy porno she saw and just like, starts playing it on her PC? And it’s this German Snow White parody where the dwarves come home to find Snow White masturbating in their house then fuck her after watching for awhile.  \nNow I enjoy porn as much as most adult males, but I’d never watched porn with a friend before, not even under the guise of doing it for “the lulz” while they translated all the dialogue to English for me. I really had no idea how to react. Was she flirting with me? It seemed unlikely given how our brief courtship had ended years earlier and that we’d become quite seriously committed to other people in the interim. So after a few awkward minutes of this I gently prompted her that the DVD was probably finished burning by now, collected my pirated anime and video game console, and made my way back home.  \nI can’t remember for sure but I think that might have been the last time I saw her. We did make plans to hang out a few times after that (as in my wife and I with her and her fiance, not one on one) but it became clear that it was never actually going to happen and we just drifted further apart over the years.",
   "created_utc": 1703680587,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf46a8u",
   "message": "I don't have a lot of dating experience, so my first \"proper\" relationship that started from highschool until my 3rd year of college, we had a messy relationship, messy breakup where my ex decided it'd be a great idea to ask me if I was interested in only a FWB dynamic, he didn't love me and didn't want to do the whole \"bf/gf thing\". BOOM, emotions exploded.   \n\n\n  \n\n\nA year later of going NC, I see him, waiting for his bus and he notices me and walks up to me. He changed his appearance a lot since then and so when it hit me, I felt really awkward.   \nHe tried striking up friendly conversation, asking where I was off to and that he was working as tech support at some new university, I think he realised that I felt awkward and was giving him short answers during our encounter and so his attempts of rekindling something ceased.    \n\n\n  \n\n\nI still saw him, because we took the same bus, him for his work and me for college out of town but we never spoke again. I still feel it was best to leave him and whatever we had in the past, our relationship was toxic and I didn't want to risk putting that energy back into my life even as \"friends\". When you see someone's most horrible side and that's the last instance you see them until years later, it kinda makes you hope they grew up as you have, but also discourages having any kind of relationship with them other than acquaintances/strangers.",
   "created_utc": 1703680804,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf46u3j",
   "message": "I dated a girl when I was 15, hadn't spoken to her since then. We didn't sleep together or do anything more than kissing. Years later when I was 21 I'd dated another woman and broke up. I changed my relationship status on Facebook to single and the girl from 15 messaged me within half a day. Her second message was asking if I'd seen her new tattoos. She then sent me the pics without asking. They are in very suggestible places. We hooked up for a while after that",
   "created_utc": 1703681136,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf47x2o",
   "message": "Not my ex, but my husband's.  During my most recent pregnancy, I had gone to labor and delivery for contractions. The nurse came down to the ER and wheeled me up to the unit. I was chatting away with her, and she was very kind and professional. She got me hooked up to the monitor and did a cervical check, and said she would be back in a bit to check on me.\n\nAfter she left the room, my husband said, \"You knew who that was, right?\" I told him I didn't, and he stated it was his high school girlfriend. \n\nMy response was, \"Oh. So you've been inside her, but now she's been inside me!\" \n\nWhen she came back, the elephant in the room was acknowledged, but it had been more than 15 years, so we all just laughed it off. She remained professional.",
   "created_utc": 1703681768,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf4a9kb",
   "message": "I had just married the love of my life when my ex husband knocked at my door and needed to be able to sleep over. My husband allowed it because the ex seemed a bit off. He was very sad and we didn’t want him doing anything extreme. \n\nHe slept in my guest room, woke up and strolled into my computer room where my husband and I hang out together. The ex just stared at us and left 15minutes later. I am not entirely sure if it helped with closure but he seems to be in a new and happy relationship now.",
   "created_utc": 1703683066,
   "score": 1,
   "submission_id": "18rrh4c"
  },
  {
   "comment_id": "kf4afrv",
   "message": "One of my exes was married and backsliding into drinking and \"casual marijuana use\", but, added me again under the pretense of friendship and made what I felt was a sincere apology to me- which I accepted. \n\nWhat ended up happening in quick order: \n* Telling me he loved me as he has never loved anyone else\n* When I brought up my relationship and his whole WIFE, he told me he and his wife had been separated for over a year. Didn't want to answer when I was like \"you literally just had a baby, dude, that math isn't mathing\" like I was an absolute moron which was more insulting. \n* Asked me to run away with him to Denmark - where he has no ties, but their immigration program wants nurses and nurse practitioners. \n* Told me I wouldn't have to interact with his children if we were together bc I'm very very very child free. \n\nHonestly the last bullet point was the most offensive to me.. I'm not messing with a married man in general, but despite being child free and not dating people with children  as an unbreakable rule: if you think you can get around it by being a deadbeat,,,,, you simply do not know me at all. I would rather eat DIRT.\n\nThey've had another kid since and are still married. I hope it's happily, honestly. I don't think she knows he was in my DMs and she seems like a nice girl who deserves better. I told him when he was sober again he should confess to her, before blocking him. Idk if he did.",
   "created_utc": 1703683156,
   "score": 1,
   "submission_id": "18rrh4c"
  }
 ]
}