{
 "submission_id": "18rs93p",
 "title": "Do you believe that technology is increasingly diminishing human connection? What are your thoughts on this perspective, and do you think there are ways to maintain genuine connections in today's digitalized world?",
 "selftext": "",
 "created_utc": 1703652894,
 "permalink": "/r/AskReddit/comments/18rs93p/do_you_believe_that_technology_is_increasingly/",
 "score": 58,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rs93p/do_you_believe_that_technology_is_increasingly/",
 "comments": [
  {
   "comment_id": "kf325lj",
   "message": "What in the freshman ELA essay prompt is this",
   "created_utc": 1703652965,
   "score": 12,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf322kg",
   "message": "Uhm…are you not connected to all of us right now?",
   "created_utc": 1703652922,
   "score": 7,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf325fj",
   "message": "There are approximately 75 thousand people on this subreddit RIGHT NOW. Id say we’re pretty connected.",
   "created_utc": 1703652963,
   "score": 11,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf32i90",
   "message": "Technology is commoditizing everything. Making everything transactional / temporary. It’s causing everyone to not value things anymore. TV stand has a scratch? Go online a buy a new one instead of fixing it. The same goes with relationships. It’s making them a throwaway item.",
   "created_utc": 1703653149,
   "score": 3,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf39gd7",
   "message": "I work in technology so my perspective here may be somewhat biased by that.\n\nI think it is relatively easy to have this nostalgic perspective of the time before technology as a time when everyone was watching Chomsky debate Foucault, where conversations were mostly meaningful and so on. I think to some degree there may be some truth in it, but very little.\n\nRealistically, before we had the internet there was television. Brave New World was the most accurate dystopian novel at the time (and still is), because it was not that the government needed to silence the people, rather they simply needed to entertain them. The conversations and thoughts of the vast majority of people have _always_ been shallow, otherwise there'd be a lot more Kants, Hegels, Gödel and so on. There isn't. Propaganda has simply been replaced by the meme.\n\nWhat technology has done imo has taken an already simplified populace and made it even simpler. It has done this by taking the concept of the sound bite and applied it to popular opinion (i.e., 120 characters or less). Adding on to that it has taken the concepts around video games and applied them to conversations. This has created a world that lacks any form of nuance. A world where popular is correct. A world where we are constantly barraged with the status quo. But again I say, the vast majority of people have always been happy to turn on daytime television, gossip about celebrities and regurgitate whatever opinion their favorite newscaster happens to espouse.\n\nNow, I have worked on systems that are built to attract people (like this site). They employ the same gamification tactics and so on. Quality does not matter, only quantity.",
   "created_utc": 1703657082,
   "score": 6,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf32m2j",
   "message": "What's being diminished is general human sympathy if anything. The only way to maintain the way things are/were is to remember to be kind and treat others as you'd want to be. But in a dark grey and cold world like ours it's hard to focus on anything but worry's about yourself and immediate family.",
   "created_utc": 1703653205,
   "score": 5,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3dknr",
   "message": "Yes and no. I don't wanna get too into it but basically it both enhances and diminishes communication depending on the context.\n\nYou can talk to anyone but that includes the wrong people.\nYou can stay connected at all times but that can also mean using it as a surrogate for real connection.\nYou can minimize risk in some cases but this reduces people's overall willingness to meet new people irl first.\nYou can learn new things and be informed but you can also find yourself in an echo chamber with misinformation.\nIt can open your eyes to things you didn't know were going on or fall victim to propaganda.\n\nThere's so much potential for communication but also risks, and we can't control how people use it.",
   "created_utc": 1703659760,
   "score": 5,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf327zc",
   "message": "I think technology has the potential to both enhance and hinder human connection. While it offers convenience, it's essential to balance screen time with real-world interactions. Establishing offline activities, like face-to-face conversations or group events, can help maintain genuine connections despite the digital era's challenges.\"",
   "created_utc": 1703653000,
   "score": 3,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf393q9",
   "message": "Yes. I find it all to be overwhelmingly depressing. We rely on technology more than we rely on each other. It’s a weird time to be human.",
   "created_utc": 1703656869,
   "score": 3,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3bgw2",
   "message": "It increases the amount of superficial connections but most of them don't go as deep as they used to",
   "created_utc": 1703658357,
   "score": 3,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf34gwa",
   "message": "I do not believe that. I think people need to get over it because there is no problem.",
   "created_utc": 1703654199,
   "score": 2,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf361sq",
   "message": "Technology will change the connection.  Only attention and affection can be achieved through personal contact.  Attention and affection through a technological venue is an attempt to describe the feeling with words.  Walt Whitman said something to the effect that words alone cannot fully capture the essence of the self or the depth of human experience.  Not a quote. What the poem meant to me from long ago.",
   "created_utc": 1703655072,
   "score": 2,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf39ymu",
   "message": "I grew up with the evolution starting with bulletin board services (BBS), IRC, ICQ, MSN/AOL/Yahoo, MySpace, Facebook... I didn't bother with Snapchat or IG or Twitter.\n\nSocial media is here to stay, and it helped me reconnect with some old friends, and made it easier to see what's going on in their lives, but rarely facilitated real world human connections. I was seeing updates from hundreds of people I never spent real time with. If a life event is happening, I can still get in touch with people who matter to me and a phone call, even a text message, feels more meaningful and intentional, IMO.\n\nSocial media has its place, but it's not for me anymore. I'm old. Pseudo anonymous Reddit and semi regular in person social activities are plenty for me.",
   "created_utc": 1703657396,
   "score": 2,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3llrx",
   "message": "Honestly, it's always felt like the opposite to me.",
   "created_utc": 1703665605,
   "score": 2,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf34jfl",
   "message": "For surface-level human connection? No. For deeper-level human connection? Yes. Less people have best friends, friend groups outside of work, etc. we can attribute that not just to technology, but the loss of the third place. It's making us more misanthropic.",
   "created_utc": 1703654238,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf35cjd",
   "message": "I just had a thought today that maybe that's why there are hardly any bands today... Used to be if people wanted to make music they would have to find likeminded friends to play with.\n\nOn the other hand when I was a teenager in the early 2000's on forums , I remember the feeling of finally being able to find people who liked the things that I liked and someone to talk to about it",
   "created_utc": 1703654677,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf35jda",
   "message": "Ye bro it’s insane",
   "created_utc": 1703654781,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3a47h",
   "message": "For some reason, this question is reminding me of a video I recently watched. \n\nIt's a video about the lost art of cable TV from a YouTuber named NationSquid that really sums up a lot of my feelings on the human connection question.\n\nParticularly, there's a part near the end when he talks about the way that cable TV connected us in a very unique way. He talks about how he happened to catch Bewitched one day with his dad and how it became their thing. And also circles back to an episode of Mad Men where Peggy gives a pitch to Burger Chef that really drives home that same sentiment. \n\nhttps://youtu.be/u-OcHoGFl5M?si=JYXEwV_Vg_e8PsoY\n\nI think that human connection in relation to life itself and the events that shape us as a whole is diminishing as we find ourselves more and more in our own little pop cultural bubbles where we surround ourselves with people and things catered to us. The human connection of those around us who may not have a lot in common but have a common ground of sorts.\n\nNot sure if this honestly makes sense but the video I linked had an essay at the end that really nails what I want to say.",
   "created_utc": 1703657493,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3c353",
   "message": "I think we have the illusion of connection. But I think people are quicker to make assumptions about people and are less compassionate. It's like with this extreme/isolating connection and immediate gratification, people are expecting perfection out of other people. Looks wise, etc. Also just a pet peeve of mine but I hate when people say they go off of vibes. I'm sorry but vibes are arbitrary and most likely reflect the person who's making the accusation of someone having \"bad vibes.\" Again compassion is virtually non existent lol",
   "created_utc": 1703658759,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3ddqn",
   "message": "Comparing the in person experience to other forms has some interesting dichotomies.\n\nToday, we have more ability to communicate than we have ever had.  There are near instantaneous options available to us: texting, phone call, email, video calls, etc, etc...  They even innately provide a sense of urgency.  One is appropriate for sharing joke you just saw while another is appropriate to call for an ambulance.  That's actually extra information compared to an 'in person' experience where you'd have to pick up on how urgent they were. This just touches on huge stack of really cool things that we can do now with communication.\n\nBut, these replicate subsets of what makes an in person experience.  We all know that a text message can be read in the wrong tone, many cues to our intent just don't get sent with text. Not only is this lacking from our side of it, we almost innately change ourselves accordingly.  When I write this I'm composing it with the thought of using this media, it is not the same as I might have spoken it in the room with you.  If you step back and watch yourself, how many differences can you find in our own behavior during texting, phone and in person.\n\nIt's an old statement but \"it's important that we use our technology to enhance our experience, not replace it.\"  \nEven that may become debatable.",
   "created_utc": 1703659630,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3dw2r",
   "message": "I think It depends on how you use it. If you use it to avoid real world conversations then yes but if you use it to talk to others then no I think it mostly depends on the person",
   "created_utc": 1703659971,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3hs8v",
   "message": "I think it has enhanced my human connections.",
   "created_utc": 1703662728,
   "score": 1,
   "submission_id": "18rs93p"
  },
  {
   "comment_id": "kf3o7fn",
   "message": "I'm probably going to be really negative here. I feel that smart phones are making people dumber. No one uses their brains anymore to work problems out or think with common sense",
   "created_utc": 1703667615,
   "score": 1,
   "submission_id": "18rs93p"
  }
 ]
}