{
 "submission_id": "18rueb6",
 "title": "Women, what’s a nsfw fun fact you wish more men knew?",
 "selftext": "",
 "created_utc": 1703660036,
 "permalink": "/r/AskReddit/comments/18rueb6/women_whats_a_nsfw_fun_fact_you_wish_more_men_knew/",
 "score": 107,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rueb6/women_whats_a_nsfw_fun_fact_you_wish_more_men_knew/",
 "comments": [
  {
   "comment_id": "kf3kkw8",
   "message": "Touching our clit during sex doesn't mean you're not doing a good job. Team work!",
   "created_utc": 1703664818,
   "score": 127,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3mr6y",
   "message": "We have thick, clear discharge, usually when we are ovulating. If your lady thinks she may have started her cycle early, and comes back like: \"False alarm.\" That's usually what it is, and I'd suggest wearing a condom cause her chances of getting pregnant are much higher. Also, vaginal discharge is so acidic that it can leave what looks like bleach stains on your underwear. (If you ever see what looks like bleach stains on navy blue, dark blue, or black underwear, it is usually from the acidic vaginal discharge interacting with the fabric dye.)\n\n\nEdit: Yes, you should always wear a condom to help prevent pregnancy. Sperm can survive up to 5 days in the woman's body.",
   "created_utc": 1703666495,
   "score": 52,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3lnm4",
   "message": "Don’t have the goal of making a woman come asap. Bc then any sort of foreplay can become „aggressive“ and not as enjoyable (and eventually painful bc it’s about 8000 nerves down there). Have to goal for her to enjoy herself bc that’s what gets us there.",
   "created_utc": 1703665645,
   "score": 139,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3o66j",
   "message": "When you go down, get into it. Lick it, suck, whatever, but please be into it. Don't be tickling the clit with the tip of your tongue like you don't really want to but you're being forced. I'd rather you not go there at all if it's not your thing.",
   "created_utc": 1703667589,
   "score": 149,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3my48",
   "message": "\nSay more stuff! \nIt’s just as morale killing for us if you’re too quiet \nEspecially during foreplay, saying something like (has to be genuine!!)  ‘your tits look amazing’ or even more natural like ‘f*ckkk look at that ass omg*’\nIs gonna take me placessss.\n\nAlso *personally if I’m in the early stages of sleeping with someone I love to hear about any fantasies they’ve had about me. :D",
   "created_utc": 1703666642,
   "score": 98,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3h0hr",
   "message": "Porn is not real. It’s the comic book version.",
   "created_utc": 1703662167,
   "score": 47,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3rndq",
   "message": "We hate it when you are quiet in bed. Especially when you actively look like you are trying to keep a moan in. Moan let us know you are enjoying whatever we are doing or being. A compliment can go a long way.",
   "created_utc": 1703670293,
   "score": 85,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3m931",
   "message": "However much foreplay you think women want/need, double it. Triple it even.",
   "created_utc": 1703666111,
   "score": 237,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3ih9q",
   "message": "Not a woman but my dudes, if you are given the go signal to finger bang your significant other, cut your nails and wash your hands.",
   "created_utc": 1703663245,
   "score": 161,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3r7bw",
   "message": "Pull our hair from the nape of the neck, not the crown of the head",
   "created_utc": 1703669941,
   "score": 218,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3rx6i",
   "message": "If you’re fingering a woman dont automatically assume they want incredibly fast and hard. That shit hurts.",
   "created_utc": 1703670506,
   "score": 170,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3jrbt",
   "message": "Most women (about 75-90%) don’t cum just by penetration alone. There needs to be clitoral stimulation.",
   "created_utc": 1703664202,
   "score": 147,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3v73z",
   "message": "Toys are your teammates, not your competition.",
   "created_utc": 1703673056,
   "score": 58,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3f3x3",
   "message": "A woman's g-spot is not really a spot but an entire area which gets out the most oohs and aahs\n\nEdit: thank you everyone for upvoting this more than the actual post!\n\nEdit 2: I have never gotten that many upvotes in my short span on Reddit! Thank you all!",
   "created_utc": 1703660812,
   "score": 35,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3skxd",
   "message": "If you want to actually ‘learn’ from porn watch amateur lesbian porn. And even then it’s still not going to be the best way to learn. The best way to learn is to actually ask what your partner likes",
   "created_utc": 1703671018,
   "score": 231,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3il8z",
   "message": "I can give myself a better orgasm than anyone else.   Don’t be offended if I want to keep playing when you’re done. Just sit back and enjoy.",
   "created_utc": 1703663329,
   "score": 159,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3r8tb",
   "message": "Kissing and sucking the clit and licking SLOWLY feels way better than the porn you all try to emulate where men start off fast and aggressive, only using the tip of the tongue. It's all about the build up and switching it up.",
   "created_utc": 1703669974,
   "score": 160,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3wovx",
   "message": "Sometimes our nipple hair grows at an alarming rate",
   "created_utc": 1703674198,
   "score": 158,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3h3ll",
   "message": "Men, eat more pineapple.",
   "created_utc": 1703662231,
   "score": 134,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3hxpf",
   "message": "We cant store items in our vaginas. Its not an extra pocket. My boyfriends always ask me to store car keys up there when we are at the beach, so they dont get stolen. Im sorry but it doesnt work like that.",
   "created_utc": 1703662841,
   "score": 90,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3nddr",
   "message": "I have all the theoretical knowledge but lack the practical experience….",
   "created_utc": 1703666968,
   "score": 228,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3p1c8",
   "message": "sometimes (but rarely) when we fart it travels past our pussy lips and feels like a hard slap or electrical shock. Anyone else?",
   "created_utc": 1703668252,
   "score": 146,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3w93l",
   "message": "When you go down there, make out with it, passionately. Sucking is good too. But please for the love of god stop with that tip-of-the-tongue flicking back and forth as fast as you can. I want to feel your MOUTH WARMTH and SUFFOCATE YOU. 😇😚",
   "created_utc": 1703673866,
   "score": 197,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3nl6w",
   "message": "Period poops are a “fun” fact.\n\nMen imagine the worst upset stomach you have ever had. The cramps, the sweating, the red raw burning ass hole from the explosive diarrhoea. \n\nWomen’s hormones can cause that along with the bleeding (anywhere from 2-3 table spoons to 1/3 of a cup) crippling pain that can run from your belly down to your knees, headaches, extreme hunger, sore boobs, brain fog and this lasts for anywhere from 4 to 9 days (rough average). \n\nAlso those damn hormones take us on a emotional rollercoaster…no I don’t know why I am crying because the big spoon got jammed in the drawer but I am. \n\nOf course it differs from woman to woman and even from day to day in the cycle, but we are not playing when we say we feel awful during that time and yet we are still expected to carry on as normal.\n\nBuy the chocolate/ice cream/big mac, keep the heating pad on standby and don’t under estimate how much this sucks.\n\nEdit- for spelling",
   "created_utc": 1703667133,
   "score": 56,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3ohwo",
   "message": "This should be common information, but vaginas expand from arousal. The more aroused she is, the looser and wetter she’ll be. If she’s super “tight”, you’re doing it wrong.",
   "created_utc": 1703667841,
   "score": 39,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3o0ls",
   "message": "Do not ask me if I'm liking it when you're giving oral. I like it, hence I'm moaning. Please don't keep checking in and break the flow, I'd tell you if I needed anything differently. I need you to not stop!!",
   "created_utc": 1703667468,
   "score": 64,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3mgzb",
   "message": "After reading out all comments should I consider my self as the most eligible bachelor in bed ?",
   "created_utc": 1703666279,
   "score": 48,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3r78q",
   "message": "Some like it round and round some like it up and down. Learn your lady do not assume this woman likes what the last woman liked EVER!",
   "created_utc": 1703669939,
   "score": 113,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3os1r",
   "message": "\"women, what's the sexiest sex every sexy sex sexed in the sexy sex time.\"",
   "created_utc": 1703668055,
   "score": 148,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3qzqj",
   "message": "I don’t know if these are “fun” facts but I do wish more men were aware of them: (and I just want to preface this by saying to all the men out there that this isn’t  meant to be a negative post against men. I know and love so many good men! This is more just things I’ve noticed or that have surprised me over the years that I just thought everyone knew). \n\n1) often, turning a woman on has more to do with you making her feel emotionally safe and respected, and as if she’s the sexiest woman on earth and you just desire her so much. It’s more about building these “feelings” rather than how you flick her clit (I mean that might help too but it’s not the deciding factor on how good the sex was). \n\n2) pregnancy and birth can be excruciatingly painful. Her skeletal structure and internal organs are literally moved and shifted into different places. Imagine someone prying your hip bones apart slowly every day and then shoving a small watermelon up your ass. So when the doctor says she needs MINIMUM 6 weeks of recovery/no sex, you listen and don’t pester her. Help her with stuff, even if it’s stuff she normally would do. \n\n3) again, pregnancy and giving birth and then looking after a baby is extremely exhausting and emotional. I know it might look like she’s sitting on the couch chilling while the baby breast feeds, but breast feeding actually increases hormones in her body that make her feel even more tired and hungry than she already is. Just try to remember that at any time you feel exhausted being a new dad, she’s probably feeling that times 10, especially if she has had to return to work within the first year. \n\n4) women have three holes in their genital area. One for poo, one for wee, one for babies/periods. I know this might sound weird to some of you, but I know of many men in some countries that do not know this. \n\n5) squirting is literally a mixture of vaginal mucous and urine. (Edited after someone gave me a little perspective). \n\n6) porn is not real. You 100% need to ask your partner before you do anal, choke them, slap them or any other stuff that’s not basic missionary. Usually people in healthy relationships will talk about their limits and curiosities or fetishes or things they want to try, so I am not directing this at all men. It’s just something I think everyone should be more considerate about when they have a sexual partner. \n\n7) periods are not something a woman can “feel coming on” or “hold in”. She also doesn’t get to pick which days it happens. It’s not like going to the toilet. It’s literally like if you cut yourself and blood flows out, you can’t “hold it in”. We can track the days it usually happens and notice the pattern so we can get a rough idea of when it will happen again and for how long, it it’s not always “on time” and sometimes we can get a surprise early start. \n\n8) biologically a woman’s body doesn’t “decide” to abort a baby if she’s been raped. It also doesnt decide to get pregnant. Its not a decision making process that the body goes through to decide whether or not to “allow” sperm to enter the egg. Where this idea came from, I do not know, but it’s wrong.\n\n9) in healthy men and women, women genetically have a higher body fat percentage (this has to do with evolutionary changes over time) and fat is also distributed differently in men’s and women’s bodies. Higher testosterone also makes it easier to lose fat and gain muscle. Higher estrogen is generally associated with voluptuous figures (big boobs and butt). \n\nSo if you’re a man who thinks that it’s easy for your female partner to hit the gym and lose her post baby-weight, it’s really not. Stress hormones also affect the rate at which a person can get rid of fat, or retain fat. Pregnancy hormones can make women feel soooooo hungry all the time. \n\nAll I’m saying is, just because a woman has more fat on her body than you, doesn’t mean she is lazy or undisciplined (I mean, she might be, but it shouldn’t be the default assumption).",
   "created_utc": 1703669778,
   "score": 125,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3io61",
   "message": "Please do NOT rub the clit like lemon zester. We have over 8000 nerve endings there, all it needs is some light flicks. LIGHT.",
   "created_utc": 1703663390,
   "score": 209,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3nfxm",
   "message": "g spot is not a spot but actually an area",
   "created_utc": 1703667023,
   "score": 76,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3qlvc",
   "message": "When going down on a woman, do not let your facial hair rub against her skin. Especially if it’s freshly trimmed or stubbly. Ouch",
   "created_utc": 1703669474,
   "score": 41,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3i3k8",
   "message": "Boobs cant produce milk unless we just had a baby. I would be rich if i had a dollar for the number of times male roomates have asked me to add some milk to their coffee because they ran out. Im sorry, ive never had a baby, this i cant help with, youll simply need to go to the shops like a normal person.",
   "created_utc": 1703662958,
   "score": 37,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3usql",
   "message": "If you claim you're good in bed, you're announcing to the world that you're an ego and shit in bed.\n\nYou're likely WITH someone else ffs. It's about being with that person and what works with them and you. You claim to be \"good in bed\" means you only think of your own performance tbh.",
   "created_utc": 1703672741,
   "score": 23,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3npsp",
   "message": "As a man who has had some experience and talked about sex with his partner: not all women like clit/G-spot stimulation, etc. Everyone has their preferences, TALK TO YOUR PARTNER OPENLY about what they like/don't like. Same goes for us, men, of course.",
   "created_utc": 1703667233,
   "score": 63,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3nizf",
   "message": "Am not a women but i know for a fact that women like to be kissed on neck area's more then there lips and face.......",
   "created_utc": 1703667086,
   "score": 69,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3ro79",
   "message": "What works for one woman might not work for another, could be only cums from penetration or nipple/ clit stimulation but rarely it's going to be the same, ask what they like be gentle and slow.",
   "created_utc": 1703670311,
   "score": 248,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3z8ig",
   "message": "DIRTY TALK! MOAN! SHOW ME YOU’RE INTO IT!!",
   "created_utc": 1703676102,
   "score": 42,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf4fibl",
   "message": "Don't be afraid to put your body against ours! So many men have sex only through the genitals, with the rest of their body leaned away. A lot of men seem to think its 'crushing us' to put their body against us, but it really isn't. \n\nAlmost all women like it when you have your chest and arms against us. Missionary is almost always better like [this](https://hips.hearstapps.com/hmg-prod/images/men-shealth-classicmissionary-1605215625.jpg?crop=1xw:1xh;center,top\u0026amp;resize=980:*) than like [this.](https://hips.hearstapps.com/hmg-prod/images/menshealth-openpicer2-1599579913.jpg)",
   "created_utc": 1703685716,
   "score": 108,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf4au0i",
   "message": "Please moan. It turns us on more than you know.\n\nAlso our clits aren't like joysticks, you don't have to press hard on it. Soft circular motions, as long as it's steady, will make us cum in no time.",
   "created_utc": 1703683363,
   "score": 165,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3z7pg",
   "message": "- whatever you do down there, don't be too fast and rub or lick like crazy. Take your time. Slow is way way better.\n- If she's pulling her pelvis back, then what you're doing is not good\n- when you lick for a while, insert one or two fingers\n- If you want to finger her, don't put your finger straight in, rub a bit before, may be Kiss her neck in the meantime and then slowly insert one finger.\n- before you meet a woman, cut and file your nails before and before it's gonna happen, make sure to have clean hands\n- communication and consent is sexy. If possible, ask her before what she likes and what's a no go. Same for dirty talk or things like choking or hair pulling.\n- If she comes over, make sure your place and especially you are clean.\n- try stimulating her clit during sex.",
   "created_utc": 1703676085,
   "score": 221,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf43nj8",
   "message": "not everything is about orgasms. Just enjoy the experience together",
   "created_utc": 1703679148,
   "score": 230,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf43ab6",
   "message": "Bringing out the magic wand will make you a very powerful wizard.",
   "created_utc": 1703678904,
   "score": 47,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf4ac98",
   "message": "I love it when a man moans. Like, damn.",
   "created_utc": 1703683105,
   "score": 32,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3wl93",
   "message": "I can’t speak for all women, but attraction is not the only important thing to get horny for most women. We need to be emotionally invested too. Make us feel safe, loved..show effort that you at least kinda care about us and not just about our tits.",
   "created_utc": 1703674120,
   "score": 57,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf42b3f",
   "message": "For me it would be that women can come more times than men. Make sure your girl is satisfied even after sex. When she asks you to make her cum one more time do it.",
   "created_utc": 1703678250,
   "score": 28,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf49534",
   "message": "Penetration feels good but foreplay makes us cum. 🤷🏼‍♀️",
   "created_utc": 1703682453,
   "score": 28,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf49nhp",
   "message": "We can masturbate just as much or even more than you.\n\nI'm actually trying to slow down. *Sigh*",
   "created_utc": 1703682735,
   "score": 26,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf4dbe5",
   "message": "Pls stop jabbing my clit congrats you found it but pls don’t treat it like it owes you money i promise a very gentle touch is much appreciated",
   "created_utc": 1703684641,
   "score": 27,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf3sirs",
   "message": "1) some clits are sensitive and you do not need to be going fast. It actually hurts. \n2) Make foreplay fun and last a while why are you in a hurry? \n3) don’t be afraid to try something new but mention it to your partner first.",
   "created_utc": 1703670972,
   "score": 20,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf44im1",
   "message": "For men or women, rhythm is everything. If your partner tells you they are close, dont speed up or slow down cause 95% of the time it ruins the orgasm. However, if you can go deeper while holding the same rhythm, that can make it more enjoyable.\n\nBesides this when fingering a women curl your fingers towards their stomach.",
   "created_utc": 1703679705,
   "score": 19,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf4abke",
   "message": "I don't mind swallowing. What I do mind is your cum burning a hole in my tongue. Have a good diet. Fruits and veggies and stay hydrated. If you live off of beer and doritos, I'm not going to want to suck it at all. Same with women's vaginas. Good food and hydration. Everyone wins.",
   "created_utc": 1703683096,
   "score": 39,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf4gqpv",
   "message": "Wish that men knew that foreplay is as important as sex and to touch our clit and nipples more during sex",
   "created_utc": 1703686305,
   "score": 16,
   "submission_id": "18rueb6"
  },
  {
   "comment_id": "kf59hy6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rueb6"
  }
 ]
}