{
 "submission_id": "18rvt7y",
 "title": "What theory is so dumb that you wonder how people still acknowledge it?",
 "selftext": "",
 "created_utc": 1703665234,
 "permalink": "/r/AskReddit/comments/18rvt7y/what_theory_is_so_dumb_that_you_wonder_how_people/",
 "score": 111,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rvt7y/what_theory_is_so_dumb_that_you_wonder_how_people/",
 "comments": [
  {
   "comment_id": "kf41vxm",
   "message": "Rejecting a raise or a bonus because it will put you in higher tax bracket.",
   "created_utc": 1703677958,
   "score": 121,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf40s8h",
   "message": "5G causes cancer",
   "created_utc": 1703677199,
   "score": 17,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3lcxw",
   "message": "The FLAT EARTH theory",
   "created_utc": 1703665413,
   "score": 246,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf43tqk",
   "message": "Vacinces contain tracking devices/5g chips or whatever....what do you think your phone is? You know, the thing most people have on them the majority of the time. I don't know how people think that the entire *world* worked together to fake a disease just to *maybe* track you if you got vaccinated. You aren't special. The government doesn't care that you go McDonald's once a week and do your grocery shopping every other Tuesday.",
   "created_utc": 1703679261,
   "score": 190,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf42mn7",
   "message": "Moon landing deniers. If a dozen or so people couldn't hold onto a secret to keep Nixon safe during Watergate, how do you expect \\*thousands\\*? Not to mention, being able to disprove the biggest technological achievement in human history would have been a massive win for the Soviet Union, and yet they couldn't. NASA has also released tens of thousands of photos and other documentation and even some artifacts, but yet there are still dumbasses out there that think some smudge from a copy machine or whatever is a proof of a hoax. Yeah, good job YouTube user XxPussyMaster420xX you were able to just immediately spot what decades of Soviet Intelligence Services missed. Good job.",
   "created_utc": 1703678468,
   "score": 231,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3p79y",
   "message": "That satellites intercept prayers to Jesus, so he cant hear them and thats why we have evil in our lives.",
   "created_utc": 1703668381,
   "score": 122,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf48xut",
   "message": "**Chemtrails :** its STILL rampant on twitter\n\nAerial dispersion at 30000ft has to one of the WORST ways to cover a large area because wind exists .\n\nPilots would be mind controlling their own families\n\nPutting a magical mind control drug in the water supply would be far more effective\n\nThey somehow believe its a secret kept by every single pilot including puddle jumpers and anything that creates a vapor trail\n\nThey don’t understand BASIC and i mean REALLY basic physics ( hot thing in cold sky full of ice make trail )\n\nIt just goes on , unbelievable levels of idiocy",
   "created_utc": 1703682342,
   "score": 67,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf42pce",
   "message": "Oh man this is a pet peeve of mine as a mother. People thinking if I hold or console my infant baby too much I’ll spoil her.\n\nShe’s a baby!!! You can’t spoil a baby.",
   "created_utc": 1703678518,
   "score": 26,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3rvl3",
   "message": "Vaccines cause autism.",
   "created_utc": 1703670470,
   "score": 90,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3ry9x",
   "message": "My friend and I used to get a good laugh about how people thought that Hilary Clinton was/is a robot.  \n\nI remember back in like 2016 she fainted and the next day I stumbled upon a website that wrote that she’s a robot. She actually “admitted” to being a Robot in 2015 during an interview when she was asked why she never physically sweats. She went along with the ruse (she has a great sense of humour) and said she’s definitely a robot, but her truthers have got it all wrong. They thought Steve Jobs and Bill Gates made her, but she was actually designed by an anonymous contractor in his garage and she’s the only model left because they destroyed the prototypes.  \n\nOn these conspiracy sites I was reading about people who believe this, they think that when she has fainted in public before it’s because her batteries needed to be charged. I even saw one photo where the author had circles parts on the photo where the USB was behind her neck.  \n\nThis was even popular with the dumbest of America during inquiries into Benghazi and the private email server thing - she was able to withstand 14 hour interrogations without losing her cool, and smoked Donnie in all her debates with him. Rather than admit she has incredible stamina and self control, they say it’s because she’s an android and has an unfair advantage because she only gets tired or shows emotion when her power is low and she can run for almost 24 hours.  \n\nI kind of wish there was a black mirror episode or something like that, because if it turned out to be true I’d laugh my ass off.",
   "created_utc": 1703670530,
   "score": 188,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3yvt4",
   "message": "The teachings of Andrew Tate",
   "created_utc": 1703675844,
   "score": 65,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf52jve",
   "message": "That it’s legal for your company to fire you for talking about your wages with coworkers.",
   "created_utc": 1703695148,
   "score": 44,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf56bo1",
   "message": "[removed]",
   "created_utc": 1703696514,
   "score": 48,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3psuo",
   "message": "I'm not history's nicest person, but I like to think I'm at least a _tolerant_ enough person. But those flat-Earthers really challenge that estimation...that is straight insipidity.",
   "created_utc": 1703668846,
   "score": 203,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf5aa77",
   "message": "The idea that 5G causes cancer\n\nMy favorite story is that town that was putting up 5G towers and people kept reporting them and claiming they were sick and you know what the construction companies response was? \n\nThey were basically like y'all could at least wait for us to turn the damn thing on before you start making up complaints",
   "created_utc": 1703697935,
   "score": 37,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf4xjit",
   "message": "Definitely the theory that people are putting drugs in Halloween candy. Idk why people even believe this. Drugs are damn expensive. Nobody is wasting their drugs on your kids, trust me.",
   "created_utc": 1703693282,
   "score": 128,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3off6",
   "message": "Young earth",
   "created_utc": 1703667787,
   "score": 89,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf427az",
   "message": "Conspiracy or belief rather than theory. Scientologists believe in a being called Xenu. Basically a space reptile apparently, but you don't get taught that until you reach a certain level. So we will never know the truth 🙄😆",
   "created_utc": 1703678179,
   "score": 156,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf5bmrz",
   "message": "[removed]",
   "created_utc": 1703698420,
   "score": 39,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3sbhk",
   "message": "Not a theory in the traditional sense but Mormonism. Dude said an angel just appeared to him and a whole church was built around that.\n\nEdit: Shout out to y'all who got the point. And yeah, obviously all religions were started this way, but the thousands of years between the birth of Christianity/Judaism and Mormonism happens to be interesting and relevant context.",
   "created_utc": 1703670815,
   "score": 10,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3mlo8",
   "message": "Anything espoused by QAnon.",
   "created_utc": 1703666380,
   "score": 95,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3zv1z",
   "message": "Flat earth. The second biggest joke to gain traction.",
   "created_utc": 1703676554,
   "score": 140,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf4rgmn",
   "message": "Holocaust deniers, like nobody is making a conspiracy that fakes millions of deaths and getting away with it",
   "created_utc": 1703690920,
   "score": 71,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3x7xz",
   "message": "That the moon landings were faked because rockets need something to push against and there is no air in space. Or that the van Allen Belts are deadly to humans and that's why we only are in low earth orbit now.\n\nBoth are extremely obviously false.\n\n Rockets are comically bad at performance, but they don't need air. Their efficiency is measured in called specific impulse. Saturn V 1st stage was around 300s. A modern jet plane is about 3000s in its engines. That's how much air helps. But you can do it with rockets and their awful efficiency.\n\nAlso, the van Allen Belts actually extend into low earth orbit due to the ominously named South Atlantic Anomaly, where the magnetic field dips. The Apollo mission was also aware of the belts and wasted quite a bit of fuel to avoid the belts being going around them.",
   "created_utc": 1703674598,
   "score": 85,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf41t8i",
   "message": "Moon landing never happened. It was a Hollywood studio lot and the world was deceived. Everyone involved lived a lifelong lie and had very talented artists make all the photos and video. FFS 🤦🏻‍♀️",
   "created_utc": 1703677907,
   "score": 118,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf5fy9n",
   "message": "The theory of the alpha male was a misunderstanding taken out of context. It has been universally debunked by scientists for decades. In fact biologists were against applying this theory to humans to begin with. There are no human alphas. And what we believed to be alphas in animal populations like wolf packs turned out to just be parents and their packs just their pups. Alphas do no exist in nature. Where they do exist is within the confines of human made prisons. The old studies on wolf alphas largely came from wolf packs in captivity who establish a weird pecking order that wouldn't exist in nature.",
   "created_utc": 1703699951,
   "score": 21,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf5cvk8",
   "message": "[removed]",
   "created_utc": 1703698864,
   "score": 19,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf42cip",
   "message": "Trickle down economics, that giving tax cuts to the rich will cause them to create jobs for all and it helps the economy when they actually just keep the extra money.",
   "created_utc": 1703678278,
   "score": 241,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf4evm5",
   "message": "That billionaires/millionaires work that much harder than you for their money.",
   "created_utc": 1703685409,
   "score": 119,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3v6nn",
   "message": "flat earth, fake moon landings, pretty much anything de-bunking literal science. as an astrophysics major who started college in the fall, i’ve already come across so many genuinely stupid people who disagree with scientific research and proven facts is insane.",
   "created_utc": 1703673046,
   "score": 65,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf44jj3",
   "message": "9/11 theories that say explosives took down the towers and a missile hit the Pentagon.",
   "created_utc": 1703679721,
   "score": 138,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf4310j",
   "message": " The birds are robots thing seems pretty coo-coo.",
   "created_utc": 1703678736,
   "score": 91,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3pw3q",
   "message": "Flat Earth... Hands down",
   "created_utc": 1703668915,
   "score": 69,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf3p0tx",
   "message": "Trump was cheated out of the last election.",
   "created_utc": 1703668240,
   "score": 124,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf40iqk",
   "message": "THAT COVID WAS A FUCKING HOAX.",
   "created_utc": 1703677018,
   "score": 183,
   "submission_id": "18rvt7y"
  },
  {
   "comment_id": "kf4nhwd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rvt7y"
  }
 ]
}