{
 "submission_id": "18s37v9",
 "title": "What company actually sells great products?",
 "selftext": "",
 "created_utc": 1703690869,
 "permalink": "/r/AskReddit/comments/18s37v9/what_company_actually_sells_great_products/",
 "score": 240,
 "url": "https://www.reddit.com/r/AskReddit/comments/18s37v9/what_company_actually_sells_great_products/",
 "comments": [
  {
   "comment_id": "kf5ayjv",
   "message": "The only complaint I've ever heard about Steinway pianos is the price",
   "created_utc": 1703698180,
   "score": 20,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4vxup",
   "message": "Every Toyota my family had has gone over 200k or 300k miles and have spent minimum time in the shop for repairs.\n\nMy parents have had the same Maytag washer and dryer for like 30 years.\n\nAll my Nintendo consoles since the NES still work.\n\nI have a GoPro that has been through hell and doesnt die.",
   "created_utc": 1703692670,
   "score": 66,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4wkyp",
   "message": "Patagonia clothing and Hamilton watches.",
   "created_utc": 1703692916,
   "score": 105,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf54hvi",
   "message": "OXO almost everything they make is top notch.",
   "created_utc": 1703695854,
   "score": 211,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5azqw",
   "message": "Most middle to upper scale hotels. People went nuts on Airbnb for no reason. You can check into a hotel within minutes, do whatever you want in the hotel room, not have to clean a single thing, not have to worry about cleaning charges added on a week later, and dont have to pay any upfront costs like cleaning charge, parking charge, booking fee, etc. You book a hotel room for 100$ a night, and youre paying 100(plus tax)$ a night. \n\nI stayed in an airbnb this past weekend because my family wanted to. The house cost was 200$ a night, so should have been 440$ish for two nights... nope. There was a 150$ cleaning fee, 90$ airbnb booking fee, 70$ host booking fee, 70$ pet fee, 40$ parking fee, and 150$ charged after the stay because there was some dog hairs on the couch and host said they charge extra for that. Just complete garbage, will never us airbnb again.",
   "created_utc": 1703698192,
   "score": 9,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf56vy3",
   "message": "Weber Grills. Both their gas and charcoal grills seem expensive but they actually perform very well and are quite simple and durable.",
   "created_utc": 1703696718,
   "score": 20,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf56buh",
   "message": "YKK Zippers",
   "created_utc": 1703696516,
   "score": 173,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4waa4",
   "message": "Kirkland. Can't really come up with a bad product that I've gotten from them. And it's a lot.",
   "created_utc": 1703692802,
   "score": 191,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4uraz",
   "message": "Don’t tell us, as soon as it becomes known for being quality product the company that makes it will start cutting corners",
   "created_utc": 1703692212,
   "score": 21,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5ccma",
   "message": "Leatherman",
   "created_utc": 1703698679,
   "score": 254,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4w6fw",
   "message": "Bialetti. Incredible grasp of engineering principles, beautiful design, and damn good coffee.\n\nRed Oxx. I bought two pieces of their luggage back in the early 2000s and have used them in everything from overnight stays to month long treks in the Atacama desert. Neither need repair.\n\nMiele. My first Miele was a dishwasher, when I heard how.... Quiet it was and how little electricity it consumed, I bought a vacuum cleaner from them too. Can't imagine buying home appliances elsewhere now.\n\nBarbour. I've had my waxed fabric jacket for more than a decade, I've even had it rewaxed, and the service was so thoughtful.\n\nEverlane. I have jeans, sweaters, and khakis from these guys. The jeans are quietly very performant, I've climbed and done light sparring wearing them. I really hope that they keep up the quality.\n\nRunner up:\nThursday boot company. When Camper moved their stuff to China, the quality took a nosedive. Thursday is the only boot I've tried that actually delivers on the promise of being a comfortable and stylish boot to walk around in.",
   "created_utc": 1703692761,
   "score": 193,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5c75u",
   "message": "Darn tough socks. I've had pairs over 10 years now, they're expensive upfront but pay off in the long run when you aren't buying socks every 6-8 months.",
   "created_utc": 1703698622,
   "score": 171,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5be3h",
   "message": "Everything I have ever purchased from Sennheiser has been worth every penny. Microphones, headphones, monitors, etc...",
   "created_utc": 1703698334,
   "score": 131,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5dqe8",
   "message": "Lego. Aint nobody convincing me to buy some other blocks.",
   "created_utc": 1703699171,
   "score": 219,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5eupz",
   "message": "Garmin",
   "created_utc": 1703699563,
   "score": 104,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4xd49",
   "message": "Everything I’ve ever bought from Carhartt has held up great. \n\nGovee lights.\n\nNot sure about the brand as a whole, but the wrangler pants I buy at Walmart for work have lasted me years.",
   "created_utc": 1703693215,
   "score": 120,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4xbqf",
   "message": "Toyota. Reliable \n\nAlso lexus",
   "created_utc": 1703693201,
   "score": 19,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf55m5e",
   "message": "I've had a lot of luck with New Balance for running shoes, I'll stand by my kitchen aid mixer",
   "created_utc": 1703696255,
   "score": 150,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4y02z",
   "message": "This is very specific but trader Joe's shampoo and conditioner. Its a green tea tree and eucalyptus base product and similar products can even be double in price. Quality brand with a reasonable price. Even though a lot of trader Joe's food is more expensive than say at an aldis... their shampoo and conditioner are quality",
   "created_utc": 1703693455,
   "score": 113,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5abp4",
   "message": "My Dyson absolutely sucks",
   "created_utc": 1703697949,
   "score": 184,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5c4th",
   "message": "Patagonia.\n\nAll profits go for environmental causes.",
   "created_utc": 1703698599,
   "score": 76,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5d8bs",
   "message": "I love to travel, but am not willing to dump the amount of money some people are into super-high-end specialty travel products. From that perspective:\n\n**Osprey** bags: I have two from them (one backpacking pack, one Porter carry-on backpack) and those things perform like a dream. I've schlepped that backpack as my single piece of luggage through basically every international and domestic trip I've gone on for years, and it still looks basically new. Plus, the design means I can fit so much more into it than a \"normal\" backpack of the same size (fuck top-loading packs, seriously), and at least in the US, their warranty/guarantee is basically second to none.\n\n**Prana** and **TitleNine** dresses: okay, I hate to feel like a shill for Prana because I find a lot of their branding/advertising yuppie and obnoxious...but damn, do they know how to make a travel-friendly dress. A lot of people on the onebag-related subreddits swear by travel clothing from companies that cost 2-3 times as much, but honestly, these things have never let me down. Comfy and sturdy enough to literally hike in, pack down small, nice-looking enough that if I throw on a scarf or belt I look ready for a semi-fancy dinner. Some of the TitleNine ones even have a snap button that lets you turn the dress into a romper if it's windy out! \n\n**Sea to Summit** Ultra-Sil products: I have one of the little daypacks that packs down into its own stuff sack (about the size of a bar of soap), and one of the hanging toiletry bags. Super convenient, easy to clean, and again look practically new despite me putting them through a ton of not-so-gentle use. My friends complimented the daypack so many times that I gave those out as Christmas gifts this year. My only gripe is that the toiletry bag is a bit small for my needs, but also that is completely my own fault since I could've bought the larger size.",
   "created_utc": 1703698991,
   "score": 22,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5diqc",
   "message": "Concept2 rowing machines. They are expensive but will practically never break down and never need maintenance.",
   "created_utc": 1703699094,
   "score": 22,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5jm88",
   "message": "Darn tough vermont socks. They warranty them for life. Socks! With a warrenty!",
   "created_utc": 1703701251,
   "score": 24,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5azcg",
   "message": "Roland / Boss",
   "created_utc": 1703698188,
   "score": 41,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf58zre",
   "message": "Anything made by Maytag today is not the same as what they made 30 years ago.",
   "created_utc": 1703697471,
   "score": 80,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5b1z7",
   "message": "Most things Sony are Great. I’ve had the same 48” Tv since I was 16",
   "created_utc": 1703698214,
   "score": 49,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf57lsq",
   "message": "L.L.Bean. I used one of their backpacks all throughout college, loaded with heavy textbooks and not even one stitch tore on it.",
   "created_utc": 1703696976,
   "score": 69,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf58dxw",
   "message": "Fender. They have been at the cutting edge of guitar manufacturing for almost their entire existence. Other brands have fallen off in terms of quality, price and popularity but Fender have ALWAYS maintained a wide base of usage. They have successfully kept up with the times while retaining a classic look. They don’t just lead on guitars but amps as well. If you wanna spend £100 or if you wanna spend £10,000 on a guitar Fender will produce something of exemplary quality for the price. Usually…",
   "created_utc": 1703697254,
   "score": 36,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5047l",
   "message": "Eddie Bauer has always done right by me for clothing.\n\nDelonghi, their appliances are all top notch. I'm currently using an automatic espresso machine that's going on 20 years old",
   "created_utc": 1703694250,
   "score": 62,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf51ymf",
   "message": "Toyota",
   "created_utc": 1703694930,
   "score": 57,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4v5gm",
   "message": "Larian Studios",
   "created_utc": 1703692363,
   "score": 112,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5ty94",
   "message": "Im noticing a theme.\nJapan makes alot of high quality and durable products.",
   "created_utc": 1703704935,
   "score": 14,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf56khp",
   "message": "Yeti. Not cheap. Very well built.",
   "created_utc": 1703696604,
   "score": 73,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf53fwi",
   "message": "Boars Head. Top quality products. Whole muscle meat, no added preservatives or flavorings even in their lunch meat (no gluten in it either). Makes it a healthy option instead of the gluten filled, water filled \"turkey\" and \"chicken\" from other brands.",
   "created_utc": 1703695471,
   "score": 134,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf55k8w",
   "message": "Red Wings .",
   "created_utc": 1703696236,
   "score": 40,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5irp9",
   "message": "LL Bean",
   "created_utc": 1703700953,
   "score": 10,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4w4y6",
   "message": "Honda",
   "created_utc": 1703692746,
   "score": 119,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4vgy7",
   "message": "Mexican restaurants.",
   "created_utc": 1703692487,
   "score": 89,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5gw9b",
   "message": "Bombas",
   "created_utc": 1703700286,
   "score": 38,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5k28p",
   "message": "Herman Miller and Steelcase office chairs are basically the best products you’ll find anywhere in any category. But boy do you pay for it.",
   "created_utc": 1703701410,
   "score": 28,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5eslq",
   "message": "Haven't seen a mention of Osprey packs but they are solid, though this may change as Osprey was bought by a company fairly recently that has a tendency to buy brands and then turn them into shittier products. Can't remember the name of the company, though.\n\nSome others I don't see mentioned:\n\nTopo shoes.\n\nEx officio underwear.\n\nGerber knives.\n\nPentax cameras.",
   "created_utc": 1703699543,
   "score": 9,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5g4jm",
   "message": "Kirkland.",
   "created_utc": 1703700014,
   "score": 10,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf521bz",
   "message": "JBL headphones/speakers are superior to most others as far as price is concerned.",
   "created_utc": 1703694959,
   "score": 69,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf566oz",
   "message": "Nintendo, both hardware and software is usually very good and of a high standard. \n\nSomething i've only come to realise as i've got older is how much effort they put into accessibility and online safety, things like kid friendly modes in their games to make it easier for them or parental controls etc.\n\nIn the modern world there arent many companies who you can trust with children, and i may be being naive but i'd say Nintendo are one of them.",
   "created_utc": 1703696464,
   "score": 42,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf4wmj3",
   "message": "I've never gotten a bad Timex watch.\n\nGroove Life belts are actually really good for what you're paying.",
   "created_utc": 1703692933,
   "score": 35,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5i425",
   "message": "3M They just dominate with anything they make.",
   "created_utc": 1703700718,
   "score": 66,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf58065",
   "message": "Lutron. When it comes to smart switches and dimmers, they simply cannot be beat IMO.",
   "created_utc": 1703697118,
   "score": 7,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5ggd1",
   "message": "Leatherman.",
   "created_utc": 1703700130,
   "score": 8,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5lgkk",
   "message": "Nintendo. They get over-hyped, they make wildly bad and bizarre business decisions, their super-fans are pretty obnoxious, and they release dud games from time to time. But the fact of the matter is that they've been consistently releasing absolute masterpiece evergreen banger video games for 40 years.",
   "created_utc": 1703701906,
   "score": 9,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5h7w9",
   "message": "Bombas. I just got some for Christmas. It may seem crazy to spend a premium for socks – – until you put them on.",
   "created_utc": 1703700400,
   "score": 19,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5i4tn",
   "message": "Sennheiser HD25 Headphones, had my same set since the mid 90's for DJing, thousands of hours of perfection.",
   "created_utc": 1703700726,
   "score": 6,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5qb8o",
   "message": "Pelican Cases",
   "created_utc": 1703703627,
   "score": 7,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5se6x",
   "message": "Levi’s jeans.",
   "created_utc": 1703704378,
   "score": 6,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5trhc",
   "message": "Scrub Daddy",
   "created_utc": 1703704868,
   "score": 6,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5bcfg",
   "message": "Big Green Egg. That’s a 10/10 product.\n\nKitchenAid stand mixers. Also a 10/10.\n\nConverse Chuck Taylor All Stars. 10/10.\n\nCeraVe face wash.\n\nCharmin ultra soft toilet paper.",
   "created_utc": 1703698317,
   "score": 45,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5ccab",
   "message": "This doesn’t apply to management or Chipotle as a company buuuuut that being said, having worked at multiple locations their food is truly fresh. Everything from the cheese coming in huge blocks that are hand shred, to the salsas being made each morning and even the meats being hand marinated with adobo, it is fresh. \n\nThe rest of it kinda sucks tho 😂",
   "created_utc": 1703698675,
   "score": 12,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf56zqk",
   "message": "Reebok shoes. I usually wear the soles off, but the rest of the shoe refuses to break.",
   "created_utc": 1703696756,
   "score": 19,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf5ixqu",
   "message": "Darn Tough and Vermont Flannel.  \n\nBuy American",
   "created_utc": 1703701012,
   "score": 11,
   "submission_id": "18s37v9"
  },
  {
   "comment_id": "kf61am6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18s37v9"
  }
 ]
}