{
 "submission_id": "18s6z5c",
 "title": "People who quit a job on the first day , what happened ?",
 "selftext": "",
 "created_utc": 1703700534,
 "permalink": "/r/AskReddit/comments/18s6z5c/people_who_quit_a_job_on_the_first_day_what/",
 "score": 138,
 "url": "https://www.reddit.com/r/AskReddit/comments/18s6z5c/people_who_quit_a_job_on_the_first_day_what/",
 "comments": [
  {
   "comment_id": "kf5r7gi",
   "message": "I got a job at a truck stop restaurant when i was 17. The boss introduced me to everyone and disappeared and the person who was supposed to train me wasn't there that day. Throughout the day i shadowed a few people in the kitchen and out at the buffet but didn't really know what i was doing. At the end of shift my boss came back and asked how my first day was and said he hoped i learned a lot because I'd be opening and running the buffet alone tomorrow on 1st shift. I handed him my apron and told him good luck and walked out.",
   "created_utc": 1703703948,
   "score": 211,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5u2wz",
   "message": "I had this \"friend\" from high school who found her way back into my circle, in a new city, after graduation. \n\nHer entire personality was based on working at hooters. \n\nI got so fricken tired of hearing about how above the rest of us she was, because she worked at hooters. \n\nLike she was some famous actress or has achieved some unattainable goal. \n\nSo I applied at hooters. \n\nI was hired immediately. \n\nI worked one shift, got the photo in the uniform, then quit.",
   "created_utc": 1703704981,
   "score": 228,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5qlyx",
   "message": "My first day at this chiropractic office I noticed that every single staff member had a desk with a chair that they could sit in except for me. I was being hired for their receptionist position and my desk sat in front of an opening that stood to about my chest (I'm 5'0).  \n\nCould not for the life of me understand why considering it was an office position where I would only really need to stand to use office equipment or set up the rooms for clients. The girl that was training me to be her replacement and I stood there for the entire 8 hour shift, often stagnant, while **all** other office staff s*at* at their desks. \n\nI texted the owner that evening to tell him that due to my flat feet it would be extremely difficult for me to stand, especially stagnant, for an entire 8 hour shift. Especially since the position had **zero** requirement for it. I even offered to pay for the seat. I explained that I would be alright with standing when required to, even if that meant I was moving around for most of my shift, but that having *no* opportunity to sit down seemed a little cruel.\n\nHe proceeded to go on a tirade about how that position had been a standing position for more than 20-years. Told me that sitting was bad for your back. He also told me that if I mirrored his other location he would see that I wouldn't be standing stagnant or even have the opportunity to sit down because the position requires a lot of movement. All this knowing that every other staff member, including him, were sitting for about 70% of that day. I quit on the spot.",
   "created_utc": 1703703734,
   "score": 123,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5mbpl",
   "message": "Quickly realized that the services being offered only saved folks a little on their student loan payments but added 10 years to the loan length.  I had no interest in adding to people's long-term debt burden in a way that I felt was technically legal but morally questionable at best.",
   "created_utc": 1703702211,
   "score": 71,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5nmuo",
   "message": "Expected me to do an unpaid training shift to deliver pizzas. Nah, I'm out.",
   "created_utc": 1703702679,
   "score": 60,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5sltm",
   "message": "Was told we had to get permission before using the restroom. Left that moment.",
   "created_utc": 1703704454,
   "score": 89,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5ojwt",
   "message": "I was told that the machines were mostly automated so the physical labor wasn't that bad. Then they wanted me to push a several hundred pound cart of cores all the way thru the plant and said this would have to be done every day at least once maybe twice. I had a total hip replacement so no way I am doing that. No one should be doing that. It should be done by a forklift or battery powered pallet jack. I left my first day on the production floor, third day overall.",
   "created_utc": 1703703007,
   "score": 32,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5krin",
   "message": "Expectations of job were different from when getting hired to after starting. Including 18 hour days and having to stay later based on if someone came in last minute or not. Made it too lunch called and said I would not be coming back.",
   "created_utc": 1703701659,
   "score": 28,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5zwor",
   "message": "I walked out of the UPS interview process.\n\nI was in college and my schedule changed like 3 times a year, I don't want to shit on the company but the interview was pretty straight to the point.\n\nI was told to arrive at a UPS warehouse parking lot at 2:30am. When I arrived there were like 30 people waiting as well. A woman gathered everyone around and put it bluntly:\n\nYou will not get any days off in your first year, you will absolutely work the holidays. Missing any time will definitely get you terminated, and if you get terminated you will be black listed by UPS going forward.\n\nI went back to bed.",
   "created_utc": 1703707070,
   "score": 88,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf61eqg",
   "message": "It was Walmart. Not technically my first day, since they set you up with training videos and stuff for the first 2-3 days, but my first day on the floor. \n\nThe hired me for sporting goods, which I had no background in. Told me I would be trained by others, then left me on the register alone with no clue how to do licenses or anything on the register other than check people out. Told me to page someone over the radio if I had anyone come up for something I didn’t know how to do. When someone showed up and asked for a fishing license, I radioed for help. No one responded. I asked again like 10 times, while the customer became more and more upset with me. I had explained to him it was my first day and they gave me 0 training on this. He finally got angry and left. So I walked to the back, clocked out, and told hr I wouldn’t be coming back.",
   "created_utc": 1703707614,
   "score": 73,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6eb4h",
   "message": "Buddy got me to apply for a job at his work.  I was a former lead of shipping at another job, and was told this would be a data entry, orders organizing desk type job.  They directed me to a temp service, and the temp service tested my ability to use a windows, did a typing speed test, an Excel knowledge test, etc.  I passed them with flying colors, computer usage is like breathing to me.  Another day I came in and they quizzed me on UPS and Fedex shipping software, international USPS orders.  Again, knew it all like the back of my hand.\n\nGot hired, showed up, they put me stacking paper products into boxes on pallets for 12 hours.   I asked why I went through all the computer usage tests, and got a shrug from the supervisor.  Next morning my back was killing me, but I got in the car anyway and drove towards work.  Some dude on a motorcycle cut through 3 lanes, the car beside me had to swerve into my lane to avoid him, and I had to go into the service lane.  I took the next exit and just went home.",
   "created_utc": 1703712262,
   "score": 70,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5i2vv",
   "message": "Took a sales job, was told to show up at 8am, showed up with about ten other new hires, led into a dark room, and then “let’s get ready ti rumble” plays followed by a Kirby Vacuums chant that is forever etched in my head.",
   "created_utc": 1703700706,
   "score": 54,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5phcx",
   "message": "Quickly realized it was a “door to door” sales job. Nope",
   "created_utc": 1703703330,
   "score": 22,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6qekj",
   "message": "Engineer with multiple degrees showed up for the new job they show me to the garage and expect me to start changing oil and rotating tires… still paying 6 figures but I’m so confused, it gets explained to me that it’s hazing and I can expect this to go on for 6mo to a year… toxic as hell… I did not bother showing up the next day, they didn’t bother calling",
   "created_utc": 1703716735,
   "score": 36,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf70skf",
   "message": "Candy factory. I saw a woman pass out in the line to clock out and not a single person went to help her. I ran to my trainer to tell her and she just rolled her eyes like she couldn't give two fucks.\n\nAlso, the green paint they use on the fake grass that goes into the prepackaged Easter baskets. That shit gets EVERYWHERE and the people stuffing it into the baskets were only given those super cheap, blue disposable masks to wear.\n\nI knew that place was a sneeze away from like 30 OSHA violations. Never went back after that first day.",
   "created_utc": 1703720811,
   "score": 37,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5m2qb",
   "message": "The chief of surgery discovered I had no formal training in anesthesiology, or any other medical discipline for that matter.",
   "created_utc": 1703702123,
   "score": 34,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6eujb",
   "message": "I was asked to sign off on notes and bill insurance for services that were provided months prior to me starting the job. \nInsurance fraud. \nReported it to licensing agency, quit. \nNothing happened to them.",
   "created_utc": 1703712455,
   "score": 19,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6rwft",
   "message": "The boss asked to borrow some money. lol nope.",
   "created_utc": 1703717309,
   "score": 40,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6l9ia",
   "message": "Applied for a local power-washing company, place seemed legit. For the first job, the owner takes me out to an unoccupied house in the middle of the woods, shows me how to start the washer, how to unfold the sixty foot ladder, and then bounces and says the entire house (THREE STORIES) has to be done by 5. Total orientation time: about 5 minutes. I told him I wasn’t comfortable working on ladders BY MYSELF, he said it’ll be fine and he believes in me.\n\nSo I start power washing the base of the house, and it starts raining about twenty minutes in. Eventually I do as much as I can from the ground, and I start climbing up the ladder to do the upper levels. The ground is wet, the house is built on a slope, and the recoil from the washer is pushing me back. I felt like at any moment, that ladder was going to lose its footing and I was going to fall… and nobody would be around to hear me scream, I’d be out there until the boss realized the truck wasn’t back at the end of shift.\n\n$11/hr was not worth it, I packed up the equipment, called him and told him I quit, and drove back to the office to drop it off. Total time as an employee: 4 hours.",
   "created_utc": 1703714792,
   "score": 30,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6nk10",
   "message": "Not first day, but three days in, a girl who was training me literally yelled and threw a book at me because she was annoyed by all my questions. \n\nI explicitly made it clear when I was hired that there were certain aspects of the job I'd never done before. So I needed training. And I really wanted to understand what I was doing, but there was one specific thing I was having trouble with. I apologized for asking so many questions, but apparently this wasn't good enough.\n\nThis girl made me feel so stupid that I was on the verge of tears. Worse, the boss stood there and watched her yell at me and throw the instruction manual at me, and did nothing. \n\nPretty sure I dodged a bullet.",
   "created_utc": 1703715650,
   "score": 49,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf71ei3",
   "message": "Sonic. I got yelled at for not knowing how to make some speciality drink for the morning. Literally had been there like 3 hours. I walked out",
   "created_utc": 1703721053,
   "score": 22,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5n48f",
   "message": "My brother got a job at McDonald's. First day of work, they sent him home and said he needed to be in black pants and a black shirt. They asked him to reschedule his training for another day that week. He simply never went back.",
   "created_utc": 1703702493,
   "score": 28,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5j5d2",
   "message": "Friend called and asked if I wanted to hang out at the beach, seemed more fun and I left to hang out at the beach. I was an idiot back then and it was more fired on the first day then quit.",
   "created_utc": 1703701087,
   "score": 13,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6sp6s",
   "message": "I have two:\n\nFirst day was bath and body works though technically it was my second day. The first day I'd come in to do paperwork, watch the training videos, and \"shadow\" someone to learn the secrets of working on the floor (there's one: harass every single person that comes within 5 feet of you. And if they don't come within 5 feet of your station, you approach them. Even if they've told you they don't want help). The second day was my official first day on the job and it was a closing shift.the store closed at 8 or 9. Once the doors closed to the public I asked about how long it takes to close up the store. I'd worked at Toys R Us prior, and a late day for us would be something like 1030. When the supervisor cheerfully said midnight was their norm I told her I would not be back. \n\nThe second one was Steve Madden. I was desperate and needed a job. I was told to show up at 830 am for my first shift. This was in a mall and I specifically asked how to enter as the mall didn't open until 9 or something. I was told just come in the regular way. Sure enough, that was wrong and I was nearly detained in a Macy's bc that was the only way I could see how to get in. The store blasted house music all day long and it hurt my ears. When they weren't blasting music they were heavily pressuring me to buy a pair of updated Steve Madden shoes (I was required to wear a pair of recent Steve Madden shoes to work there, and mine were \"too old\"). I tried to avoid buying a pair as I just wanted to get through the shift and just call before my next shift and say that this wasn't for me. But they hounded me all day,so I bought a cheap pair and then quit. They tried to not pay me for that lousy days pay too.",
   "created_utc": 1703717611,
   "score": 10,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf66krd",
   "message": "The manager crop dusted us, but before walking away said “Did someone fart ?” I was disturbed, as I literally heard him fart. I carried on for an hour or so then noped out. I used my go to excuse to get out of tricky situations, “ Hey I gotta grab something from my car real quick, be right back ”. Then I just got in my car and drove home lol.",
   "created_utc": 1703709493,
   "score": 28,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5qkl9",
   "message": "Got hired as a hydraulic technician. During orientation I was told everyone is expected to clean the restroom when it’s their turn. I didn’t stick around for my turn.",
   "created_utc": 1703703720,
   "score": 13,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6h257",
   "message": "Not first day quit, but really short, both were security guard jobs.\nThe first was a traveling security guard, to fill in shifts, now mind you this was in 2008 when gas was 5 dollars a gallon, I had a wonky schedule, different times different places, \nI showed up to my shift but at the wrong place ...I just fired myself,the job was too miserable to even care.\nThe second was security guard at Louie Vuton, on my feet for 10 hours, After my third day the Manager goes, \"You know there's a sheet to log your Hours.\"",
   "created_utc": 1703713255,
   "score": 3,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6w5lw",
   "message": "Worked for Avis/budget for 6 days, while I didn’t quit day one I had 5 days of computer training crap, then did actual work for one day and quit.\n\nAngry customers, confusing pos system, busy, running out of cars to rent. But it’s sales and some of the ppl there made bank.",
   "created_utc": 1703718955,
   "score": 3,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6wisc",
   "message": "It was a family style seafood restaurant and I was bussing tables. Found out that the waitresses didn’t tip out and said eff that. This was a summer job in college for the record.",
   "created_utc": 1703719105,
   "score": 6,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6za6b",
   "message": "Shit show of a living facility. Too many patients/nurse. Too much work, and covering two separate buildings. Finished observing late med pass when CNA got us. A patient aspirated (possibly because of the late meds) and was basically dead when I started CPR on them. Despite my best efforts, they did die die.. I told the manager thanks, but no thanks.",
   "created_utc": 1703720200,
   "score": 9,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf5xz2w",
   "message": "Got a job at a bank. Worked a week and hated it. Wrote them a letter saying I wasn’t able to fully\nCommit to the position considering I was a full time student. Money was good. But I don’t regret it at all. Just thank them and move on",
   "created_utc": 1703706382,
   "score": 7,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf76000",
   "message": "The one time I tried to waitress as an early 20-something. It was for a local chinese restaurant, and the lady was soo impatient with me I just left after an hour.",
   "created_utc": 1703722907,
   "score": 4,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf78e9r",
   "message": "I went in for an interview for a “sales position”. When I get there I’m interviewed for about a minute before he said “ok, you’re good to go for the next stage, go into the next room and we’ll be with you shortly.” The next room had about 10 people sitting around looking a little confused. About 20 minutes later a guy walks in dragging a vacuum cleaner. He started into his pitch about how easy it is to sell $1000 vacuum cleaners going door 2 door. But go for your relatives first since they’re easier to sell to. When he started giving suggestions like “when they open the door, throw a handful of dirt on their carpet” I just got up and noped the fuck out. About half the room filed out behind me.",
   "created_utc": 1703723878,
   "score": 23,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6pi0x",
   "message": "Junior year in college. First night cleaning the library. Old lady showing me how to do the work as I will be replacing her so she can move up to an easier position. She did such an overblown dramatic show. 4 hours later, great job, let’s lock up. “Keep the keys ma’am, I’m not coming back. “",
   "created_utc": 1703716395,
   "score": 4,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6ca2p",
   "message": "Wendy’s sucks",
   "created_utc": 1703711539,
   "score": 2,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf6l4jr",
   "message": "I was hired at vons or albertsons or whatever grocery store. I went to my first day sober which was a huge mistake but i get there and im shaking or whatever and they gave us the whole walk around showing us the whole place. They took us to the backroom to start introducing us to the company or whatever. A guy started going on about his “40 years in the grocery industry” and how proud he was of that and boom got an anxiety attack.\n\nI excused myself to the bathroom, hyperventilated for a bit then walked out",
   "created_utc": 1703714740,
   "score": 4,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7b5mg",
   "message": "I was in a program that had me work at different hotels/hotel kitchens to see where i would like to spend the practical parts of trade school. Usually 3 days per hotel. \nI went to some hotels, for some shifts i had to get up at 4:30 and go by train and walk up a hill to be there on time. I did the full 3 days in every hotel except for one: \n\nMy shift started with a tour of the hotel and the rooms. I was told how the cleaning of the rooms had to be done. I was told that if the glasses by the sink looked okay, i shouldn't change them between visitors. The rest of the tour went ok. \n \nAfterwards, i was supposed to help with plates and the coffee machine in the hotel restaurant. When the waitress didn't need my help i was supposed to stand at the bar and smile, but i wasn't allowed to talk to guests. Even if they greeted me, i wasn't supposed to greet them back. Very weird request to begin with. \nThe boss was mad at me because i never worked a professional coffee machine before and he had to explain it to me. He did so while standing in his hotel kitchen, barefoot and chewing on a paperclip. His shoes were nowhere to be seen, every time i went back to the kitchen during my shift, he was barefoot. His shoes somehow appeared on his feet when he was in the guest room. The cook was alone for a restaurant filled with ~35 people and he was struggling. I wasn't allowed to help him, even though i had all the necessary hygiene certificates to work in a kitchen and had done kitchen work at home and in the other hotels i tried. I could've easily prepped salads or peel and cut potatoes. But i wasn't allowed. \nWhen a guest ordered coffee, the waitress told me, i went into the kitchen to make the coffee but i had to give the coffee to the waitress because i had to stay behind the bar and not talk to anybody. \nOne time i went to the kitchen and the hotel owner's elderly mom was screaming at him about being wasteful because of some reason i don't remember. Of course, he was barefoot. \n\nThe waitress and i were only allowed to take away empty plates and glasses after the guests left. They had to sit infront of their empty plates and sometimes multiple empty glasses until they left the restaurant. \n\nAfter the first few guests left and i could finally do something, i grabbed the plates, glasses, napkins etc. and went back to the kitchen. I put all the food scraps and the napkins in the trash and put the dirty dishes to the side where they would be taken care of, i don't remember how or who had to wash them. This went well until the boss saw me throw a \"PERFECTLY GOOD NAPKIN!!!\" in the trash. He then berated me on how everything costs money and that i should check every napkin. If it didn't have stains, i have to put it back with the clean ones to go to the next guest. \n\nI talked to the waitress when almost all guests were gone. She told me that she is stuck with this job because she doesn't have a car and thats basically the only job she can do without having to drive a car to get there. If there was better public transport, she would immediately leave and go to a better workplace, since the boss is always like this. Not working is no option for her since she has a young kid she has to feed. She told me to leave if i didn't want to end up like her. \nShe was very kind, but obviously very broken. \n\nI called in sick for the remaining 2 days of the deal, and reported everything i typed here to the program. \nI have made it a habit to visibly stain any napkin that is handed to me in a restaurant. \n \nWorking in the hotel industry for a few days has really shown me that this is not the way for me. I now work in childcare and this was the right decision for me.",
   "created_utc": 1703724988,
   "score": 4,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf72r9z",
   "message": "Looking back I should have.",
   "created_utc": 1703721598,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf75b2a",
   "message": "It was a retail job and the owner kept his dogs in the back room.  I went back there with him for something and the dogs lunged at me and tried to bite me.  Fuck that.",
   "created_utc": 1703722630,
   "score": 9,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf77f1j",
   "message": "Job ad: “Work with pro sports teams”\n\nThe job: Selling nonsense in front of a supermarket",
   "created_utc": 1703723482,
   "score": 9,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7adf5",
   "message": "Hired at a factory job back when I was 18-19ish, it was my first “real” non-fast food job.  It was a one person per shift forklift driver position.  Was told only 2nd shift was available, but I could apply to 1st shift whenever it opened up.\n\nFirst day I found out not only was 1st shift open, but I was expected to be the one that would train whoever they hired.\n\nAnd no I couldn’t take the 1st shift opening.  They wanted an “adult” to fill 1st shift.\n\nNot sure why they were surprised when I told them I wasn’t coming back for day 2.",
   "created_utc": 1703724670,
   "score": 8,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7cre7",
   "message": "I started work as a night auditor at a popular hotel chain in my city. I went in for training, feeling quite excited to get my \"foot in the door\" in the hospitality industry. The first words out of my trainer's mouth: \"Just so you know, you're going to get robbed while on the job. The night auditor basically gets held up at gunpoint every week here. Just give them the money and call the cops afterwards. Hopefully you don't get tied up and locked in the laundry room like the last night auditor.\" She was completely serious and had a kind of exhausted tone about it. I quit during my lunch break.",
   "created_utc": 1703725642,
   "score": 14,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7d6tk",
   "message": "Lost my job during COVID and was looking for anything, as long as it paid more than unemployment was currently. I got accepted in a sales position at a local favorite furniture store. I asked how the commission worked and they told me that it was usually much faster than it was currently but commission doesn't pay out until the product is delivered and that COVID had expanded timelines to a 1-2 months, rather than a few weeks. \n\nOn my first day I was told that I had to purchase my own iPad to make sales on as the store only had 2 and they were used based on seniority. Not a deal breaker but super annoying this wasn't explained beforehand.\n\nLater, I was filling out paperwork in the break room and saw a bunch of manufacturer names written on a whiteboard with dates next to them. The closest date was 6 months out. I asked an employee what the dates meant and he said \"that's the expected date of delivery for each brand we carry\"\n\nI called my wife, we talked it through and both came to the conclusion that we couldn't afford for me to work for $10 an hour (less than my unemployment) for 6 months before seeing my first commission check. Left without saying anything and called the manager on the way home who said I was \"overreacting and would be sorry\".\n\nGot a much better job and was happy to have made the decision.",
   "created_utc": 1703725820,
   "score": 16,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7d8p5",
   "message": "Oh my god I thought I could do car sales AHAHAHA. I applied on indeed and was working nights so I was excited for the change. Got my certification and even bought a new purse! \n\nI had no idea it was cold calling, I watched training videos my first two days which I was then told I didn’t need to watch, I was then given a list and told to call at least 60 people A DAY. I had no script, and no knowledge of what I can or can’t say outside of the Do Not Call training I’d chosen to do the day before lmao. I would be given leads trying to sell people cars WE DIDNT EVEN HAVE ON DISPLAY! I was the only employee that was getting leads to sell an antique mustang…BECAUSE IT WAS SO BEYOND REPAIR, OUR OWN SERVICE DEPARTMENT WOULDNT TOUCH IT!!!! We were to work 13hr days Saturday, everyone was late to meetings, I was shamed for working thru lunch to leave early on my birthday even!\n\n I made it more than a day because I was holding out hope, but I ended up not even lasting a month lmaooooo. No shade to anyone in sales but not all dealerships are like that right?!",
   "created_utc": 1703725841,
   "score": 3,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7e1f6",
   "message": "I was working through an employment agency which allowed me to be a bit more picky. The meat packing plant where I stand on a step ladder for hours in the cold making sure the conveyer belt doesn't get jammed up with frozen chicken breasts? No thanks, new job. The warehouse with only 4 employees, none of whom I want to spend any time around? Next. \n\nFinally ended up at a food packaging factory where I was paid decent and got along well with my co-workers. Worked there a couple years.",
   "created_utc": 1703726169,
   "score": 3,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7fv73",
   "message": "Didn’t quit in the first day but within 2 weeks I left Chuck E Cheese. That place was hell and also very disgusting.",
   "created_utc": 1703726914,
   "score": 8,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7mxoi",
   "message": "It was a janitor job and the lady training me showed me how they clean. Their method of cleaning was using a toilet bowl scrubber on the toilet and then with the same cleaner and scrubber, cleaned the sinks and counters. I turned around as soon as I saw what they were doing and left.",
   "created_utc": 1703729830,
   "score": 6,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7jgmx",
   "message": "I did one shift at a coffee shop in NYC. The lady who ran the place was also the baker - there were also baristas on staff. I was in charge of the upstairs seating area, running coffees, taking people’s orders \u0026amp; bringing out their food. \n\nOn my first day one of the baristas, who had been there for a bit, remarked “why would YOU work HERE?!” after he had learned about my previous position. Ok, weird but whatever. The baristas would also give a side glance to each other when the lady in charge’s name would come up. I kinda knew what that look meant after ages of working in the restaurant industry 😂\n\nThe place was pretty busy \u0026amp; there was a lot of running up and down the stairs to fetch coffees and bring them up to the seating area… but no way to know if your coffee was ready, you just had to run down and check. That got annoying, quick. \n\nThe lady who ran the place was yelling the whole day and was sooo incredibly chaotic and disorganized during the entire shift. Running around like a chicken with her head cut off. \n\nThe kicker was she peaces out at like 3pm every day. \n\nDidn’t show up to any shifts after that.",
   "created_utc": 1703728387,
   "score": 3,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7miqb",
   "message": "I was 19, working at a gas station cash register. No training besides how to scan items and give change. 3 people stole gas from me, I let a few people charge lottery tickets (didn't know it was a seperate drawer), and multiple people gave me shit for asking for their IDs for cigarettes and alcohol. Lasted about 6hrs before I realized that job sucked...",
   "created_utc": 1703729655,
   "score": 3,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7j03h",
   "message": "Monday morning sales meeting it became fairly obvious to me that the magager was coked. Got though the meeting but by mid afternoon I had convinced myself it was a mistake to hitch my wagon to this office and I wasn't about to hang around long enough to start taking money off of them.\n\nWas a good call the office shut down a couple of months later.",
   "created_utc": 1703728201,
   "score": 2,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7zbl5",
   "message": "I was hired at a promotional marketing company with tons of experience in that arena.  I would not be nor was the office public facing.  I showed up the first day in a summer sweater turtleneck, a midcalf length skirt, and wedge sandals. I was \"counseled\" that I was unprofessional in my attire. I should be in heels, my skirt was too long, and I should be in a blouse.\n\nI was told that we were not allowed to have anything on our desks.  I mean nothing. No pens, no office supplies, no paper, nothing!\n\nI was waiting to be trained when the phone rang.  I was asked to answer it, which I did in a very professional manner.  It was the owner's wife who then hung up and called her husband to complain about me not following the \"script.\"  He then counseled me to always follow the script.  He did not appreciate me pointing out that I had not been given a script and then counseled me on my attitude.\n\nNoped right out of there and moved on to a corporate position at national company, making about five times as much.",
   "created_utc": 1703735175,
   "score": 2,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf80qnu",
   "message": "Nothin really, just felt bad. Was doin phone surveys, ended up with a list calling about bus service to an area that didnt get bus service. It was all old people hoping for a relative calling. Made me sad so I left lol",
   "created_utc": 1703735824,
   "score": 2,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf82t84",
   "message": "Super excited to start my first High School Art teacher job. Sure, it was 1/2 way through the year and the other teacher retired early but I figured she just wanted to retire. I met the principal the day before and showed her my carefully selected project ideas neatly organized in a 3 ring binder. She was very positive and encouraging. \n\nCue day one. Forty two kids in the first class and only about 9 wanted to be there. I had to stop two kids from trying to make a baby on the back table. Simple paper folding activity was too much and soon turned into them whipping paper at each other. \n\nA little set back but ready for class number 2. Thirty eight kids in this one and I don’t think anyone wanted to be there but I really couldn’t get a pulse on the group as the obese 17 year old sat in the front aggressively eating Doritos out of a party sized bag and refused to put it away, some kid was spinning on his ass in a table and another kids last name was Dick and although I knew better than to say it out loud it was not, in fact, a secret and quickly became the class chant. So there I am, joy draining from me as the ass spinner is going round and round on the desk to the chant of “dick, dick, dick” with the floating dust of Doritos wafting though the air when I realized quite suddenly that I would rather be homeless and excited stage left.",
   "created_utc": 1703736811,
   "score": 2,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7nhr3",
   "message": "I was going to work for an inventory counting company and we were practicing with the devices used to count. I was told we’d be going out to jobs in other states which was fine. But they said, if you mess up any counts since youre new, take too long, talk too much you’ll sit in the hotel for the few days we’re there and you\nWon’t get paid so don’t mess up. I never went back after training",
   "created_utc": 1703730065,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7rhuy",
   "message": "I quit an engineering management position at Wells Fargo within 6 days - they brought me on to finish a project and then sack the 12 person engineering team and transfer the project to India for maintenance. I wouldn’t have done it under normal circumstances but it was a definite no because there were 2 people there from my high school and college..",
   "created_utc": 1703731758,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7tk84",
   "message": "It was at a restaurant, and the amount of roaches and bugs I noticed in the kitchen/staff area was mortifying! \nI left after my first shift because I can’t serve food or drinks that I wouldn’t be comfortable eating myself.",
   "created_utc": 1703732641,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7tph2",
   "message": "Worked in a large Wholesale Bakery.. some new hires would leave during their rest break or lunch break and Quit ? The reason for leaving when questioned was they didn’t realize there was such laborious work still being done in this age and time ? When your making 100+ loaves of bread a minute ? You become part of the machinery and have to keep up with the Production flow… you can’t stop until the machinery stops ? When there was hiccups you would be up to your arse in sticky dough or baked hot bread…",
   "created_utc": 1703732702,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf7vy3a",
   "message": "My first job when I was 15 years old was at checkers/Rally fast food. I use to love their food and was hired and ask to start the same day after doing the interview. I went in and the space was extremely small  and dirty. Ppl didn't change their gloves between cleaning and making burgers and at the time the pay was only $7. The patties were heated up in this dirty oven and I kept burning my hands with the gloves on while touching the patties and I only got one 15 min break. I promised I would never work in fast food again. I'm 30 years old now and that place is still open Idk how they continue to-pass health food inspections but I have never ate from them since working there.",
   "created_utc": 1703733672,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf82k9r",
   "message": "My hiring boss continually told me how bad the current person doing the role was. Then this person was slated to train me.  It became very obvious as the day went on, based on what the person training me would say, that she was treated like shit and the boss knew absolutely nothing about her own business nor did she care to know.  The ick vibes were high.  I supposedly had to give 4 weeks notice, so I quit that day so I wouldn’t waste anyone’s time. I sent an email saying unfortunately it wouldn’t work out but would be happy to help them out in anyway possible for the next 4 weeks.  The boss wrote me back BLASTING ME, saying she had just told people I had been hired and how that was such a bad look for her - never once asked me why I was quitting. lol",
   "created_utc": 1703736689,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf82sir",
   "message": "My first job ever at everyone’s favorite fast food joint.\n\nSaw a girl let a fly in the ice cream machine, they tried having me take orders after 1 hour of me being there, I got to see how disgusting that place really was behind the counters, webs full of flies in the corners and shit. I left after 3 hours and never came back 💀.",
   "created_utc": 1703736801,
   "score": 1,
   "submission_id": "18s6z5c"
  },
  {
   "comment_id": "kf88lzv",
   "message": "I had to be a dishwasher (the job was ‘dishwasher’, btw)",
   "created_utc": 1703739716,
   "score": 1,
   "submission_id": "18s6z5c"
  }
 ]
}