{
 "submission_id": "18s6ii2",
 "title": "Which conspiracy theory makes you laugh?",
 "selftext": "",
 "created_utc": 1703699383,
 "permalink": "/r/AskReddit/comments/18s6ii2/which_conspiracy_theory_makes_you_laugh/",
 "score": 134,
 "url": "https://www.reddit.com/r/AskReddit/comments/18s6ii2/which_conspiracy_theory_makes_you_laugh/",
 "comments": [
  {
   "comment_id": "kf5xtoa",
   "message": "That the Disney movie frozen was only made so that if you look up “Walt Disney Frozen” it doesn’t bring up any search results about Walt Disney’s cryogenically frozen head.",
   "created_utc": 1703706328,
   "score": 129,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5myf6",
   "message": "Maybe Bigfoot *is* blurry, and that’s the reason nobody has ever taken a good photo of him?",
   "created_utc": 1703702436,
   "score": 226,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5egj5",
   "message": "It will always be flat earth, makes no sense.",
   "created_utc": 1703699425,
   "score": 130,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5vlp8",
   "message": "Chemtrails. There’s tons of pictures of cockpits taken professionally and by regular people, and yet no one has seen or shown a chemtrails button or guage, which would be on every plane.",
   "created_utc": 1703705531,
   "score": 51,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5xlma",
   "message": "The microchips inside of a vaccine conspiracy theory\n\nIts logically stupid. A microscopic nano chip that can be perfectly drawn from a vaccine vile, and passed through the tip of a needle, that has a power source that can not only last forever without charge, it has a 5g/Bluetooth chip that can Broadcast wide and far to constantly track you…\n\nIf we has that tech it would be sold widely into dozens of applications.",
   "created_utc": 1703706250,
   "score": 189,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5ga2v",
   "message": "That the moon landings were hoaxed. That, somehow...\n\n* The Soviet Union would have kept quiet about it.\n* If a major conspiracy, all the workers and companies putting the equipment together knew it would fail, but were in on it, and so told no one.\n* If a minor conspiracy, that everything was built, they just weren't sure it would work, so they faked it with a handful of people somehow. (Kubrick is usually in this one, but the moon surface he made was different from the one actually found on the moon.)\n* That there's always a reason why you can \"tell\" that photos made by astronauts on the moon were fake (though, if they went somewhere, why not just take pictures?). But the different methods of faking were contradictory. Why fake a photo one way for one picture, and another way for another picture? This is supposed to be a hallmark of a major conspiracy planning all the details?!",
   "created_utc": 1703700067,
   "score": 25,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5pf0a",
   "message": "Tupac living in Serbia",
   "created_utc": 1703703307,
   "score": 36,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5mwp0",
   "message": "That JFK Jr. isn't dead, and that he was going to make himself known, and be pro MAGA in Dallas Texas where his father was assassinated.",
   "created_utc": 1703702419,
   "score": 209,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5nkbc",
   "message": "That Pepsi and McDonald's have aborted babies in them.  Yes, let's make food out of highly illegal, limited, impossible-to-get human fetuses for no reason, only to sell them for $1.50 each.  That makes perfect sense.",
   "created_utc": 1703702653,
   "score": 158,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6d4nw",
   "message": "\"Atheists are using satellites to intercept prayers so they can't reach Jesus.\" @PastorAlexLove",
   "created_utc": 1703711843,
   "score": 68,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5x32o",
   "message": "Holographic Moon / Plasma Moon.\n\nWay too many people believe the moon is a self illuminating “luminaire”made of plasma. Also that the face of the moon\nIs the reflection of earth showing the “true” shapes of the continents.\n\nBonus is because is plasma it is impossible to land on so that confirms the moon landings are a hoax.",
   "created_utc": 1703706065,
   "score": 29,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5tb4h",
   "message": "Birds aren’t real started as a joke, and now it seems like some people believe it? That’s pretty funny to me.",
   "created_utc": 1703704707,
   "score": 120,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5emk2",
   "message": "Holocaust deniers",
   "created_utc": 1703699484,
   "score": 177,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6936t",
   "message": "Drugs in Halloween candy. Every year there are warnings, and every year I laugh. Drugs are expensive. No one is wasting money giving them to kids.",
   "created_utc": 1703710393,
   "score": 48,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5f5v0",
   "message": "The conspiracy theory that makes me laugh the most is the one that claims that the Earth is flat and that NASA is hiding the truth from us. I mean, come on, how can anyone believe that in this day and age? There is so much evidence that proves that the Earth is round, such as satellite images, gravity, seasons, time zones, etc. And what is the motive for NASA to lie about the shape of the Earth? What do they gain from that? It just makes no sense to me.\r  \n\r  \nI also find it hilarious that some flat earthers think that Antarctica is a giant ice wall that surrounds the edge of the world, and that there are guards who prevent anyone from crossing it. Like, have they ever seen a map or a globe? Antarctica is a continent, not a wall. And who are these guards? Penguins? It's just so ridiculous and absurd.",
   "created_utc": 1703699673,
   "score": 38,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5redn",
   "message": "Christians who don't believe dinosaurs existed.\n\nIf you look up \"Christians Against Dinosaurs\" on FB, the page titles are hilarious.",
   "created_utc": 1703704017,
   "score": 86,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf61fjp",
   "message": "That walkable cities are part of a government plot to turn cities into prison camps.\n\nFirst off \"Why?\", and second it's way easier to control where people drive than where they can walk. People walked from one end of the earth to the other across mountains, swamps, deserts and everything in-between. You can stop most cars from going anywhere by just shutting down gas stations and putting up roadblocks.\n\nThirdly the way we design cities right now is way easier to control people. Metro areas are split into nicely controlled segments by artificial terrain (freeways) that you can easily use control access becaus they limit overpasses and cross traffic.",
   "created_utc": 1703707622,
   "score": 45,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5uzxa",
   "message": "Kermit the Frog did 9/11.",
   "created_utc": 1703705313,
   "score": 11,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6dt7z",
   "message": "JFK wasn’t assassinated. His head just did that on its own.",
   "created_utc": 1703712085,
   "score": 7,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5mmnc",
   "message": "If by \"laugh\" you mean \"weep for humanity\", then there's a lot. My mom believes that George Soros (AKA \"The Jews\") used a space laser to start the fires in Lahaina and California to reduce the price of real estate. Or perhaps that Trump is still the *real* president running things in secret and that's why things have improved so much under Biden's administration.",
   "created_utc": 1703702317,
   "score": 55,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6a3cd",
   "message": "Reptilian overlords",
   "created_utc": 1703710755,
   "score": 13,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf62iud",
   "message": "That Lenin was a mushroom.",
   "created_utc": 1703708022,
   "score": 8,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5sd54",
   "message": "My coworker believes that there's a coldish civil war going on in the USA now between \"patriots\" and an elite cabal of globalist Jewish bankers.  Like, he believes there are actual battles being waged and the media is covering the whole thing up.",
   "created_utc": 1703704367,
   "score": 12,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6mu4o",
   "message": "Stumbling upon a conspiracy theory forum like a decade ago and finding a 100+ page post explaining that all the planes on 9/11 were actually holograms projected around cruise missiles was a work of art. Just a horde of morons arguing with an even dumber group of morons.",
   "created_utc": 1703715381,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5qiii",
   "message": "Saying the Sandy Hooks mass shooting was faked.",
   "created_utc": 1703703699,
   "score": 20,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5w3wi",
   "message": "Various female celebrities being transgender.  Interestingly, the theories never explain why this would be so detrimental, it's always \"They're trying to pull the wool over our eyes my brothers.  Emma Watson is totally a dude!!\"",
   "created_utc": 1703705715,
   "score": 19,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5mbie",
   "message": "The 2020 election being stolen.",
   "created_utc": 1703702209,
   "score": 47,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf64r3b",
   "message": "The streaks jets make in the air is chemicals and the government is poisoning us. Gives me Mr. Prepper vibes.",
   "created_utc": 1703708832,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6d0z9",
   "message": "That Taylor Swift is gay and is sending coded messages to her fans.",
   "created_utc": 1703711806,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6f8sy",
   "message": "The flat earthers",
   "created_utc": 1703712599,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6sc3y",
   "message": "My personal favourite is chemtrails.",
   "created_utc": 1703717473,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6yvip",
   "message": "That the COVID vaccine developed by a pair of immigrants in another country working together with scientists from all over the globe was apparently nothing more than an invention by the US government to try and fill us with microchips to track us or something since apparently the cell phone that all of us carry around isn't good enough at doing that already",
   "created_utc": 1703720038,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf72468",
   "message": "George bush did 9/11.\n\nI have had this exact conversation before, it was like the SpongeBob ray man meme.\n\nIf you were to drop a 40 story building onto a 60 story building, the 60 story building would collapse floor by floor, then so would the 40. \n\n“Ok”\n\nSo all we need to explain is how a single floor failed and the rest is a chain reaction.\n\n“Ok”\n\nJet fuel doesn’t melt steal beams, but heating them up will make them more maleable and not able to support as much weight. That’s why blacksmiths put iron in the forge before whacking it.\n\n“Ok”\n\nSo if the fires weakened the supports just a little bit past what they were rated to bear, the entire building would collapse in a chain reaction.\n\n“George bush did 9/11”",
   "created_utc": 1703721341,
   "score": 5,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf7579l",
   "message": "The moon landing was fake and they hired Stanley Kubrick to direct it, but he’s such a perfectionist he insisted they shoot on location.",
   "created_utc": 1703722587,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf77dgj",
   "message": "We haven’t been to the moon. Every country across the globe is in on a big lie together and they all agreed that America gets to be the country who got to the moon first.\n\nThe world can’t agree on anything let alone letting America win the space race.",
   "created_utc": 1703723463,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf79gsm",
   "message": "My pet conspiracy theory is that many white American families do indeed have Native American ancestry but DNA testing services keep a lid on it because there’s nobody more annoying than a white person who thinks they’re part Indian.",
   "created_utc": 1703724307,
   "score": 1,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5gcts",
   "message": "Lord Lucan didn't disappear or die after the murder of the  nanny, he became Freddie Mercury",
   "created_utc": 1703700095,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6cazs",
   "message": "I used to laugh at conspiracy theories until they started to hijack one of the two major parties in my country. I don't really find them to be funny anymore.",
   "created_utc": 1703711548,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6dy7a",
   "message": "Flat earth! Ha!",
   "created_utc": 1703712133,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6fv3h",
   "message": "Steve wonder [isn't blind](https://youtu.be/uRxOTXUv6LQ?si=Jt7qgLIs_xyZgLa8)",
   "created_utc": 1703712825,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6legl",
   "message": "In the 90s there was a rumor that Michael Jackson and Janet Jackson were the same person.",
   "created_utc": 1703714843,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6nxaa",
   "message": "My best friend is a conspiracy theorist who believes that Damar Hamlin died on the field in Cincinnati that night and that there is a government psyop going on that replaced him with a body double that returned to Buffalo, attended a Bills game from the suites, etc.\n\nHe also believes that Hillary Clinton had Anthony Bourdain killed because of tweets he sent about her.\n\nIt's gotten to the point where there are fewer and fewer things we can talk about and I just ignore the conspiracy stuff he forwards me or I tactfully make fun of them.",
   "created_utc": 1703715789,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6nyaq",
   "message": "Michelle Obama is a man is floating out there....",
   "created_utc": 1703715800,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6pgxl",
   "message": "This hasn't been mentioned yet but it's only kind of adjacent to conspiracy theories, but Sovereign Citizens. \n\nI'm a lawyer and these people seriously believe that there is some secret code of laws that only their friends on the internet and every single judge know about.\n\nThey have a whole spread of just insane beliefs.\n\n You don't need a driver's license because you're just traveling.\n\nIncome tax is illegal because no one is an actual person and they are taxing you as a corporation, which is why we all have Social Security numbers assigned at birth. \n\nThat if you don't agree to be under the rule of law, it doesn't apply to you, or that there is some way to exempt yourself from all civil and criminal liability if you just follow these simple steps. \n\nThe only luck I've ever had talking to these people is breaking it down to pure power politics. Okay, so you \"believe\" that these laws exist and no court has jurisdiction over you, what happens if the court disagrees? Which they fucking are going to because these laws don't exist. \n\nThe court is going to send people with guns, lots of them. They have rifles, shotguns, pistols, body armor, and, in some parts of the county, fucking tanks. Then they are going to get you and take you back to the court, where they are going to tell you that you broke the law. You can protest that you are not subject to their laws, but guess what, the people with guns and the old lady in the robe think that you are, in fact, subject to the laws of the country you live in. They are going to lock you in a place that has more guys with guns to prevent you from leaving. \n\nAt which point do you think that your argument is going to work? Is it the point where the people with guns come by your house and they just say, \"Oh, shit. He posted a notice on the courthouse door that he's not a citizen of the United States, oh well, judge was wrong?\" \n\nYour belief in this shit doesn't affect law enforcement in any way, shape, or form. They don't think it's real and they have people with guns to enforce that it's not real.\n\nSo who's going to win? You and your two buddies who have never held a weapon in defense, or the state, who again, sometimes has tanks.",
   "created_utc": 1703716383,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6prc0",
   "message": "It's no conspiracy; birds aren't real",
   "created_utc": 1703716493,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6r5b8",
   "message": "You guys know the old “Paul McCartney is dead and was replaced by an actor” conspiracy theory? Well apparently there’s a newer one making the same claim about ***AVRIL LAVIGNE***. \n\nWhat makes it so laugh-out-loud ridiculous is that it makes even less sense than the Paul McCartney one. At least that one—despite being nonsense—at least had the excuse of The Beatles being super-popular and record execs not wanting to lose a cash cow in the theory. \n\nBut Avril Lavigne—even at the height of her early-2000’s popularity—never had even a fraction of the Beatles’ cultural capital. The idea that her record company would decide to cover up her death and hire an actress to replace her—both being SERIOUS crimes, btw—just for a singer who was briefly kinda popular but never a phenomenon, is absurd. \n\nIt’d involve a whole bunch of record company executives risking serious jail time in exchange for little discernible reward. Wouldn’t it be easier for them to just move on to the next flash-in-the-pan pop singer?? \n\nNo offense to Ms. Lavigne lol, I’m a Millennial so I do have some nostalgia for her, but c’mon! She’s just not “big” enough to warrant this kind of conspiracy lol.",
   "created_utc": 1703717020,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6rlo0",
   "message": "That NASA killed Michael Jackson. \n\nMJs moonwalk became more famous than the actual moonwalk NASA performed. They hated MJ for this and they killed him.",
   "created_utc": 1703717195,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6w3ra",
   "message": "Any \"Vaccine bad\" conspiracy. Because now, everytime a celebrity (or anyone for that matter) has something happen to them, the first thing on X (twitter) is \"Oh... was that person vaccinated? I bet they got the jab/injection\"\n\nIts like suddenly all tragedies can be explained by the vaccine.",
   "created_utc": 1703718934,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6wmdx",
   "message": "The whole adrenochrome pizzagate thing. Why? cause I remember being there when the trolls were cooking it up.",
   "created_utc": 1703719146,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6xih7",
   "message": "ThEyRe tRyIng tO mAke ThE cHildReN GaY/TraNs",
   "created_utc": 1703719497,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6z3qd",
   "message": "My username.",
   "created_utc": 1703720129,
   "score": 3,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5ir9v",
   "message": "Mandela Effect. Pretty much all of them. \n\nAnd what's worrying is that, much like flat earth, it's going from \"stupid, but amusing, thought experiment\" to people fully believing it. Could it be that people are wrong and memory is notoriously inaccurate and influencable? No, must be parallel worlds with *slightly* different cartoons and brands. Couldn't just be you assuming the more common spelling of \"Johnny\" and not thinking much about it as a kid.",
   "created_utc": 1703700949,
   "score": 7,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5r1fk",
   "message": "Stevie Wonder isnt blind always cracks me up",
   "created_utc": 1703703889,
   "score": 5,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6gd8v",
   "message": "That Covid shots contained tiny microchips so Bill Gates can track you.\n\nFirst of all multiple shots came from a single vial.\n\nSecondly, y’all carry around a GPS enabled computer in your pocket. People that want to know where you are already know.\n\nThird, none of you cattle live interesting enough lives for anyone, especially Bill Gates, to want to follow your every move.",
   "created_utc": 1703713007,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5mvi6",
   "message": "The Butterscotch Hypothesis by Sir u/Sufficient-Sink-8569",
   "created_utc": 1703702407,
   "score": 4,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5icgs",
   "message": "Flat Earth.",
   "created_utc": 1703700801,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5nb9w",
   "message": "Never heard that but now I kinda believe it",
   "created_utc": 1703702563,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5qdfy",
   "message": "Flat earth. Others a are downright unfortunate, but flat earth always makes me chuckle. I love to hear about their latest shenanigans",
   "created_utc": 1703703649,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5qlh8",
   "message": "Almost all of them. Human beings like to talk and are terrible at keeping secrets.",
   "created_utc": 1703703730,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5syuu",
   "message": "There's a theory floating around that nuclear weapons are a hoax; that they simply don't exist.",
   "created_utc": 1703704583,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf5xgez",
   "message": "There was a very large recall on lettuce due to salmonella contamination a few years ago, which meant that the lettuce  that remained on the shelves was very expensive.\n\nOne of my employees was convinced it was a conspiracy between all the producers to effectively destroy the lettuce crop so that they could sell whatever was remaining at 3-4 times the normal price.   He even pointed out a few other similar examples where a crop was *apparently* destroyed by bugs, or frost, etc and prices shot up.\n\nHe never could explain how that made any sense;  all I got was the *'if I have to explain it to you, you'll never get it \u0026lt;insert eye roll\u0026gt;* .",
   "created_utc": 1703706198,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf663s0",
   "message": "Flat earth",
   "created_utc": 1703709322,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf66cm8",
   "message": "Flat Earthers",
   "created_utc": 1703709410,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf672i9",
   "message": "That the earth is flat 🤣",
   "created_utc": 1703709672,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf68815",
   "message": "Flat earth. Now let's just assume they're right. What do they expect to get out of that, and what would NASA get out of lying to us. If by some miracle and despite mountains upon mountains of evidence that it's not, what is their end game?",
   "created_utc": 1703710087,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf69na3",
   "message": "If y’all could have seen how my uncle tried to avoid the National alert from his cell phone going off and starting a microchip he believes he got from a vaccine he did not even get. “They used mosquito drones to get the people who didn’t take the jab buddy” you are a regard uncle Mike",
   "created_utc": 1703710595,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6bu78",
   "message": "Space is fake - look into it!",
   "created_utc": 1703711379,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6e8lf",
   "message": "Flat earth for sure.",
   "created_utc": 1703712237,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6hnv0",
   "message": "All of them, except the ones that are true.",
   "created_utc": 1703713471,
   "score": 2,
   "submission_id": "18s6ii2"
  },
  {
   "comment_id": "kf6hpmr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18s6ii2"
  }
 ]
}