{
 "submission_id": "18s7bmn",
 "title": "What’s going on right now that most people have no idea about?",
 "selftext": "",
 "created_utc": 1703701383,
 "permalink": "/r/AskReddit/comments/18s7bmn/whats_going_on_right_now_that_most_people_have_no/",
 "score": 233,
 "url": "https://www.reddit.com/r/AskReddit/comments/18s7bmn/whats_going_on_right_now_that_most_people_have_no/",
 "comments": [
  {
   "comment_id": "kf5xu55",
   "message": "The greater one-horned rhino population in India and Nepal is growing, as highlighted in the State of the Rhino Report, 2023, by the International Rhino Foundation\n\nThe collaboration among India, Bhutan, and Nepal, along with strict government protection and management, has led to a increase in their population over the past decade. The Greater One-Horned Rhino population, which once numbered as low as 100 in the early 1900s, has increased to more than 4,014 now.",
   "created_utc": 1703706332,
   "score": 114,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf62u37",
   "message": "There's always cool stuff happening in the science community that doesn't make it to the news but really should. Check out the goodnewsnetwork.org to see some neat things. Here are a few highlights:\n\n* a new stem cell injection that halts the progression of multiple sclerosis is in clinical trials\n\n* the California redwoods weathered the wildfires better than scientists expected and are recovering very well\n\n* the FDA approved a treatment that cures sickle cell disease\n\n* a complete stegosaurous fossil with skin still intact has been unearthed \n\n* NASA has developed technology for sending data transmissions much further than radio frequencies, and recently sent their first transmission 10 million miles away \n\n* scientists are going to start experimenting with lab-grown cooking oils, which could help curb a lot of the environmental damage caused by mass soy, corn, and palm oil farming. \n\n* scientists have created natural sponges that can soak up nanoplastics",
   "created_utc": 1703708137,
   "score": 107,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf60l5b",
   "message": "The Ocean Cleanup initiative has a new system to clean up an area the size of a football field every 5 seconds. The previous one extracted 282,787 kg of trash from the Pacific Ocean so far.\n\nThey're also working on interceptors for rivers that have collected over 840 tonnes of trash and counting.\n\nThere's a long way to go but they have lots of support and they're making amazing progress!\n\nOkay now back to the bad news 😆",
   "created_utc": 1703707316,
   "score": 67,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf64nvm",
   "message": "Lake mead water levels are 20+ feet higher than last year!",
   "created_utc": 1703708799,
   "score": 146,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5v8j2",
   "message": "We are experiencing both [child](https://blogs.worldbank.org/education/new-literacy-data-shines-spotlight-learning-crisis) and [adult literacy](https://www.proliteracy.org/wp-content/uploads/2023/09/2023-PL-AdultBasicEducation-FactSheet-2467.pdf) crises predating but exacerbated by COVID.\n\nEDIT: The people telling me in the comments that these predated COVID, as explained in my one sentence post, are proving my point.",
   "created_utc": 1703705398,
   "score": 227,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5zsm8",
   "message": "The war on water resources. It needs to be a big deal but it ain't",
   "created_utc": 1703707030,
   "score": 249,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6ly4m",
   "message": "Astronomer here! We are now putting the final touches on the [Rubin Observatory](https://en.wikipedia.org/wiki/Vera_C._Rubin_Observatory), which will see “first light” aka start looking at the sky in a year or so. It is an eight meter diameter telescope mirror that will image the ENTIRE sky every night visible where it is!\n\nIt’s hard to emphasize what a game changer this will be for astronomy. We will literally catalog all the asteroids, see millions of supernovae a year, map the Milky Way, maybe even learn about what dark matter and dark energy are… put it this way, if JWST is like boring a hole into one tiny spot on a shutter to let light through, this is gonna be like opening an entire window. \n\nCan’t wait!",
   "created_utc": 1703715046,
   "score": 26,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5yez0",
   "message": "Science is kicking Cancer's ass. Almost every cancer has had treatments and drug breakthrough's in the last decade and it keeps improving with more funding and research.",
   "created_utc": 1703706541,
   "score": 75,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6ku8e",
   "message": "The absurd amount of insider trading that takes place every time a company is bought-out",
   "created_utc": 1703714636,
   "score": 221,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6kchp",
   "message": "For those who use or are considering using DepoProvera birth control, DON'T DO IT. Those of us who were on it for years have developed osteoporosis and degenerative disc disease. Supposedly there is a BLACK BOX WARNING but patients only see the filled injection needle - we never saw the box! And doctors didn't tell us. So I am 46 year old this year with the degenerative spine of a 70+ year old woman. There is NO reversal.",
   "created_utc": 1703714453,
   "score": 225,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf69ms2",
   "message": "alex batty, a young boy  from manchester, UK, who disappeared in 2017 in spain whilst on holiday with his mother and grandfather was found alive a few weeks ago in france after he'd been walking for 4 days to escape a religious commune and being spotted by a delivery driver in toulouse. he was returned home just before christmas",
   "created_utc": 1703710590,
   "score": 180,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf67lt3",
   "message": "This is really specific.  Gunnison valley (Gunnison, Crested Butte, and Almont) Colorado is where the Gunnison river starts.  The Gunnison and the Upper Colorado river join to make the lower Colorado river, which is an extremely important source of water and power for the western states.  The Gunnison provides most of the water to the lower Colorado.  So, if we don’t get snow in the valley then Las Vegas and the farmers out west are fucked.  We’ve barely gotten any snow and there is zero in the forecast.  If something doesn’t change, y’all are going to have a rough summer down there.",
   "created_utc": 1703709867,
   "score": 252,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf65e9s",
   "message": "There's a huge amount of carbon stored in permafrost — an estimated 1,500 gigatons, or twice as much as the atmosphere contains!",
   "created_utc": 1703709065,
   "score": 169,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf670xj",
   "message": "Your child’s classroom is being completely overrun by 1 or 2 problem children and your child is hurting because of it.",
   "created_utc": 1703709656,
   "score": 116,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf65jro",
   "message": "There are a significant number of lunar landings by robotic vehicles scheduled for 2024.",
   "created_utc": 1703709120,
   "score": 1,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf7liia",
   "message": "A fox and a deer are friends in my backyard. They like to cuddle together by my shed.",
   "created_utc": 1703729239,
   "score": 238,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6ne9d",
   "message": "There’s a guy in NC browsing the tax office record of deeds to find business owners who haven’t paid their taxes in order to pay off the taxes himself and then get the deed, then extorting the owner or evicting them and selling their property, all under the protection of the law.",
   "created_utc": 1703715590,
   "score": 37,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6a283",
   "message": "There’s a third regional war being threatened, aside from Ukraine and Israel.  It’s between Venezuela and Guyana, with Venezuela threatening to invade what is essentially the western half of Guyana.\n\nThis is an old dispute, one Venezuela originally gave up pushing on decades ago, but a few years ago a shitload of oil was discovered off the coast of western Guyana, and *LO AND BEHOLD* Venezuela is suddenly feeing muscular.\n\nThe US has already sent a carrier over, sending a *not-so-subtle* message to Venezuela: “You don’t have nukes, we don’t have to suffer you gladly.”\n\nThat’ll probably be the end of it.  **Probably**.",
   "created_utc": 1703710743,
   "score": 214,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf72iey",
   "message": "The largest dam removals in history are happening RIGHT NOW restoring access that salmon havent had to their spawning grounds in over a century. The Yurok and other Northwestern tribes have put in the work for decades advocating for waterways.  And though some utility companies are real pissed about it,  Biden admin approved millions of dollars to fund the continued efforts. Salmon are a keystone species so many parts of the ecosystem rely on them so this is amazing news!   \n\n\n [https://apnews.com/article/salmon-tribes-snake-river-dam-energy-336a20cf02093fcdd725cb3047af8f29](https://apnews.com/article/salmon-tribes-snake-river-dam-energy-336a20cf02093fcdd725cb3047af8f29)",
   "created_utc": 1703721499,
   "score": 231,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5t0gk",
   "message": "Why the fuck are celebrities building shelters i think they tryna raise up the shelter prices",
   "created_utc": 1703704599,
   "score": 220,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6c3mi",
   "message": "The US healthcare system is actively collapsing. Roughly 15% of US patients **simply cannot receive care**, and that number is increasing.\n\nCOVID accelerated it, but it's been coming for a while. There are tons of causes: cost, patient location, or because of the system being overburdened.\n\n* Hospital systems are closing entire hospitals because they aren't profitable enough. This creates \"care deserts\" where patients don't have access to medical care. Certain specialties are being targeted by politics which can make it worse.\n\n* Hospitals, especially bad ones, are having huge staffing issues. Nurses are leaving bedside nursing at a high rate because patient care sucks. That creates a viscous cycle because then conditions get worse and so even more nurses leave. 35-45% of nurses quit nursing entirely within 5 years. But also MDs, CNAs, and support staff like techs, phlebotomists, therapists, etc leave for the same reason. Hospitals just aren't paying appropriately to be assaulted and shit on and get certifications and have your license be on the line when Target will pay you $2/ more an hour.\n\n* Our insurance system has raised the price of care so high that many patients choose not to seek care, or can't pursue treatment when they need it. That's a combo of for-profit insurance, providers being able to opt out of Medicare/Medicaid (because they need to be profitable to keep their doors open!), and the ever-rising cost of treatment itself (medicine, procedures, AND facilities). States who opt out of extended Medicaid are the ones who need it most, so tons more low-income patients can't afford care.\n\n* The resources we do have are being stretched to the breaking point because of better-known issues like people treating ERs as primary care. That's getting worse for the same reasons: fewer and busier providers, higher costs, worse insurance, fewer facilities.",
   "created_utc": 1703711474,
   "score": 206,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf61cuo",
   "message": "[removed]",
   "created_utc": 1703707595,
   "score": 150,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf67qnj",
   "message": "How about the total commercialization of the internet? It started as a Wild West of entertainment, news, information. Now there are daily propaganda and agendas that get consumed en masse. There are entire swathes of commercialized psychologists finding how to squeeze profit from you on almost every single app, game, streaming service, you name it. There are advanced AI being used by corps to lock you in cages of your own design. So comfortable and cozy that you’d be crazy to disconnect or complain. But why would you want to know, that you are just a slave to forces beyond comprehension as long as you are here and a slave your own compulsions. That morality has long fallen by the wayside. we don’t even see things like gore, porn, racism as particularly degenerative anymore. We just consume.",
   "created_utc": 1703709915,
   "score": 217,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf65wau",
   "message": "Over the past decade and a half, pretty much every person on Earth has been eating about 1-2 credit cards worth of plastic a year from microplastics. It's getting worse and isn't slowing down any time soon it would seem.",
   "created_utc": 1703709246,
   "score": 146,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5scce",
   "message": "We're in the middle of a great extinction event meaning species are going extinct at a rate of up to 10,000 times the normal rate. We're actually making the Earth into a monoculture which means across the Earth we're planting many of the same crops across vas areas such as the US mid-west and transforming the ecosystem into a place where generalists such as coyotes and deer thrive and specialists at certain ecosystems die off. We've currently transformed 40% of the Earth's landmass into crops and farms.\n\nEdit: About 2/3 of the farmland I had stated was farm land was actually pastureland but I wasn't trying to be misleading, it's still part of the monoculture. The US prairie is virtually non-existent and it was the home of I think like 500 grass species. It's often time the species you don't think about or didn't know existed that go extinct.",
   "created_utc": 1703704360,
   "score": 169,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6i5mp",
   "message": "In Quebec, the entire public system (teachers, nurses, healthcare, etc.) has been on strike since November 13th. Kids have been out of school for close to 5 weeks now and teachers have not gotten paid since. Our government is refusing to give higher pay and better work conditions to the backbone of our province.",
   "created_utc": 1703713653,
   "score": 147,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf67jqf",
   "message": "Can't believe I'm seeing nothing in the top 200 comments about insects disappearing.\n\nThe fact that you can go on a 45 minute drive across the town and arrive with a clean grille should be insanely alarming to E V E R Y O N E. They are the bottom of the food chain. EVERYONE relies on them.",
   "created_utc": 1703709846,
   "score": 80,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf651hh",
   "message": "Maternal death rates in the United States are *rising.* \n\nThe highest rates are among black women. The rates have essentially doubled over the last 20 years.\n\nEdited to share that there’s a lot of moving factors here. The rates are calculated from before birth to a year after birth. People are having babies later in life now which is 1 factor. The immediate factors at play are things like hemorrhage, infection, hypertension, pre-eclampsia, stroke, and cardiomyopathy. But if we consider the factors that are happening up to a year after birth, we look mostly at mental health. The contributing factors to this metal health crisis like lack of support, shit maternity/paternity leave, living far away from family, increased societal pressures, social media, etc. These mental health factors, alone, can be why America’s rates are higher vs other countries. We aren’t supporting our moms.\n\nThen there’s the contributing political factors surrounding abortions.",
   "created_utc": 1703708937,
   "score": 234,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5vs5i",
   "message": "The 8+ different genocides happening at once.",
   "created_utc": 1703705597,
   "score": 143,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6ixnn",
   "message": "Nurse Practitioners are being granted independence to practice, with online degrees and only 500 hours of clinical training. \n\nWith no RN bedside experience. \n\n...independently",
   "created_utc": 1703713936,
   "score": 184,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf62687",
   "message": "I commented this early but the 2024 Taiwan election is going to seriously dictate whether or not two super-powers clash militarily",
   "created_utc": 1703707892,
   "score": 108,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6feh8",
   "message": "We are likely very close to a vaccine for breast cancer. There are several versions now in the human trial phase that seem to be working.",
   "created_utc": 1703712656,
   "score": 195,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5n5mu",
   "message": "The snow belt is getting higher and higher each year. I live in Chicago and it was 55 degrees F out on Christmas day with no substantial snow for the foreseeable future. As a kid we would have had snow for weeks at this point already and my family up in northwest Michigan would be buried in it and none of us have any!",
   "created_utc": 1703702507,
   "score": 242,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5yiya",
   "message": "today is my 10 year anniversary with my wife.",
   "created_utc": 1703706579,
   "score": 112,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6x4y4",
   "message": "After 20 years of getting black-out drunk on an almost daily basis, I'm proud to say I'm 36 days booze free!",
   "created_utc": 1703719348,
   "score": 103,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6dla1",
   "message": "Bees aren't endangered anymore",
   "created_utc": 1703712007,
   "score": 3,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf69sxx",
   "message": "The IRS is trying to figure out the best way to catch the thousands of Americans who stole billions of dollars through the employee retention credit. So many businesses claimed the credit who didn’t deserve it. The credit created an entire industry of nefarious accounting companies who specialize is taking advantage of this credit.",
   "created_utc": 1703710652,
   "score": 59,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6d8tu",
   "message": "Neopets is making a comeback",
   "created_utc": 1703711884,
   "score": 83,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6933z",
   "message": "The US Navy (along with limited assistance from the British and French) has been shooting down dozens of Yemeni Houthi (the Iranian backed quasi government) missiles and drones aimed at neutral shipping in the Red Sea and now well out into the Indian Ocean over the past few weeks.  In mid December, USS Carney engaged more air targets than any ship since WWII.  USS Mason boarded a vessel that had been captured by Somali nationals under Yemeni guidance, rescued the crew and captured the attackers.  The USS Eisenhower Strike Group engaged over a dozen drones, ballistic missiles, and cruise missiles the day after Christmas.\n\n\n\nMeanwhile, several ships have been struck by missiles, including an oil tanker which could have led to an ecological catastrophe if the crew had not been able to stay aboard and perform damage control.  (A Norwegian-owned, Indian-crewed vessel bound from Malaysia to Italy). \n\n\nWhatever your thoughts on the Israel/Hamas conflict (and both sides will have a lot to answer for there), the Houthi's claim that their strikes have been against ships traveling to or owned by Israel has become increasingly threadbare as they indiscriminately fire on ships with zero connection to the conflict.  This is Iran stirring the pot and the US has been protecting ships and crews for which it has no responsibility in order to protect innocent sailors and the freedom of the seas.  They have been doing far more than either East Asian nations such as China (despite their base and squadron in Djibouti) or the EU to protect a shipping route that benefits them more than it does us.\n\n\nEDIT:  It's good training and proof that our defenses work reasonably well against at least some targets, but it is expensive and wearing on crews.  We really, really need more help from Europe and China here.  There was big news two weeks ago that a multi-national taskforce would be formed with the US and mostly European vessels (with token support from other nations), but that seems to have fallen apart.  It's been crickets from China, again, despite them having a naval base and squadron in the area specifically tasked for anti-piracy work.\n\n\nEDIT2:  For some related good news:  The UN has completed the unloading of the [FSO Safer](https://en.wikipedia.org/wiki/FSO_Safer) an offshore, floating oil storage vessel (basically a permanently-moored clapped-out oil tanker that takes in the output of several wells or refineries and stores it for later shipment).  This decrepit ship is moored off the coast of Yemen and has been in legal limbo for years as the various Yemeni factions have refused to guarantee the safety of anyone trying to unload it.  The ship was an ecological time bomb, which could have destroyed the ecosystem of the southern Red Sea if it had sunk, leaked, or caught fire.  \n\n\nIn a burst of surprising usefulness, the UN managed to purchase the ship and its oil, along with an empty tanker.  As of August, they have offloaded the oil.  The ship is still there and will be a mess if it isn't removed before it collapses on itself, but it's no longer the nightmare scenario that it was.",
   "created_utc": 1703710392,
   "score": 196,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf61xeh",
   "message": "\"21.6 million more people face high level of acute insecurity than in 2022\"",
   "created_utc": 1703707802,
   "score": 203,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf63iw8",
   "message": "This absolute wild story is on CNN today, so maybe some people know about it, but long story short, all those scammers that are stealing peoples life savings are actually being held captive as modern day slaves and are tortured in front of their coworkers if they don’t scam certain amounts from people. They specifically target Americans, Brits, and two countries from South America that I forget. \n\nIt was such a terrible story. They live in cheap buildings that look like hotels and spend 16 hours a day scamming people. They have profiles built for them, and they spend all day lying to people and getting them to invest in a fake crypto platform that ultimately gets shut down and their money is gone forever. **The scammers don’t get paid and are threatened with death.**\n\nOne of them that spoke out in anonymity and said when he initially denied to do the job they locked him in a cell for three days with no food or water, and he finally decided scamming was better than dying. \n\nIt might sound ludicrous to have sympathy for these people, but *some of them* -I have no idea how many of course- who steal your money, that talk to you and convince you to give away your life savings… that you curse to hell for what they’re doing to you.. they don’t see a dime of it. And as mad as you want to get at them, they’re slaves. If they don’t do what they do they will be tortured and possibly killed. \n\nEven when they called the embassy for help, they were told they got themselves into the situation and to get themselves out.",
   "created_utc": 1703708385,
   "score": 58,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf66b0j",
   "message": "Shipping volume for truckers is so low that truckers are getting laid off.",
   "created_utc": 1703709395,
   "score": 78,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6jp6g",
   "message": "Insects are humans #1 competitor for food resources and our agriculture leans heavily on temperatures dropping below freezing at least once per winter to control insect populations (whether they know it or not). But southern states are starting to see years without a freeze and insect populations are booming. Couple that with hotter summers that hurt our agriculture, and production seasons are struggling. \nETA: the other post is referring to urban insects. The information I’m bringing to you here is from a 20K person agricultural conference I just attended where the main topic was developing technologies to solve the problem of fending off the influx of insects. I didn’t make up this stuff, there is literally tens of millions dedicated to solving this problem.",
   "created_utc": 1703714216,
   "score": 79,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5xoii",
   "message": "[We have achieved nuclear fusion ](https://www.independent.co.uk/tech/nuclear-fusion-clean-energy-breakthrough-b2469839.html)",
   "created_utc": 1703706278,
   "score": 18,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf64hmm",
   "message": "Don't forget to sort by controversial",
   "created_utc": 1703708737,
   "score": 91,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf62872",
   "message": "The future is both unbearably bright and unfathomably dark, and has a pretty good chance of going either way",
   "created_utc": 1703707912,
   "score": 111,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6janr",
   "message": "We could have Mammoths by next year. This company(I forgot the name) is genetically engineering a wooly mammoth using existing Mammoth dna and that of the Asian elephant to make a hybrid that is essentially a furry Asian elephant that looks like a mammoth.",
   "created_utc": 1703714070,
   "score": 67,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6wyhw",
   "message": "I am thawing out a shrimp ring with a hairdryer in a hotel",
   "created_utc": 1703719278,
   "score": 87,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6248l",
   "message": "I think people know about this but it’s almost put under the rug especially by governments : It’s the Ethnocide of the Uyghurs",
   "created_utc": 1703707871,
   "score": 230,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6p4tg",
   "message": "There is a star that will go supernova, possibly within our life time, that is close enough to be as bright as a second moon for a couple of months. Predictions are within the next 100 years\n\nEdit: added sources and such. \n\nLast time this happened was in the 1600’s - we now call that The Crab Nebula\n\nStar: Betelgeuse\n\nConstellation: Orion \n\nSources:\n\nhttps://arxiv.org/pdf/2306.00287.pdf\n\n\u0026gt; We conclude that Betelgeuse is likely in the late stage of core carbon burning, and a good candidate for the next Galactic Type II supernova.\n\nhttps://iopscience.iop.org/article/10.3847/1538-4357/ac7853/pdf\n\n  https://youtu.be/3QgLwpuDGhI?si=i3cW4cfOTEsJWgZn",
   "created_utc": 1703716253,
   "score": 113,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf62r0q",
   "message": "The absolute horror that is Project 2025",
   "created_utc": 1703708105,
   "score": 91,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf5n2xl",
   "message": "I'm dangling on the edge of sanity",
   "created_utc": 1703702480,
   "score": 148,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf67m4y",
   "message": "Middle class is disappearing in the civilized world.",
   "created_utc": 1703709870,
   "score": 46,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6310l",
   "message": "I have a plan to do a little holiday for new years eve. All my friends already made plans in their circles, and it's been a rough year. So I booked a ticket to Berlin after seeing some artists I like will be playing. I'm gonna get out and try and shake my butt to some nice electronic music. Gonna put my sunglasses on in a club like an extra from the Matrix and will then proceed to devour a felafel in a drunken haze at 4am",
   "created_utc": 1703708207,
   "score": 85,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf665mc",
   "message": "there’s a generation of teens constantly smoking fake weed vapes with pesticides in them that turn into neurotoxins when inhaled. the most common black market brand which i’ve seen fucking everywhere atp, tested for 19 diff pesticides. i see teenagers chiefing these shits all the time like it’s nothing and reading abt the effects is scary. as someone who used to chief hella fake weed vapes i can still feel the brain damage, there’s gonna be a generation of teens with brain damage and fertility issues bc of all the fake weed they used to smoke\n\nweed is diff today too with vapes. before u can’t smoke anywhere and everywhere bc flower is stinky, u gotta roll ur shit n light it etc etc. weed vapes however are so discreet and easy to carry, but worst of all teens stay fucked up on this shit 24/7 as opposed to smokin 2-3 times a day. it’s a teenagers dream, discreet n not smelly n hit it quick n jus put it away, stay fucked up all day if u like. this is so bad for ur brain, esp w neurotoxins in the mix. i don’t wanna even know what’s gonna happen w all this shit",
   "created_utc": 1703709340,
   "score": 76,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf69ok1",
   "message": "The largest title company in America has been completely breached (First American) in a ransomware attack. No one is acting like this is as seismic as it is.",
   "created_utc": 1703710608,
   "score": 18,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6m2ti",
   "message": "Pakistan is in the process of deporting 1.7 MILLION Afghans that fled there following the Taliban takeover. Nobody seems to give a shit. The Taliban seems to be doing what it does best: oppressing those that are being returned horribly. 450,000 have been forcibly returned like this, in the dead of winter, mostly along the border areas. \n\nPeople look at what is happening in Gaza and think Genocide, but what Pakistan is doing is arguably worse.",
   "created_utc": 1703715094,
   "score": 22,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6pm3v",
   "message": "The Wagnergroup are clear cutting the old rainforests in Africa.",
   "created_utc": 1703716438,
   "score": 21,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6sn29",
   "message": "In the US they’re making original Medicare look less appealing than advantage plans, which are administered by private companies. These companies take billions of tax dollars and limit access to medical care by have small networks and difficult claims processes. \n\nThose on original Medicare are forced to by crappy part D plans to cover prescriptions. Get this, they stop paying after $4k has been spent on medications and you still have to continue paying the premiums even when they don’t pay out anymore. \n\nPut politicians traded the health of the disabled and elderly for profits.",
   "created_utc": 1703717590,
   "score": 21,
   "submission_id": "18s7bmn"
  },
  {
   "comment_id": "kf6vmv5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18s7bmn"
  }
 ]
}