{
 "submission_id": "18s9mpp",
 "title": "What's the most toxic fan base you've ever seen?",
 "selftext": "",
 "created_utc": 1703707206,
 "permalink": "/r/AskReddit/comments/18s9mpp/whats_the_most_toxic_fan_base_youve_ever_seen/",
 "score": 46,
 "url": "https://www.reddit.com/r/AskReddit/comments/18s9mpp/whats_the_most_toxic_fan_base_youve_ever_seen/",
 "comments": [
  {
   "comment_id": "kf6edih",
   "message": "All those crazy fans who support serial killers just because they think they're hot. Ted Bundy fanatics etc.",
   "created_utc": 1703712285,
   "score": 137,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6do4e",
   "message": "The Supernatural fanbase has run three of the main guest stars off social media. I know it isn't all the fans, its sad it gets to that level with anyone though.",
   "created_utc": 1703712034,
   "score": 224,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf717uu",
   "message": "The Heartstopper fandom bullied one of the main actors, who was only 18, into outing himself because they were saying he was „queerbaiting“ fans by playing a bi character while being straight after he was photographed holding hands with a girl. While the show is about a guy who was bullied in school for being gay. Not the worst considering those that were already mentioned but it was pretty disgusting to see.",
   "created_utc": 1703720980,
   "score": 202,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf7bvbb",
   "message": "Hooo boy. SO.\n\nI used to mod one of the biggest My Chemical Romance fan groups on Facebook. It had around 40,000 members at one point. \n\nIt was basically around the clock reporting of self-harm threats (and images) when the band broke up in 2013. I went to college with two of the other mods here in the USA, another was in the UK, one was in Vietnam. \n\nI have absolutely nothing against mental illness of any kind, and I understand a massive amount of people deal with it daily; it can cause people to do some things, but THAT many people in one group….it was like they were feeding off of each other and trying to outdo each other in how crazy the band breakup made them go. We were seeing pictures of words carved into arms and stuff. \n\nOne by one, we each just abandoned that group page for our own sanity.",
   "created_utc": 1703725281,
   "score": 193,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6ekm7",
   "message": "Any fan of good looking criminals. Literal petition to shorten the sentence of the kid that killed three people while he was street racing because he was \"cute\"",
   "created_utc": 1703712355,
   "score": 97,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6c2y2",
   "message": "hetalia, back in the day.",
   "created_utc": 1703711467,
   "score": 179,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf67jbb",
   "message": "kpop. someone on the internet could say “i didn’t enjoy _____’s new song, i thought it was too repetitive” and the entire comment section would just be berating them and insulting them (even making it personal??) for it. like seriously?? your idols don’t know who you are, neither do YOU actually know who they are. it’s one thing to be a fan but another to act like you’re in a cult.",
   "created_utc": 1703709842,
   "score": 122,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6y0sf",
   "message": "Either the Gaylors or the Larries\n\nThe Gaylors think that Taylor Swift is gay and is sending coded messages to her fans. She was in a relationship with Karlie Kloss and her boyfriends are PR stunts. Look what they did to John Mayer and after Taylor rereleased 1989 they hated on Harry.\n\nThe Larries think that Harry Styles and Louis Tomlinson have been married for ten years and all the girls they date are stunts. Louis kid isnt really his kid, but the son of the pretend grandparents. Even though the boy looks exactly like him. And they think that their tattoos and songs are codes. Like if Harry sings a word 28 times in a song, that is the number of Louis tattoos which is the code for a law in the UK.",
   "created_utc": 1703719702,
   "score": 96,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6e0yw",
   "message": "Andrew Tate’s cult fanbase",
   "created_utc": 1703712161,
   "score": 206,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf65o7n",
   "message": "I am a huge supernatural fan and there is a lot of toxicity in the fandom particularly among shippers. People get super bent out of shape over social justice stuff too, which has a place, but this fandom takes it too seriously and goes as far as bullying actors off twitter over dumb, harmless comments, and sending hateful shit to \"problematic shippers.\" Some fans also are also legit stalkers of the men and it's really creepy. I've read that the actors' wives remained low profile until later seasons because they legit got death threats from fans who wanted to be with the male actors or shipped the male actors together (this may be fandom lore, but I've heard about it). It's a strange community and I enjoy my place in it, but not like I once did. There are almost too many crazies for it to be fun these days.",
   "created_utc": 1703709165,
   "score": 248,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6mgtb",
   "message": "Steven Universe. Beck in 2015, there was this young girl who drew a buff character very slim, and fans began to bully her because they thought she was fat shaming (even when the artwork was never intended to be). The bullying became so bad the girl committed suicide. I kinda forgot if she recovered but it was a big deal on the Internet and went beyond the fanbase, and the creator had to talk about the situation.",
   "created_utc": 1703715242,
   "score": 68,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf67vc9",
   "message": "As an ex-furry, furries.",
   "created_utc": 1703709961,
   "score": 48,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6lqav",
   "message": "Dutch F1 fans",
   "created_utc": 1703714964,
   "score": 76,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6jl3i",
   "message": "Dreams fanbase",
   "created_utc": 1703714175,
   "score": 111,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf62i6o",
   "message": "Comfort show fandoms, they end up getting bothered by stuff that people in normal fandoms would not.  Like while Neelix might be hated here and there in the Star Trek fandom, you can openly talk about him in mostly any way you want. While with the Buffy fandom, it's a crapshoot when you talk about certain characters like Xander. Or Diane in the Bojack Horseman fandom. It's sort of ironic that comfort show fandoms end up being echo chambers more these days. \n\nSometimes it's more of the mods/admins of an online community than the actual fanbase. They are pretty arbitrary about what can be posted, even if it does not break the rules. Sometimes they are so fucking weird about what they consider \"reposts\". Or just generally making the group unpleasant to be a part of in one way or another.",
   "created_utc": 1703708015,
   "score": 87,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf62w8g",
   "message": "Voltron was so bad that people barely talk about the show now without cringing over the ship wars",
   "created_utc": 1703708159,
   "score": 44,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf70lp0",
   "message": "I’m so boggled nobody has said Barbs yet",
   "created_utc": 1703720733,
   "score": 66,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6rzmo",
   "message": "RuPauls Drag Race. Can’t believe no one said it yet. It’s totally toxic and weird and cult like.",
   "created_utc": 1703717342,
   "score": 183,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6oven",
   "message": "Star Wars, no matter what movie or show you like SW fans will say you’re not “true fans” i rarely see Star Wars content on any social media that’s positive. No one talks about the stuff they like about Star Wars but rather non stop bitch the things they hate.",
   "created_utc": 1703716151,
   "score": 150,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6dt8b",
   "message": "Overwatch.\n\nAnd the developer almost causes part of it. Sure, there's people who are just toxic because they're toxic, but the ranked game mode encourages a lot of toxicity IMO. I don't play a lot of ranked games so maybe this is commonplace, but in Overwatch, your competitive ranking increases and decreases based solely on whether you win. You can lose a hard fought game and play exceptionally on an individual basis, but it doesn't matter.\n\nWhen I used to play, our friends group would rip apart at the seams because everyone's SR would drop if we lost and so fingers would be pointed.\n\nFOr a game that collects so many different detailed statistics, it shouldn't be entirely based on winning. It just encourages people to attack teammates when you lose.",
   "created_utc": 1703712085,
   "score": 137,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6c0ty",
   "message": "Rick and Morty. Had to stop watching the show because I didn't want to even feel like I was associated with that fanbase",
   "created_utc": 1703711446,
   "score": 179,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6o14b",
   "message": "No one hates Star Wars like Star Wars fans.",
   "created_utc": 1703715830,
   "score": 56,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf677tf",
   "message": "Pretty much all the political streamer fanbases, you know who you are.",
   "created_utc": 1703709726,
   "score": 118,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6esa7",
   "message": "The Voltron Fandom. The show itself took a nosedive after a couple good seasons, but the fanbase got wild. Massive shipping wars that had people run off the internet and calling each other pedophiles; blackmailing the studio; harassing VAs; someone reportedly sent cupcakes with glass in them or something.",
   "created_utc": 1703712433,
   "score": 31,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6v16t",
   "message": "I see someone’s already mentioned Supernatural, so along with that one I’d like to add Marvel fanbois, and Star Wars fanbois. And to a lesser extent, Doctor Who fans. That only recently started though. If you don’t like Tennant’s Doctor, whoooooboy. They don’t like that a complete random stranger doesn’t like the same thing they like and get bent out of shape over it.",
   "created_utc": 1703718507,
   "score": 77,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf78n51",
   "message": "Taylor swift fans. It’s like she’s some sort of deity to them. It’s toxic and pathetic",
   "created_utc": 1703723977,
   "score": 202,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6ady4",
   "message": "MAGA",
   "created_utc": 1703710864,
   "score": 169,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6i657",
   "message": "People who use politics as a team sport mentality.\nSo pretty much everyone on Reddit.",
   "created_utc": 1703713658,
   "score": 238,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6zr4s",
   "message": "Homestuck, as someone who was at the fringes of being in that fandom, it was fucking wild hearing stories of people harassing the author, ruining conventions, and other horror stories.\n\nLike… chill.",
   "created_utc": 1703720389,
   "score": 26,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6pzun",
   "message": "Philly fans of any sport are pretty insane. They seem to love it, but man they are easy to root against.",
   "created_utc": 1703716582,
   "score": 96,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf718zy",
   "message": "Reddit fans. 85% negativity.",
   "created_utc": 1703720993,
   "score": 49,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6yw8v",
   "message": "The \"Red Pill\" fanbase. People who follow Roosh V, Andrew Tate, Fresh 'N' Fit, Justpearlythings, etc",
   "created_utc": 1703720047,
   "score": 55,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6kfqq",
   "message": "Reality TV shows like Big Brother and Love Island.",
   "created_utc": 1703714487,
   "score": 27,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf72b89",
   "message": "undertale and steven universe",
   "created_utc": 1703721418,
   "score": 19,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf7fo1v",
   "message": "Star Wars fans. And I say this as a massive Star Wars fan. That fandom can be fucking cruel.",
   "created_utc": 1703726834,
   "score": 9,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf60mnm",
   "message": "Call of Duty ha",
   "created_utc": 1703707332,
   "score": 41,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf60eh8",
   "message": "Star Wars.",
   "created_utc": 1703707250,
   "score": 128,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6x1eq",
   "message": "Fanboys of any serial killers",
   "created_utc": 1703719310,
   "score": 8,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf78wx3",
   "message": "Star Wars, Marvel, and most Anime are pretty vile. It was Harry Potter though that I had to file a police report over after several women were sending death/rape threats about my mom after I said Severus Snape was my favorite character",
   "created_utc": 1703724087,
   "score": 8,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf6ymrf",
   "message": "Beyonce…\n\nSome people will do whatever she does without any regard simply because, if she did it, it’s right.\n\nThey play her music uncensored in workplaces, twerk at work to her music, etc. and if you tell them it’s wrong, they say “but it’s Beyonce”.",
   "created_utc": 1703719943,
   "score": 29,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf67v86",
   "message": "Rockstar",
   "created_utc": 1703709960,
   "score": 14,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf71x36",
   "message": "Tesla. \n\nI once asked in their subreddit about how the line detection system works in snow, and they banned me from the sub.",
   "created_utc": 1703721260,
   "score": 6,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf7khg4",
   "message": "Wrestling. If you know, you know.",
   "created_utc": 1703728810,
   "score": 6,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf7sxij",
   "message": "League of Legends players",
   "created_utc": 1703732371,
   "score": 7,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf611pa",
   "message": "Hands down Undertale",
   "created_utc": 1703707484,
   "score": 37,
   "submission_id": "18s9mpp"
  },
  {
   "comment_id": "kf808qm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18s9mpp"
  }
 ]
}