{
 "submission_id": "18sbuwt",
 "title": "Bartenders of Reddit, what is one drink you absolutely despise making?",
 "selftext": "",
 "created_utc": 1703712851,
 "permalink": "/r/AskReddit/comments/18sbuwt/bartenders_of_reddit_what_is_one_drink_you/",
 "score": 53,
 "url": "https://www.reddit.com/r/AskReddit/comments/18sbuwt/bartenders_of_reddit_what_is_one_drink_you/",
 "comments": [
  {
   "comment_id": "kf7l3pt",
   "message": "The vodka martini is a lot like eggs at brunch, everyone likes theirs exactly the way they want it. With specifications about brands, varying levels of dirt, different words to describe that level of dirt, the confusion most patrons have about dry/extra dry/ straight up/, shaken (very cold, ice on the pond, double strained) or stirred, and the garnish situation (are they stuffed with blue cheese??) the simple order of “dirty martini” can become a minefield of questions. It’s never quick, and if it’s quick it’s never dirty enough.",
   "created_utc": 1703729067,
   "score": 117,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7ruzs",
   "message": "I don’t think any drink is too bad to make, other than virgin frozen blended drinks when you only have 1 blender 🙄. \n\nFor me it’s when you are peak rush and you have 5-10 different cocktails being ordered at the same time \u0026amp; you have to use new tools and ingredients for every one. \n\nHowever.. Bartending is a fun job at the end of the day",
   "created_utc": 1703731913,
   "score": 87,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7t79p",
   "message": "That drink you had that one time at another bar. I think it had vodka in it. Or maybe tequila. \n\nMost all popular drinks are totally fine. Lesser know drinks are a learning opportunity. More involved drinks are usually a little pricier so it makes more money. \n\nNever worked at a place with a blender though.",
   "created_utc": 1703732486,
   "score": 39,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7gf39",
   "message": "Around Valentine’s Day one year, we had a frozen layered drink. First off, a frozen drink during winter in a state that experiences winter never made sense to me. You had to make two separate drinks with separate ingredients and layer them using one blender. 🤨",
   "created_utc": 1703727142,
   "score": 140,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf82iw9",
   "message": "Long Iceland Ice Tea. The people who order them do not need another drink.",
   "created_utc": 1703736670,
   "score": 155,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf6opq6",
   "message": "Are Espresso martinis annoying to make? I always want one but never order unless it's on a specific menu.",
   "created_utc": 1703716091,
   "score": 102,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7y5ah",
   "message": "Old school bartender here. Anyone ordering a Long Island Iced Tea. They wanna get messed up.",
   "created_utc": 1703734644,
   "score": 83,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7tqyj",
   "message": "I always order the Blue Dolphin. \n\n8 shots of water over ice.",
   "created_utc": 1703732719,
   "score": 185,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7edmv",
   "message": "Bartended for a long time. My two absolute least favorite drinks to make:\n\n1. Anything that involved using the blender, especially if it was a virgin piña colada\n\n2. The “I’ll have the uhhhhh ummmmm uhhhhh, what’s the strongest/sweetest/best/your signature, etc. drink?” Followed by “oh okay I’ll take uhhhhh ummmmm…..” ad nauseam. \n\nI know that a lot of people are afraid to order certain drinks because they think that the bartender hates making it or that they’re going to get judged for what they order. The truth is, 99% of the time, I never gave a shit about what you drank. My job was to make you a drink that you’re going to enjoy. Just please have at least an idea of what you want to drink before you try to order and don’t dick me around when I’m in the weeds. \n\nAlso don’t order blended drinks 😡",
   "created_utc": 1703726309,
   "score": 43,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7rga2",
   "message": "It’s been a minute since I was a bartender but I didn’t really care. I’m going to be there until til close no matter what. I might grumble to myself but outwards, I just made your drink and moved on with my night.\n\nDrink what you like.  Experiment some. It’s all for fun and none of it matters at all in the scheme of things.",
   "created_utc": 1703731740,
   "score": 132,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7u23i",
   "message": "Mojitos and egg white sours, kills ticket times.",
   "created_utc": 1703732850,
   "score": 101,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7tz6j",
   "message": "Ramos gin fizz.   Right in the middle of a busy Sunday brunch and I have to run to the kitchen for eggs.",
   "created_utc": 1703732816,
   "score": 55,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7wt4g",
   "message": "My bartending days are long in the past but the shot-and-beer joint I worked in had an interesting crowd that would indulge in some oddball drinks when they had money.  Enter the \"Screaming Orgasm,\" as it was known locally, which resembled a Toasted Almond except it used Creme de Cacao instead of Kahlua.  It was a shot each of C de C, Amaretto and vodka, filled with half-and-half and shaken over ice in a tall glass.\n\nIt wasn't that it was all that hard to make, albeit it sticky, but more the result of people drinking them that was problematic.  Those who stopped at one were fine but, because it went down like a milkshake, many overdid it.  All that sugar and dairy, on top of whatever other cheap shit they'd been swilling earlier, led to some pretty spectacular drunks and some large, sticky puddles of yack in the bathrooms and parking lot.",
   "created_utc": 1703734050,
   "score": 47,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf6ghbz",
   "message": "Obligatory not a bartender, but in Savannah Georgia, if you really want to piss off a bartender, order some 'cannonball punch'.  \n\nIt's not that it's overly hard to make, when done the usual way, it's just that the usual way makes enough to serve 80 or so people. So getting that mix down to serve a single person, is going to take a lot more work than the bartender really will want to bother with.\n\nAlso:  Fun fact.  Cannonball Punch was created to celebrate General Washington visiting Savannah after the Revolutionary War.  Reportedly, it was so strong, that Washington is said to have lost two whole days, and suffered a hangover that lasted several days.",
   "created_utc": 1703713048,
   "score": 185,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf6hor3",
   "message": "Former bartender. Worst order someone can make: “Surprise me.” Ok, here’s your beer. Surprise. I’m busy, not really interested in playing games.",
   "created_utc": 1703713480,
   "score": 158,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7uy8b",
   "message": "1. anything frozen, fuck that blender \n\n2. What's your best drink? Surprise me, or what's your favorite? Best drink idk green tea is the most popular but I wouldn't call it the best by any means, surprise me umm I don't know you how would I know your taste and last thing I wanna do it make you something you don't like and I gotta remake your first drink drink for and comp something and likely do the dance of you don't know what you want again. My favorite is a double gin and tonic short, extra lime and I doubt you want that...\n\nHonorable mention: mojito, just bc it can be tedious to make and actually taste well while in the weeds but if I got the time to make it I don't mind at all but if the bar is packed I obviously have a strong preference to quick easy drinks.",
   "created_utc": 1703733235,
   "score": 37,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7xoaa",
   "message": "\"surprise me!\"",
   "created_utc": 1703734436,
   "score": 15,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7qbe5",
   "message": "Miami vice",
   "created_utc": 1703731258,
   "score": 12,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7niua",
   "message": "I'm surprised nobody mentioned Mojitos.",
   "created_utc": 1703730078,
   "score": 144,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf6k5lf",
   "message": "A „Randermann“ (a drink called after a regular) \n\nIt’s Escorial mixed with Jägermeister. \nIt’s disgusting",
   "created_utc": 1703714384,
   "score": 27,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf8cn0o",
   "message": "Ordering a Bloody Mary at night club style bar is annoying.",
   "created_utc": 1703741906,
   "score": 9,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7w8fa",
   "message": "I bartended in Wisconsin for a decade+ and they have a very specific way of drinking old fashioned’s (with brandy, barf). Friday nights everyone wants one with their fish fry and it was just a lot of steps and muddling. My fingers were always dyed red from the cherries. Hated it",
   "created_utc": 1703733798,
   "score": 45,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7zmcb",
   "message": "Considering there's basically only 6 cocktail recipes, a single variation of one of them isn't a big deal. My least favorite drink to make is the one you don't want.\nCocktail menus are fun and enlightening, but if you LOVE gin and HATE tequila, why are you asking if the ghost pepper infused margarita is something you'll like?\n1: How the hell am I supposed to know what you like? \nB: This isn't Golden Corral. I can't make you infinite samples. \nD: Unless you're 21 and this is your first visit to a bar, you should have a basic elementary idea of what you enjoy drinking. \n\"What's good?\" is the reason I will end up on trial for murder. Every time I tell a lost soul to order the 21 year old scotch (BECAUSE I THINK IT'S DELICIOUS) and they respond with some sort of \"eww,I don't like brown liquors\" I question my appreciation of living free and not in a federal penitentiary.",
   "created_utc": 1703735313,
   "score": 29,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7y3g8",
   "message": "Does any bartender get upset making virgin drinks?",
   "created_utc": 1703734621,
   "score": 9,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7w9c0",
   "message": "Anything frozen or any complicated shot for only a single patron. Want 10 lemon drop shots no problem, you want one? PITA.",
   "created_utc": 1703733809,
   "score": 9,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf87ls7",
   "message": "Sex On The Beach\n-people just ordered it to get a reaction",
   "created_utc": 1703739193,
   "score": 9,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7scvo",
   "message": "Screaming Viking",
   "created_utc": 1703732124,
   "score": 15,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7sast",
   "message": "Miami Vice!!! Pure evil!",
   "created_utc": 1703732099,
   "score": 16,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf81c9f",
   "message": "Fizz drinks with egg whites can be a pain in the ass, especially if you don’t normally make them and have to go down to the kitchen to get them and separate them. \n\nPeople who customize menu drinks in ways that don’t really work, if your drink comes with white rum, don’t ask for it with scotch, on top of most likely looking terrible it won’t taste good and you’ll just end up sending it back and wasting time and ingredients.",
   "created_utc": 1703736105,
   "score": 5,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf8bxef",
   "message": "Caesars.\n\nWhere my Canadians at?",
   "created_utc": 1703741509,
   "score": 7,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7x2xa",
   "message": "Any sort of frozen drink on a busy bar",
   "created_utc": 1703734172,
   "score": 4,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7xesc",
   "message": "A Spanish Coffee if I'm busy",
   "created_utc": 1703734318,
   "score": 5,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7u5lu",
   "message": "Nightclubs it’s Espresso Martini’s. \n\nMostly because they are such a fuckaround to make. As soon as you make one the entire crowd wants them, and it’s disrupts your entire bar / flow. \n\nIf I’m bartending in the US it literally costs me money on tips to make the goddam drinks because I could serve ten other groups in the time it took to make your order. \n\nAlso as soon as I’ve finished your drink. Your friend who heard you order will ask for the same thing too, and instead of making two at a time I have to make them back to back. \n\nAlso the type of person who drinks an espresso martini at a nightclub is a nightmare to deal with.\n\nFuck anyone who orders an espresso martini past 10pm. \n\nBut yeah nah not really any drink I hate making. 😉",
   "created_utc": 1703732891,
   "score": 27,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf8f3s2",
   "message": "Some bartenders seem to forget they are in the hospitality industry, which is all about providing good customer service and an experience to your guests.\n\nIt’s been several years since I tended a bar, but as I recall, when I made a customer happy, the tips would flow. When I didn’t make them happy, the tips would go, usually right out the door.\n\nIf you’re repeatedly annoyed with customers ordering something that is a little more work to prepare beyond opening a bottle or running a tap, perhaps you’re in the wrong line of work.\n\nWhen I realized customers had become the source of my frustrations, I got out of hospitality world and found something else to do.",
   "created_utc": 1703743348,
   "score": 24,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf850kt",
   "message": "Espresso martini",
   "created_utc": 1703737887,
   "score": 5,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf865ah",
   "message": "My fave drink is an aviation. Is that a pain in the ass to make???",
   "created_utc": 1703738449,
   "score": 4,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf8glze",
   "message": "Negroni.\n\nBecause of that fucking House of Dragons tiktok sound 23 year old dipshits who've never tasted anything more bitter than a cosmo want to try one.\n\nI poured 6 out in 2 weeks that had a single drink taken out of them.",
   "created_utc": 1703744271,
   "score": 4,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf8ns4w",
   "message": "“The Old Fashioned”\n\nEspecially when people don’t know what it is and then they tell you that you made them the wrong drink.\n\nAlso I’d give an honorable mention to the “Tito’s and Vodka”.",
   "created_utc": 1703749131,
   "score": 4,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7p0nn",
   "message": "Long islanders iced tea. That how you know nothing good is about to happen.",
   "created_utc": 1703730707,
   "score": 13,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf86da8",
   "message": "I LOVE drinking frozen drinks\nBut lord do I hate making them, especially if other customers are around\n\nBonus: at the bar I worked at, we didn't use the blender for them directly, we used a manual ice crusher (with a lever) before putting it in the blender.",
   "created_utc": 1703738561,
   "score": 3,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf8872q",
   "message": "Most aren't that bad, but from 2pm til close, please don't order a Bloody Mary. And 15 Vegas bombs.",
   "created_utc": 1703739498,
   "score": 3,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7ho3h",
   "message": "Anything I have to get on a ladder or counter to retrieve ingredients for is awful.",
   "created_utc": 1703727655,
   "score": 15,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7r0z7",
   "message": "I find that they hate making anything. Unless you order a beer or a rum and coke it seems like a chore.",
   "created_utc": 1703731558,
   "score": 30,
   "submission_id": "18sbuwt"
  },
  {
   "comment_id": "kf7z74s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18sbuwt"
  }
 ]
}