{
 "submission_id": "18sei0p",
 "title": "How do you manage to have active sex life in marriage after many years being together?",
 "selftext": "",
 "created_utc": 1703719523,
 "permalink": "/r/AskReddit/comments/18sei0p/how_do_you_manage_to_have_active_sex_life_in/",
 "score": 51,
 "url": "https://www.reddit.com/r/AskReddit/comments/18sei0p/how_do_you_manage_to_have_active_sex_life_in/",
 "comments": [
  {
   "comment_id": "kf7kq4r",
   "message": "It’s a two way street, but by continuing to treat your partner like the first 3 months you were dating. Comment on how hot they look, buy them “just because” gifts, make out in the car before you go into the store, pinch their ass when you walk by, etc.\n\nIt takes intentionality. My wife and I have been together 13 years and married for almost 6, and I’ll tell you that it takes work. We have to sometimes remind ourselves, and each other, that our marriage requires service. \n\nIt’s okay to go through roommate syndrome every now and then when life is busy, but when that happens, keep your eyes peeled for any opportunity to rebuild romance and intimacy.",
   "created_utc": 1703728910,
   "score": 172,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7ct6l",
   "message": "OMG my wife and have been together 29 years and I can’t keep my hands off her!",
   "created_utc": 1703725662,
   "score": 57,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf72x9q",
   "message": "You want to fuc. You ask your partner for some fuc. They consent. You fuc.",
   "created_utc": 1703721664,
   "score": 110,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf71tnq",
   "message": "It's pretty easy to have great sex with someone you love.",
   "created_utc": 1703721222,
   "score": 41,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7n7u2",
   "message": "The trick is to actually like one another and not be using each other either physically or resourcefully (to fulfil the get married and have children desire).\n\nBasically if you find someone whose motives are to find love and be with you for a long time, you’ll have sex after marriage. \n\nAfter that, it gets into the keeping things new and fresh, yet remaining respectful and present like you were in the early years of dating.",
   "created_utc": 1703729950,
   "score": 16,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7f2cr",
   "message": "Laugh and have fun with your partner/spouse. My hubby and I still have so much fun after being together over 20 years.",
   "created_utc": 1703726586,
   "score": 10,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7dl7v",
   "message": "When you are able to figure it out let me know I’ve tried everything and anything but it doesn’t feel as my s.o even cares",
   "created_utc": 1703725984,
   "score": 10,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf84fby",
   "message": "I've been living with my boyfriend for several years now. For my end i have a high libido, for his end he's good to me. I can ask and he accepts so long as he doesn't feel crappy or something similar.\n\nSo long as you two have an understanding and make sure that understanding, and your love and respect for one another, isn't lost i don't see how it could go wrong",
   "created_utc": 1703737598,
   "score": 3,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7s4na",
   "message": "Make it a priority. Schedule it if you have to. Yeah, it sounds stupid, but it works and once you get a little momentum going, it becomes easier to keep it happening regularly. If you can work from home, do it over your lunch break while the kids are at school. It doesn't have to be at night when you or your partner are just worn out from the day. \n\nIf course, if there are relationship issues, major stress, illness, depression, etc it becomes much more difficult. You have to deal with those problems and understand that investing in the relationship comes first. Sex comes after things are in a good place.\n\nMost of all, talk about sex, but not in the bedroom and not with the expectation that it leads to anything. Be honest but don't blame yourself or your partner if things aren't where you want them to be.\n\nGood luck, it's not always going to be easy but if you work at it, you can get there.",
   "created_utc": 1703732027,
   "score": 3,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7uxdi",
   "message": "It's not as simple as we both like it.  We both have hangups, hers is perceived hygiene, she feels \"dirty\" if she farted an hour ago.  Mine is our tween kids, I hear a noise and I assume they hear us.\n\nWe went through a rough spell after we fucked like rabbits for years, we finally had a real and honest conversation...we are back!  Best advice, be vulnerable, be honest.  This is your spouse, why do we hide things from each other?  Why be embarrassed about our feelings, about our desires, our needs?\n\n*Old me slaps young me and says stop being an idiot and TALK to her*",
   "created_utc": 1703733225,
   "score": 2,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf6xqeh",
   "message": "There's sex after marriage?!",
   "created_utc": 1703719586,
   "score": 3,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf6ztn0",
   "message": "By sticking my penis inside her vagina, kissing and licking multiple body parts at the same time helps too.",
   "created_utc": 1703720418,
   "score": 4,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7ugv9",
   "message": "Can’t get enough of my goddess after 20 yrs.\nBeing able to communicate your desires and needs etc is very important. Even more important is that you both want to communicate.\nPatience, respect, trust. All required. \nOur sex life is off the charts. Better than ever. We’re still discovering things about each other and finding new ways to please each other.",
   "created_utc": 1703733026,
   "score": 2,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8el3h",
   "message": "The trick is to not just love but to genuinely LIKE the person you're with. Never stopping the dating and romance, the fun and playfulness.  13 years and we'd  do it daily if it were up to me.  It's really not that hard. You have to be sexually compatible.",
   "created_utc": 1703743039,
   "score": 2,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7xvii",
   "message": "Usually trying new positions, changing who I have sex with regularly and sometimes try some groups. I guess not telling my wife is also important",
   "created_utc": 1703734525,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7t2xw",
   "message": "I like pussy. \n\nShe likes dick. \n\nProfit???",
   "created_utc": 1703732434,
   "score": 2,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7s139",
   "message": "Scheduled Outlook calendar entries.",
   "created_utc": 1703731986,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8scaa",
   "message": "By not telling your wife about it",
   "created_utc": 1703752515,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf857vu",
   "message": "By having sex.",
   "created_utc": 1703737989,
   "score": 0,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7fyry",
   "message": "Condoms",
   "created_utc": 1703726956,
   "score": 0,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7xzkq",
   "message": "You talk about it. Also you set your kids up with a movie in the basement.",
   "created_utc": 1703734575,
   "score": 0,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7zh6i",
   "message": "Just keep kinking it up",
   "created_utc": 1703735247,
   "score": 0,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8ih0m",
   "message": "treat her like a stripper",
   "created_utc": 1703745464,
   "score": 0,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8shia",
   "message": "By getting someone else to do it",
   "created_utc": 1703752620,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7fhvo",
   "message": "Don't get caught cheating",
   "created_utc": 1703726764,
   "score": 247,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7hsnd",
   "message": "We opened up our relationship.",
   "created_utc": 1703727706,
   "score": 239,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7z4kf",
   "message": "Listen to what the woman in this video is telling you. It's an hour long video. Jump to 5 minutes in. And watch the whole thing.\n\nhttps://www.youtube.com/watch?v=G28\\_VO6XeBw",
   "created_utc": 1703735086,
   "score": 255,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7jzvs",
   "message": "You cheat.",
   "created_utc": 1703728608,
   "score": 238,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf88xg2",
   "message": "My wife and I had better sex lives after having kids. We learned and did all positions. She got wilder and yummier. Tangina we even have sex while our kids are asleep beside us",
   "created_utc": 1703739883,
   "score": 246,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7wp4p",
   "message": "Remember that everyone is different. There isn't a formula for what constitutes a \"good\" sex life. Some people go for quality over quantity and that's ok.\n\nI think the most important thing is trying to find a way to be honest about your feelings/desires without either side feeling attacked. That can be hard if you don't have a partner that wants to try to understand you. \n\nOther than that try not to make sex an expectation and think of it more as a natural expression. If you spend more time really enjoying just BEING around your partner, talking to them, romancing them, the sexual expression often comes naturally.",
   "created_utc": 1703734000,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf7zie3",
   "message": "toys",
   "created_utc": 1703735263,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf85y4g",
   "message": "Just Do It",
   "created_utc": 1703738351,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8eza8",
   "message": "She's amazing, and not just physically. I want everything about my wife, I'm head over heels for her. Even just thinking about her, her looks, her compassion and loving personality, or reminiscing about our relationship just makes me want to embrace her, whether it be for sex or just closeness.\n\nI try to be that for her as well, I try to keep her on her toes for physical interaction by surprising her or talking about what turns her on.",
   "created_utc": 1703743273,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8gxna",
   "message": "31 years in and I still love and fancy her, she must feel the same.",
   "created_utc": 1703744473,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8oma0",
   "message": "Lots of great suggestions here about intentionality and deep connection fueling desire. “Mating in Captivity” by Esther Perel is a great resource. Her basic premise is that we (well, most of us…) desire  the comfort and security of a long term, committed relationship, but our brains and bodies are also designed to seek out novelty and the unknown and some risk. Sexual heat often comes from the unknown and unfamiliar. So the trick is to find ways to allow for and create novelty in a relationship when the novelty is no longer organic.",
   "created_utc": 1703749745,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8q3yw",
   "message": "Together 20 and married for 19 years.  We’ve remained very active. I’m in my late 50’s and she is 10 years younger. \n\nWe have always had an active and creative sex life. During Covid we started tracking our sexy time on a simple calendar. We average 5-6 times a week. Our bodies have changed and our interests and kinks have too. We openly communicate our physical or emotional needs with each other before we have cuddle time.  I tend to be the “innovator” which means looking at and introducing new things and fantasies, etc…",
   "created_utc": 1703750840,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8tuml",
   "message": "Musical respect, still acting the same as you did when you first met, making time for each other, still being 'lovey dovey' exploring kinks together, talking openly about sex",
   "created_utc": 1703753656,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8v22r",
   "message": "My wife and I have been together for 36 years she is an amazing woman, beautiful , smart, loving person, would not want to ever be with anyone else + she is incredibly tight and great lover.",
   "created_utc": 1703754590,
   "score": 1,
   "submission_id": "18sei0p"
  },
  {
   "comment_id": "kf8wy0j",
   "message": "Work less if you can. Find jobs that arent stressfull. Find a partner that matches your sexual energy. Dont have kids.",
   "created_utc": 1703756027,
   "score": 1,
   "submission_id": "18sei0p"
  }
 ]
}