{
 "submission_id": "18sp7x3",
 "title": "What was the lowest point in your life? How did you find motivation to keep going and are you in a better place now? What advice would you give someone who feeling very down and low right besides hanging in there?",
 "selftext": "",
 "created_utc": 1703752746,
 "permalink": "/r/AskReddit/comments/18sp7x3/what_was_the_lowest_point_in_your_life_how_did/",
 "score": 8,
 "url": "https://www.reddit.com/r/AskReddit/comments/18sp7x3/what_was_the_lowest_point_in_your_life_how_did/",
 "comments": [
  {
   "comment_id": "kf8t4ms",
   "message": "Life is full of surprises. You never know when something good will happen to you but it will eventually",
   "created_utc": 1703753111,
   "score": 1,
   "submission_id": "18sp7x3"
  },
  {
   "comment_id": "kf8tq0d",
   "message": "Life has given me many low points, but I just soldiered on even when I felt I had little reason to do so.  I wish I had more to offer you than platitudes, but the only thing I can say about that is that they became platitudes because there is some truth in them.\n\nIf you have people, reach out and talk about it.  Get it out if you can.  It's the best way to try and get your mind in a good place again.  (this is part of what I did for myself)  Also, if you feel things are getting a bit too bad, you may want to consider a professional.  A counselor might help you navigate these waters if things are getting too bad.\n\nI really hope things get better for you!",
   "created_utc": 1703753556,
   "score": 1,
   "submission_id": "18sp7x3"
  },
  {
   "comment_id": "kf8uopl",
   "message": "Ugh, lowest point? Too many to choose from. But somehow I always find the will to keep trudging through this shitstorm called life. TBH I'm not sure if I'm in a better place now, but at least it's different. My advice? Bro, just hang on by your frickin' nails and hope for the best. It may suck now but hey, who knows what'll come next!",
   "created_utc": 1703754299,
   "score": 1,
   "submission_id": "18sp7x3"
  },
  {
   "comment_id": "kf8ux4c",
   "message": "I’ve had lots of low moments but one of the worst was when my baby sister was 2 years old and was being baby sat by my biological “grandma” and ended up getting into her meth and digesting it and almost died. My mom, dad and two brothers really helped during that time and we all kinda needed each other to lean on. It truly changed our lives and we cherish my little sister more than she will ever know. My advice for someone feeling down and low would be to talk to someone or even just hang out with someone or even by yourself doing a hobby you enjoy or a craft. Find something or someone that relaxes you and take advantage of it. Sometimes life sucks and we can only do so much to make it bearable but everyone is always stronger than they think. I truly believe that.",
   "created_utc": 1703754480,
   "score": 1,
   "submission_id": "18sp7x3"
  },
  {
   "comment_id": "kf8x0ge",
   "message": "I was going to list some low points, and actually started to, but I do not really want to go down that rabbit hole. Sorry.\n\nWhat I will say is that motivation came from different places at the times that these things happened. My most recent example is that my dad is developing Alzheimer's, and he'd be lost without me because my mom isn't with us anymore. Her death was what triggered his current state, truth be told.\n\nIn terms of advice, I think that talking is about as important as it gets, be it with a professional or someone that you know personally - people would rather have someone cry on their shoulder than go to their funeral - or heck, even strangers on the Internet if needs be.\n\nSome medication can absolutely be the difference for some people and there is no shame in that. It is not for everyone but then there is no blanket answer to this. I take Sertraline and am quite fascinated by how quickly it helped me. I only take a small amount and it definitely does not mean I never have problems, but it helped very swiftly.\n\nCBT training is also genuinely helpful for some people. I found it useful and often use some of the techniques to deal with more of my 'smaller' day-to-day problems. \n\nExercise is definitely something else to use, no matter someone's fitness level. Something as simple as a gentle yoga routine or going for a walk can be enormous in changing a mood. I have had a lot of health issues this year from a physical point of view,  and I can confirm that even very light exercise is still extremely useful.\n\nFinally, hobbies are good too. I have been known to get myself through a bad spell by playing puzzles or cooking, just to distract myself.",
   "created_utc": 1703756079,
   "score": 1,
   "submission_id": "18sp7x3"
  }
 ]
}