{
 "submission_id": "18t01l4",
 "title": "What is the most disturbing thing you know ?",
 "selftext": "",
 "created_utc": 1703786162,
 "permalink": "/r/AskReddit/comments/18t01l4/what_is_the_most_disturbing_thing_you_know/",
 "score": 7,
 "url": "https://www.reddit.com/r/AskReddit/comments/18t01l4/what_is_the_most_disturbing_thing_you_know/",
 "comments": [
  {
   "comment_id": "kfamxzd",
   "message": "Myself",
   "created_utc": 1703786274,
   "score": 4,
   "submission_id": "18t01l4"
  },
  {
   "comment_id": "kfap4t9",
   "message": "Your eyes have their own immune system that your body doesn't know about, so your body would kill your eyes if it finds out about them",
   "created_utc": 1703787053,
   "score": 4,
   "submission_id": "18t01l4"
  },
  {
   "comment_id": "kfb0cnh",
   "message": "During WWII 'Pervitin' was added to the German Army's rations. What was Pervitin you ask? Chocolate Meth. Literal Meth in chocolate.\nThis was because Methamphetamines were being commercialised for increasing housewife's productivity during the time.",
   "created_utc": 1703791025,
   "score": 2,
   "submission_id": "18t01l4"
  },
  {
   "comment_id": "kfasz5y",
   "message": "Foxes have evil shaped penis so when they enter it's like an arrow and the female screams",
   "created_utc": 1703788419,
   "score": 1,
   "submission_id": "18t01l4"
  },
  {
   "comment_id": "kfavukq",
   "message": "The Oscars are fake, always have been, it’s just a marketing gimmick",
   "created_utc": 1703789428,
   "score": 1,
   "submission_id": "18t01l4"
  },
  {
   "comment_id": "kfaww3o",
   "message": "There is multiple child rapists out there that got away with no consequences",
   "created_utc": 1703789794,
   "score": 1,
   "submission_id": "18t01l4"
  },
  {
   "comment_id": "kfazons",
   "message": "Gangs get away with killing and replacing babies, or at least swapping babies. I asked my relatives to babysit. Years later I noticed the change between all the baby pictures of my son. I really looked at his face as I laid the pictures side by side. They really screwed me over. I had to buy Christmas presents for a son that isn’t mine this year. The ungrateful kid said he would rather have had money, after I bought exactly what he asked to have bought for Christmas. I hate my relatives.",
   "created_utc": 1703790790,
   "score": 1,
   "submission_id": "18t01l4"
  }
 ]
}