{
 "submission_id": "18t29fz",
 "title": "Q for 25+ adults. What is some advice you'd give to people in early 20s? Why or why not would you say if life gets lighter and more certain?",
 "selftext": "",
 "created_utc": 1703791705,
 "permalink": "/r/AskReddit/comments/18t29fz/q_for_25_adults_what_is_some_advice_youd_give_to/",
 "score": 62,
 "url": "https://www.reddit.com/r/AskReddit/comments/18t29fz/q_for_25_adults_what_is_some_advice_youd_give_to/",
 "comments": [
  {
   "comment_id": "kfb3khw",
   "message": "You have time, make mistakes",
   "created_utc": 1703792176,
   "score": 73,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb5wyp",
   "message": "If I could go back in time I would take much better care of myself. It’s awful feeling trapped in a body with many issues that cannot be undone.",
   "created_utc": 1703793020,
   "score": 43,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb779x",
   "message": "Your teenage years set you up for your 20s... your 20s will set you up for your 30s. Spend them as wisely or more wisely than you once did.",
   "created_utc": 1703793474,
   "score": 34,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbbd9c",
   "message": "No, you aren't mature for your age. They're just trying to manipulate you 95% of the time.",
   "created_utc": 1703794973,
   "score": 68,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb7i2t",
   "message": "It's okay to end friendships that don't work, you don't have to keep them up just because they've been around a long time. People grow up and grow apart and that's just part of becoming an adult. Who you were at 15 doesn't always reflect who you are at 25, and if the people in your life can't see that then it's their loss.",
   "created_utc": 1703793583,
   "score": 24,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbfbz5",
   "message": "Take care of your teeth is #1.  You only get two sets, and you've already gotten rid of one of them, don't lose the second.  Dentures suck, hard.",
   "created_utc": 1703796382,
   "score": 22,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb5fsg",
   "message": "I always tell them (to men) that life is hard, and that no one is going to come and save you. And at some point we have to stop being a child, and put away our childish things and behaviors. And that life isn’t gonna wait for you to get ready. It will just pass you by.",
   "created_utc": 1703792849,
   "score": 18,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb779i",
   "message": "Save something out of every paycheck. Even if all you can afford is $5. \n\nThere's going to come a time down the road when you're going to *need* that money. If you've got money for Starbucks or a fast-food burger, you've got money to save. \n\nIf you're in shape, come up with a routine that keeps you in shape. If you're not in shape, get in shape. It's a hell of a lot easier to do in your 20s than in your 40s. Make sure you include strength training, cardio, and flexibility. \n\nLearn to eat healthy if you're not already. A lot of health issues come from people not eating healthy. \n\nLearn how to repair stuff around your house. Youtube is a great resource, and it'll save you thousands of dollars in the long run. \n\nWhen you're starting out, get your tools cheap at Harbor Freight. If you use that tool enough for it to wear out and/or break, go buy a good-quality version. (Just not anything that is going to hold significant weight. Like jack stands.)\n\nNever loan money to those you like. Either give it to them as a gift, or not at all.  \n\nBe your own advocate; no one else is going to do it for you. Whether it's dealing with a doctor who won't believe you, a boss that is lax on raises/promotions, or fighting for government benefits you're entitled to. \n\nFinally, learn what your rights are as a worker in your state so that you know when your boss is screwing you over, and so you don't make yourself look like a fool when you demand something as a right that isn't one. (IE, you're not owed a break in a lot of states.)",
   "created_utc": 1703793474,
   "score": 30,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb2zf4",
   "message": "[removed]",
   "created_utc": 1703791966,
   "score": 14,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb4wkx",
   "message": "Keep learning",
   "created_utc": 1703792657,
   "score": 10,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb5nic",
   "message": "Everybody's life is different. My early 20s were some of the most fun years in my life and everybody needs to have a period in their life that's fun and carefree, on their own terms. If you don't quite have that yet, get there. If you've already had it and enjoyed it and are ready to have more responsibility that's fine too. \n\nThe good(?) news is that invariably your life does become more certain as you get older. This can be a blessing or a curse depending on your perspective.",
   "created_utc": 1703792927,
   "score": 8,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbk1eh",
   "message": "In no particular order: \nDon't buy things if you don't have money. You need food, shelter, water and clothes. No one cares about you. -You are NOT the center of the universe. Be kind to people.",
   "created_utc": 1703798039,
   "score": 7,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb8ter",
   "message": "Start a ROTH IRA and max it. Make it a life priority. You are living in both the most valuable decade of your life when it comes to compound interest, at the same time that you probably couldn’t care any less about it. It’s a paradox but if you just do that one thing financially your 30’s+ self will be immensely grateful.",
   "created_utc": 1703794049,
   "score": 13,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbholp",
   "message": "Stop drinking. God, all the trouble and wasted money. So many mistakes.",
   "created_utc": 1703797209,
   "score": 6,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb7fjz",
   "message": "There’s really no magic advice to give because there is not really a path that provides proportionate rewards to what you put in. I lost tons of money pursuing college and renting around in high cost, low quality housing and that is probably going to continue unless something beyond my control happens to get me out of it, and there was never a possibility for me to live any other way. All I can say is to avoid making particularly high-investment risks. Also, no one will be there for you no matter what.",
   "created_utc": 1703793557,
   "score": 5,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb7jid",
   "message": "Balance your income and spending while using credit as a buffer so that your total money goes up and any debt goes down at the end of every month.",
   "created_utc": 1703793597,
   "score": 5,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb9gkd",
   "message": "I am 25 now and the wrong person to answer this question. But honestly despite feeling like I'm struggling more than I was five years ago. I've accomplished some of my goals all the same. So I don't really feel like it gets easier as much as you'll just be surprised by how much you'll manage to do despite the fact you feel like shit.",
   "created_utc": 1703794283,
   "score": 4,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbo2l8",
   "message": "SAVE YOUR MONEY FOR THE LOVE OF GOD",
   "created_utc": 1703799462,
   "score": 5,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbe2jx",
   "message": "The most valuable thing you have is your health and time. They will run out and you will never get them back. Don't waste them.",
   "created_utc": 1703795931,
   "score": 4,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbfjvd",
   "message": "I'm 29. Get therapy now rather than waiting until everything is a big problem.\nInvest if you want to or fuck about if you want to. Be in a relationship or be single, there is no right answer to your life and you get to live it how you want to.\nEverything you think has ruined your life will be over. It will be ok. Just keep trying to be a good person and never stop trying to figure out what you actually want. Heartbreak happens, loss happens, shit doesn't always go to plan.\n\nI think life changes but there is no blueprint to say when it gets easier and harder. But if you drink less alcohol, look after your body and be vaguely financially aware then those sorts of things become less of a stressor.",
   "created_utc": 1703796460,
   "score": 4,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb2wib",
   "message": "Stay in school, study something useful, and avoid the bullshit spewed by r/antiwork. There’s a reason so many of them complain about being poor.",
   "created_utc": 1703791937,
   "score": 13,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb5yp6",
   "message": "Take more risks. Usually in your early 20s you still don't have any major accountability in your life, and can afford to make and live with most mistakes/learning experiences.",
   "created_utc": 1703793036,
   "score": 3,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb87it",
   "message": "Life gets better and more certain if you work on yourself now. Do not listen to your teachers becayse MONEY does matter and it provides a happy healthy life. Prioritize money now so you can enjoy it in your 30s. Eliminate toxic friends now and focus on your love ones. Sharpen your skills (skills that will make you $). Take care od your health and make exercising and good diet part of your life style. Tell people you love, that you love them.",
   "created_utc": 1703793834,
   "score": 3,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb8fy3",
   "message": "invest. being old sucks. being old and poor will be exponentially worse",
   "created_utc": 1703793916,
   "score": 3,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbcj3e",
   "message": "You’ll find out who your friends ARENT",
   "created_utc": 1703795388,
   "score": 3,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbtpmw",
   "message": "I am a completely different person at 26 than 21. Just saying",
   "created_utc": 1703801477,
   "score": 3,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb2e8k",
   "message": "Childhood sucks. Once it's over things are so much better.",
   "created_utc": 1703791757,
   "score": 5,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb8012",
   "message": "If you get married: never change your last name. It’s a completely nightmare to change it back.",
   "created_utc": 1703793760,
   "score": 4,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb9p20",
   "message": "No one likes you when you're 23.",
   "created_utc": 1703794371,
   "score": 5,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb92cc",
   "message": "There is absolutely \\*no\\* need to have your sh\\*t together by the time you finish your 20's.  I remember becoming more and more freaked out as the years ticked by and I still had no clue what I wanted to do, who I wanted to be with, and where my life was headed overall.  Watching friends and family start/continue to succeed at life really wreaked havoc on my self-esteem as well.\n\nBut at 28 I met my now wife.  I started my first real job at 31.  I had my first kid at 32. Now--at 41--I have a great job, a lovely family, and have gone back to school for an MBA and PMP certification.  Most of that came from trying many different things (and failing at most).  I also cut the people out of my life that weren't contributing positively to my overall mental wellbeing.  The only way I'd consider repeating my 20's is if I could bring with me the knowledge I have today.",
   "created_utc": 1703794138,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb9j88",
   "message": "You will drift away from friends as their lives and yours go in different directions. \n\nThis is natural. Don't take it to heart, it doesn't mean that they don't like you or anything like that. As isolating as it can feel at times, it is a sign that they and (hopefully) you are growing. \n\nAnd when you move into a rental - document everything. Every tiny, minor blemish from before you moved in until after you move out. Communicate with the landlords and real estate only in writing. If they say something to you in a phone call, have them email their request or thoughts to you as well.",
   "created_utc": 1703794310,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbabxr",
   "message": "Try a little harder at your job. Don’t be a “they’re only paying me for 9-5 and I’m going to put in the least amount of effort possible” employee. I’m not saying work 65 hours and get paid for 40 but show up, show some enthusiasm, and act like you care. It doesn’t THAT much extra effort to make a good impression. Build bridges now so that as the higher ups move up and on, you can also move up and make more money. Life is better when you can afford fun things!!",
   "created_utc": 1703794602,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbcl1u",
   "message": "Life definitely gets better, as long as you put in the work it takes to improve yourself and your circumstances. I’d say that not having your life figured out by your early twenties is normal and perfectly fine. Also, that what other people are doing is none of your business. Focus on you and what you want from life.",
   "created_utc": 1703795407,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbgixz",
   "message": "Enjoy being single",
   "created_utc": 1703796802,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbhfwb",
   "message": "Even though money is tight, look into your retirement savings - $30 a month goes a long way when you start young",
   "created_utc": 1703797123,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbhlol",
   "message": "I got two here that, at 25, I'm just starting to figure out myself. Advice that I ignored, that I've since learned the hard way.\n\nYou're not going to get anywhere in life if you just sit around and wait for something to happen. If you want something, you have to put it in motion. Unless you have the silver spoon in your mouth, nobody is going to do it for you.\n\nIf you must get a credit card, use it only for emergencies or only stuff that you can afford and pay it off in full every month. Credit card debt is no joke, out of control it will bury you alive. I wasted almost an entire year of my life, time I should've been hoarding money, with no savings and no extra money because I was racking up credit card debt, interest charges, and late fees just as fast as I was paying it all off. In your early-mid 20s, you're going to get bombarded with flashy credit card offers, I started getting them as soon as I turned 18, but you have to remember that credit cards are not free money, and you can very easily set yourself up for pain.",
   "created_utc": 1703797180,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfblxbl",
   "message": "You've seen how the world gets more and more fucked up by the day, and you know which way things are going, both socially, politically and economically. I know you know, because your age-group is one of the most politically involved/interested in years... so if you put off making adult-choices in life just because you're young now, you might not be able to do so later. \n\nYou know how manageable it was to buy a home just 20 years ago? well, if you think it's hard now, imagine life in the next 10-20 years.   \nSecure your future first, don't just focus on being \"living your fullest\" if it prevents you from living decent down the line.",
   "created_utc": 1703798704,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbnq7e",
   "message": "This is the time to start setting yourself up for your career.  No, I'm not saying you have to do a bunch of things you don't want to do, yes you can absolutely enjoy yourself and have fun.  \n\nBut there are ~~two~~ three things you should do.  \n\n1.  **Clean up your social media**.  Any photos that paint you in a bad light - delete em.  Untag yourself from things that make you look bad.  These \"get ready with me while I tell you a TOTALLY regrettable thing about myself\" that you guys post to Tiktok?  Listen, I hate to be a buzzkill, but you guys have got to stop doing that.   Keep social media positive, light hearted, keep it PG.   If you must get into a heated, expletive-laden political argument on social media, keep it on an anonymous reddit account.  That is what *this* app is for.  Don't do that on Instagram.  Don't post video responses to comments on TikTok with the camera pointing at your face.  Keep it anonymous and keep it on reddit.\n\n2.  **Develop Self-Management Skills**.  Think about a time when your professor gave everyone a syllabus, and people didn't read the syllabus, and then they showed some hella Pikachu Face when the thing on the syllabus, comes up.   \"Whaaa?   I didn't know about this.\"  It's in the syllabus.  \"Yeah, but...\" but it's in the syllabus.  We all saw this happen at least once.  You have no idea how common this behavior is in the workplace, and the same people who are guilty of this, think that they are fit for a remote job.  But if you want to be someone that people can rely on to work independently, or to be able to work from home, you have to  start developing some self-management skills.  When you have a question, use the tools you have to try and answer it first - whether it's Google, whether it's using a cheat sheet of some kind, whatever it is - before deferring to someone else.  When you're given a contract, or a schedule, read it.  Don't just assume that people will remind you of things, or that people forgot things just because they didn't remind you.  Make yourself the kind of person who proactively, and *assertively*, seeks information.  \n\n3.  **Stay the fuck away from anti-work, or anti-establishment, subreddits.**  Is the workplace perfect?  No.  Should you have boundaries at work and be treated fairly?  Absolutely.  Unfortunately, these subreddits are also rife with people passing around bad advice.  Those people do not have good advice, because clearly, whatever pearls of wisdom they have is not serving them, and it sure as shit will not serve YOU.  You will not learn the aforementioned self-governing skills, in antiwork.  You will not learn how to be assertive, in antiwork.  Stay the fuck away from those subreddits, and try to avoid content like it on social media platforms like Tiktok.  \n\nAlso, open a 401k and take advantage of matching.  Open a Roth IRA, and invest.  In 2024, people under the age of 55 can now save up to $7000 in a Roth IRA, per year.  I don't expect people under the age of 25 to just have $7000 saved up every year, but you should still save something.  Even if it's $100, that's better than $0.",
   "created_utc": 1703799342,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbt74j",
   "message": "Date in your own age range, and don’t settle if you have bad vibes.",
   "created_utc": 1703801292,
   "score": 2,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfb815f",
   "message": "Travel more and have adventures in your 20s.  The regrets I have are centered around living life before my body started giving up on me.  \n\nMake no mistake, I've worked on race cars, I've been to amazing places and traveled all over North America.  I still regret not doing more of that while I could.  \n\nHave more adventures.",
   "created_utc": 1703793771,
   "score": 3,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbcdv1",
   "message": "Keep learning. It’s okay to make mistakes kahit ganonpa kasakit ang exp HAHAHA goe!",
   "created_utc": 1703795337,
   "score": 0,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbdmdp",
   "message": "Here's one that will be controversial given reddit's hatred for alcohol.  Early 20s are a great time to be out late, eating crap and drinking heavy.   You can still bounce back the next day and your body can recover.  In my 30s, having 3-4 drinks is enough to be hungover despite hydrating and going to bed by 10.  At 22, I could stay out til 2AM having 6-8 and wake up the next morning at 10AM feeling fine.   By about 25, my body just couldn't do that lifestyle.",
   "created_utc": 1703795770,
   "score": 0,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfba5v2",
   "message": "from Everybody's Free to Use Sunscreen\n\n\"take care of your knees. you'll miss them when they're gone.\"",
   "created_utc": 1703794541,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbagel",
   "message": "Well the life itself is a journey. You will have experiences both good and bad so don't be afraid of taking risks. Making mistakes will lead us there are more to learn.  For the bad ones, try to take lessons from them and always look forward. Don't be dependent on anyone cause everyone will leave someday even with death or due to incompatibilty. If it's meant to be, it will be. If you have a dream or any goal, try to focus on that, don't procrastinate because of others.",
   "created_utc": 1703794647,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbakct",
   "message": "**EVERYTHING** IN MODERATION.\n\nWork hard, but live life. Save money, but don't deprive yourself of some luxury from time to time. Drink and party, but only when you deserve to celebrate stuff. Deprive yourself of excess.\n\nLearned that the hard way.",
   "created_utc": 1703794687,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbaryl",
   "message": "Have fun, adventure, and love yourself. I spent my early 20’s being very responsible. I worked every summer and holiday and weekend outside of school and saved every penny. I worked out at midnight after these shifts sometimes  so I could look good rather than socializing. I turned down trips because I had to study. Now I’m not saying go wild, but going on a weekend trip to go skiing with friends is going to be okay, going to homecoming to party one night and the sleeping in until noon is not going to ruin your life. You’re absolutely beautiful regardless of if you hit the gym every day and those that see you for you will see it, and those that don’t, don’t matter. Balance is key, but this is your time to make memories and friends and not be responsible 24/7.",
   "created_utc": 1703794763,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbbyfp",
   "message": "Early 20s are a confusing time, you're figuring out yourself, your career, relationships. Having been through the struggle, I can personally say you learn what matters to you most during this time and life doesnt get easier to be frank but you learn better ways to cope.",
   "created_utc": 1703795184,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbcs99",
   "message": "You don't have to feel lonely or sorry for yourself if you don't have friends or a girlfriend...there's a difference between being independent and self-sufficient...and alone or lonely.",
   "created_utc": 1703795478,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbe2j1",
   "message": "- You might be wrong: this one is always true about everything. If you can hold your fire for a little bit, you might learn something new that changes the situation.\n\n- Everybody you meet is fighting a war you know nothing about: be as kind as you can be. Wait to pass judgement. You never know all the facts.\n\n- Everybody you meet has something to teach and something to learn. Try to find what someone has to teach you.",
   "created_utc": 1703795930,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbft4u",
   "message": "Chill\n\nStop chasing a relationship. Stop thinking you have to choose the perfect career right off the bat. Stop thinking you have to know everything right away. Stop thinking you “should” do things a certain way.\n\nRelax. Breathe. Things take time, and you’re not going to have it figured out by the time you’re 25+. Hell, I’m 26, and I’m sure a 30 year old would say the same things to me, and then have a 35 year old tell them the same things all over again.",
   "created_utc": 1703796550,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbhfdz",
   "message": "Set aside part of your week, every week, for advancing your life goals. \n\nWant to be fit? Make time to exercise. \n\nWant to eat well on a budget? Learn to cook.\n\nWant to get into a different field? Take classes and network.\n\nWant to travel? Go before you have children.\n\nMake a plan. Implement it. And prioritize it.",
   "created_utc": 1703797118,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbj011",
   "message": "If you’re waiting for the right time to do something, it’s now.",
   "created_utc": 1703797675,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbjhzc",
   "message": "Save for retirement",
   "created_utc": 1703797848,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfblyba",
   "message": "Buy appreciable assets.",
   "created_utc": 1703798714,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbm91l",
   "message": "Stretch. Every day. Chronic muscle and joint pain will ruin your life if you don't.",
   "created_utc": 1703798821,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbni7f",
   "message": "Save money. Early and often. Don’t ever stop. Don’t get into debt. Under no circumstances.",
   "created_utc": 1703799265,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbrba5",
   "message": "* Pursue a stable career technological advances aren't likely to render obsolete.\n\n* Take care of your health, especially your teeth\n\n* Nurture your friendships and family relationships\n\n* Don't let your job define you. Pursue hobbies you find fulfilling and become part of a community that shares these interests, even if it's just via a Discord server or something\n\n* Master life skills like cooking, tidying, budgeting, and socializing early on\n\n* Never stop learning for the sheer joy of it",
   "created_utc": 1703800611,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbrgho",
   "message": "Don't take shit from anyone.",
   "created_utc": 1703800663,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbs9zo",
   "message": "Really depends on the start you got in life whether it gets easier or not, tbh. The effects of all you've experienced compound, and what you were born into determines a lot.\n\nMay the odds be in your favor.",
   "created_utc": 1703800958,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbt80d",
   "message": "If your friends are spending all your money, find better friends.",
   "created_utc": 1703801301,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbta9b",
   "message": "It’s never too late to go to school or start something you love, but there’s also no rush. Don’t feel bad for not going to college yet. If you don’t feel like you’re mentally or emotionally ready yet, you are probably right, so give it some time. Experience life at the pace that makes you most comfortable. My last bit of advice is never stop self-reflecting, it’s the best way to always improve yourself. Be the person you want to be, someone you would want to he friends with.",
   "created_utc": 1703801324,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbvnav",
   "message": "If you see red flags avoid it, it doesn't get better. Works for relationships, friendship family member. People don't magically get better. If they can be an asshole early in your relationship with them they will only be bigger asshole later when they are more comfortable. People you meet first time are on their best behaviour.",
   "created_utc": 1703802175,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbvzfn",
   "message": "Start maxing out your Roth IRA every year",
   "created_utc": 1703802299,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbxawp",
   "message": "Learn to cook.  It will save you soooo much money.",
   "created_utc": 1703802789,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbxbeh",
   "message": "Take care of your health.",
   "created_utc": 1703802795,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfbxgta",
   "message": "if you haven't already, go down your friend list and ditch the ones that you don't really like. regardless of how they became your friends ask yourself: is there a net positive from being friends with this person? \n\nother than that, eat right and be kind to your parents.",
   "created_utc": 1703802852,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc05b4",
   "message": "Don't get so hung up on dating and relationships. Focus on yourself and finding a career you enjoy, the rest will happen when it needs to happen. I have a good friend who is almost 20 and I often tell her that the guys she meets now are probably not going to be around forever and she should really focus on herself and her education. If I could go back in time and tell myself this stuff at 20, I would have saved myself a lot of heartbreak and wouldn't have been in dead end jobs that made me miserable.",
   "created_utc": 1703803869,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc0m78",
   "message": "Don't use alcohol as a coping mechanism.",
   "created_utc": 1703804046,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc0nln",
   "message": "Take time and effort to spend time with your good friends and try to take trips with them. You get more tired, life gets busier, you get more expenses the older you get, so take the time in your 20s to do things that would be difficult/impossible in your 30s or later in life. Life changes the older you get, so make sure to do the fun things you’re able to do, when you’re able to do them.",
   "created_utc": 1703804062,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc0yyw",
   "message": "If you can afford it, live somewhere fun when you're young. I spent most of my 20s in boring suburbs and moved to a walkable city in my late 20s and loved it! Now that I'm mid 30s with a toddler I kind of want to go back to the burbs though 😂",
   "created_utc": 1703804182,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc2s92",
   "message": "I'd say invest most of your salary and refrain from \"living life\" by spending. Time is money and money is time. But money can become money, and quite a lot when most of your life is still ahead of you, because of a thing called compound interest. By midnight the day is over, and that's a day you'll never get back, but you can turn money into more money, which you can later turn into more time to do things that matter the most to you.\n\nPeople say money don't buy happiness, but it does give you security and time, and it's much easier to be happy when you have thos.",
   "created_utc": 1703804879,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc2ufn",
   "message": "Best advice I ever got...\n\"You only go through this life ONCE. So don't live your life in such a way that, at the end, you say to yourself... \"Huh, that was a good opportunity I missed out on...\"   \n...\nIf your friends suggest 'let's go do Thing!' ...   \nDo it.    \nIf it sounds dumb, or painful,  or Embarrassing... BUT it would make for a funny story, go do it.",
   "created_utc": 1703804902,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc3b0c",
   "message": "Start building your credit and saving for the future now",
   "created_utc": 1703805082,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc3fpa",
   "message": "invest into ira spy. get to 100k asap. the earlier the better.\n\nParent's arent always right,   make sure your living your dream, not theres.\n\nmake sure your living your life, not someone else's.",
   "created_utc": 1703805134,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc4hjs",
   "message": "Don't bother.",
   "created_utc": 1703805549,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc6s24",
   "message": "Try to be the reason someone succeeds, and not the reason someone quits.\n\nThink about all the stories people have where they say “if it weren’t for them, I wouldn’t be where I am now.”  Be that person.  Don’t be the person that puts someone off of a hobby, or a job, or a sport.\n\nYou might be the beginner at whatever it is you’re doing now, but one day, you’re gonna be a veteran.  When you see someone struggling, help them out.  Give them some pointers.  You don’t want to be the person who sees someone who is struggling, and resorts to gossip.",
   "created_utc": 1703806460,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc7e73",
   "message": "Early 20’s go by quick.\n\nEnjoy them while you can, no need to be all serious.",
   "created_utc": 1703806707,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc85q6",
   "message": "Take your 20s to figure out what you really want out of life.",
   "created_utc": 1703807011,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc86ya",
   "message": "Take your 20s to figure out what you really want out of life.",
   "created_utc": 1703807025,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc8aos",
   "message": "You can stress your life out really quickly with bad financial decisions. Watch Ramit Sethi, read The Psychology of Money, etc. So that you learn financial literacy early on. Start saving. And when you can start investing. Stay away from the credit cards, or if you do get them, remember that they are only meant to churn points and give you rewards and that paying them off as soon as you use them is the only smart way to use them. You will save yourself a lot of grief if you don’t get yourself into a financial hole that you have to work 3x as hard to get yourself out of.",
   "created_utc": 1703807066,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfc9fb4",
   "message": "Never believe a girl that tells you 'they cant get pregnant'... \"Life, uh, finds a way\"\n\nTo piggyback on that, get a vasectomy as soon as you can. Planned Parenthood offers them for $500 ish, sliding scale on ability. If you think THAT is expensive, try having a kid. And if you want kids in the future, they are reversible. And then it will be a conscious, planned decision since you have to schedule and pay for the surgery.\n\nHaving a kid young when you didnt want to will bring all your plans and ideas for your life to a grinding halt.",
   "created_utc": 1703807520,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcaw1n",
   "message": "You're just in your twenties. Don't take yourself so seriously and try enjoy yourself. You've got a lot to learn, but also a lot to enjoy.",
   "created_utc": 1703808113,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcaxlu",
   "message": "Don’t do drugs. It really is dangerous and dumb and you will waste so much time being around a bunch of losers or a-holes. Surround yourself with young adults who are all about making MONEY. 💵",
   "created_utc": 1703808132,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcb5a8",
   "message": "25 M. My advice to those younger than me is go out and have fun. Don't let money restrict you. Yes it's okay to save and by all means do that but going out with friends for dinner once a week is not gonna put you behind in life. Hell, taking a trip isn't going to put you behind either. If you get the chance to do some traveling do it. Expand your horizons and open your eyes to the world around you. You never know, you may find what you're looking for. Your late teens and 20's are the years you're supposed to go out and discover yourself and start living your life. There's no rush to buy that house or get married or whatever else is seen as a major accomplishment",
   "created_utc": 1703808219,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcg0zl",
   "message": "Invest in stocks - you can literally start from $25 a month via Direct Stock Purchase Plans.\n\nI started in my late 20s and continued because I was just lazy and after 10 years I'm getting basically the same amount ($300 annually) as I'm investing.",
   "created_utc": 1703810186,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcgzxk",
   "message": "Take care of your body. It's the only one you have, and it's easier to look after it now than it is to try to fix any damage done now when you're older.",
   "created_utc": 1703810579,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcjarl",
   "message": "Exercise and diet",
   "created_utc": 1703811514,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcjse1",
   "message": "Don't hang around people who give off bad vibes or you feel give you a bad feeling inside. Especially if they are drinking, doing drugs, and making you feel uncomfortable. If U feel like you don't want to be around them, leave. Don't stay. U will end up unwell. Source me",
   "created_utc": 1703811715,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfckps8",
   "message": "Save if you can. Don't immediately leave home unless you're unhappy. You can save a fortune staying with parents for a bit. \n\nDon't be afraid to speak your mind. I know a lot of people who are afraid to speak about things because they'll be called some type of phobic. As you get older you give less of a crap to listening to what amounts to bullies.",
   "created_utc": 1703812092,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcltnq",
   "message": "Save money if you can.  Even if it’s a hundred dollars a month, you will be happy to have at least 10,000 dollars in the bank in your mid 30’s.\n\nIf you want to do something, this is the age to try really hard at it.",
   "created_utc": 1703812548,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcltym",
   "message": "It really sucks to get yourself established as an adult. Set the expectation with yourself that its going to be hard to buy home or even a not-shitty car. I wouldnt advocate saving every penny or spending it all. If it’s possible for you, strike a balance of having fun/ saving for your future.",
   "created_utc": 1703812551,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcmxss",
   "message": "Live your life and don't worry about regrets. You learn by making mistakes.  Also, don't feel like you need the perfect job/house/spouse/vehicle right now. Things take time.",
   "created_utc": 1703812998,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcswso",
   "message": "You don’t have to be a day trader or have a ton of cash to get wealthy. \n\nLearn how to trade/ buy and sell for a profit start with small collectibles or anything that you can afford, use the money to invest in bigger and bigger things to buy and sell over time. \n\nI started trading Pokemon cards in middle school, graduated to cars in high school, then bought a foreclosed house in 08 for Pennie’s when I was in college. I was able to time the market and my wife and I have a great standard of living that we would not be able to have at this point in our lives.",
   "created_utc": 1703815402,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcuvq4",
   "message": "The older you get, the more likely you are to get respect.",
   "created_utc": 1703816211,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcy071",
   "message": "Hit the gym, plan ahead, and don't waste time with useless people.",
   "created_utc": 1703817498,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcybee",
   "message": "Dont rush.  Plenty of time to adult in the future, enjoy being young.  Dont be dumb about it but you dont need to get married right now, you dont have to have kids right now, you dont have to have the perfect career right now, you dont have to buy a house right now, you dont have to settle down right now.  There is plenty of time in the future to do those things.  But you likely have more freedom and less obligations now than you will EVER have in the future so take advantage of that.  I wish more people really enjoyed their 20s.  You are on your own, have freedom, have limited obligations; take advantage!  Go on trips, experience things, meet new people, learn new things.",
   "created_utc": 1703817627,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfcz9rw",
   "message": "Don’t drink so much",
   "created_utc": 1703818018,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfd0oea",
   "message": "If you're in college - work hard and get good grades, while also seeking out prestigious internships for the career you want. The sooner you invest in your career and start making the right kinds of connections, the better.",
   "created_utc": 1703818594,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfd6k06",
   "message": "Don't start doing drugs. But if you are going to start doing drugs, don't do cocaine, meth, any opiate, or benzos.",
   "created_utc": 1703821048,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdaew7",
   "message": "Nothing good ever comes fast or easy. Stop listening to those \"how to get rich/hot quickly\" videos or podcasts. Those are scams.\n\nLive healthily. Eat well, exercise well, have good sleeping time, get out of the house and get sun exposure for daily Vit D dosage. You might feel fine now but poor diet and lifestyle gonna catch up on you as quick as your late 20s. \n\nIt doesn't make you weak or shameful to ask for help when you need one. Being able to do it all by yourself is great; but admitting you can't do life alone and actively searching for help is commendable.",
   "created_utc": 1703822735,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdbvdp",
   "message": "My advice would be to try to get into training or education that is sure to get you a good paying job, or get into work that has lots of upward mobility.  Myself and a lot of  people I know didn't do this but, could have, or did it later than they could have, and we have it a lot harder than we would if we were better off financially.",
   "created_utc": 1703823408,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdeuln",
   "message": "go for it.  there is plenty of time to settle. life is always unpredictable,  maintain your heath.",
   "created_utc": 1703824808,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdf5yk",
   "message": "Wash your hands. Your second question is a tongue twister, i would say don’t ask obscure questions if you don’t expect obscure answers",
   "created_utc": 1703824961,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdov8b",
   "message": "Nobody gives a flying fuck about anything you do at your age, exploit this fully and learn as much as possible. Experience things, try stupid shit and see what sticks. Just make sure you don’t do anything permanent like get a criminal record or knock any girls up, and make sure you get school out of the way so you don’t have to redo it later, when people actually *do* care.",
   "created_utc": 1703830063,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdry4e",
   "message": "take the company 401k match. Even if you are not making much, just put something. compounding interest is huge.\n\nprioritize your career early.",
   "created_utc": 1703831979,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdvxg7",
   "message": "Take risks and accept every opportunity you have to try something new. As you get older you will have more responsibilities, less free time available and the costs of your mistakes will be higher. \n\nSo go for it!",
   "created_utc": 1703834613,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdwe7a",
   "message": "The real world is much bigger than high school and University",
   "created_utc": 1703834940,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdwedu",
   "message": "Put yourself first.",
   "created_utc": 1703834943,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdx9bq",
   "message": "\"Too late\" arrives way faster than you think.\n\nEnjoy yourself, but don't procrastinate too much.",
   "created_utc": 1703835552,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfdzupi",
   "message": "Take care of your skin, use lotion, wear sunblock and avoid getting burned.  You will pay for it later if you don't.  I am sitting here literally as I type with my face red as the sun, burning and itching from a chemo cream I am having to apply for per-cancersous legions. \n\nMove to a city of 500,000 people or more.  There is nothing quite like the big city when you are in your 20's, the fun and experiences you will have will last a lifetime.   After a few years if you are over it you can always move back to your home town or a smaller city.",
   "created_utc": 1703837437,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfe3ihv",
   "message": "Your brain doesn't develop fully *until* you're 25. Treat it well.",
   "created_utc": 1703840201,
   "score": 1,
   "submission_id": "18t29fz"
  },
  {
   "comment_id": "kfe420u",
   "message": "Wear sunscreen \n\nEnjoy it now, you're on the cusp of joining the rest of us in this meat grinder called life. Be prepared to lose excitement over things that once brought it to you. Be ready when you realize you live to make someone else rich.  Be ready to have a life of mediocrity. There will come a day when you ask yourself , wtf have I done with my life, and realize you've done nothing and there's nothing you can do about it.\n\nSome would argue death is the better alternative",
   "created_utc": 1703840613,
   "score": 1,
   "submission_id": "18t29fz"
  }
 ]
}