{
 "submission_id": "18t9329",
 "title": "Tenants of Reddit, what is your “Landlords from hell” story?",
 "selftext": "",
 "created_utc": 1703809216,
 "permalink": "/r/AskReddit/comments/18t9329/tenants_of_reddit_what_is_your_landlords_from/",
 "score": 5,
 "url": "https://www.reddit.com/r/AskReddit/comments/18t9329/tenants_of_reddit_what_is_your_landlords_from/",
 "comments": [
  {
   "comment_id": "kfcekxi",
   "message": "I signed a lease with a landlord who sold the property while I was there.  Multifamily building.  The new landlord had hired a \"property management company\" who just... existed as little as possible.  I couldn't ever get them to pick up the phone or return a call.  I'm not totally convinced they existed.  After several days of this, depending on urgency, I'd have to call the new landlord herself, and she'd get extremely pissy with me for bothering her.  Then I'd have to call her a handful of times before she'd get the property management company to subcontract someone to fix my water heater, or smoke detectors or whatever other urgent thing.\n\nOh, but they kept signing me up for automated text messages nagging me about the rent five days before it was due.  That they'd try to contact me about.  I was never, ever late on paying rent.  And they'd mail me stuff about their \"rules\".  Even though like... without enforcement, what's a rule?\n\nBut in terms of replying to calls?  Replacing broken things?  Clearing the snow?  Mowing?  Nah, they didn't do any of that.  They'd hire someone to mow (not even a landscaper, just like, some guys) once the grass had gone to seed.\n\nI ended up leaving that place because they sent me an automated lease renewal, I had questions but I couldn't get a hold of anyone about them, so I just didn't sign it and.... moved out.  I proceeded to call the landlord twice a day, 10 days in a row before she confirmed that I moved out and she got the keys I left on the counter.  I did get my entire deposit back which was nice.  Still wish I had some _paperwork_ about it, but nothing else ever happened.\n\nThat place badly needed a new roof when I left, I hope that situation got worse before the owner found out, and was expensive for everyone to deal with.  I probably would have mentioned that if I felt like being polite, but no use calling someone over fallen shingles when they don't even bother to start fixing a water heater for two weeks.",
   "created_utc": 1703809595,
   "score": 1,
   "submission_id": "18t9329"
  },
  {
   "comment_id": "kfckur3",
   "message": "My landlady lived upstairs. We had the basement and first floor. She had the second floor.\n\nShe was pretty OK most of the time. Worked long hours in health care, nurse or something like that. Didn't see her much, mostly said hi as she went past the front porch to her entrance. \n\nOne day her boyfriend was visiting and he got drunk and threw her down the stairs. Broke her arm and her ankle. She was a mess. Cops took him off to jail. \n\nA few weeks later, she came home from work mega early. Didn't stop to chit-chat with me when going past. (I spent a lot of time on the porch then as I had a young child who played in the yard). She was home about 15 minutes. Came out with luggage and ran to her car. I thought it was odd but it's not like she was a friend so I just let it go.\n\nCouple hours later a detective came to the house and asked if we had seen the landlady today. I told the detective what happened. She told me the landlady had gone to where her boyfriend was assigned to do highway cleanup and helped him escape custody. And also that the landlady and her boyfriend had major cocaine/Crack habits, this was before meth was a thing. So all of our rent and her paycheck was being spent on that and not the mortgage. \n\nWe never saw either of them again. We stayed there rent free for 8 or so months terrified the bank would swoop in and kick us out with no notice. Once we had enough saved we got a new place to live.\n\nSorry I don't know what happened to her. I don't even remember her name. It's been over 25 years.",
   "created_utc": 1703812150,
   "score": 1,
   "submission_id": "18t9329"
  }
 ]
}