{
 "submission_id": "18tb43n",
 "title": "[Serious] home schooling is increasing in US conservative families to prevent “indoctrination.” what effect will this have locally or nationally when these kids become adults?",
 "selftext": "",
 "created_utc": 1703814902,
 "permalink": "/r/AskReddit/comments/18tb43n/serious_home_schooling_is_increasing_in_us/",
 "score": 212,
 "url": "https://www.reddit.com/r/AskReddit/comments/18tb43n/serious_home_schooling_is_increasing_in_us/",
 "comments": [
  {
   "comment_id": "kfcrotg",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703814903,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdqt6z",
   "message": "My biggest concern with homeschooling is that is often the most commonly used and abused method of keeping child abuse under wraps.\n\nSource: ex CPS investigator. Almost all of my legitimate abuse cases were from religious, home schooling parents.",
   "created_utc": 1703831252,
   "score": 30,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfctpgw",
   "message": "Idk the only homeschooling I have any experience with is this kid I used to work with and we could never put him on register bc he couldn’t count change for shit",
   "created_utc": 1703815724,
   "score": 152,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd3u0o",
   "message": "As a case study of 1 - my cousins were home schooled by their religious parents. 5/7 are liberal leaning/ do not belong to the same church as their parents- one just celebrated a shot gun wedding. In general their “cult-de-sac” living (they grew up only around members of their church) had little impact on their adult world views, outside significant shame for being human.",
   "created_utc": 1703819901,
   "score": 218,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd05lg",
   "message": "As someone who was homeschooled until 9th grade (my mom did not want to deal with math and science, and wanted us to learn from teachers who actually understood and could teach it 🤣), I was pretty shy, but that ended after being in public school for highschool. \n\nIt was not religious-based, and long before all the homeschooling co-ops formed. We were the only ones we really knew who were homeschooled. \n\nPositives: my personal education and progress was the focus. Not a large class where the whole is the focus. So my interests were included in what I learned, as well as where I struggled. \n\nNegatives: I was shy and a little awkward. I did have socialization in extracurricular sports, but that's completely different than being in a classroom all day with peers. \n\nNot all who homeschool are the religious type. But I was definitely looked at as if I was and people were shocked how talkative and unreligious I was once they got to know me. \n\nI know this doesn't really answer the question. But they're not all like it. \n\nIt will be limiting to these kids if any of them want to grow up and work in a nonreligious sector and are unknowledgeable in \"common knowledge\" because they were not taught it. Unless they all plan to just remain in their bubble and cycle of being homeschooled growing up getting married to homeschool and/or work in religious settings. I knew a family I went to a liberal arts university with who was religious-based homeschooled until college and they all ended up working with churches and church schools because it was all they knew (they were working towards degrees in Christian Ministry)\n\nI grew up, went to college, and ended up \"fine,\" but ours was not religious-based.",
   "created_utc": 1703818378,
   "score": 50,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdaz0z",
   "message": "I was one of those kids. I’m incredibly pissed, liberal enough to make the Gadsden snake blush, and transferring to an actual good college (after being stuck at Liberty “University” Online). Learning about evolution, history, astronomy— it’ll all be so exciting!\n\nI’m majoring in physics and hoping to work in academia at a real university, not the Institute for Creation Research my child self wanted to join.",
   "created_utc": 1703822991,
   "score": 37,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfcsvkn",
   "message": "While we can’t for certain tell what the results will be going forward, we can make some pretty good predictions based on what curriculum is currently available on the homeschool market.\n\nA substantial amount of homeschool curriculum skews religious. This is not necessarily an issue in itself, but by religious I mean that they say things like “dinosaurs and mankind both bestrode the Earth at the same time.” This is not true. As such, I think that these kids will suffer heavily when it comes to biology and other STEM areas. \n\nA substantial amount of homeschool curriculum skews white conservative. This is not necessarily an issue in itself, but by white conservative I mean “many slaves benefited from being slaves and learned about god as well as skilled labor. Also the Civil War wasn’t about Slavery.” Thus I think the kids learning this curriculum will have issues understanding objective history and thus the ramifications that history has on the current day. \n\nHomeschooling is dangerously unregulated. There are examples where a kids education, especially female education, is largely focused on domestic chores and preparing them to be wives. This is objectively a bad thing. \n\nNow your mileage will vary depending on the curriculum you end up getting, but ultimately I don’t feel comfortable knowing that children are being educated in a system where such objectively incorrect curriculum is in circulation.",
   "created_utc": 1703815388,
   "score": 73,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdm73w",
   "message": "The children with stable households, whose parents take an active role in preparing them for the future will continue to outperform children missing one or both of those qualities in their lives.  Just like they always have.",
   "created_utc": 1703828553,
   "score": 64,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfcs58t",
   "message": "Oh the irony of them doing it to avoid indoctrination.",
   "created_utc": 1703815087,
   "score": 154,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdp4gp",
   "message": "There's going to be a lot of very confused and spiteful conservative parents when their kids still grow up to be gay and lesbian liberals with trans friends who are fully vaccinated.",
   "created_utc": 1703830216,
   "score": 7,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdb2ih",
   "message": "I was raised homeschooled and I think I turned out pretty well. My parents were/are public school/college educators, and they decided what was offered in our state was kind of restrictive. Especially government, history, economics, stuff like that. It was usually taught with bias from one side of the other and they wanted us to be able to understand all sides. We were raised religious, but we were never taught to deny or ignore scientific theories, ‘facts’, etc. just because it wasn’t dictated in the Bible. In fact most all of my siblings except one are going into various scientific fields. When we got to high school, we were dual enrolled at the local college for the afore-mentioned subjects so we could see different points and sides being taught first hand.\n\nMy older - early to mid 20’s- siblings are getting their PHD’s/ masters, and half of us double majored (one triple majored) in the sciences. \n\nNot that there’s not downsides. Unless you’ve got a decent sized co-op or something like that, you often have a pretty small social circle, and usually higher scholarships and awards don’t get awarded to homeschoolers unless they’re the ultra competitive type that’s involved in stuff, and usually at that point in they’re in public school as much or more as they are home, and a lot of people stop homeschooling at high school. Being awkward around peers is a reality. \n\nA lot of people think that homeschoolers end up going to Christian colleges and stuff like that, but the actual amount is much lower. I only know maybe 5 people who went to one, and there’s multiple dozens of families all over the religious, political, and social spectrums homeschooling in the community, equaling hundreds of kids. A lot of people who attend those types of colleges aren’t religious in the slightest, they just did it for a somewhat private college. \n\nThere are upsides too. I personally get along with most people, am more comfortable in conversations with older people, don’t really care about what peers think, don’t really care about awards and stuff like that since it wasn’t a thing for me. My personal interests and education were prioritized, since there wasn’t a entire class, just 6 of us. \n\n\nI would say none of us were ‘indoctrinated’, and most of us get along just as well with people of completely different beliefs and political views as us, as ones who believe the same stuff we do.\n\nI’m not trying to say this is the same for everyone, I’ve heard horror stories of parents just having their teenage kids memorize multiplication tables to rattle off if someone asked what they learned homeschooling. But I think it’s a pretty big generalization that it’s just conservatives who are indoctrinating their kids with religion and their political values and not giving them a proper education. \n\nYou would be surprised at the number of very non conservative families that homeschool. Before someone replies with surveys/studies, yes, it’s probably a heavily conservative leaning statistic. But I see a huge amount of homeschooled students not leaning the way their parents did. If they were raised religious, they often are very unreligious themselves, many come out as gay, bi, trans, etc. \nA huge proportion of families stop homeschooling at high school, so they’re suddenly introduced to all this stuff that they didn’t grow up with, and it makes them rethink how they were schooled, often for the better. \n\nA stereotype is that all homeschoolers are socially stunted, have no people skills, and stuff like that, and are behind education wise. At this point, it’s hard to be behind whatever grade you’re in. Listen to some public school teachers for high school and younger. Most, or at least a good deal, have a social circle, even if it’s small, and many have co-ops. \nI really don’t worry about homeschooled students taking public positions and ‘ruining’ the country ( anymore than it is). Those that stay relatively conservative and those that go on to be more liberal frankly seems somewhat equal. When you think about it, what really would be different? Conservatives will vote and run for conservatives, and ditto for liberals. \n\nTo bounce off what someone else commented, my mom, who’s degree is childhood behavior/development, also decided that we wouldn’t perform our best in public school. People learn/develop at different rates, and from what I’ve seen so many public school teachers say, schools are advancing grades way too quickly for their capabilities.",
   "created_utc": 1703823037,
   "score": 80,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd06kg",
   "message": "We can only hope they give their kids a proper education. Or at the least turn them into productive, good people. With the rate kids are being fed thru the school system now that can’t read or write, do simple addition and subtraction, it seems like their odds are about the same to be successful.",
   "created_utc": 1703818389,
   "score": 34,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdpho6",
   "message": "I was one of those kids. I am now trans, bisexual, and as “woke” as can be. \nI live in the bible belt, and was homeschooled in a christian curriculum, from grades 8-12. The curriculum is called “classical conversations”. It absolutely sucks from an educational point of view, and the content has been burned into my brain. I’m still trying to unlearn it. \n\nThat was the most horrific time of my life, I was so, so lonely. I met up with other homeschoolers every Monday but I couldn’t relate to anyone up there, they were all super conservative and christian, and I was a closeted queer teen. (More on that later.) So I had no friends at all in high school. When our group met, we had an actual class, to make sure everyone was completing their work during the rest of the week. Also, side note, lots of families at that co-op had at least 4 children. One family even had 11 children. I don’t know why, but it was super common for families to have lots and lots of kids, and then homeschool them all under Classical Conversations. \n\nI am fucking SHOCKED that nobody has spoken out about Classical Conversations. That program is raising the next generation of Ben Shapiros. We learned to debate and even had a mock trial in a real courthouse at one point. We learned logic and fallacies. All of this is well and good, but I think it’s very ironic that they’re heavily encouraging kids to “see both points of view” while simultaneously forcing their views down those kids’ throats. 😐\n\nThe co-op leaders were also wildly homophobic and transphobic. They straight up said in the rules, if you’re gay, trans, and/or you dress in clothes that don’t match your gender, you aren’t allowed to take this curriculum. That caused me so many panic attacks as a teenager because I knew I was queer. I never felt welcome at the co-op or in the curriculum, I always felt like I was pretending. And in addition to this, I was being taught that queer people were abominations, and they belonged in hell. I’d google over and over, “does god love gay people?” “is homosexuality a sin?” I had so many sleepless nights where I’d just toss and turn, wondering if I’d ever get to be myself, and be loved for who I am, because I was worried about what God and my family would think. (But no, this isn’t indoctrination, true indoctrination is teaching kids that queer people exist!!! /s)\n\nThe worst books in the course are, by far, the “Apologia Science” textbooks and the religious book “It couldn’t just happen” which we used as a textbook and even memorized passages from. \n\nApologia Science’s textbooks had some true information, but they tried to back it all up with bizarre lies. For example global warming. They claimed that global warming isn’t real, because the earth is “self-regulating”. (And like, okay, sure, I guess the earth will “self-regulate” us right off of its surface if we continue polluting it. /s)\n\n“It couldn’t just happen” was an awful book about how the universe just lined up too perfectly to be a coincidence. It went into detail trying to disprove evolution, while also making big claims about our universe. It entirely fucked up my belief in science as a teenager. One of the worst things that book did was, IT TRIED DISPROVING CARBON DATING. They wanted us to believe that the world is only 10,000 years old so they cast doubt on the concept of carbon dating. I swear to god this curriculum is custom-made to pump out science deniers.\n\nAnyways, these books and the curriculum as a whole are so much worse than I can convey in a reddit comment. I’ve considered making a video essay on youtube about it, or maybe requesting/commissioning a video essayist to make one in my stead. I have soooooo fucking many stories and facts to tell about this curriculum.",
   "created_utc": 1703830440,
   "score": 32,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdbfdo",
   "message": "If my experience with home schooled kids is any indication, there will be a whole generation of kids losing their shit and having a ton of sex and doing drugs all at once. Then they'll have a rebellious phase in college and later in life become conservative assholes just like their parents.",
   "created_utc": 1703823203,
   "score": 56,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdp7wn",
   "message": "Was homeschooled for a few years. Moderate conservative household, very high emphasis on education\n\n\nIm a physician now.",
   "created_utc": 1703830275,
   "score": 8,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdk3d1",
   "message": "I was homeschooled in a conservative christian family through my entire childhood, and I hated it. The books teach that the earth is between 6000-10000 years old. There's zero accountability to make sure that your kid is educated properly, my mom literally just gave me the books and I tought myself. One thing that I think that's good about it is the fact that it took like 2-3 hours to get my work done for the day. Learning how to socialize as an adult at work was extra tough because I'm autistic AF.",
   "created_utc": 1703827428,
   "score": 16,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdkct2",
   "message": "I was homeschooled by conservative parents (my mom has a teaching degree). I’m more moderate/left leaning and went on to get my masters. For me, homeschooling gave me an opportunity to study things that actually interested me yet met with state requirements.\n\nA lot of homeschooled kids I grew up with ended up in various places. Some got married and became stay at home parents, others went on to college or trade school and have advanced in their careers. The ones I met in college/grad school were 3.5+ gpa students and high achievers. \n\nConservatives are a wide range of people, so I think we’ll end up with a mix of high achievers in a variety of fields (both academic and skill work) as well as some rigidly traditional folks.",
   "created_utc": 1703827568,
   "score": 11,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdhymb",
   "message": "There are varying degrees of homeschool, just like public and private education. \n\nMy cousin is homeshooling her kids. While they are fine academically, they are very stunted socially. \n\nConversely, in college, i knew a guy who went to private school and failed algebra 3 times his first year in college. He graduated from private school simply because the school graduated everyone so parents wouldn't get mad and pull students, thereby rescinding tuition. He got flunked out of college after freshman year, eventually with tutors and 2 years community college, he graduated with a degree in Art and is fully supported by his parents.",
   "created_utc": 1703826340,
   "score": 7,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdhwzd",
   "message": "I was homeschooled and see a lot of homeschoolers through the education process to varying degrees of success. \n\nI’m also working in both a public and private education environment. \n\nMost of the people I see switching to homeschooling are not doing it for religious reasons but actually because of their access to affordable quality education proportionate to their social and economic status. \nThis means some will switch because of curriculum issues that conflict with their values, but more often because of the conditions in the school system and the heavy burden of the teacher shortage and overreliance on online programs. Most of these families who are switching do fit the demographics of a more traditional nuclear family with a mother who does not work full time. However, I see a lot of dads taking on the home school parent role and even forgoing their careers to be the home parent in these traditional examples. \n\nWhat does this mean for the future? \nThe current college students cannot read above a middle school level in much of my experience working with public and private education. The pandemic worsened conditions that were developing on their own. The emphasis on testing - which is how teachers get their bonuses and raises - is detrimental to students’ ability to read and comprehend complex ideas. STEM programs have been pushed to the detriment of humanities, which is bad for language skills overall and is now causing huge issues with literacy, to the detriment of all fields everywhere. \nMost homeschool programs are built around the humanities and philosophy rather than “practical” science like chemistry. In high school, however, my experience of science was no different in a classroom than at home aside from a handful of lab experiments. I took chemistry in school and learned almost nothing, but could do geometry and algebra without a calculator because I learned it from a homeschool curriculum that prioritized conceptual learning. \n\nWhile people like to talk about homeschoolers being poorly adjusted or socialized or whatever, the majority of states have pretty strict rules about what passes and what does not. There are checks and balances and coops for support. Not all will succeed, some kids will have to repeat a grade, and I’ve seen some religious families basically study the Bible and nothing else, and struggle as a result. \n\nThe homeschoolers who end up in college classes, in my experience, usually stand at the top because they are accustomed to building their own schedule, working at their own pace, and studying independently of a teacher being readily accessible. Not all homeschoolers have the advantages of co-ops and accountability structures that guide parents, so mileage may vary. Overall, I encourage a lot of people to try it out when they’re not finding success in overcrowded public schools or overpriced private schools. It’s a great option to lighten the load so kids who will never have that sort of one-on-one opportunity can receive a better education in a less burdened system.",
   "created_utc": 1703826317,
   "score": 23,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdq0z3",
   "message": "I don't even want to think about it.",
   "created_utc": 1703830768,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdwz4l",
   "message": "My sister was home schooled for a while \n\nAnd frankly you need to be a self starter or have a parent that is invested in your schooling \n\nMy sister excelled in it because she was a very good self starter. My mother certainly didn’t teach her anything and barely checked her work. \n\nBut her curriculum was very VERY basic compared to public school \n\nEventually she did all she could do and transferred over to public school \n\nShe homeschooled her son for a while and he failed everything because all he did was play video games and was in the internet. She never bothered to see if he was actually doing his work and his grades suffered. Now he’s in public school. \n\nI highly doubt there will be many parents teaching their kids. We’ll probably see an uptick in uneducated people and possibly more teen pregnancies.",
   "created_utc": 1703835351,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe0lyf",
   "message": "Home schooling gets a bad rap in the US.  As long as it's done properly with social events to get the kids social skills then I don't see the issue of it.  It's a lot of work, but it can be a great way to set your kids up to succeed in life. If it's done well.\n\nI have friends who home school their kids. Not for reasons like the OP, but because their school options were pretty bad and they didn't want to pay for private school.  Both their kids are hitting early teens/mid teens now and doing well. They're testing well above average on standardized assessments, have really good hobbies, and aspire for some pretty nice careers in the future.  \n\nWhile also seeming totally normal/friendly cause they've kept up with social events and weekly get togethers for the home schooled kids.",
   "created_utc": 1703838005,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe2xgy",
   "message": "Bold of the parents to assume their vaccine-free child will actually *make it* to the age where they will need homeschooling...",
   "created_utc": 1703839757,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe3axr",
   "message": "Homeschooling generally doesn't work out IMO.\n\nAlmost all of the homeschooled people I've met in my life have been very poorly socialized, with sub-par educations.  I know this sounds like a massive generalization, but the fact is, most parents ARE NOT TEACHERS.  And even if they can teach the curriculum, the students are missing out on vital socialization that is needed at the most important part of a child's life.  Home schooling is also frequently used as a way to begin or continue child abuse and control the victim.\n\nNot to mention, the very people who are doing this are conservative and paranoid, so their kids won't be exposed to any other views in life which is extremely dangerous for a child.\n\nThere are exceptions of course, so it's not hopeless, but the whole idea sounds awful.",
   "created_utc": 1703840041,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdg1u4",
   "message": "was one of them for a bit and grew up with a ton. typically are very socially stunted. very ahead by book smarts in most areas (at least in my weird co op program). also fiercely loyal to their parents opinions. and fucked up mentally. struggle when they leave bc they don’t know anything except their parents “not indoctrination, just Truth” indoctrination crap. it’s sad.",
   "created_utc": 1703825394,
   "score": 12,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd54k8",
   "message": "Your very own left leaning Washington post reports the rise of home schooling crosses every political, demographic, and geographic boundary, and is the result of the sustained popularity from the pandemic.\n\nIn other words, OP is full of shit and made this up.  Everyone is homeschooling. \n\n\nhttps://www.washingtonpost.com/education/interactive/2023/homeschooling-growth-data-by-district/",
   "created_utc": 1703820440,
   "score": 24,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfddz8k",
   "message": "I've met several adults who were home schooled as kids. They generally did retain their conservative and religious way of seeing things, but they were fairly reserved and often wouldn't even want to talk about it. They were each engineers, so their homeschooling was sufficient to get them into a decent university. And they were earning quite a bit of money. As for wacky beliefs, they didn't have many outside of their religion. They understood science and generally had nothing bad to say about it. There really wasn't much of a difference between them and other conservatives that didn't get home schooled. The only thing I would note is that they tended to be more shy, reserved, and not outgoing. They didn't seem to understand how to make friends and were sometimes frustrated by the lack of opportunities to meet people and date others who were of similar worldviews.",
   "created_utc": 1703824391,
   "score": 8,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdh2rq",
   "message": "Some of you have some very biased old school ignorant views on who is actually homeschooling.",
   "created_utc": 1703825901,
   "score": 10,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfcsopq",
   "message": "I consider myself conservative. I've homeschooled my kids since 2007. My eldest is working on her Master's. My second eldest is as liberal as you can imagine. My son is basically a genius who would have been bored as hell throughout school. My youngest is a carbon copy of me: smart yet autistic. At ten years old she still would be unable to deal with 36 hours a week of public school. She would simply melt down every week.\n\nMoral of the story: Homeschooling can be extremely beneficial and isn't the boogeyman that you seem to think it is; not even in conservative families.",
   "created_utc": 1703815309,
   "score": 26,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdov7x",
   "message": "Increase in purposefully ignorant and blithely superior jerks?\n\nThese adults will not be prepared to function in a world where naivety is exploitable. Heck, half of them will be so averse to swear words, they'll go blue screen of death on a construction site. They'll look down on, berate, or even attack anyone who won't convert just to make them feel like good, successful proselytizers.\n\nEssentially: They will end life as we know it by trying to make reality into the image of the television shows under the Hays Code. Because they don't realize life was never like that.",
   "created_utc": 1703830063,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdpoyl",
   "message": "I believe it’s well-established that home schooling results in higher rates of child abuse because actual schools are the most logical place for a child to report abuse. Many of these kids will be literally trapped.",
   "created_utc": 1703830564,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdpxek",
   "message": "[This song pretty much sums it up](https://www.youtube.com/watch?v=qbwFMZTFrmU) \n\nLyrics:\n\nDear Mother\r  \nDear Father\r  \nWhat is this hell you have put me through\r  \nBeliever\r  \nDeceiver\r  \nDay in day out live my life through you\r  \nPushed onto me what's wrong or right\r  \nHidden from this thing that they call life\r  \nDear Mother\r  \nDear Father\r  \nEvery thought I'd think you'd disapprove\r  \nCurator\r  \nDictator\r  \nAlways censoring my every move\r  \nChildren are seen but are not heard\r  \nTear out everything inspired\r  \nInnocence\r  \nTorn from me without your shelter\r  \nBarred reality\r  \nI'm living blindly\r  \nDear Mother\r  \nDear Father\r  \nTime has frozen still what's left to be\r  \nHear nothing\r  \nSay nothing\r  \nCannot face the fact I think for me\r  \nNo guarantee, it's life as is\r  \nBut damn you for not giving me my chance\r  \nDear Mother\r  \nDear Father\r  \nYou've clipped my wings before I learned to fly\r  \nUnspoiled\r  \nUnspoken\r  \nI've outgrown that fucking lullaby\r  \nSame thing I've always heard from you\r  \nDo as I say not as I do\r  \nInnocence\r  \nTorn from me without your shelter\r  \nBarred reality\r  \nI'm living blindly\r  \nI'm in hell without you\r  \nCannot cope without you two\r  \nShocked at the world that I see\r  \nInnocent victim please rescue me\r  \nDear Mother\r  \nDear Father\r  \nHidden in your world you've made for me\r  \nI'm seething\r  \nI'm bleeding\r  \nRipping wounds in me that never heal\r  \nUndying spite I feel for you\r  \nLiving out this hell you always knew",
   "created_utc": 1703830707,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdqax8",
   "message": "This is called the. \"Joshua Generation\" I just heard about it this year. They're training their kids to grow up and \"take the country back\"\n\nI first heard it in the Duggar documentary on Amazon. Your question reminded me of a podcast episode in my to-listen queue about this. It's from \"Today, Explained\" by Vox if anyone is curious.",
   "created_utc": 1703830936,
   "score": 5,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdj31t",
   "message": "I’ve taught several. I’ll be diplomatic and just say that they’re screwed since everything is collaborative now (aka group stuff). And their rigid, inherited ideologies don’t usually translate to a mind open to learning other perspectives and cultures. They’re being indoctrinated by ignoramuses",
   "created_utc": 1703826906,
   "score": 9,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdplmb",
   "message": "Anecdotal, but every kid I knew while growing up in the 90s that was homeschooled was socially awkward and struggled to fit in. It was only 7-8 kids, but if they were homeschooled they didn’t have any social skills and they were oblivious to most stuff the other kids their age were interested in. Everyone of them came from a very strict Christian family.",
   "created_utc": 1703830507,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdyecw",
   "message": "There are a lot of issues with the public school system and as a result we've discussed homeschooling. The reason we won't do it is even though I may not agree with all of the worldviews of others, I want my children to be able to experience thoughts and ideas outside of my own and form their own beliefs from there.",
   "created_utc": 1703836373,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdyer1",
   "message": "I feel these homeschooled kids will struggle  socially for starters. I also worry that their reading comprehension, literacy, spelling, and mathematic skills will suffer greatly. I also feel like a lot of accidentally pregnancies will occur. My reason for thinking this is that, in my personal experience, conservatives, especially religious ones, aren't great about teaching proper sex ed classes.\n\nWhen these kids grow to be adults, I feel they will be baffled about how the world actually works and/or operates. Many of them may change their opinions and come to resent their conservative family. Some may even go as far as going little to no contact with their parents. \n\nThose are just my thoughts and theories on that though.",
   "created_utc": 1703836381,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdym5l",
   "message": "Most people aren't smart enough to recall their own schooling. So I feel like due to a reduction in the overall quality of education we will see two things, increased crime, and reduced college admissions.",
   "created_utc": 1703836533,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe26ew",
   "message": "Those who try to get into colleges will get a ride awakening.  The rest will either stay ignorant or realize, over time, that they were lied to.  None of those outcomes bode well for the future of the right wing.",
   "created_utc": 1703839180,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe3smp",
   "message": "They’ll all be living in a different world from everyone else and think the world is wrong.",
   "created_utc": 1703840414,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe41au",
   "message": "they'll probably end up the exact same as most of the conservative homeschooled kids who came before them: they'll come out into the 'real world', experience a culture shock, and will probably end up leaning liberal",
   "created_utc": 1703840597,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe4hn5",
   "message": "If they can pass the GED then who gives af. I don't blame parents for homeschooling either, some of the shit they teach at schools mixes political views (even some I agree with) as a black and white fact.",
   "created_utc": 1703840938,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe4juf",
   "message": "As a Former homeschooled child of conservative parents we desperately need regulations on homeschooling. There are essentially zero safety nets for homeschooled children in the US. Most of us are being educationally neglected (I only revived a 3rd grade education) and very socially isolated as well as being abused and neglected in other ways. We have been absolutely failed by the government, our parents and our communities. I personally think homeschooling should be banned and we should make our schools more accommodating (unrealistic in America but absolutely possible). My siblings and I are lucky that we managed to figure out that what happened to us was incredibly fucked up and abusive and now we can take steps to help ourselves. But most homeschool alumni I know have not figured this out they don’t realize they were neglected/abused/isolated and essentially raised in a cult and they go on to continue the cycle of abuse. Being very isolated and educationally neglected etc.. as a child deeply fucks you up please give us grace as we learn to navigate the real world. I was essentially locked in solitary confinement for 20 years of course I’m socially awkward I don’t need you to make me feel bad about that. Why do think you are more qualified than an entire school system? No sane person thinks they can give a child (yet alone multiple) an entire k-12 education. Socialization is also so incredibly important and a public school setting cannot be beat by homeschooling no matter how many extracurricular activity’s your child is in. You’re setting yourself up for child up to be an outcast and have a much more complex relationship with you than public school parents. \nIf you think public school is missing something or wrong about something engage with your child after school or weekends about that topic instead of pulling them out. Public school also provides mandatory reporters to your child which unless you’re an abuser is a good thing.",
   "created_utc": 1703840983,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe53nd",
   "message": "I won't hire them. I can't realistically measure their potential against other applicants. And I gotta figure they will be xtian zealots more than likely, which creates all sorts of issues with customer interactions.",
   "created_utc": 1703841402,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfe5ezb",
   "message": "They'll have issues socially, their education will (probably) be subpar, and they will either completely buy into the ideology, or run the moment they can in the opposite direction. The US already has the most cults in the world, and one of the reasons is the fact that that homeschooling is so easy to access Isolating kids at an early age is a great way to control them",
   "created_utc": 1703841639,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfcs0mu",
   "message": "Assuming they are meeting educational standards set by the states, not that much?",
   "created_utc": 1703815035,
   "score": 16,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdkzok",
   "message": "First there will be a fight between parents and academic planners over the minimum requirements for education - then regardless of who wins that fight there will be a rapid decline in the average quality of education. I say regardless of who wins that fight because one side of that argument will believe in following rules and laws while the otherside does not and will make batshit claims about educational planners forcing parents to indoctrinate their children with basic literature and algebra.\n\nOn the bright side these zombified children will be rendered ineligible for many post secondary colleges and universities because they wont be able to pass entrance exams. On the down side though eventually foreign students will outnumber American students in American Universities.",
   "created_utc": 1703827908,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdmdok",
   "message": "I was only homeschooled for a couple of years. \n\nMy parents were getting a divorce and my dad got custody but he was in the military abroad. I went from school in Germany to the US where apparently I was quite a bit off from the regular US school schedule. I entered homeschooling with a co-op half way through my 4th year. I did that through the summer with no spring break.\n\nWhen regular school was about to start the school wanted to test me for placement. They put me not only in sixth grade, but in all advanced classes. I skipped 5th all together. I quickly fell behind in English as I hadn't studied enough to spell correctly and I still had an accident. I also found it difficult to understand the Georgia English where we moved to from Germany. I was put back in a regular class.\n\nBack then it didn't matter what the subject was you'd get bad grades if you didn't spell correctly. That's not the case anymore at least for public school in California for my children. \n\nThe homeschool co-op I was a part of was super efficient. There was like 30 of us, all different ages and grades, two teachers for general subjects. An art teacher, a music teacher, physical education coach, drama teacher, home studies (like keeping a house, not quite home economics), physical sciences teacher (lab work who also taught gardening or perhaps that was just for the youngest), we had a full staff of seemingly specialized instructors. We didn't have any non English languages to learn which I found strange. \n\nMy point is, some homeschool is basically private school quality, or can be. Just like there are good and bad public schools there are good and bad homeschool. The difference is bad homeschooling generally only affects one family of children.",
   "created_utc": 1703828652,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdp4bv",
   "message": "I went to a conservative Christian college (that was the requirement for going away for college, and I was dead set on getting out of that house) that had a lot of students that had been religiously homeschooled (I had gone to  the same religious private school for K-12, an entirely different nightmare). I became more aware of homeschooling through friends of mine, and when I decided to go into child protection law, I was immediately pulled to the increased rate of child abuse among homeschooling families. There are a lot of different reasons why it happens, from cultish religious sects (I see you, Duggars and your child abuse manual) to general neglect and not caring for their kids. The vast lack of oversight though is being used to keep children away from mandated reporters, so there’s nobody they can report the abuse to, and they fill their kids with fear about CPS coming to their door and taking them away, insisting they target homeschooling families (and as someone who’s worked inside Illinois’ CPS organization, the number of time homeschooling families came up was….zero). It really is a mess, and the lack of oversight that the “Christians” over at the HSLDA (homeschool legal defense association, otherwise known as child abuse enablers) pushed for and made possible is a huge reason why that happens, and as a Christian it absolutely disgusts me. They then go to court and defend the rights of convicted child abusers to homeschool their kids, which is fucking unfathomable to me. \n\nSo yeah, it’s definitely an issue, and more and more homeschool alumni have been speaking up about it, hopefully soon changes will be made.",
   "created_utc": 1703830214,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdqhzg",
   "message": "It’s probably just going to breed more people complaining about how we should strictly adhere to the Constitution, who can’t even read the Constitution. So basically, it’ll just replicate what’s already happening.",
   "created_utc": 1703831057,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfcrxup",
   "message": "It will just worsen the already stark differences between conservative families and normal families. These kids will feel extremely isolated in all communities outside of those with equally extreme beliefs and values.",
   "created_utc": 1703815005,
   "score": 12,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd96y1",
   "message": "These same parents will be very angry when their ignorant kids can’t get into any legitimate colleges. Expect to see more Libertys and Hillsdales popping up. In the end it will further contribute to the dumbing down of America.",
   "created_utc": 1703822187,
   "score": 5,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdjsh0",
   "message": " Most test in the top10% in their states. Most score very high on the SAT's. Most get into colleges easier.",
   "created_utc": 1703827271,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdmrml",
   "message": "It is increasing largely to **cause** \"indoctrination,\" and it's going to be disastrous unless the U.S. starts making stronger guidelines and laws around homeschooling.  Right now, in many states, literally anyone can say they're \"homeschooling\" their children and there are no tests or checks on the system at all.  \n\nYou can't have a succesful country without an educated citizenry.  We will end up with uneducated adults, or worse: https://www.washingtonpost.com/education/2023/02/02/ohio-officials-are-investigating-pro-nazi-home-schoolers/\n\nThis will weaken us on the world stage in every possible way.  \n\nhttps://www.washingtonpost.com/education/2023/12/28/homeschooling-regulation-esa-school-choice/",
   "created_utc": 1703828865,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdkckn",
   "message": "The biggest effect it will have is that the kids will not talk to their parents when become adults.",
   "created_utc": 1703827565,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdp4sw",
   "message": "I work in a library in the children's section. We're already seeing changes. \n\nMore demand for books about Jesus, parents refusing to read books if the characters aren't white or animals. Also they refuse fantasy and sci-fi books. \n\nTons of demand for books that went out of print in the 80s and 90s. \n\nAlso, they won't allow their kids in the teen or preschool section at all. I'm talking kids like 16 year olds still only reading books in the children's section.\n\nThere is a local Christian private school in the area. It's huge. It's also know for their parties having the most drugs, and from the high schoolers I talk to, it's not just weed. Most avoid them,or so they claim.\n\nAs a whole, we see homeschooling kids are kinda shy. And some of them are downright weird. Like think of a library cart. Most people would put the books spine out. The home school kids just put them in stacks on the top tier only.\n\nOverall, homeschooling seems to make kids shy, rude (not knowing the rules of society), they think outside the box (but in weird ways), and they use words that tend to be super negative against LGBT, people of African descent, Hispanics, and all disabilities. As some of the younger ones are aging they get told only part about history. Most of them love books on the titanic and the American revolution. \n\nAlso, most (in my are) are being shown how to use guns to defend themselves.\n\nThose parents who have kids with things like autism, ADHD, want a \"cure\". Because they want their \"real child back\".\n\nHonestly,  I think we'll have another civil war eventually. But there is a current war on going. And it's basically,  treat others the way you would want to be treated. And we're losing that war. Homeschoolers in my area don't know how to share, or take no for an answer.",
   "created_utc": 1703830221,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd7l0x",
   "message": "My wife and I are very educated people. Between her and my mother we have put a lot into growing our kids intellectually. They test way ahead of their grade levels at reading and math. If I wanted to, I could probably home school my kids and do as well as, if not better than schools in my area at academic progress. Honestly, I get that it isn't PC to say, but I do think schools are doing a little too much indoctrinating these days. Having said that, no way can I see myself considering  homeschooling. The purpose of school is learning how to become a functional adult. Yes, that involves algebra and the periodic table, but learning to interact and play well with others is just as vital. You get none of that at home. I think online classes and to some extent WFH are similar.\n\nI ran across several homeschoolers in higher education and while they were brilliant the also had social skill deficiencies that caused issues. Don't want that for my kids.",
   "created_utc": 1703821492,
   "score": 6,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdd6dl",
   "message": "Anything is better than oregon public schools that just dropped the reading and math requirements to graduate because \"math is racist \" 🙄  how will these kids live and work? With out math? Without reading?",
   "created_utc": 1703824011,
   "score": 5,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdf74c",
   "message": "Likely further decline in social skills and greater variation in the quality of education.  Basically, it's the same thing that happened during covid.",
   "created_utc": 1703824977,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdlvx9",
   "message": "Can't read, write, 'rithmetic or social skills. Source: friend came from an area with many homeschoolers",
   "created_utc": 1703828383,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdf56z",
   "message": "Polio outbreaks worsening.",
   "created_utc": 1703824950,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdgsk3",
   "message": "I'm just spit-balling here, but gaming this out, you're going have millions of adults who can't critically think or solve problems. They will be socially incapable of interpersonally working with others (you know, because they weren't exposed to liberal/secular/immoral ideas) and will be completely incapable of functioning in a complex, fast-moving, ever-changing world. Like, literally they'll be too developmentally challenged to be of use to anyone. So, assuming they're even lucky enough to get a job at all, it will be extremely menial, low-skill/low-wage work with no hope of advancement or self-sufficiency (probably). Plus, from what I've gathered from some accounts from people I've read about who escaped the homeschooling subculture, a lot of it is just parents using their kids for chores and not actually administering academic learning anyway. It's not like any government body regulates this shit.\n\nDon't even get me started on vaccinations and all that. If their parents don't want to expose their kids to ideas and information they don't approve of, they definitely don't want their kids getting jabbed and likely prefer \"natural immunity\" because they heard Joe Rogan say it or a mom group on Facebook or something. So, these kids will contract a myriad of disaeases as youngsters, some of them dangerous that can/will cause severe complications (physical and cognitive) that can set them back as well. Also, it endangers anyone around these people, no doubt, because they just get everyone around them sick and cause outbreaks everywhere they go like a plague.\n\nI mean, that's just a brainstorm...",
   "created_utc": 1703825761,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdic63",
   "message": "We'll have a nation of indoctrinated dumbfucks who question whether archeology is real or the earth is a sphere while believing Jesus is coming back.",
   "created_utc": 1703826526,
   "score": 5,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdg0p8",
   "message": "Accuse others of indoctrination, then indoctrinate your kids into your own religious/political/conspiracy bullshit.\n\nWe're gonna have a lot more fighting and arguing and yes violence because the rest of us are gonna be stuck dealing with people who don't live in reality and not get things that are just common sense to the rest of us. Some of them will grow to hate and resent their parents for fucking them over as they have to deprogram or unlearn the bullshit and learn what real life is actually like as adults, stuff they were supposed to learn as kids to prepare them for life as adults.",
   "created_utc": 1703825379,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdeuhk",
   "message": "These families will struggle to function in the modern world, and so will continue to get poorer, and probably become radicalized further.\n\nMuch of what's going on in America is because the 'red states' are slumping into deep poverty, which leads some people into fascist thinking. But as long as their leadership is focused on banging the 'culture war' drum, it's just going to get worse.",
   "created_utc": 1703824807,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdkhrt",
   "message": "The irony of preventing indoctrination by indoctrination.",
   "created_utc": 1703827641,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdj268",
   "message": "I'm going to take a more bipartisan approach to answering this question - because Reddit is largely liberal, and I'm a bit sick of living in an echo chamber.\n\nMake no mistake fellow Redditors, there are a **lot of crazy Republicans out there**. They believe crazy things and do crazy things in terms of the classroom and the school. I do not deny that these people exist or that they've got a wild worldview.\n\nHowever, I think we shouldn't pretend like a liberal bias has not only taken hold of our public education system, but works there in full degree. If you think this is because liberalism is inherently the answer if you value education, then you're also silly.\n\nStates that allow a teacher to hide a child's sexuality or gender identity from their parents is concerning as an example - and I truly don't care what you think; **it is**. Do you understand how much authority and power that gives a teacher or administration over my child instead of me as a parent? Is that not at all concerning to you? What if the teacher isn't a saint, and instead has nefarious intentions. This is not exactly a crazy scenario to imagine.\n\nTalks about gender and sexuality in the classroom has largely become politicized; and quite honestly I blame both conservative and liberal lawmakers for this. Fixed gender identity is a social construct, much the same as **a diversity of gender identity.** This means that societies that have a \"boy\" and \"girl\" customary are just as valid as societies that allow for the existence of 82 genders. However, when under the guise of education, we frame one as morally correct, and the other as morally reprehensible - I'm sorry that's just a purely political take being openly talked about in the classroom.\n\nI could continue with those list of issues, but I worry that in our hunt to chase down and allow acceptance in the classroom, we've created a situation that's removed the possibility of acceptance of diversity of thought in a classroom. Children come from different backgrounds, and should be educated about issues in an unbias manner. Education has a liberal skew that does not allow for this outright; and some conservatives see this as a reason to entirely remove their children from the system because they believe it's a system that no longer coincides with their way of life.\n\nIt's a normal human response to do this with your children; **especially** if you feel that the values you'd like them to have are being compromised.",
   "created_utc": 1703826893,
   "score": 4,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdjub0",
   "message": "A large number of easy marks and people that can be scammed fairly easily.",
   "created_utc": 1703827297,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdqqfa",
   "message": "I live in a semi conservative part of California, I’ve noticed that these idiots are the ones saying how much Californians sucks usually retire out of state or plan to, and their kids tend to leave the state for college/trade shortly after high school. They make everyone’s life miserable while they are here though. Ruining school birds or assaulting schools with their idiot rhetoric",
   "created_utc": 1703831203,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdwy99",
   "message": "Conservatives aren’t devaluing education and science for funsies. They’re doing it because uneducated people are easily manipulated. They want a voting base with no critical thinking skills that will believe everything they say on face value.",
   "created_utc": 1703835334,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdk2jj",
   "message": "I will say there is a right way and a wrong way to do homeschooling. The college I went to for some reason attracted a TON of homeschoolers, many of which you could spot from a mile away. At least 50% of them completely lacked any social skills or critical thinking ability. Many of them were extremely gullible and some were emotionally immature.\n\nHOWEVER, as homeschooling becomes more and more popular you are seeing a rise in homeschooling groups where different homeschooling families get together and attempt to give their kids a more traditional high school experience. They go on field trips and participate in music, theater, sports, etc. It’s hard work but if you can commit yourself to doing it properly I think many of those kids will come out better than the ones going through the public education system. \n\nYou don’t need to look very far to see the failings of the public school system from teachers blowing the whistle on how little their kids know to the fact your average person is a complete moron.",
   "created_utc": 1703827416,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdpmwd",
   "message": "Again, as always, its sheer projection with these people.\n\nThey are the ones indoctrinating their children.",
   "created_utc": 1703830530,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdeyho",
   "message": "I don’t think this will be that big of an issue. Im sure it’ll happen, but I think most people are all talk tbh.",
   "created_utc": 1703824860,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdjcro",
   "message": "Homeschoolers in mass take regular sojourns to manufactured insanity like the Creation Museum, where the laws of physics, natural science, the historical fossil record, and established standards for verifying universal truths of nature are denigrated and denied. All explained away as supernatural and because. That’s some dark shit. I don’t know anything about developmental sciences in children, but convincing them the laws of nature are incorrect can’t have a happy ending.",
   "created_utc": 1703827044,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdl5qc",
   "message": "They will be very incompetent.",
   "created_utc": 1703827997,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdqwvw",
   "message": "They will have huge gaps in their overall educations that will put them way behind in the increasingly competitive job market.",
   "created_utc": 1703831317,
   "score": 3,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfd1y2i",
   "message": "I was homeschooled from birth until 10 years old. My mom did a decent job at teaching me and my sister up until that point. But we were forced to go into the public school system after my parents got divorced and my mom had to get a full time job. I can totally understand why homeschooling is on the rise, given the politicization of the education system in the US. Even when I was in public school, I had to keep on my toes not to seriously believe what political things they were pushing on us. Good thing I like reading and doing my own research on issues, topics, etc. I ultimately think it will just accelerate the culture war though, and grow the divide between the two sides. Hard to say with any specifics though.",
   "created_utc": 1703819119,
   "score": 2,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdk33h",
   "message": "A bunch of adults who lack critical thinking skills.",
   "created_utc": 1703827424,
   "score": 255,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdfq9c",
   "message": "They are kneecapping their own children and their future livelihoods. World is going to keep moving on and they will be left behind.",
   "created_utc": 1703825236,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdaz7g",
   "message": "There will be a large population of idiots who don't know how to interact with other people and a large subset of them that are indoctrinated into extreme racism. Another indoctrinted into evangelical Chrisianity.",
   "created_utc": 1703822993,
   "score": 255,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdf1ll",
   "message": "Kids will be a lot dumber, but more likely to blindly obey",
   "created_utc": 1703824902,
   "score": 0,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfds5lp",
   "message": "They just told you they're trying to keep them stupid and prevent critical thinking. Literally just trying to ensure that change won't happen. They pretty much summed up what the end product will be.",
   "created_utc": 1703832112,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdtkwd",
   "message": "Watch the movie Idiocracy for further research",
   "created_utc": 1703833025,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfcrxan",
   "message": "Did you know that in Francoist (fascist) Spain, they would kidnap the children of known communist families and place them with catholic families.",
   "created_utc": 1703814999,
   "score": 255,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdhjym",
   "message": "The biggest impact will be on accelerating the dismantling of our public K-12 education systems.",
   "created_utc": 1703826136,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdhu99",
   "message": "I was homeschooled for several years as a kid. I’ve noticed most homeschooled kids grow up to be much like their parents: strictly religious, marry extremely young, very conservative and have many children. I will admit, I’m still struggling socially all these years later, but I get by. Many homeschooled kids are a bit odd, but once they integrate into a workplace or a church or other social group, they usually turn out pretty normal.\n\nBut there is one thing many homeschooled families don’t seem to realize. Like amish people who let their teenage children experience life outside the Amish for a week or whatever, many homeschooled kids go off the deep end when they first move out. I mean, things like underage drinking, drug usage, or premarital sex go from 0 to 1000 almost instantly, instead of gradually. I think it’s the whole “I can do this now” freedom and they go A bit crazy. But maybe that’s only where I live",
   "created_utc": 1703826280,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdk0ng",
   "message": "One of my current co-workers is an ultra-religeous individual(had his sixth kid not long ago) and believes every damn thing he sees on Facebook. He has come up to me and asked if I was concerned there were books in school libraries about \"how to give a blow job\", and expressed his concern for my daughter. I told him i seriously doubted there are such books and his response was \"well maybe or maybe not, but id rather my kids to be more god-fearing than classically educated\"",
   "created_utc": 1703827389,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdky8k",
   "message": "America is collapsing anyway. We should invite the British back.",
   "created_utc": 1703827885,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdnmp0",
   "message": "One of the reasons why we have considered homeschooling is because the schools suspend, arrest, send CPS to homes over misunderstandings or gross exaggerations.\n\nChild drew funny pic of sloth ..they freaked out...\n\nWe have had a seven year old in neighborhood arrested for a plastic toy knife that went with his costume. \n\nOur own child recently arrested \u0026amp; attempts to charge him with a 2nd degree felony for making a joke/comment about a bomb with a friend, (witnessed by his sister's and brothers. No evidence provided) \n\nWe have also experienced our children terrified \u0026amp; crying because the entire school thought there was an active school shooting. (It was adults, parents, militia trying to infiltrate the school and try to defend the school.) After a school shooting that had been put in. \n\nSchools shut down because they rated a grad or D or less for 9 consecutive years to the point that the school district would NOT give in to any more funding. \n\nThis is in more than four school districts. These are five schools 1,000s miles apart in many years length of time. \nIt's just too much. Public school is too much nowadays.",
   "created_utc": 1703829340,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdo837",
   "message": "Now how the fuck do you expect your mom to teach you about science, history, and math... The whole thing is just bizarre to me.",
   "created_utc": 1703829686,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdoghz",
   "message": "a family member once flunked 8th grade\n\nthey did home school and re did the entire year in 3 months\n\nhome school kids are gonna be fine, probably better than fine",
   "created_utc": 1703829824,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdpbxy",
   "message": "More teenage pregnancy because the parents won't teach sex ed and they can't get abortions. Divorce rates then soar. Single parents households are tough on everyone leading to more stress. And stress kills. The median age drops to death at 65 so no need for social security/Medicaid/Medicare and this makes the conservatives very happy and horny. Thus, making more babies to fight the holy war against the Muslims. Then it's the end of the world as we know it. Stay in school. Real public schools and learn how to get along with everyone!! You're saving the earth from complete annihilation. It will be warmer but you'll live underground in a cave so no worries it'll be like being homeschooled.",
   "created_utc": 1703830343,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdpwxw",
   "message": "They're going to be even dumber and less educated than their parents, falling further and further behind in college and the workforce, completely unprepared for life as an adult, and then they will bitch and moan about how they've been unfairly persecuted for their beliefs when what they need to do is bitchslap their parents for perpetuating an endless cycle of ignorance.",
   "created_utc": 1703830699,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdqabu",
   "message": "It’s rare for a family to do homeschooling right. I honestly think that most are going to have a hard time adjusting to adulthood. That’s not to say that they are all doomed, but they’ll be at a social disadvantage, and likely an academic disadvantage if they choose to pursue higher education. Community college can close the gaps somewhat. \n\nAnother major thing with homeschooling is that it’s also used by families who are abusive to avoid scrutiny, so there’s some complex trauma on top of the social and educational neglect.",
   "created_utc": 1703830926,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdr730",
   "message": "What always baffles me about homeschooling is that someone with (usually) zero experience teaching is making the decision that they are a better teacher than trained professionals and are willing to hedge their child's education on it. Don't get me wrong, I'm sure they have great intentions and give it 100% most of the time, but there's just no shot that they can overcome the types of things teachers do for children.",
   "created_utc": 1703831496,
   "score": 1,
   "submission_id": "18tb43n"
  },
  {
   "comment_id": "kfdsq7v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18tb43n"
  }
 ]
}