{
 "submission_id": "18tomha",
 "title": "How does it feel to be lonely?",
 "selftext": "",
 "created_utc": 1703860928,
 "permalink": "/r/AskReddit/comments/18tomha/how_does_it_feel_to_be_lonely/",
 "score": 160,
 "url": "https://www.reddit.com/r/AskReddit/comments/18tomha/how_does_it_feel_to_be_lonely/",
 "comments": [
  {
   "comment_id": "kff3z5q",
   "message": "It feels awful. It eats you from the inside, slowly and painfully.\r  \n\r  \nI am lonely. Very lonely. I have one friend and my parents and nobody else. That feeling is eating me alive day by day and I try my best to hide it from people but it is hard. Goddamn hard. I don't have a person to talk to. My friend has her friends and I am not important to her and I will probably never be. My parents are there for me but they have their own problems and I avoid talking with them too often because I don't want to make them more problems than they have now. Essentially, I am alone with my thoughts and with my feelings and that is what I don't like. The only thing I can do about it is to cry my guts out and hope that I will feel better. I sometimes do, sometimes don't. The worst part is that you can feel how it hurts you. How that feeling breaks you into a thousand pieces from night to night. It is a hard feeling to deal with alone.\r  \n\r  \nIt often mixes with anger and sadness. You are angry because you are trying so hard to supress that to avoid feeling it that when you fail, it is ten times worse. The sadness part is when you see other people with their friends, laughing and having a good time and you are lonely and sad. It eats you from the inside, again. Some people get used to it so it doesn't represent something new and some people just have the same feeling over and over again. Some people feel like there is no end to it.\r  \n\r  \nThat is how it feels to be lonely. Trapped in your own feelings, thoughts and knowing that no matter how much you try, you will never be the 1st choice for someone. Some people accept that fact and move on, some don't. The thing is that it affects you, like it or not. And that's the worst part - being afraid to feel lonely, constantly fighting against it.",
   "created_utc": 1703862262,
   "score": 129,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff6ceu",
   "message": "AI is getting its cheat sheet...",
   "created_utc": 1703863209,
   "score": 28,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffdhhk",
   "message": "Imagine everybody knows it is your birthday but nobody gets you a present or wishes you a happy birthday. \n\nNow have this at Christmas.\n\nNow do this for 15 consecutive years",
   "created_utc": 1703865942,
   "score": 23,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffhxks",
   "message": "To me, the easiest way to imagine the feeling of loneliness is picture yourself at a train station, or a pier.\n\nAll of your friends you've ever had got to the dock/train station around the same time as you, but then they boarded and moved on without you. Some said they would contact you soon, some said they would come back after a bit, some promised to invite you to their wedding in the future. Nobody ever reaches out to you and nobody ever comes back to see you. Years pass. Literal years, I'm talking 5-10 years.\n\nYou wait at the station, and you keep seeing more people getting on and moving away from you. You wait, and wait, hoping someone will remember you still exist. You occasionally post things online like \"I'm still here\" trying to get pity points, but eventually stop because the only people who comment are your Mother, Grandmother, or some random person you don't even know.\n\nThen you look on social media and see your \"friends\" are posting photos on Instagram and Snapchat of their new friend circles in other towns. Some of them recently had weddings. They look so happy, all your mutual friends are present, but you aren't present in any of it.\n\nYou've been left behind on the shore/train tracks with nothing but memories. You feel like the gas station on a long highway they passed by just for a bottle of water, and then kept driving off into the sunset.\n\nYou are nothing to these people. Not even a thought, unless they want to take a road trip near your town and need a place to crash. Again, they see you as someone who can be used for something, but not someone who can join them in life.\n\nI speak from experience on all this. I've been essentially alone since 2013 and my friendships are shadows of what they once were. Work doesn't allow for the same friendship bonding as childhood-college experiences allowed. As a man in my 30s, no other adult wants to hang out with just me; I've become the creepy guy alone at a bar, with nothing but a bottle to stare at.\n\nSome of us are just not the life of the party. Some of us are viewed as just NPCs. Some of us will die alone with nobody present at our funeral. We are easily replaceable, easily forgotten, Never loved beyond immediate family.",
   "created_utc": 1703867595,
   "score": 16,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff97bl",
   "message": "Sometimes it’s nice but sometimes my heart aches when I see everyone have friends in college",
   "created_utc": 1703864321,
   "score": 13,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff5ri6",
   "message": "It feels like if you don't get the next visual or audio stimulus into you the world will cave in and suffocate you.  I go from long form podcasts to dozens of youtube subscriptions and that gets me through the day.",
   "created_utc": 1703862978,
   "score": 10,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff5xok",
   "message": "It's tough, but it can be overcome. I'd recommend starting with volunteering or joining so local communities in your city.\n\nI'm actually building an app that could potentially help people feel less lonely. \n\nIt's an alarm clock app, but with a twist.\n\nYou set an alarm like normal.\n\nThen you sleep. Zzzz.\n\nLastly, wake up ... to the sound of a friendly voice. :D\n\nCongrats, you've received a nice voice message from someone somewhere else in the world.\n\nThey recorded it while you slept.\n\nIt could be a short story.\n\nA joke.\n\nThe weather report.\n\nSome words of encouragement.\n\n....or a \"Happy Birthday\" message if it's your birthday.\n\nInappropriate messages filtered out, no worries there.\n\nI truly hope it can help spread some kindness in the world, if nothing else.",
   "created_utc": 1703863047,
   "score": 18,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff1ke6",
   "message": "After some time, it becomes depressing",
   "created_utc": 1703861254,
   "score": 5,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff64xx",
   "message": "lonely",
   "created_utc": 1703863128,
   "score": 6,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff9l4y",
   "message": "It’s not very good. \nIt doesn't come right away, I would say. I've been single all my life, I was fine until I was 15, but then I stayed at home for a year. Literally stayed there. I haven't been outside for weeks. I had no one to talk to except my mom. We live in the same room, so I saw and heard her every day! It's been going on until now, I can't stand it, but what should I do? A transitional age? Perhaps, but this feeling has not left me for a very long time. \n\n\nWhat's all this about? Strangely, I if would be alone, I wouldn’t feel lonely. I would not feel lonely, because freedom is the main happiness for a person! If you're trapped in the same circle, if you can't do anything, then you'll be lonely and sad, even if there are a hundreds of people around you.",
   "created_utc": 1703864467,
   "score": 3,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffc0s2",
   "message": "It's really weird as someone with social anxiety. I crave solitude and companionship at the same time. I want to both experience things with a partner but also have a significant portion of it to chill by myself.",
   "created_utc": 1703865390,
   "score": 4,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffff3n",
   "message": "Suffocating at times. Peaceful in others.",
   "created_utc": 1703866665,
   "score": 3,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffpgnl",
   "message": "I used to hate mosquitoes, and still do. \n\nBut nowadays I purposefully leave my window open so they come flying in and bite me. \n\nWhy? Because at least that's a form of interaction with...something.",
   "created_utc": 1703870346,
   "score": 3,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff1dq9",
   "message": "I think about the times I wasn't lonely and how good it felt to have her head rest on my chest. But that's all in time's past. Gotta move on.",
   "created_utc": 1703861175,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff79l7",
   "message": "Meh",
   "created_utc": 1703863570,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff949k",
   "message": "Frightening, to me.",
   "created_utc": 1703864287,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffd9ku",
   "message": "At my job, I was the only person coming onsite during the pandemic while everybody else worked remotely. I think it did impact my mental health a bit.\n\nThen my idiot coworkers came back on-site afterwards and wouldn't shut up about their inane lives and I missed being alone again.",
   "created_utc": 1703865861,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffe1wk",
   "message": "It’s so peaceful",
   "created_utc": 1703866154,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfffvot",
   "message": "It's the feeling when you think about it at night in semi tears, and you want to scream, but then you realise if you did no one would care to hear.  So it would be pointless so you don't, and most night you stay awake thinking what it must be like to have friends.  Let alone a gf (that's when it really hurts) but you've basically never known any different in your life so you sort of don't understand the true extent, you just have a lingering permanent sadness, if you're unable to climb out of the hole it'll eventually lead to chronic depression, to where you will hate your life and wish for nothing more than the end of it all.  Those are the dark parts.\n\nThat's how it was.  For years.  Religion saved me. Now I've experienced those things, I realise I could never go back and how badly underdeveloped I am (but fortunately I'm not introverted, so it's just a matter of time while i speedrun fixing myself and living the experiences I lost out on)",
   "created_utc": 1703866833,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffh27t",
   "message": "People that need to be around people are the loneliest people,I'm always alone and prefer it,I have social anxiety and Don't really go out,learn to be happy on your own and anything else is a bonus",
   "created_utc": 1703867270,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffki0k",
   "message": "doing good or bad things literally doesn't matter because no one is around",
   "created_utc": 1703868541,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfflz0r",
   "message": "Fanta.Fantastic",
   "created_utc": 1703869079,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffo9ma",
   "message": "Pathetic. You start talking to yourself about the same things. Keep wishing you could say them out loud to someone else",
   "created_utc": 1703869914,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffrplv",
   "message": "It's like there are two different worlds. The one in your head, where your own thoughts and daydreams fester, and the other one, outside, in which people live. You've always been in the first one, and will never connect to the second one.",
   "created_utc": 1703871162,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffrq3w",
   "message": "For me, it depends on the circumstances surrounding my loneliness.\n\nWhen I lived with my family, the loneliness felt painful because I felt I was surrounded by people who either didnt want me around or didnt care about me. My family would walk right by me and not say anything. No one would ever check up on me. It was like I was on auto-pilot in the background while everyone else lived life around me. Family would have company and I could hear everything in the house, yet I didnt feel the warmth of their company. \n\nSimilarly, when I was in my longest relationship, it was a LDR so i felt emotional company from my partner but not the physical aspect of their personality, so my heart felt warm around him while i physically felt empty and touch deprived.\n\n\nI now live alone and I am now single. This flavor of loneliness feels empty, hollow. Because I live alone, Im not constantly around people who dont acknowledge me, so im not reminded daily that I am alone in the same way. It sounds weird, but feeling lonely while living in a house full of people is more heartbreaking than feeling lonely while living alone. I go by day to day not hearing a sound other than whatever I decide to play on my game or whatever. I invite guys over occasionally to hook up or do whatever but that doesnt necessarily stop the feeling of loneliness. In my day to day life, I feel nothing. No joy, no sadness, no anger, no love. Often times, when I do contemplate unaliving myself, its not out of depression, its a simple desire to simply stop trying\n\nIt also distorts my sense of time. Every single second feels like years, but the weeks go by without me even realizing. Im just coasting through life on auto-pilot.",
   "created_utc": 1703871167,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffvnez",
   "message": "Like a literal and physical hole inside your chest.",
   "created_utc": 1703872570,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffw7v9",
   "message": "It’s awful. I wouldn’t wish it on my worst enemy because it will, and it does, destroy your being.\n\nYou lose all concept of self-respect. It’s not due to hating yourself because I love who I am and my interests. When I get a sliver of someone by my side, I latch on. I become petrified of losing that. I start to allow them to walk all over me and people can sense that. It’s like a shark in water smelling blood. It creates a perpetual cycle that consists of you always being hurt but you fear loneliness to such a degree that you try to justify their actions in your head. When you do think “I had enough” and do something, they leave and you’re thrown into a bad bout of depression. You want to die. You begin to wonder if you should have just bit your lips. Being taken is far better than having no one, you think. \n\nThose that tell you they’re fine alone are full of shit. They aren’t but they suffer silently because who cares. If we bring it up, we’re opening the door to being used. If we bring it up, we’re just inviting mockery and folks start questioning if something is wrong with us. \n\nI’ve been suicidal. I’ve contemplated if I should die. What especially sucks is I have tried to be super understanding and nice. I have tried to be a good guy, but those I attract always run off. If I bring it up, the narrative is that the common thread is me. I’m the reason they leave and I’ve no idea why. \n\nIt eats at my heart everyday. I have Covid right now and I’ll be honest, I’ve had moments when I think, maybe I should let it take me. Don’t bring up worrying symptoms. \n\nI’m tired.",
   "created_utc": 1703872772,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffx8vz",
   "message": "Idk if it's just me, but I'm getting used to it. Don't get me wrong, there's nothing more beautiful than having lovely/kind people around you. However, after a while, you will get used to it and move on.",
   "created_utc": 1703873141,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff6cmo",
   "message": "Worst feeling ever. Takes over your whole body and nothing can change it",
   "created_utc": 1703863211,
   "score": 2,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffat1i",
   "message": "See your friends talk about something you don't know",
   "created_utc": 1703864935,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff3czy",
   "message": "If you have a brother or sister or cousins, you’re never alone. Seek them out in times of trouble.",
   "created_utc": 1703862005,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffckrj",
   "message": "Maturity is when you release being alone is fucking peaceful rather than spending time with fake persons.",
   "created_utc": 1703865601,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffjnaw",
   "message": "It would have been awesome if redditors, as a collective, had chosen to upvote this post, but **nobody** comment.",
   "created_utc": 1703868228,
   "score": 0,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff6y9h",
   "message": "Feels very bad",
   "created_utc": 1703863447,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kff91ne",
   "message": "It depends if you don't want to know anyone, or if you're getting rejected, you'll not be all alone , remember you've your family, friends, you can be happy if you are satisfied with yourself.\n\nYou're never gonna be happy if you just depend on another one to make you happy \n\nRelationships are great , but it doesn't mean that we will be sad if we didn't find it .",
   "created_utc": 1703864260,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffa6j8",
   "message": "Have you never been lonely?",
   "created_utc": 1703864695,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffa9vq",
   "message": "you dont wanna know",
   "created_utc": 1703864731,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffaqjx",
   "message": "You have to pretend there isnt a wall of ice around you in order not to offend anyone.",
   "created_utc": 1703864908,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffbu0q",
   "message": "It's, well, lonely.",
   "created_utc": 1703865322,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffbzja",
   "message": "It feels hollow and slow",
   "created_utc": 1703865378,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffccys",
   "message": "Great question...I have experiences beyond lonliness. Trancendental atheist.",
   "created_utc": 1703865519,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffchgb",
   "message": "lonely",
   "created_utc": 1703865566,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffcvr1",
   "message": "when they're not involved in your life or the lives of others.\n\nGenuinely lonely folks don't have somebody nearby to recognise the symptoms.",
   "created_utc": 1703865716,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffd1t1",
   "message": "Besides all of the negative things, sometimes you get a comfort from it as you know you can't disappoint anybody due to expectations, whether from other people or created in your own mind.  That can be solace for somebody with esteem issues.",
   "created_utc": 1703865780,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffd3mj",
   "message": "It feels like you’re missing out on life, then you start to think what’s the point if there’s not much here for me anyway lol my pets probs the only reason im still around and the slim chance of reincarnated is a no go.",
   "created_utc": 1703865799,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffdm2v",
   "message": "Lonely",
   "created_utc": 1703865990,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffdvhy",
   "message": "Bad",
   "created_utc": 1703866087,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffe7jh",
   "message": "Maybe I am just the oddball here or maybe , because I’ve been at it so long, it feels like nothing . A bit of history here , I am 51 and grew up with the “if you get hurt , walk it off mentality “and the whole “you’re a guy , guys are not meant to show vulnerability ” etc  . Never had a lasting relationship , no kids, barely talk to anyone .. the list goes on . Sure I was diagnosed with depression and social anxiety a few years back but it’s become such a part of who I am, it doesn’t even bother me .",
   "created_utc": 1703866212,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffeun1",
   "message": "Melancholic. Ethereal. Scary. Sublime. Apocalyptic.",
   "created_utc": 1703866453,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfffk8n",
   "message": "Sucks.",
   "created_utc": 1703866717,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffh0c2",
   "message": "It feels great. Why?\n\nI am not dependent on anyone. I always do everything myself.\n\nI don't care what people think about me. If I do something wrong, no one will laugh at me.\n\n\u0026amp;#x200B;\n\nNo, I am a beautiful and kind person. I have many friends. But I was never called anywhere, no one ever wrote to me, I am a typical invisible friend.",
   "created_utc": 1703867250,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffh9cu",
   "message": "Mental torture",
   "created_utc": 1703867344,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffhdb7",
   "message": "SO GOOD",
   "created_utc": 1703867385,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffhh8d",
   "message": "Empty. The quiet is so loud.",
   "created_utc": 1703867425,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffhtu0",
   "message": "It's an ache. It's painful, sometimes even physically. It can change your entire personality if you let it. Due to circumstances beyond my control I was left pretty much isolated for a year and I became angry, bitter, and felt like no one could ever understand me, which just led me into a cycle of perpetuating my own loneliness.",
   "created_utc": 1703867555,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffi54s",
   "message": "Profound unending sadness",
   "created_utc": 1703867672,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffif9t",
   "message": "I hate it but not much I can do…..",
   "created_utc": 1703867777,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffkh5q",
   "message": "When I’m not busy it is boring as hell",
   "created_utc": 1703868532,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffkniw",
   "message": "if it is your chose to being alone it feels pretty good otherwise its pretty bad",
   "created_utc": 1703868596,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffkyvb",
   "message": "Show me the meaning of being lonelyyyy",
   "created_utc": 1703868711,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfflawe",
   "message": "like sitting in an empty concrete box with small one-way windows that you can't see out of",
   "created_utc": 1703868834,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfflc4q",
   "message": "Sucks... 😂\nPero, sabi nga nila, mindset..... Lang yan",
   "created_utc": 1703868847,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfflh12",
   "message": "You feel ashamed. And also try to hide from it at every possible opportunity. Trying to make friends desperately while not caring about how those people treat u just so u can say: \"atleast I'm not lonely\" but then that person treats u bad so u either stay with them because not being lonely is worse than being in a shitty friendship or u leave them risking to be lonely once again. U feel kinda worthless too. If humans are social beings then u feel like an alien. U slowly become more anxious and get worse at talking to people. It's a really bad feeling that gets worse with each passing second.",
   "created_utc": 1703868896,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfflld2",
   "message": "Idk, I can't explain it. Not having anyone to talk to and share ideas and stories with. Not having anyone to do things with. Feeling empty. Feeling alone all the time, even in a room full of people. Wanting some sort of human contact and interaction. And when you do get some sort of interaction you cling to it for way too long.",
   "created_utc": 1703868939,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffmcsi",
   "message": "painful",
   "created_utc": 1703869218,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffnfj9",
   "message": "Not to sure between myself and I these 2 dont shut up",
   "created_utc": 1703869612,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffnm2d",
   "message": "Not so good",
   "created_utc": 1703869678,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffnx94",
   "message": "Feels like you’re a cat whose owner left alone for the weekend. As you sink into your safe hiding place every noise scares you. You just wish your caregiver comes home. Being lonely is feeling like there’s nobody who cares for you.",
   "created_utc": 1703869791,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffo6o4",
   "message": "i have learned to be comfortable with myself.  understanding myself better.  reading alot.  a lot of self reflection.  clearing my mind.  reaching higher consciouness",
   "created_utc": 1703869885,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffp41n",
   "message": "It feels amazing when no one can hurt my feelings anymore! 🌚",
   "created_utc": 1703870219,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffrqbe",
   "message": "it's bearable but annoying like a toothache",
   "created_utc": 1703871170,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffsq3d",
   "message": "Some days it's a blessing, and sometimes it's the cruellest curse. \n\nI miss the sounds in the background at my family home, people coming and going, my brother in the other room shouting abuse at someone on Xbox Live, my mum shouting up the stairs for us...\n\nNow when I'm at home, and I finish what I am doing, I am greeted with a deafening silence... and it makes me feel like I have to find the next thing to do to fill that silence... so I can never fully rest, I'm always searching for ways to fill the silence because after a while even a TV on in the other room just doesn't do it...",
   "created_utc": 1703871522,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffsqp8",
   "message": "Worst feeling ever. Takes over your whole body and nothing can change it",
   "created_utc": 1703871529,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfft8j6",
   "message": "It feels like something is gradually eating a part of your brain but it's not a threat because it won't eat that much, but then months later you worry that a significant chunk of your brain cells have just vanished.",
   "created_utc": 1703871706,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfftk5c",
   "message": "Like your in the middle of the woods buy your self and everybody is 5000 miles away",
   "created_utc": 1703871822,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffu0wz",
   "message": "The phone saves me from loneliness",
   "created_utc": 1703871991,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffu9oa",
   "message": "I know someone who was constantly, even morbidly lonely, but that's because anyone that she would get close to and/or would get close to her she would push away, try to destroy them, get mad when it wouldn't work on me, then break everything off in spectacular fashion, then write online about how cripplingly lonely she was.  We went through this a few times.  I am guessing she's dead now, which is not a nice thing to say, but she showed me that lonely people aren't always presenting the full picture.  She wrote how she's just lonely and depressed from it, but didn't ever write the flip side that she was unhealthy for anyone around her after honeymoon periods.",
   "created_utc": 1703872078,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffupbv",
   "message": "God awful. Plain and simple.",
   "created_utc": 1703872235,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffupo6",
   "message": "Hurts. Especially when you see your peers having lots of friends and living their best lives.",
   "created_utc": 1703872238,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffvhk2",
   "message": "Feels freeing (no expectation and no standards,just you and a goal or daily routine)\n\nI don’t get how it can be sad (i’d rather have this freedom than be with people i don’t get along with other than just being family or growing up with)",
   "created_utc": 1703872513,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffwaxq",
   "message": "A lonely road crossed another cold state line, miles away from those I love, purpose undefined...",
   "created_utc": 1703872803,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffwoa8",
   "message": "What?",
   "created_utc": 1703872936,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffwp20",
   "message": "Depends on your mood. Sometimes I have fun, other times I stare at my phone. Other days it just feels like I'm just waking up just to sleep again.",
   "created_utc": 1703872944,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffx1ro",
   "message": "Cold",
   "created_utc": 1703873071,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffxa32",
   "message": "80% of the time it feels good. 20% of the time i want to cry",
   "created_utc": 1703873153,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffxxqa",
   "message": "It eats you up.\n\nI have a lot of people around me but I'm lonely.",
   "created_utc": 1703873386,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffy04y",
   "message": "Like if i disappear there’s nobody to even notice im gone.",
   "created_utc": 1703873410,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffyfkh",
   "message": "Peaceful, no drama.",
   "created_utc": 1703873562,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffylvf",
   "message": "The only thing you hear is the chatter in your head, or, whatever stimuli you consciously have to engage in to overwhelm the chatter. \n\nThe worst is in the dead of the night when you realize - we all go into that final sleep alone.",
   "created_utc": 1703873624,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffz796",
   "message": "Lonely",
   "created_utc": 1703873834,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffznzy",
   "message": "Idk. Our ”experience” always comes in ready verbal form.",
   "created_utc": 1703873999,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kffzolt",
   "message": "AI is getting its cheat sheet...",
   "created_utc": 1703874005,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg0wf8",
   "message": "I wish I had the courage to end my life to be honest",
   "created_utc": 1703874440,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg1f8w",
   "message": "Saves money on buying drinks for other people.",
   "created_utc": 1703874630,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg2953",
   "message": "I've only really felt loneliness once for a brief period but it was like a hole in my chest and the edges of it was trying to expand inside of you. That may sound weird but that's the best I can remember cus this was months ago",
   "created_utc": 1703874929,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg2bnd",
   "message": "Have you watched that Black Mirror episode “White Christmas” where it’s possible to block people irl and it shows they’re blurry and no one pays attention? Like that.",
   "created_utc": 1703874954,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg2j5w",
   "message": "Some days it's OK. Some days it's bad...I'm 45, single with a teen. He keeps me company most days, but when he's with his mom, I tend to mope about being alone.\n\nI enjoy being able to wake up and set my own schedule. It stinks though not having a companion to share some experiences with.",
   "created_utc": 1703875027,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg31wz",
   "message": "Loneliness is being surrounded by people but knowing none of them.",
   "created_utc": 1703875215,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg4une",
   "message": "Lonely",
   "created_utc": 1703875857,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg53ct",
   "message": "It’s worse at night.",
   "created_utc": 1703875943,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg57de",
   "message": "it's almost always boring, you need to be able to entertain yourself when you're alone, which is what i am doing right now lol",
   "created_utc": 1703875983,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg5iex",
   "message": "I'm solitary by choice, but I often feel intensely lonely. When I was a kid, I developed a habit of retreating into my imagination to try to get those needs met, which led to me being a very avoidant adult that still longs for connection.   \n\nFor me, loneliness is a very physical feeling, like a big black hole in my chest. The edges of the hole are raw and inflamed. The hole aches.",
   "created_utc": 1703876094,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg5jpz",
   "message": "Sometimes it feels great to be on my own. Sometimes it's suffocating.",
   "created_utc": 1703876106,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg5tn9",
   "message": "It makes you feel insecure about every single thing.",
   "created_utc": 1703876207,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg7k86",
   "message": "Like someone threw me into space from their space shuttle watched as I froze into a husk and died. Very empty and strangely sore.",
   "created_utc": 1703876835,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg7kcn",
   "message": "You feel there's nobody for you in the good nor bad times. Nobody to have your back when you have hit rock bottom, not even in an altruistic way, as well as nobody to cheer you up for your goals and you feel like the world is your oyster.\n\nAnd it also comes down to the basics and trivial aspects. You don't have anyone to be enthusiast about your new hobbies, likes, series, and so on. Same with the oppositive, you don't have anyone to bum about your favourite show being cancelled. \n\nThere's nobody there for you for anything, neither the most pivotal events nor the silliest and trivial aspects in your life. \n\nYou must keep to yourself everything. Celebrate and toast or be sad and scream inside your head, and carry on.",
   "created_utc": 1703876836,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg9iw3",
   "message": "You have a thousand people around you but the problem is, you have no one around you.",
   "created_utc": 1703877552,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfg9yxk",
   "message": "The worst is having people around you friends etc and still feeling so painfully alone. Gets a lot worse during Xmas time lol.",
   "created_utc": 1703877715,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgbfr9",
   "message": "Like 10000 stabbings taking place all at one",
   "created_utc": 1703878249,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgbh1r",
   "message": "I would say that it's bad and to be honest, i do feel jealous seeing people being able to find a relationship, but for someone that is witnessing their own generation implode and argue for the most idiotic things possible, i would really rather date someone that is older than me than someone from my own generation, a.k.a. Gen Z",
   "created_utc": 1703878262,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgbtkh",
   "message": "You learn to live with it unfortunately. I have friends; been in a relationship but I still feel incredibly alone a lot. In my case; I’m too different and radical, the people around me don’t get me and to be fair only a handful of people I’ve met in my life have. Take the loneliness and let it fuel you; I’ve advanced so far in my career and dreams because I keep myself busy to avoid feeling alone. Mental illness comes to play too, I have BPD and there are days where I literally want to crawl in a dirt hole and stay there. Finding a community online helps",
   "created_utc": 1703878393,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgca6b",
   "message": "You just hate yourself overtime",
   "created_utc": 1703878560,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgd8jk",
   "message": "It sounds perfect to me..",
   "created_utc": 1703878910,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgdaiv",
   "message": "If you don't know, you are one of the luckiest people on the planet.",
   "created_utc": 1703878931,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgect3",
   "message": "       It's terrible. Truly horrible. At first you my think it's cool and everything but the more time you spend alone the more fucked up it gets. You start getting delusional. I've had episodes of pure sadness and melancholy quite a lot lately. \n\n       Have you heard of those people that have an internal narrative? Yes I'm one of them. But what if instead of 1 voice you had 2 (or 3) inside your head. That's also me. Some follow my line of thought, others tell me what I don't want to hear and then there are those that tell me to hurt myself. Gladly, I've never taken that step. My conscience steps up at those moments and tells me that that's a stupid idea. For now, I'm only in dread with myself.\n\n        For me, it all started in 9th grade when we got to go back to school after lockdown had ended (at least that's how it was in my native country). I suffered from asthma and severe allergies and my immune system decided to fight the detergent we used to clean the tables; I had an asthma attack. We tried to suggest the school to use other detergents but they had already bought a full stock (which makes sense afterall). I couldn't go to school in those conditions so my parents submitted a paper that made me have to stay at home having classes. Here's the catch: school didn't care shit and they didn't even have a plan for those kids that were in this type of situation. What happened? Yep, this mate here had to go through a whole year of teaching 9 whole subjects to himself. What about friends? Those that weren't occupied were afraid of getting COVID (which is understandable). So I started getting lonely.\n        At the end of the year (last trimester of that school year) my mom found a treatment for the allergies and it did solve my problems. When I wanted to go back, i was denied since once I submitted THAT paper I couldn't go back and \"unsubmit\" it. I was devastated. \n\n        Well, next year we moved on to another country. Since I was only 3 years old from college my parents spoke with me and we agreed it was best for me to give continuity to my country's studies and stay homeschooled. This time was a different type of homeschooling. We found that there was this school that offered a special type of teaching for those that couldn't attend normal school (due to disease, being outside of the country or being a federated athlete). I did have a different teacher for the different subjects and classmates but it's all like if we were back in lockdown. I actually made a friend that I meet with when I go to my birth country but in the meantime, it's still lonely as hell.\n        Why not go to the local school you may ask? Well, we acknowledged the local teaching system and it is far different from my country's. Where I am now, students don't get the amount of stress I get in my country's school. Why?, well: here they care for mental stability; there they don't. It does have some advantages though as (compared to what I've seen with my sister's college classmates) we prepare our students way better for college life and subjects. \n         \n         Here I am, in a country which language I do not understand, with my friends miles away and spending most of my day at home. It is lonely for sure. I do experience some mental side effects but I think I'll go through it. I already see the light at the end of the tunnel (with this light being my departure to college and a more social life).\n\nEDIT: spelling and grammar.",
   "created_utc": 1703879320,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgetl3",
   "message": "Ok sometimes and bad sometimes",
   "created_utc": 1703879488,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgg4ph",
   "message": "Well if you have everything and you still are sad you are lonely, also when you eat alone.",
   "created_utc": 1703879962,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfggrum",
   "message": "I happy",
   "created_utc": 1703880196,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgh1q7",
   "message": "It feels like being trapped in a transparent bubble, where you can see everyone and they can see you.  But you’re trapped with your own thoughts, fears and doubts bouncing around inside the bubble with you.  Some days you can handle it and other days you want to reach out, but the bubble gets in the way.",
   "created_utc": 1703880295,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgi45l",
   "message": "It is worst when you are at the mall and EVERYBODY ELSE is with someone: kids (how to have one when you don't even get touched), friends (yours are always occupied [with their family]) or a boyfriend/ husband.\nIn the rest of the time it is ok. I like my company.",
   "created_utc": 1703880685,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgidr7",
   "message": "No1 is lonely",
   "created_utc": 1703880782,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgkzkx",
   "message": "It’s debilitating",
   "created_utc": 1703881733,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgl280",
   "message": "it feels shit but remember, it's your fault.",
   "created_utc": 1703881760,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgmxyl",
   "message": "Difficult, part of it is great being on my own, but damaging when trying to socialize.",
   "created_utc": 1703882445,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgn3ex",
   "message": "Feeling lonely feels like you have a knife in your side and every time you try and get comfortable, you only end up pushing the knife deeper or twisting the blade, If you are feeling lonely, you aren't alone, ask somebody who looks alone if they want to be friends and take the knife back, you can do this.",
   "created_utc": 1703882500,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgpg01",
   "message": "Like being invisible, people literally have walked into me because they didn't know I was there",
   "created_utc": 1703883367,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgq18v",
   "message": "Hurts in the pit of stomach",
   "created_utc": 1703883587,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgq4jo",
   "message": "Silence, empty air",
   "created_utc": 1703883622,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgqv8j",
   "message": "Its weird accually. Sometimes it feels sad but as a human we need to try to be happy alone. Being lonely is so peacful if u were good with urself because at the end we just gonna be alone and die alone",
   "created_utc": 1703883896,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgrgme",
   "message": "Wanting love, but not finding it",
   "created_utc": 1703884118,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgstz4",
   "message": "rather lonely than surrounded by fake people",
   "created_utc": 1703884630,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgt6k3",
   "message": "I‘m 23, it was my 5th Christmas i spent alone. It will be the first time this year spending New Years Eve, which is also my 24th Birthday, alone and it‘s the first time I realize how fucked up this is. It‘s just sad",
   "created_utc": 1703884761,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgttmq",
   "message": "An emptiness in your soul and body which you get very familiar and comfortable with and can be very hard to get out of / let go of without professional support.",
   "created_utc": 1703884999,
   "score": 1,
   "submission_id": "18tomha"
  },
  {
   "comment_id": "kfgtts8",
   "message": "Sometimes being alone feels good. And sometimes loneliness feels awful. I think it s a state of mind, this “loneliness”, because there s a diference between “alone” and “lonely”. I think “alone” is a choice and “ lonely - loneliness” is a feeling. I am most of the time alone, but sometimes i feel so lonely, mostly at night. And it sucks, because i feel that i don t belong, nowhere, to nobody. I feel lost and confused, sometimes angry, sometimes sad.",
   "created_utc": 1703885000,
   "score": 1,
   "submission_id": "18tomha"
  }
 ]
}