{
 "submission_id": "18trwam",
 "title": "Ladies, if you and your man go out to eat and your friend tags along, do you expect your man to pay for your friend? Why or why not?",
 "selftext": "",
 "created_utc": 1703869605,
 "permalink": "/r/AskReddit/comments/18trwam/ladies_if_you_and_your_man_go_out_to_eat_and_your/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18trwam/ladies_if_you_and_your_man_go_out_to_eat_and_your/",
 "comments": [
  {
   "comment_id": "kffnw26",
   "message": "God no. I don't expect anybody to pay for anyone else",
   "created_utc": 1703869779,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffo6cg",
   "message": "If I said “We’re trying out that new place on the coast tonight.” And my friend says “I’ve been wanting to try that! Mind if I tag along” 100% she’s paying for herself since she invited herself. \n\nIf I say “we’re trying that place on the new place on the coast tonight, you wanna come” I still wouldn’t expect him us pay, but wouldn’t be upset if we did. \n\nWe buy each other food all the time, so it’s not like she wouldn’t get me back. And if she didn’t it’s not a huge loss",
   "created_utc": 1703869882,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffo9jk",
   "message": "Hell no. I'm the only one who earns anyway so I dunno how he'd afford it haha but no way. He's not under any obligated to pay for me or my friend.",
   "created_utc": 1703869913,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffnn1g",
   "message": "It wouldn’t be expected, no. At the same time, it’d feel pedantic making my friend pay for their own meal.",
   "created_utc": 1703869688,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffodwe",
   "message": "Sorry? Pay for your own food you scrounger.",
   "created_utc": 1703869958,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffocs2",
   "message": "Unless he specifically invited her to come with, no, of course not.",
   "created_utc": 1703869947,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffokdr",
   "message": "No, I would never expect him to pay for my friend, especially if the friend invited herself along. It might be different if he invited her out or insisted she come along, but if she invited herself, then the payment is her responsibility.",
   "created_utc": 1703870023,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffp7wv",
   "message": "Depends on Situation. If its planned, no. If its kind off a random \"oh hey lets grab a bite\" then he or me or another friend pay if someone doesnt have money with them.",
   "created_utc": 1703870258,
   "score": 1,
   "submission_id": "18trwam"
  },
  {
   "comment_id": "kffr49r",
   "message": "No because if you’re tagging along, I’d assume you have money to spend.",
   "created_utc": 1703870949,
   "score": 1,
   "submission_id": "18trwam"
  }
 ]
}