{
 "submission_id": "18u8uvk",
 "title": "What was a time where you almost died?",
 "selftext": "",
 "created_utc": 1703917070,
 "permalink": "/r/AskReddit/comments/18u8uvk/what_was_a_time_where_you_almost_died/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/18u8uvk/what_was_a_time_where_you_almost_died/",
 "comments": [
  {
   "comment_id": "kfivsf1",
   "message": "I was performing in my school festival once when I slipped and was going to fall,but thankfully, someone catch me before getting hurt.",
   "created_utc": 1703917369,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfivut4",
   "message": "Nearly hit by a van on my motorcycle",
   "created_utc": 1703917410,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfivx1d",
   "message": "Riding a bicycle and I was hit by a truck. The bicycle was so fucked up but fortunately I survived with minor injuries. Also a typhoid fever + dengue at the same time when I was a kid.",
   "created_utc": 1703917448,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfiw39y",
   "message": "I relapsed from alcohol and drank half a bottle of sleeping pills.",
   "created_utc": 1703917557,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfiw82h",
   "message": "Riding a fixed gear bike for the first time in the city without training the “reverse pressure” muscles. Got fatigued/cramped legs coming to a stop and fell into the intersection with cars going 40+ mph. Missed by inches and still get queazy thinking about it.",
   "created_utc": 1703917641,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfiwa53",
   "message": "Brain surgery after\n falling and hitting head and bleeding out of my ear  \n\n I am lucky so much better off than most brain injured people",
   "created_utc": 1703917678,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfiwkpj",
   "message": "I was visiting my husband's country. Someone gave me moonshine to try.  I downed a whole glass.  It wasn't real alcohol. I had to go to the hospital in the capital and get my stomach pumped and experience the joys of a hospital in a third world country where you play Russian roulette with your life. Luckily we had money to pay them.\n\nI never touched or drank alcohol again. I've been sober 13 years.",
   "created_utc": 1703917862,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfizk5r",
   "message": "Just a week ago..my (61f) and bf (63m) were both recovering from first time ever Covid and after antivirals my cough got super bad and I have asthma and copd so was started on antibiotics to hedge that. After meds were done and all had lost 20 lbs in 2 weeks and just very week with the runs from antibiotics. Ended up on toilet and felt really weird. Called my bf with help. By the time bf got to me my lips were turning blue and he couldn’t get me to wake up. Next thing I know I am waking up yo paramedics talking to me. So surreal. Ride to the hospital, tests run, fluids given and everything was okay. Just from loss of fluids and all that it was a short visit and weird as all hell.",
   "created_utc": 1703919800,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfj2ock",
   "message": "Got caught in a riptide, couldn't come up, I eventually gave up and went limp. Felt weirdly serene. Then I was spit out. Very scary in retrospect.",
   "created_utc": 1703921944,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfj8ox1",
   "message": "I've been in a house fire, I've been in a car accident where we flipped over several times and landed upside down, I've gotten alcohol poisoning, I've had a gun pulled on me and one night I did way too much cocaine to the point where I actually thought I was going to die!!!!\n\n(Take your pick)🤔",
   "created_utc": 1703926369,
   "score": 1,
   "submission_id": "18u8uvk"
  },
  {
   "comment_id": "kfjb94h",
   "message": "Was mowing the side if a ditch at like 10-15mph (sounds slow but imagine running speed). I'm on a big rider mower and was looking at the grass, making sure I'm going straight since I'm on a sideways incline, but then I look up and I'm about to collide from the chin upwards with an aluminum roadsign, and just barely dodge my head around it. The mower would not have stopped, and the sign would not have bent",
   "created_utc": 1703928332,
   "score": 1,
   "submission_id": "18u8uvk"
  }
 ]
}