{
 "submission_id": "18uklso",
 "title": "What is a step in food recipes that you always skip?",
 "selftext": "",
 "created_utc": 1703956972,
 "permalink": "/r/AskReddit/comments/18uklso/what_is_a_step_in_food_recipes_that_you_always/",
 "score": 21,
 "url": "https://www.reddit.com/r/AskReddit/comments/18uklso/what_is_a_step_in_food_recipes_that_you_always/",
 "comments": [
  {
   "comment_id": "kfl3bb4",
   "message": "Sorry but I dont have that one exotic ingredient that costs 20 bucks and can only be used once.",
   "created_utc": 1703960842,
   "score": 23,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfktnbg",
   "message": "Their life story.",
   "created_utc": 1703957306,
   "score": 23,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfl33vx",
   "message": "Adding garlic and onion at the same time. That's just a recipe for burnt garlic.",
   "created_utc": 1703960767,
   "score": 234,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflznfq",
   "message": "For soups, I skip the veggie amount and just use the whole thing of whatever I have. 1/2 cup onion? No, the entire onion is going in. 3 sticks celery? No, using however much is in the fridge. It’ll be fine.",
   "created_utc": 1703972843,
   "score": 68,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfkvs7s",
   "message": "Seasonings. I feel like the amounts mentioned are suggestions. I will always, without fail, add more garlic.",
   "created_utc": 1703958086,
   "score": 102,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfl7ymz",
   "message": "I ignore the suggested  measurements for cooking, and have enough experience to be able to guess how much.  Baking, I weigh using a gram scale",
   "created_utc": 1703962529,
   "score": 252,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfktdcc",
   "message": "I only sift flour if I feel it needs it...and it rarely does.  LOL\n\nThis drives some purists nuts, but it honestly hasn't affected anything I baked.",
   "created_utc": 1703957202,
   "score": 191,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmhve0",
   "message": "Measuring out the water to cook any type of pasta. I don't need to measure, I just know",
   "created_utc": 1703979850,
   "score": 128,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfkuyw8",
   "message": "There's never enough seasoning in many online blog mom recipes, so I almost always add more or different kinds.",
   "created_utc": 1703957791,
   "score": 26,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfl8rbo",
   "message": "I'm still kinda miffed at a recipe I found years ago. According to the recipe I had to finely chop the chocolate, before melting it and mixing it into the brownie batter.\nNo way am I spending time choping, and getting a chopping board and knife dirty in order to chop up chocolate I'm then gonna melt anyway.",
   "created_utc": 1703962821,
   "score": 73,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfljs6h",
   "message": "Measuring seasonings. My ancestors will tell me when it is enough.",
   "created_utc": 1703966843,
   "score": 181,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflqfz0",
   "message": "Start cooking the pasta before i start everything else. I always start making the sauce and such and then start cooking the pasta. Otherwise pasta is done before everything else.\n\nAlso set the temperature of the oven as first step, i do it later when I think i have few minutes left making the recipe.\n\nAnd whisking egg yolk before whisking egg white. I do it the other way around, otherwise the egg white could get contaminated with the fatty parts of egg yolk and it won't get fluffy.",
   "created_utc": 1703969342,
   "score": 38,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfle593",
   "message": "Skinning potatoes.  They're so much tastier with the skin still there, whether whole or mashed.",
   "created_utc": 1703964778,
   "score": 87,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflgk9o",
   "message": "Boiling the water. I always use the kettle and pour the hot water in the pan when I make spaghetti",
   "created_utc": 1703965658,
   "score": 223,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflw2my",
   "message": "Only adding 1-2 cloves of garlic. There are no limits to this. No recipe can dictate how much garlic I add. I simply keep cutting until the spirits tell to stop.",
   "created_utc": 1703971482,
   "score": 245,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflq9co",
   "message": "Adding only a little vanilla extract, I'll just pour until my heart's content.",
   "created_utc": 1703969273,
   "score": 243,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflj7bs",
   "message": "I don't sift the flour.",
   "created_utc": 1703966628,
   "score": 127,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflzfh3",
   "message": "I restructure  baking recipes to use a single bowl.  I start with liquids, add in the sugars and seasonings, add in baking soda/powder, then flour.\n\nI've never had a problem, but I also move quickly.",
   "created_utc": 1703972758,
   "score": 155,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfls7v9",
   "message": "I am never EVER boiling my tomatoes and skinning them to make a sauce. The very definition of extra.",
   "created_utc": 1703970011,
   "score": 53,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfku1fr",
   "message": "I know that the measurements for solids and liquids are different, but I use the wrong cups anyway.",
   "created_utc": 1703957452,
   "score": 214,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflyy2x",
   "message": "Preheat oven to 350 THEN start making the recipe.  That way, my oven would be on for a long time before I even finished making the recipe.",
   "created_utc": 1703972572,
   "score": 104,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfled8c",
   "message": "Let sit then serve, we eating this right now.",
   "created_utc": 1703964860,
   "score": 121,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflies8",
   "message": "pre-heat the ~~oven~~ airfryer",
   "created_utc": 1703966336,
   "score": 107,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflnfki",
   "message": "Peeling ginger. Not necessary and if you're going to do it use  a spoon to scrape off the skin gently. That way you'll not waste any.",
   "created_utc": 1703968206,
   "score": 75,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmd3qh",
   "message": "Using room temperature eggs for baking when a recipe calls for that. I’ll soften butter in the microwave when softened butter is called for, but eggs are going in straight from the refrigerator.",
   "created_utc": 1703977981,
   "score": 100,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmjapv",
   "message": "Washing chicken is something I still see popping up in recipes I've never bothered with. Feel like I'm more likely to contaminate my sink than achieve any notably positive outcomes.",
   "created_utc": 1703980405,
   "score": 54,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfl8z19",
   "message": "Not 100% (like I wouldn’t do this for gumbo) but if a soup recipe calls for adding flour as a thickener / roux in the beginning that recipe probably derives from a time when flour was the only available thickener. I’ll skip that step and add a cornstarch slurry at the end. It’s more predictable, harder to screw up, and affects the overall flavor of the soup less.",
   "created_utc": 1703962900,
   "score": 19,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflhzfv",
   "message": "I rarely sift flour - I just run the beater in the mixer a few times instead",
   "created_utc": 1703966178,
   "score": 46,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflkq9x",
   "message": "\"Enjoy.\"",
   "created_utc": 1703967199,
   "score": 74,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflule1",
   "message": "Measuring any seasoning",
   "created_utc": 1703970918,
   "score": 18,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfm9jrz",
   "message": "\"Continue prepping ingredients while the chicken sautes.\"\n\nNope.  All the prep is being done first.  I'm not stumbling through your poorly explained steps for the first time with something on the stovetop because you wanted to save a minute.\n\nIs it faster?  Probably once you have the steps memorized.  But it's not worth arguing with my amoke detector about on the first run through.",
   "created_utc": 1703976603,
   "score": 52,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflv9u6",
   "message": "I never heat up the oven as a first step. I guess I'm really slow but it would just end up being on for way too long and me being stressed because the oven has reached the right temperature and I'm still at the second step.",
   "created_utc": 1703971179,
   "score": 55,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfn2ks5",
   "message": "Garnish cause I’m lazy and I don’t insta my food",
   "created_utc": 1703987946,
   "score": 14,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmg9i0",
   "message": "“Mince garlic” fuck you that shit goes through the press",
   "created_utc": 1703979223,
   "score": 12,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfme2sw",
   "message": "I never add a specific amount of water before boiling it. I just fill it up and put it on the stove",
   "created_utc": 1703978364,
   "score": 11,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfm94hc",
   "message": "At the end when it tells me to let it cool off before eating.",
   "created_utc": 1703976442,
   "score": 10,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmyec9",
   "message": "Using unsalted butter. The amount of salt in butter isn't enough to worry about keeping two kinds in the fridge.",
   "created_utc": 1703986344,
   "score": 11,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kflnu4l",
   "message": "If you tell me to mince garlic, I'm going to ignore it. If it's a marinade then garlic cloves go in the blender whole along with whatever else is part of it. If it's supposed to be sauteed then I'm using a garlic press. I hate how sticky garlic is and having to fuss around trying to mince a tiny clove.",
   "created_utc": 1703968357,
   "score": 62,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmk6wt",
   "message": "I use regular butter; never unsalted. I've compared the taste of finished products made by others with unsalted butter to mine with regular butter and can't tell any difference",
   "created_utc": 1703980758,
   "score": 41,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmfose",
   "message": "Most of these I'm like \"Yeah, that makes sense\" or \"that could probably be skipped with no problem\" but a couple of y'all are insane and I have no desire to taste your food.",
   "created_utc": 1703978994,
   "score": 49,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfm1fvf",
   "message": "Peeling potatoes for mashed potatoes. The skin has nutrients and texture, and I don’t have the time to make it worth it.",
   "created_utc": 1703973525,
   "score": 28,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfma6go",
   "message": "Quantities of cheese. You must listen to your heart in the moment.",
   "created_utc": 1703976842,
   "score": 28,
   "submission_id": "18uklso"
  },
  {
   "comment_id": "kfmuqdl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18uklso"
  }
 ]
}