{
 "submission_id": "18ukrce",
 "title": "[Serious] What’s the greatest lesson you’ve taught yourself?",
 "selftext": "",
 "created_utc": 1703957379,
 "permalink": "/r/AskReddit/comments/18ukrce/serious_whats_the_greatest_lesson_youve_taught/",
 "score": 8,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ukrce/serious_whats_the_greatest_lesson_youve_taught/",
 "comments": [
  {
   "comment_id": "kfktufa",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703957380,
   "score": 1,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfktz3f",
   "message": "Being unapologetic about myself. \n\nI’m legally deaf, legally blind.\n\nI’m an EMT and I’ve been discriminated against, doubted, you name it. \n\nI’m not apologetic or afraid to pull punches when someone becomes a prick.",
   "created_utc": 1703957428,
   "score": 5,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkuw56",
   "message": "Life is like a glass vase. Yes it starts out like that. But people are bound to come by and knock it over, whether it be purposely or accidentally. It will fall and break. Shatter to big or small pieces. It’s your choice to bend down, pick up your shattered vase, and with the right instruments, reshape it into something new. And sometimes you have to do that over and over. And one day you’ll finally reshape it into something so sturdy it’ll take a lot to break it again.",
   "created_utc": 1703957763,
   "score": 3,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkuk9r",
   "message": "You should always do and pursue what you love and are passionate about and be happy until the last moment.",
   "created_utc": 1703957644,
   "score": 3,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkv1qf",
   "message": "Love yourself, if you don't, you'll find someone and then that someone will probably break you even more.",
   "created_utc": 1703957820,
   "score": 3,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkvrj9",
   "message": "Boundaries with people. The ability to say no to people.",
   "created_utc": 1703958079,
   "score": 3,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkvni4",
   "message": "That I need to mind my own business",
   "created_utc": 1703958038,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkvqkm",
   "message": "To value my own time. It's limited and therefore valuable. If you don't respect my time I have no time for you.",
   "created_utc": 1703958069,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkwixr",
   "message": "Anyone can say \"I love you\" but actions speak louder than words. Also if someone says \"don't worry about that guy, he's like a brother to me\" it means they're already fucking behind your back. :)",
   "created_utc": 1703958358,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkx3ik",
   "message": "Being myself instead of pretending to be whoever I think people want me to be. Living behind a mask is exhausting.",
   "created_utc": 1703958569,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkyahv",
   "message": "Don’t compare yourself to anyone. Everyone else’s success doesn’t mean you should rush at life.",
   "created_utc": 1703958999,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkygp4",
   "message": "Don’t overthink too much. Seize the opportunity cause it could go away any second. Don’t assume things.",
   "created_utc": 1703959061,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfl1hdq",
   "message": "Stop trying to please others and instead focus on what makes me happy.",
   "created_utc": 1703960176,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfl2skh",
   "message": "To accept peoples incorrect perceptions of me knowing I cant ever change them",
   "created_utc": 1703960651,
   "score": 2,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfkzyk7",
   "message": "Don’t commit to a relationship just because you “can’t find anything better.”",
   "created_utc": 1703959611,
   "score": 1,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kfl6pw9",
   "message": "nobodys coming to save u. \n\nand im responsible for my healing.",
   "created_utc": 1703962076,
   "score": 1,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kflaq74",
   "message": "Give it time. \n\nI can be really quick to make big decisions because I think my current emotion about something is permanent. I get excited, or into something new, or have an experience that I perceive as negative at the time and  I'll want to make a permanent decision based on that. \n\nFound a dog? I wanna keep her!\nDiscovered a fun activity? This is my life's purpose now! \nReceived criticism about something? Fine I'll never do it again.\n\nI have found that once I give those things time I will find that I don't need another dog and I should find her a home. It's okay not to buy a bunch of expensive equipment because I wanna learn to play guitar. It's ok to be not perfect at something and still enjoy it, and get better.\n\nJust taking time to make decisions has made my life a lot better.",
   "created_utc": 1703963534,
   "score": 1,
   "submission_id": "18ukrce"
  },
  {
   "comment_id": "kflrz85",
   "message": "Not to expect anything for anyone",
   "created_utc": 1703969919,
   "score": 1,
   "submission_id": "18ukrce"
  }
 ]
}