{
 "submission_id": "18umjrf",
 "title": "What is the craziest secret you found out?",
 "selftext": "",
 "created_utc": 1703962069,
 "permalink": "/r/AskReddit/comments/18umjrf/what_is_the_craziest_secret_you_found_out/",
 "score": 132,
 "url": "https://www.reddit.com/r/AskReddit/comments/18umjrf/what_is_the_craziest_secret_you_found_out/",
 "comments": [
  {
   "comment_id": "kfltko1",
   "message": "My grandma announced to the family on Xmas Eve several years ago that my uncle (58 at the time, oldest of 4) had a different dad and only told us because his real dad was about to die after she had been sneaking off to take care of him for the 6 months prior.\n\nThen she kicked everybody out of the house.",
   "created_utc": 1703970528,
   "score": 102,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflxgtx",
   "message": "Not me, a friend at work about 20 years ago.  She was older than me, but we were good work friends. Her father had passed several years earlier, and when her mother passed, her brother and her would take the weekends to clean out the house to sell it.  They found a box in the attic with piles of Polaroid pictures, 8 mm movies and VHS tapes.  The pictures were of their parents and their close friends, two other couples whom she'd known since birth - the couples were lifelong friends and the kids all grew up together.  They vacationed together, spent holidays together, and had a lot of sleep overs over the years.\n\nAll of the pictures were of the couples having sex together, with each other, etc., and looked liked they spanned decades.  She assumed the tapes and the movies were all the same - she and her brother had no desire to find out.  She had no idea if any of the other couples' kids had any idea - she and her brother never suspected that their parents were swingers with their close friends.  They burned everything and decided to not mention anything to the rest of the family and the kids of the other couples.",
   "created_utc": 1703972009,
   "score": 50,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm0hqa",
   "message": "I witnessed a man confessing to his wife he’s gay and sleeping with his ex-wife’s 21 year old step son on a plane. Yes, this man has been married to women twice and is now having sex with his ex-wife’s new partner’s son.",
   "created_utc": 1703973164,
   "score": 26,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflj8gm",
   "message": "I was looking to get an athletic scholarship in high school and so I never drank. I also had a minivan. These two facts meant I was the DD.\n\nOne night, I loaded the van up with a group of drunkards after a party. I dropped some people off at home but a few of my friends wanted to go to McDonald's. \n\nWe're sitting in the van eating our food when somebody asks, \"Who's phone is this?\"\n\nThey go through the messages and find out it belongs to our friend \"Brian\". As they read the messages they uncover that Brian is in a secret relationship with his best friend's mother and has gotten her pregnant. \n\nShe ended up having the baby. We were 17 at the time. Looking back we should have said something but we never did and as far as I know this is still a secret.",
   "created_utc": 1703966641,
   "score": 206,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflmkry",
   "message": "My mother told me i suffered from hypoxia during birth to give me a reason for my \"specialties\" (autistic traits and poor  motorskills). When i got to meet my biological father He nearly lost it, she simply smoked and drank during pregnancy",
   "created_utc": 1703967886,
   "score": 125,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmp9gl",
   "message": "After my grandfather died, my aunts found paperwork showing that he had been living under an assumed name for most of his life but they never could learn his original identity. He enlisted in WW2 to keep from going to prison a 2nd time, per his own story sharing. They learned that when he enlisted he changed his name, which was apparently much easier to do back then before SS numbers",
   "created_utc": 1703982732,
   "score": 8,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflsw21",
   "message": "I was adopted but then my parents used the reclaim the baby thing and got me back",
   "created_utc": 1703970266,
   "score": 176,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfllibz",
   "message": "The house I grew up in all the rooms had different colored walls: the living room was blue, the kitchen was yellow, one of the bedrooms was green etc. My mom has always hated white walls and still does till this day for some reason.\n\nAbout a year ago my mother told me that the entry/hallway room was painted red because my dad once stabbed my mom in the lung with a screwdriver and she couldn’t get the blood of. So while me and my sister wasn’t there she got the walls painted in a hurry to cover up the blood. I lived in that house for 10 years growing up without knowing…",
   "created_utc": 1703967489,
   "score": 150,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmnqzd",
   "message": "The parents of a friend of mine had passed off their 2nd daughter as their 1st daughter (who passed away as a baby) for about 20 years.\n\nSo the 1st daughter passed away as a baby, and upon having a 2nd daughter, the parents allocated the identity and age of their 1st daughter to her.\n\nI don't know how they did this and managed to pass it off for so long, but it may have had something to do with them moving from one country to the next.\n\nShe struggled through school and somewhat obviously so because when she was actually thirteen-years-old, she was being told that she was fifteen.\n\nShe discovered the truth after her 21st birthday, when, in fact, it was only her nineteenth birthday, and this discovery played so much havoc with her life that she needed lawyers to prove that she even existed since there was apparently no record of her birth.\n\nAnd there was the legal complications of an underage girl obtaining a driver's license, consuming alcohol, smoking, age of consent, accessing nightclubs, etc.  There was also the feeling of betrayal, the pressure applied to her over school when she wasn't even meant to be in the high school classroom until two years later.\n\nAs I understand it, she now has a birth certificate, her own birth date.",
   "created_utc": 1703982145,
   "score": 97,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmfkl5",
   "message": "I used to work for the coroner. One of the calls my boss had was a friend of mine. We were told by his family he died in a tragic accident.\n\nI mentioned it to my boss because the circumstances were odd. The accident didn't make a lot of sense. My boss let it slip that it was a suicide.\n\nI can never tell any of my mutual friends what actually happened. Our friend was our hero. I have to keep this a secret for the rest of my life. This happened a while ago and it still kills me.\n\nedit - minor edit to be less specific. This post is blowing up.\n\nedit 2.0 - same as the last.",
   "created_utc": 1703978948,
   "score": 216,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflx2xx",
   "message": "Not entirely sure this counts as a secret, but after my father attempted to murder-suicide me and my family, the police told us that there was evidence that the firing pin in the rifle hit the round. It just never went off. Literally only alive due to faulty ammunition.",
   "created_utc": 1703971863,
   "score": 236,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflptwu",
   "message": "My uncle (on my dads side) who’s a pretty respectable professor at an university went to prison for 2 years for killing his 15 year old brother (he was 13). He hid the body in a pond and killed a cat to disguise the smell.\n\nAlso apparently I was ‘betrothed’ to my mother’s (biological) brother since before I was born 🫠. Fortunately he decided he couldn’t wait and married someone else when I was 10\n\nedit: Since people are asking:\n\n1. I don’t know why he killed his brother. \n\n2. I’m from S.India. Cousin marriages are common in my family (but only cross cousins are allowed). If you’re a girl, that means your mother’s brother or his sons. If you’re a boy, it’s your father’s sister’s daughters (It is uncommon to marry your father’s sister because she’s usually older).",
   "created_utc": 1703969110,
   "score": 198,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmr6o9",
   "message": "Not mine, but a friend. She was a private investigator and sometimes they did these \"decoy\" cases where they sent a pretty woman to see if the client's husband/boyfriend would flirt/hit on her/cheat on the client and get photos. Well, my friend's coworker told her that years before she worked there, they had a decoy case and the decoy investigator ended up sleeping with the man, got pregnant, and moved in with him and the head honcho bosses of the PI agency never found out.",
   "created_utc": 1703983488,
   "score": 175,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflvc3v",
   "message": "Was with this woman for years. We have a son. Moved across the country together. It wasn't until after I moved here that I learned her sister is a product of incest.",
   "created_utc": 1703971202,
   "score": 76,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm79hw",
   "message": "Apparently, I had a great-uncle who was a pedophile and got his mentally handicapped foster daughter pregnant. I didn't know I even had a great-uncle",
   "created_utc": 1703975732,
   "score": 153,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfls1m6",
   "message": "I went to recover an old email with my phone number. An extra account popped up to recover that looked like ex-girlfriend of 10 years ago. The curiosity got the better of me and I logged in. Lots of junk, but when I looked into sent email I found several correspondence from craigslist ads seeking other married women for a discrete no strings sexual relationship. She was married with a child at the time. I had no idea she ever liked women.",
   "created_utc": 1703969944,
   "score": 233,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfnqa1p",
   "message": "McDonald’s Big Mac sauce is assembled with Mayonaise, Salt + Pepper, Paprika, Mustard, Relish, and onion powder",
   "created_utc": 1703997800,
   "score": 113,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm8n1z",
   "message": "I remember my great grandfather being one of the nicest men I knew when I was a child. When he passed away I found a helmet hanging from a nail in his garage. It had a weird mark on it that I didn’t understand at the time. Years later, the family explained to me that, not only was great grandpa a Nazi, he had actually left Germany before the war and returned to fight because he believed in the cause so much… He was apparently one of those nazis that America gave a pass to in exchange for knowledge. Something to do with power generation. He spent the back half of his life managing power plants in New York.",
   "created_utc": 1703976258,
   "score": 139,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmf6m7",
   "message": "I had always thought my mother was the oldest of 7. I found out when I was 13 that my grandmother actually had 3 kids before my moms family and basically left them when she met my grandfather. This was revealed my by other grandma after she consumed 2 glasses of white Zinfandel at a TGI Fridays.",
   "created_utc": 1703978795,
   "score": 189,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfn4hom",
   "message": "My grandma is really cool. She's been divorced for a long time and isn't blood related to us, but she was like a mother to my mom so we keep in touch. She lives in Texas, with a friend, who's also a woman. For years, I've joked that since she's single and lives with a woman, that they were \"special friends.\"\n\nShe flew up for Christmas and last week after a few glasses of wine she let slip that THEY GOT MARRIED?! LIKE WE SKIPPED OVER THE RELATIONSHIP ENTIRELY, THEY'RE IN LOVE AND MARRIED AND SHE IS GENUINELY BISEXUAL. I was FLOORED.",
   "created_utc": 1703988699,
   "score": 187,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmkasc",
   "message": "Found out I wasn’t my dad’s kid. Then found out my sister wasn’t my mom’s kid. Then found out 2 of my cousins were not their parents kids. We kids found out before the adults found out!! \n\nIt was a crazy 2023.",
   "created_utc": 1703980799,
   "score": 112,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmt5v7",
   "message": "On her deathbed my grandmother told her three daughters that there was an elder fourth daughter. The older daughter was born out of wedlock. Her father was a GI. My grandmother was British and always lived there. We found a photo of an American solider in her belongings after she died but have no clue if he was the one or not.  There was no name attached or other identifying information. \n\nThe crazy part is that the three daughters had always known the fourth. She was known to them as a cousin and had been brought up by their uncle and aunt to save my grandmother the embarrassment of being a single mother - remember this was the 1940s. \n\nSadly the “cousin” had died of cancer three or four years earlier so they never got to talk through the revelation together.",
   "created_utc": 1703984265,
   "score": 1,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm6x2q",
   "message": "It hasn’t been a secret for YEARS, my mom is very straightforward with me and refuses to tell me lies, but at the time it was shocking, I’m an affair baby lol my dad wanted an abortion and my mom did not\n\nEdit: I’m sorry y’all based on the replies you guys are not reading this right hahaha my mom didn’t cheat ON my dad, my mom and dad were cheating with each other hahahaha. Everybody is in a happy marriage now and there was cheating on both ends so the person getting cheated on wasn’t even mad and in fact was supportive of the pregnancy and is still very much in my life. it’s a funny story in my family. My dad is the only one bitter bc my mom wouldn’t marry him bc he wasn’t a very good dad\n\nAlso wanna add the fact that it was an affair wasn’t ever really a secret it was just shocking to me when I first found out that’s HOW it happened. My dad wasn’t around for the pregnancy but he came around after I was born and although they weren’t perfect I was very fortunate to have both my father and my brother’s father in my life and my mom is the best mom ever, her crappy marriage is no reflection on what an amazing mom she is to my brother and I and that’s really all that matters imo",
   "created_utc": 1703975601,
   "score": 212,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm7e4t",
   "message": "My great uncle was killed by my great uncle in law(?) because great uncle in law didn’t like him living with him and his wife (great uncles sister) and complained he cost him too much money on food budget. \n\nThey went out drinking one night and my great uncle fell asleep on the ride home. My great uncle in law, pulled into the garage and left the car running. Then locked the garage from the outside so even if my great uncle woke up, he wouldn’t be able to get out. Police ruled t an accident but everyone on my great uncles side, believes it was intentional.",
   "created_utc": 1703975782,
   "score": 252,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kflqm1s",
   "message": "In my midnight shift, I caught my ex boss shagging his friend's wife.",
   "created_utc": 1703969404,
   "score": 117,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmy4i7",
   "message": "Found out when i was 18 that my 19 year old \"best friend\" was nailing my 45 year old mother and that's ultimately what caused my parents to divorce. \n\nA year and a half before that. I was in mixed martial arts and had an upcoming state fight. My parents pulled me out of training completely 1 week before the fight i had trained for with zero context as to why. Any guesses why? Mom was nailing my MMA coach 🙃",
   "created_utc": 1703986239,
   "score": 240,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmsbr4",
   "message": "I’m 36. This last summer my mother sat me down and told me I had an older brother that is 43 and lives in another state. She gave him up for adoption even tho her parents were pushing her to abort. She was 19 and went to live with her aunt through out the pregnancy and joined the marines to get away after giving him up. \n\nShe couldn’t tell anyone because she was afraid we would go looking for him and she could get in trouble. We only know now cuz he found her and gave her permission to tell us. I have yet to talk to or engage with him as I feel it is her bridge to cross first and figure out.",
   "created_utc": 1703983936,
   "score": 78,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfl9b26",
   "message": "My dad had an affair with his step mother [my grandmother] and the young aunt I had [she was 4 years younger than me and passed away] was actually my step sister.",
   "created_utc": 1703963023,
   "score": 141,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmmfwc",
   "message": "My grandfather was having an affair with his neighbor. Husband found out, left for 5 years.  Moved out of state, whereabouts were very unknown. Husband showed back up at his daughter’s 16th bday party. Asked to talk to his “Wife” in the basement. Blew her brains out, and then turned the gun on himself. All the while, their daughter and several of her friends were upstairs celebrating her Sweet 16. My Grandfather was asked to take care of their house afterward.  Basically check on it from time to time until it sold. One time I went with him to turn on the sump pump in the fucking basement!  I was 8!  I’m now 42. Just found out 3 years ago about the affair.",
   "created_utc": 1703981636,
   "score": 72,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmz6hc",
   "message": "That the reason my cousin and his fiance broke up was because they were half siblings and people were starting to figure it out. Neither one of them knew at the beginning due to both not knowing who their bio dad's were. But once the family's met each other people started to recognise each others faces. My cousin laughs about it today but at the time you could tell he was incredibly upset.",
   "created_utc": 1703986644,
   "score": 147,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm9m10",
   "message": "When I was 16 at a family Christmas party I found out from my aunt that my dad named me after the woman he was having an affair with when my mum was pregnant with me. Also that he spent the week my mum was in the hospital after my delivery sleeping around. I cut him from my life shortly after that.",
   "created_utc": 1703976626,
   "score": 248,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm7va7",
   "message": "That my father wasn't who raised me because I was the result of an affair",
   "created_utc": 1703975964,
   "score": 67,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmh65k",
   "message": "Most of my freinds did cocaine and I had no idea up until recently. Hell I had freind in highschool who I learned just recently was a huge drug dealer in highschool and I had absolutely no idea. For years I always wondered how they were always able to stay up so late drinking... I'd be home by midnight and I'd learn the next morning they'd be up till sunrise playing cards or whatever. I guess I just never thought about it. Turns out... cocaine.",
   "created_utc": 1703979576,
   "score": 22,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmc1as",
   "message": "That my aunt on my dads side was in a relationship with her first cousin in the 90’s",
   "created_utc": 1703977561,
   "score": 63,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm3ox4",
   "message": "My house that I currently live in used to be a funeral home. Whenever new people come over they always compliment the house on how big it and nice it but little do they know it used to a funeral home",
   "created_utc": 1703974372,
   "score": 45,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmmy6s",
   "message": "my dad slept around like crazy when younger. \n\nhe left my mom when I was 2 and he went on to have two sons with a nice lady. \n\na couple years ago, a guy reached out to me on 23\u0026amp;me- we have the same dad, and my dad cheated on my mom with this guy’s mom and she put him up for adoption. \n\nlooking into it more, we found out my dad had 3 other kids with different women put up for adoption that we are still looking for.",
   "created_utc": 1703981833,
   "score": 162,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfn35if",
   "message": "Found out how my grandmas side became so wealthy. Boss man  Lucky Luciano paid my great father mmillionsss to take the hit and go to jail for him. My great grandfather was a lawyer in NYC.",
   "created_utc": 1703988173,
   "score": 58,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfl6rsj",
   "message": " My sister was masturbating to photos of me",
   "created_utc": 1703962096,
   "score": 13,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm1spg",
   "message": "Throwaway account for reasons that will become obvious…\n\nMy Irish uncles were all “businessmen” who, generally, ran legitimate operations but, truly, and I mean truly, believed that if you could outwit someone, whatever you could take from them was earned. As you might imagine, this led to other, more creative enterprises…one of which was an underground bar and gambling operation. \n\nOne day, a guy who owed my uncle a lot of money on some gambling debts decided it would be more expedient to stab him. So, he came in and stabbed him 28 times. \n\nI was 14 at the time and was the one who found my uncle, I ran for help, it was awful. My uncle, an incredibly tough guy lived though. He thought the 28 wounds were symbolic and kept saying over and over “28 times he stabbed me…28 times” \n\nOne year and one day later (these guys were obsessed with numbers and numerology and other hoo doo clap trap), one of my uncles comes and gets me out of bed in the middle of the night. He gave me whiskey for the first time and wouldn’t even tell me where we were going. \n\nAll of my uncles and some well trusted workers, kidnapped that guy, gave him exactly 366 wounds, the last one a shot in the back of the head. It was important/implacably essential to them that I saw all of this, I guess to show me since I was the one who found uncle jack. \n\nThey dismembered his body and spent the rest of the night burning the parts to ashes on a roaring fire in a giant grill (like to roast a whole hog) at a cabin where they’d killed him. Then, they scattered the ashes “to the four winds of heaven” \n\nIt was already daylight when my uncle drove me back home so; the craziest part of this story is that I took a shower and went to school.",
   "created_utc": 1703973661,
   "score": 42,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmk4i7",
   "message": "My friend got a 23andme and started finding half siblings which didn’t make any sense. This year a guy matched her as her bio dad and he reached out to her. She had no clue her dad wasn’t her real dad and she hasn’t said anything to her parents because we don’t know if they used a sperm donor or what the dynamic  is. But now she doesn’t know if her sister is a full or half sister. She doesn’t want to blow up her family with drama but she and (we) all want to know the truth obviously, but she’s scared.",
   "created_utc": 1703980731,
   "score": 228,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm8661",
   "message": "When you move out of the comfort of your parent’s house, it’s really expensive to live.",
   "created_utc": 1703976079,
   "score": 210,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmjc0y",
   "message": "An ex-friend planned to murder his parents, then kill himself. He told me randomly, without context and it shook the fuck out of me.",
   "created_utc": 1703980419,
   "score": 91,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmgye2",
   "message": "Not as wild as others, but my mum turned heavily back to religion once I was like ~16ish. I found out, almost immediately after school she was a nun for the whole seven years before deciding against it.",
   "created_utc": 1703979492,
   "score": 82,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm2blc",
   "message": "My ex went on a stunning, romantic beach holiday with his ex-wife while we were in a relationship. He told me he was on vacation with his two sons and announced that we were officially a couple and building a future together. He added that his sons were ecstatic to meet me and that it should be arranged ASAP. I later discovered that he did the exact same thing in a previous relationship. There are no words to describe how I felt the day I found out about this secret... No words!",
   "created_utc": 1703973859,
   "score": 182,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmgbrz",
   "message": "I ,a lowly, warehouse and printshop supervisor was given indisputable information that the large health insurance company I worked for was lying to my fellow employees and others about why they were abandoning a huge Medicare A contract (they had spent a few million dollars to win the contract). They would lay off close to 300 people as a result. Most of these folks were hired because of the contract. This happened in the mid nineties and the company was ultimately fined $10,000,000.",
   "created_utc": 1703979247,
   "score": 108,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmfz37",
   "message": "My uncle had a secret 2nd family in northern England. We're from the states, he was stationed there in 70s. He and my aunt announced it as a happy thing to the extended family about 15 years ago. \n\nMy grandfather on that side of the family apparently had several other children with various women that none of us knew about. After he died they started coming out of the woodwork. I have 4 new uncles so far, would not be surprised if a few more get in contact with us",
   "created_utc": 1703979109,
   "score": 73,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmu1n0",
   "message": "My grandfather was an alcoholic.  It runs in the family apparently.  While I was in rehab my father told me about a secret that my family didn't want to get out.  My grandfather was never a very nice man as I recall, but I figured he was just a grumpy old asshole.  When he was drinking he would regularly beat his wife and children.  My grandmother finally had enough so she took the kids and left one night.  My grandfather got drunk and burned his house down.  His brother took him in and rehabbed him for 4(?) years.  No booze, no cigarettes, no violence, and he had to make EVERY church service.  They eventually got back together and I never saw him so much as drink a soda.  He was still a crotchety old asshole though.",
   "created_utc": 1703984621,
   "score": 70,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm3nb1",
   "message": "One of my family members was in the cult NXIVM...",
   "created_utc": 1703974355,
   "score": 147,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmonpw",
   "message": "I found out on my 21st birthday from my auntie that my dad isn’t my real father.. found out that my real dad could possibly in the navy. I confronted my mother and asked if she was ever going to tell me, answer was no. I asked if she knew who my dad was and got “I slept with 3 guys in one week, I have no idea who your father could be”.. my mother also told me prior to this secret (a few months before I think) that she was sexually abused (raped) by her step father for years. I confronted her and asked if I was a rape baby…. She’s denied it. But it’s still in the back of my mind. \nAlso my father (who has been there since my birth and I have his last name) he isn’t aware that I know that he isn’t my biological father..",
   "created_utc": 1703982498,
   "score": 64,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmbfxc",
   "message": "The secrets of the universe while on psychedelics. Can't remember what it was though.",
   "created_utc": 1703977329,
   "score": 218,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfn1ufq",
   "message": "Found out my sister in law is an escort.",
   "created_utc": 1703987656,
   "score": 57,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfm29al",
   "message": "I had an aunt who was murdered years before I was born. I found out the day of my grandmother's funeral, because everyone swore that they wouldn't talk about her. My grandmother had sent her back to live with her dad after she got involved in the wrong crowd and started forging my grandmother's signature on checks.",
   "created_utc": 1703973836,
   "score": 131,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmlq5d",
   "message": "After my grandfather returned to the US from Europe following WWI, he ended up working for Frank Capone (Al's brother). and made a lot of back and forth trips to Miami from Cicero. After Frank got shot, my grandfather earned an engineering degree, got married and my dad was born in 1933.",
   "created_utc": 1703981353,
   "score": 53,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfn8okv",
   "message": "My sister had an interview once where she detailed a moment where our neighbor SA'd her at age 8.\n\nI read the interview and I recalled the event at age 11... Our neighbor (m16) had locked himself in a bedroom with my sister, I hadn't thought a second time about it until I read what she stated happened behind the door...\n\nI called her, in shock, and she thanked me because me confirming the other side of the story confirmed for her that her memory wasn't wrong.",
   "created_utc": 1703990370,
   "score": 53,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmcrc5",
   "message": "My grandmother (on my dad's side) was a cheater and none of her 3 kids were to the man she married. He suspected my dad wasn't his, and was fairly certain the youngest wasn't his. He beat the two of them at a drop of a hat. Good to know the old jerk has no children, but the sad thing is the family only knows the youngest is most likely not his, nothing about the other 2.",
   "created_utc": 1703977846,
   "score": 42,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmpio2",
   "message": "My deceased paternal grandfather is NOT the father of my oldest uncle. No one besides my grandmother knows who the biological father is. \n\nAny time questions like this are asked I respond hoping that my dad's family sees it because fuck if I'mma be the one to tell them their mom has been lying for 60+ years.",
   "created_utc": 1703982832,
   "score": 22,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfnqec3",
   "message": "My uncle passed in 2022 from a neurological disease and I took care of him until the end. He never knew I knew...\n\nHe had been raping my mother (his sister) for  more than a decade, until she moved out, pregnant with me. I took a DNA test and luckily he was not my biological father.",
   "created_utc": 1703997855,
   "score": 23,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfnvgs3",
   "message": "This is an interesting one. Years ago I was working in the home office on some school work and my mom was frantically digging through the adjacent filling cabinet and I was curious so I stood up and peered over her shoulder to see what she was looking for. She immediately closed the filing cabinet upon noticing a section labeled my name, proclaiming she found what she was looking for. Which I think she did, but something about how she responded seemed like she was hiding something from me.\n\nSo later that same week when I was home alone. I broke into the filing cabinet and started to flip through the stuff. Turns out it was a lot of stuff on my IEP and paperwork for school. Turns out I had a Spectrum Disorder that I was never informed about properly so at 15-16 years old, I was finally able to connect the dots and realize why school was hard for me/why I never felt socially apt.\n\nThe devastating thing was that everyone knew: at school, my friends, etc. So I have been trying to learn what this all means for me for nearly a decade. I've never confronted my parents about it because for a \"family that doesn't keep secrets,\" they've kept a lot of secrets.",
   "created_utc": 1704000318,
   "score": 22,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmedht",
   "message": "I've always known that I have 3 aunties but I actually have 2, one of them belongs to my nans sister (great aunt) but she gave her up because she was 17 and decided to chase after the guy who got her pregnant after she got my grandad and my great grandad to chase him off..",
   "created_utc": 1703978480,
   "score": 36,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfns4v3",
   "message": "I am the construction business you could say as a supplier. In my 20 plus year I am positive 3 body's have been placed in foundations. \n\n1 is a sex offender that the father of the victim put him there. \n\nThe other 2 I am not sure who they are but I have my suspicion.",
   "created_utc": 1703998662,
   "score": 37,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmx9ye",
   "message": "My coworker, brand manager at my work was on pornhub. She used to come with bruises on her face to work and would take weeks off saying she had blood issues then I saw her getting gangbanged on James Deen website. She even mentioned at the beginning of the video that she worked for gaming (tho she said she worked for development). This was about 3 years ago and the video already had 2 million views.",
   "created_utc": 1703985909,
   "score": 48,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfn2y7d",
   "message": "I’m one of the oldest of about 40ish cousins. I assumed there was only one above me for many years. I found out not too terribly long ago that we have another older cousin, who was born out of wedlock, and wasn’t acknowledged by our grandparents. \n\nNot necessarily too crazy, but for my family, it’s odd to keep such a thing buried away.",
   "created_utc": 1703988095,
   "score": 15,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmjuyn",
   "message": "My ex of 14 years. Met when I was 14, had a child. Was on fetlife and swinging with couples behind my back the whole time. He was the most vanilla person the whole time we was together",
   "created_utc": 1703980626,
   "score": 31,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmogl2",
   "message": "My roommate was dating/getting busy with my ex. I knew he was seeing someone but whenever asked he would deflect the subject. Until I heard them one night and I recognized the screams 🫵😵",
   "created_utc": 1703982420,
   "score": 28,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfmsi8y",
   "message": "Family friend didn't die from an abscess tooth but was a closeted gay man who died from AIDS, his catholic family was embarrassed so they lied.",
   "created_utc": 1703984002,
   "score": 31,
   "submission_id": "18umjrf"
  },
  {
   "comment_id": "kfn8zr6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18umjrf"
  }
 ]
}