{
 "submission_id": "18uxxaj",
 "title": "What is the best thing to buy for your mental health?",
 "selftext": "",
 "created_utc": 1703992569,
 "permalink": "/r/AskReddit/comments/18uxxaj/what_is_the_best_thing_to_buy_for_your_mental/",
 "score": 85,
 "url": "https://www.reddit.com/r/AskReddit/comments/18uxxaj/what_is_the_best_thing_to_buy_for_your_mental/",
 "comments": [
  {
   "comment_id": "kfo0gv5",
   "message": "A comfortable mattress.\n\nGood quality sleep is super important to your mental health.",
   "created_utc": 1704003062,
   "score": 90,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnkar6",
   "message": "An off switch for your doom scrolling",
   "created_utc": 1703995213,
   "score": 23,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfngytl",
   "message": "Weighted blanket and a cat.",
   "created_utc": 1703993811,
   "score": 204,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4g2d",
   "message": "Medication.\n\nAnd I don't just mean medication for mental health disorders; if you have diabetes and you are \"rationing\" your insulin, your mental health will suffer. If you get migraines and you are not buying the latest (amazing) meds, your mental health will suffer.",
   "created_utc": 1704005501,
   "score": 58,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnhdo9",
   "message": "Gym membership.",
   "created_utc": 1703993987,
   "score": 69,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnhtaj",
   "message": "A book. Any book at all, as long as you enjoy reading it.",
   "created_utc": 1703994170,
   "score": 157,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfneu8h",
   "message": "A pet. Pets are magical.",
   "created_utc": 1703992925,
   "score": 126,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfni6f5",
   "message": "Publicly traded indexed funds in a tax free account",
   "created_utc": 1703994320,
   "score": 105,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo2phc",
   "message": "Good lighting for your home.\n\nI am NOTICEABLY happier every single day when I turn my ambient lighting on instead of the harsh overhead lights. I have several warm toned lamps at different points in each room and string lights around the ceiling perimeter in most because I love the look of them. I also use remote outlets so I can turn all of them on/off with a single remote (which allows up to 6 devices on a single remote) and never goes offline because they’re not used with apps. I personally love being able to turn things on and off with a physical button instead of having to talk to Alexa and battle with her misunderstanding things or her volume being aggressively loud. She stresses me out.\n\nTL;DR warm, ambient lighting and “dumb” remote!",
   "created_utc": 1704004407,
   "score": 78,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnj8vh",
   "message": "Dirt. Hear me out. There are scientific studies that show that soil contains something called Micobacterium and working with soil or gardening helps your body to absorb this Micobacterium which boost serotonin levels and lowers cortisol. Kinda cool",
   "created_utc": 1703994767,
   "score": 166,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnix0q",
   "message": "In all seriousness, I made a \"mental health survival kit\" during therapy. I recommend keeping it somewhere easy to access (mine is on my bedside table) and mine contains the following:\n\n* A high quality chocolate bar (There is no shame in raiding these snacks when you REALLY need them - that’s why they are there!\n* A bag of salty snacks (salt and vinegar chips are my fav)\n* A notebook I wrote positive affirmations in, and a pen so I can write more\n* A little bag of magic modeling clay (it feels great to squish, doesn't make a mess either)\n* A stuffed animal I've had since I was a kid\n* Some lavender, jasmine and other essential oil blends\n\nI also have some playlists on my phone I listen to if I need to feel relaxed or energized.\n\nThink of all of your senses when you put together your kit!",
   "created_utc": 1703994631,
   "score": 161,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo067v",
   "message": "Honestly, the best thing for your mental health is to put your phone down... it costs you nothing... just put it away, be bored and without stimuli for 20 minutes a few times a day, its supposedly good for your brain to experience short periods of stimuli free boredom a few times a day.",
   "created_utc": 1704002889,
   "score": 35,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfneohg",
   "message": "Therapy",
   "created_utc": 1703992860,
   "score": 220,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnq2o8",
   "message": "Community college class     I actually made friends as an adult. I never thought this would happen.  The class forced us to work together and then we became a crew.",
   "created_utc": 1703997705,
   "score": 55,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnqbem",
   "message": "Fragrance. Smells control memories and thoughts. Something that makes you feel peaceful, safe, attractive, whatever- priceless.",
   "created_utc": 1703997817,
   "score": 74,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnh460",
   "message": "A pillow. \n\nYou can comfort yourself, rest your head and feet on it, decorate your home with it to brighten your day...\n\nAnd quietly smother whomever is bothering you.",
   "created_utc": 1703993874,
   "score": 94,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4qm6",
   "message": "Plants. Plants are so underrated. And its beautiful to see them grow. I had a small cactus my mom gave me and it lasted for about 2 years before it was dropped and it was never the same. My gf gave me one for our anniversary and i cried when I saw. I like looking at it. For me its like pets but require less maintenance",
   "created_utc": 1704005689,
   "score": 47,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnp1i3",
   "message": "The answer to this question is bound to differ for everyone, but for some of you out there, consider buying a very cheap budget nylon string (also known as classical) acoustic guitar and just sit down on the edge of your bed and explore that instrument blindly. \n\nYou don’t have to know how to play, or what notes work, and you don’t need any good technique. You just have to be able to fret a note on any string, pluck it, and make sound initially.\n\nI’m a semi-professional (meaning not at all professional, but sometimes bars give me money) musician, and it was the thing that kind of clicked for me as an otherwise aimless person. \n\nElectric guitar is great and it’s actually what I started out on technically, but then very shortly after within a year or so I got that 3/4 size nylon string acoustic as a gift because I enjoyed playing guitar in music 101 in high school… it’s been almost 15 years ago now… and it’s still the guitar I grab in the morning when I have time to enjoy a cup of coffee. \n\nWhen I was sad, which was frequent, I’d pick up that darn guitar no matter how good I was. When I was anxious and excited for a first date and didn’t know what to do with myself because I got ready way too early, I’d pick up that guitar. When some of my friends passed away, I’d pick up that guitar. When I was lost, hopeless, helpless, depressed, confused, lonely, hurt, jaded… I’d just pick up that guitar. You can only play your favorite video game so many times before you get sick of it, but for some reason when I would play that guitar things were different. Every time I played it different things would happen, new sounds, old sounds in a different order, bad techniques got less bad, and here I am typing this today in spite of everything, I’m able to live to type this for others to read— when many times my mental health was at its absolute lowest.",
   "created_utc": 1703997232,
   "score": 68,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfng8o4",
   "message": "Pottery shit",
   "created_utc": 1703993507,
   "score": 19,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnkvq1",
   "message": "A ranch far, far, far away from people",
   "created_utc": 1703995460,
   "score": 82,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo2vtk",
   "message": "I had a neighbors bird break in into my apartment. \n\nShe cursed me out and barked like a cat. Then we started an argument over who was at fault for her pooping. Thats how the neighbors found her and me yelling back and forth. \n\nHer owner said she keeps her laughing all day while causing strokes to everyone else",
   "created_utc": 1704004515,
   "score": 19,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo9raq",
   "message": "A good pair of walking shoes.  Get out of the house and walk somewhere.  During the day, I walk around the zoo (I'm a member, so unlimited daily access).  At night, I walk at the beach.\n\nJust getting outside clears your head and keeps you trim and fit.  Win win.",
   "created_utc": 1704009103,
   "score": 17,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnssbg",
   "message": "Full spectrum light.",
   "created_utc": 1703998974,
   "score": 16,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnfmo0",
   "message": "Pets. And therapy.",
   "created_utc": 1703993251,
   "score": 85,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnknjs",
   "message": "A dog, a log cabin a whiskey and a book",
   "created_utc": 1703995363,
   "score": 47,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo148u",
   "message": "Kettlebells. When I fully embraced kettlebell work outs I lost 30 pounds in 3 months and reveled muscles I didn’t even know I had. Plus the exercise mitigated my depression better then any medication I’ve ever taken. For less than $100 I changed my life.",
   "created_utc": 1704003447,
   "score": 16,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfny3am",
   "message": "A pair of hiking boots",
   "created_utc": 1704001727,
   "score": 15,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnl6vh",
   "message": "For me, it’s been a gym membership with personal training. I haven’t felt this good in a LONG time.",
   "created_utc": 1703995596,
   "score": 16,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnyzlt",
   "message": "Dinner with a friend",
   "created_utc": 1704002219,
   "score": 12,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfne4rz",
   "message": "A cat",
   "created_utc": 1703992629,
   "score": 53,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo5qul",
   "message": "A Spotify premium subscription.",
   "created_utc": 1704006336,
   "score": 11,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnjgmi",
   "message": "Kindle",
   "created_utc": 1703994859,
   "score": 10,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnx501",
   "message": "A pair of running shoes.",
   "created_utc": 1704001206,
   "score": 10,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfno9xi",
   "message": "Therapy",
   "created_utc": 1703996886,
   "score": 9,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnz5dk",
   "message": "For me its been my giant stuffed animals. Sleeping in a bed full of them does wonders at calming me mentally.",
   "created_utc": 1704002309,
   "score": 8,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnkkl8",
   "message": "Hot tub. Nothing greater than 100F water pounding at your back while you stare up at the stars.",
   "created_utc": 1703995328,
   "score": 33,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnibyw",
   "message": "A divorce. Therapy",
   "created_utc": 1703994386,
   "score": 50,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnepx2",
   "message": "It's not for everyone but an organizational binder, or a physical calendar. It's helpful to plan for events, and not have to worry about little things",
   "created_utc": 1703992875,
   "score": 15,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo11bh",
   "message": "Foods with Probiotics, prebiotics, enzymes, b12, fiber, protein, complex carbs, and healthy fats",
   "created_utc": 1704003399,
   "score": 18,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnrp1z",
   "message": "Not giving a shit and exercise",
   "created_utc": 1703998456,
   "score": 6,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnxzfk",
   "message": "A hotel room for one night, and just for yourself. An environmental and social escape to focus on just yourself. \n\nPerhaps I’m projecting, but that’s what I would love - A hotel room, a bubble bath in a bathtub, room service and nothing else in the world to worry about.",
   "created_utc": 1704001668,
   "score": 8,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo7rq4",
   "message": "Apparently writing something to be grateful for everyday is the same equivalent on the brain as getting a 20% pay rise. I use an app and it's easier to do than I thought it would be. Or buy a gratitude journal.",
   "created_utc": 1704007698,
   "score": 9,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfng1az",
   "message": "A throw blanket. My family got me one and it is sooooo cuddly and soft im like super happy all the time",
   "created_utc": 1703993422,
   "score": 16,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfne46k",
   "message": "Porsche 911 GT3RS",
   "created_utc": 1703992622,
   "score": 49,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnoztj",
   "message": "A pair of running shoes",
   "created_utc": 1703997210,
   "score": 16,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnqkuu",
   "message": "Plants",
   "created_utc": 1703997939,
   "score": 6,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnvf7q",
   "message": "A vacation",
   "created_utc": 1704000297,
   "score": 7,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfny7vs",
   "message": "Lexapro",
   "created_utc": 1704001798,
   "score": 8,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo3v7i",
   "message": "Retirement",
   "created_utc": 1704005134,
   "score": 7,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnqfpr",
   "message": "A journal. You can vent, brain dump, doodle, write affirmations and goals out. Pinterest has tons of prompts to write about and if your in therapy it a great way to retain information after sessions.",
   "created_utc": 1703997873,
   "score": 12,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnfpvm",
   "message": "A book.",
   "created_utc": 1703993287,
   "score": 6,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfngves",
   "message": "Land.  \nAny piece of dirt will do.  \n\n\nJust remember to use it, maintain it, take care of it and it will take care of your mental health.",
   "created_utc": 1703993771,
   "score": 20,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnjs2v",
   "message": "Gym Membership",
   "created_utc": 1703994996,
   "score": 11,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnff28",
   "message": "A pretty/cool journal and a pilot G2 05 ink pen",
   "created_utc": 1703993163,
   "score": 17,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnnv0c",
   "message": "Therapy. Seriously, therapy.",
   "created_utc": 1703996706,
   "score": 10,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo02bx",
   "message": "A gym membership and good healthy food",
   "created_utc": 1704002828,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo37p3",
   "message": "I got a few:\n\n1. I didn’t buy them but my cats. They are the only thing in my life that loves me unconditionally. \n\n2. I buy a lot of clothes. Not like an addiction but clothes make me happy.\n\n3. Therapy and a meditative massage or chiropractic place is always awesome.\n\n4. Oreos. \n\n5. Candles and natural soaps because the smells are nice.\n\n6. A detachable shower head. For some reason that always makes me happy.\n\nI can’t think of anything else but those.",
   "created_utc": 1704004717,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4rpc",
   "message": "My dog was free from the shelter so: Cheese",
   "created_utc": 1704005709,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo5qsj",
   "message": "Dog",
   "created_utc": 1704006335,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo8c7r",
   "message": "Save up 3 months worth of salary equivalent. Never touch it to buy stuff. Just keep it for the worst case.",
   "created_utc": 1704008093,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo92mv",
   "message": "A house.",
   "created_utc": 1704008613,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoijf7",
   "message": "A dog. They are the most wonderful emotional support animals imaginable.",
   "created_utc": 1704015705,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnfc7r",
   "message": "Vibrator",
   "created_utc": 1703993130,
   "score": 23,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnu31b",
   "message": "Ice Cream, Chocolate and other snacks item. They help to build my mental health. These foods are like my best friend.",
   "created_utc": 1703999617,
   "score": 6,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo0fq4",
   "message": "A cat or dog. A great pillow and a fan to blow cool air at you while you sleep.",
   "created_utc": 1704003043,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo230c",
   "message": "Therapy?",
   "created_utc": 1704004026,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo2suo",
   "message": "Learning to say no, let go and stop sweating the small stuff. Also knowing that if somebody has a problem with me, it's THEIR problem.",
   "created_utc": 1704004464,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4maq",
   "message": "Therapist",
   "created_utc": 1704005611,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4n6n",
   "message": "Student massage packages at your local massage school, if you're lucky enough to have one around. Students are always super dedicated to learning and improving, so they're often surprisingly good. And it's WAY cheaper. Every year my local place has a \"buy one get one half off\" gift certificate deal and I buy as many as I can possibly afford. Then throughout the year, whenever I'm exhausted, worn out, stressed, or in pain... free massage, right there when I need it. No guilt about spending the money. No excuse not to treat myself. It's a very kind gift to give your future self.",
   "created_utc": 1704005627,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo5x6u",
   "message": "Bicycle, therapist,  \u0026amp; the city park.",
   "created_utc": 1704006452,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo876v",
   "message": "A bicycle.",
   "created_utc": 1704007996,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoefv7",
   "message": "I know you said mental health but hear me out...this coincides kinda with it at first but if you're still a responsible and caring person, then maybe think about getting a pet like a dog. \n\nIt's going to be your best friend (and rewarding) and it's giving you a(nother) purpose. Of course it's gonna be work too but if you can deal with it, you both will be fine.",
   "created_utc": 1704012556,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfogh6s",
   "message": "buying or adopting a dog ( must be ready for the responsibilities as a paw parent) :D",
   "created_utc": 1704014112,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfohqra",
   "message": "I’m a dog person, safe to say a cat.\n\nBut an adult cat, from a shelter.",
   "created_utc": 1704015087,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoizm0",
   "message": "I think this depends on the nature of your mental health.",
   "created_utc": 1704016061,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfokbch",
   "message": "Cooking shortcuts - frozen vegetables, pre-made dumplings and the likes.\n\nI usually make everything from scratch, but when I'm too depressed or too stressed to cook, I would spend days on end surviving on bread and raw carrots. Or not eat at all. Until it dawned on me that I don't HAVE to make everything from scratch all the time. I buy a bag of fresh, chilled ravioli that take one minute to cook, or frozen vegetable mixes that I can just throw in the oven. There's always something like that at the ready for particularly rough days.\n\nBeing able to have a satisfying, warm dinner instead of a depression meal makes a huge difference.",
   "created_utc": 1704017089,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfopdi4",
   "message": "Stuff that makes hygiene easier or more enjoyable. \n\nHospital bathing wipes are a god send when you’re fried in a “can’t get out of bed” way. \n\nMouth wash is better than doing nothing. \n\nGet the spiderman shampoo. Get the bubblegum kids toothpaste. Get cartoon themed beach towels instead of bath towels. Whatever helps you do it. You’ll feel so much better clean.",
   "created_utc": 1704021055,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfov3xh",
   "message": "Help keeping your home clean",
   "created_utc": 1704025257,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfovfa1",
   "message": "Noise Cancelling headphones!!!",
   "created_utc": 1704025471,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfp7sdp",
   "message": "A gym membership",
   "created_utc": 1704032523,
   "score": 4,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4c44",
   "message": "Good soup. \n\nJoggers that fit perfectly.\n\nA museum pass to see something you really like, by yourself, so you can linger as long as you like.",
   "created_utc": 1704005432,
   "score": 7,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnz4o5",
   "message": "Journal, plants, pets, weed, and vibe",
   "created_utc": 1704002298,
   "score": 7,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo1x7m",
   "message": "Healthy food (as well as probiotic foods) because gut health = mental health",
   "created_utc": 1704003930,
   "score": 5,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoeu87",
   "message": "A small amount of shrooms.  I'm talking microdoses.  You are not high.  No visuals, feelings or anything acting eating shrooms.  However it has done better, for me, better than any pill I was ever subscribed.  It always just gives me the feeling of being able to mentally relax and just feel like I can breath for a minute.  Some people microdose with weed or LSD. Anyone who hasn't tried it should at least once.",
   "created_utc": 1704012859,
   "score": 6,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnqpwl",
   "message": "You can buy a lot of things, and I'm sure they're great, but the biggest boost you can give your mental health is deleting all social media, reddit included",
   "created_utc": 1703998003,
   "score": 7,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfntk59",
   "message": "Weighted blanket.\nTea machine.\nBooks books books.\nMeditation app. \nFitness Boxing (Nintendo Switch game).\nLegos.\nWool and knitting needles.\nDiamond paintings.\nSquishmallows.\n\nI have cats but didn't pay for them.",
   "created_utc": 1703999354,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfnv9ri",
   "message": "Mountain bikes",
   "created_utc": 1704000219,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfny00r",
   "message": "Food/takeout. It always puts me in a better mood when I’m having a bad day and I think of a nice place I can order some takeout to bring back home and enjoy.",
   "created_utc": 1704001678,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo4jys",
   "message": "specialty coffee; everything can go to shit but not the hot special drink for mornings",
   "created_utc": 1704005570,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo65jh",
   "message": "For me the best investments have been a weighted blanket, chamomile teas, lavender oil spray, anything that is soft to touch and squishy like a Squishmellow stuffy, meditation apps on my phone, Spotify membership, various crafting/painting supplies, and a light alarm clock with a activity tracker watch to track sleep health",
   "created_utc": 1704006605,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo8e2z",
   "message": "In my positive psych class, I learned that time-saving products will positively boost your emotions. This can be a nice automated vacuum cleaner, rice cooker, electric toothbrush, veggie chopper, etc",
   "created_utc": 1704008128,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo8gvp",
   "message": "A journal. Journaling and writing down all of my thoughts/feelings really helps me process stuff and calm down.",
   "created_utc": 1704008181,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfo8mzv",
   "message": "A meow meows (kitty)",
   "created_utc": 1704008302,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfobql8",
   "message": " Whatever makes your little heart happy!  During covid days I decided to stop giving a crap what other people think and started indulging myself with plushies :3 I don't have an enormous collection or nothin', but the ones I have make me smile.  Plus I'm easy to shop for! lol",
   "created_utc": 1704010533,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoeigl",
   "message": "THERAPY!!!! Specifically EMDR if you need extra help like me. Life changing !!!",
   "created_utc": 1704012611,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoen8a",
   "message": "A motorcycle - when I'm riding mine, all my worries are left behind as I'm literally in the here and now. I always return home feeling better and at ease with life.",
   "created_utc": 1704012710,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfofptq",
   "message": "For me, it's therapy.",
   "created_utc": 1704013530,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfog3po",
   "message": "Dog",
   "created_utc": 1704013822,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoiabj",
   "message": "Realising that perfect is the enemy of the good.\n\nIt's like an instant relief.",
   "created_utc": 1704015504,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfojjbd",
   "message": "Walking.boots and a puppy and get yourself outdoors.",
   "created_utc": 1704016483,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfojt2z",
   "message": "Dogs! And running shoes",
   "created_utc": 1704016694,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfokujt",
   "message": "Reading, I feel so much better reading.",
   "created_utc": 1704017501,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfol4hc",
   "message": "Choir membership.",
   "created_utc": 1704017716,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfomv1k",
   "message": "Therapy, obviously",
   "created_utc": 1704019085,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfonjks",
   "message": "Daily Multivitamins. Vitamin D supplement. Fish oil or cod liver oil capsules.\n\nThese things have completely improved my mental health.",
   "created_utc": 1704019629,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfooz2g",
   "message": "I tend to buy Legos when i'm down. Putting some music or a movie on, having a beer and assembling the new Eldorado Fortress is a vibe.",
   "created_utc": 1704020746,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfops5c",
   "message": "Sneakers for a 30 minute walk outside everyday",
   "created_utc": 1704021369,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoq2hy",
   "message": "A dog - they're non judgemental and full of love and admiration, plus when you take them on walks the outdoors makes you feel better.\n\nIf you're on a local field, you'll meet lots of neighbours, and straight away you'll find you have your own little support network.",
   "created_utc": 1704021586,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfot15w",
   "message": "A trip to somewhere you’ve never been.",
   "created_utc": 1704023793,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfou9vw",
   "message": "A therapist",
   "created_utc": 1704024681,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfovns1",
   "message": "Running sneakers",
   "created_utc": 1704025635,
   "score": 3,
   "submission_id": "18uxxaj"
  },
  {
   "comment_id": "kfoq5bg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18uxxaj"
  }
 ]
}