{
 "submission_id": "18uyajb",
 "title": "People who enjoy living, what's your secret?",
 "selftext": "",
 "created_utc": 1703993708,
 "permalink": "/r/AskReddit/comments/18uyajb/people_who_enjoy_living_whats_your_secret/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/18uyajb/people_who_enjoy_living_whats_your_secret/",
 "comments": [
  {
   "comment_id": "kfnlew3",
   "message": "I am enjoying life because, I have come to the understanding that:\n\n1. My existence is temporary, so why be upset about things that does not dramatically affect my life in a bad way, this will only make my existence a bit worse.\n2. 2. The things I cannot change, cannot be changed so why care so much, and if there is an issue I can fix then I try to fix it.\n3. 3. I am in control of my perspective of the world, if I am mad at the powers of the universe for, lets say breaking my leg and I'm just so angry that its stopping me from doing the things i love and I'm (metaphorically) screaming at the sky wishing I didn't have a broken leg, my yelling into the sky wont heal my leg, so if I know that the screaming into the sky wont fix it than why not look down to see what else the powers of the universe has to offer good or bad.\n\nI think it is very important to find comfort in the meaninglessness of existence and to make yourself a home, maybe a family, find friends, get a pet, feel the emotions that you can feel, and to see what this existence has to offer.\n\n\u0026amp;#x200B;\n\n(I tried to make it make sense, I don't really know if i succeeded but i tried)",
   "created_utc": 1703995694,
   "score": 4,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfngual",
   "message": "Find something worth living for",
   "created_utc": 1703993758,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnh9nz",
   "message": "being delusional",
   "created_utc": 1703993938,
   "score": 3,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfni1wi",
   "message": "No effort just brought up in a loving family in a safe neighborhood",
   "created_utc": 1703994268,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfni7rl",
   "message": "Guacamole",
   "created_utc": 1703994336,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfniv2r",
   "message": "Curious about what happens next.  What I might be able to accomplish, people I might meet, things I might do.",
   "created_utc": 1703994609,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnj6pb",
   "message": "I stopped worrying about things that I know I can't change.",
   "created_utc": 1703994743,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnjxgb",
   "message": "I started investing in myself. Focused on making as much money as possible, getting into the best shape of my life,  and building up things I wanted around me. It's the sense of purpose.",
   "created_utc": 1703995060,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnk8nk",
   "message": "As a pessimistic person...the hope for a better tomorrow.\n\n I got stuck in shitty jobs for years then something good came along.\n\n I messed around in the dating world until my wife came along.\n\n I hated where I lived so I traveled and practically lived out of hotels with no fixed address.\n\n I invested in shitty stocks till I hit it decently and now only invest in etfs. \n\nYou just keep trying and you screw up and piss people off and lose friends and make new ones and get drunk and wallow in sorrow but you keep moving forward. You give the universe another shot everyday to give you something better as long as you keep playing. And winning is different for everyone.",
   "created_utc": 1703995189,
   "score": 2,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnt55g",
   "message": "This might be long. Bare with me here, but I feel like it’s good.\n\nTo live is to experience. You also can’t hold grudges or else you will be miserable. Every bad thing that has happened to you has taught you a lesson (same with good, but most people dwell on the bad) or at least it has to me.\n\nOne day I got extremely high before going to class. I’m not a smoker but I just said ‘eff it, why not?’ since the class wasn’t that difficult or serious. As I walked outside I felt the 20°F weather pierce through my coat, I thought, damn it’s cold as f*ck. But then I just had this epiphany. I can feel the cold, I can see the sky, breathe in crisp air and hear the leaves rustling. I can walk, I can run, I can taste and feel and love and live. \n\nI realized how beautiful life is. It all sings to me. The wind and the trees and the birds just sound like nature’s song and it’s beautiful. The innocence of children, the hardworking attitude of parents to be able to support their children, the elderly watching kids play or feeding the pigeons, stray dogs chasing each other, momma cats bathing their litter of kittens… Life is just so peculiar, especially humans.\n\nHumans can melt at the touch of someone they love: by a hug, by words, by actions. We can cry over strangers, over words written by someone we’ve never met, over proposals and marriages. We can find the most mundane things funny, like farts or poop.\n\nWe love so deeply sometimes we can’t explain it. We love our pets as if they were our own flesh and blood, we raise them and coddle them. It could be a cat, dog, bunny, pig… any animal you grow an attachment to. Some love objects this way too, like childhood blankets or stuffed animals.\n\nYes, there are terrible things in the world. Killers, r*pists, terrorists… but we wouldn’t know who was good if those people didn’t exist. Good does not exist without bad. There is no light without darkness.\n\nYes, things can be temporary. The people you love will eventually die, but that’s what it’s all about. To love is to live. You wouldn’t know what grief was if you didn’t love. You grieve over what you’ve lost because you know how much you truly loved it and you *miss* it, whether it was your childhood or a close friend/family member. Instead of focusing on how much you miss them, remember why it is that you miss them. Because of the way they laughed, their jokes, their smile, their warmth, their comfort. Because you were 4 and innocent and experiencing life for the first time without knowing the dangers it held. Find comfort in knowing how it impacted and changed you. \n\nWhenever I start missing who I was, whenever I start missing being a child I think back on it and tell myself that I was experiencing it for the first time and I wouldn’t have known it would be such a meaningful memory to me. It’s like when you watch a really good movie and you tell yourself “Man, I wish I could watch it for the first time again!”. You didn’t know it would mean so much to you. Same goes with the past. You never knew those moments would be so important to you, but now you do and now you get to look back and remember how amazing it was. “I should’ve enjoyed those days more…” well, now you know, and by knowing you get to remember to *live*. \n\nWhen life gets hard, I like to look at nature. It all just goes with the wind and the seasons… unbothered. Beautiful. Our life isn’t like that and that’s how it is, but whenever I feel like the world is about to end nature just shows me it won’t. Even if I died the trees would still flow with the wind and the sun would shine and the birds would sing. The world would still rotate and it wouldn’t end. If I just keep going, life will too. \n\nI just think life is so beautiful. Sorry for the long reply though! I went off on a tangent lol.",
   "created_utc": 1703999148,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfni2gk",
   "message": "Adopt a dog from the pound.",
   "created_utc": 1703994274,
   "score": 0,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfni5f8",
   "message": "My beautiful wife and daughter, wonderful friends, and fulfilling hobbies.",
   "created_utc": 1703994309,
   "score": 0,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnh4sj",
   "message": "I don’t always enjoy it, sometimes it’s rough and seems like a hopeless routine however I enjoy spending time with friends family my dog my own alone time \u0026amp; music. It’s not what you do or want. It’s all about perspective and doing something that you enjoy",
   "created_utc": 1703993881,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnierm",
   "message": "Lowered expectations it seems.",
   "created_utc": 1703994419,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnis9j",
   "message": "Line up small plans or goals, reach it then plan new one and keep going. (Mine are around travels, activities with friends and creative hobbies)  \nI also lead a simple life. I bought an house under my means in 2016 and cleared it in 2023. I gained lot of freedom from that achievement. But my house is small and not very nice, but it's paymentfree now so there's that.",
   "created_utc": 1703994576,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnitx3",
   "message": "Set a goal and try to master it. The trick is that there are endless goals to master",
   "created_utc": 1703994596,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnjxk5",
   "message": "Fuck the past. Don’t worry about the future. Be present.",
   "created_utc": 1703995061,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnjy37",
   "message": "Hookers and cocaine…",
   "created_utc": 1703995067,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnk1r9",
   "message": "Stay single",
   "created_utc": 1703995110,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnlt18",
   "message": "Be organized",
   "created_utc": 1703995872,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfnms6m",
   "message": "Working out and enjoying nature around me.\n\noh and Consuming the souls of children.",
   "created_utc": 1703996272,
   "score": 1,
   "submission_id": "18uyajb"
  },
  {
   "comment_id": "kfns8go",
   "message": "A good therapist, one who helps get through all the self imposed garbage",
   "created_utc": 1703998709,
   "score": 1,
   "submission_id": "18uyajb"
  }
 ]
}