{
 "submission_id": "18v4yg0",
 "title": "What’s a piece of regular household maintenance most people don’t know?",
 "selftext": "",
 "created_utc": 1704018014,
 "permalink": "/r/AskReddit/comments/18v4yg0/whats_a_piece_of_regular_household_maintenance/",
 "score": 241,
 "url": "https://www.reddit.com/r/AskReddit/comments/18v4yg0/whats_a_piece_of_regular_household_maintenance/",
 "comments": [
  {
   "comment_id": "kfovoq4",
   "message": "Empty out the crumb tray in your toaster!",
   "created_utc": 1704025653,
   "score": 52,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpcb5d",
   "message": "Own a fire extinguisher and make sure it works. I live in an apartment and know there's one down the hall, but the one under the sink is way closer.",
   "created_utc": 1704034620,
   "score": 168,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfoqtyo",
   "message": "cleaning the filters of any kind",
   "created_utc": 1704022165,
   "score": 32,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kforfjl",
   "message": "Shocked how many people don’t empty the lint trap in a tumble dryer. That shit can ignite.",
   "created_utc": 1704022610,
   "score": 73,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfosrqw",
   "message": "Just tightening screws all over your house. Tables, chairs, oven door, ceiling fans, handles, door knobs. If it has screws and moves it needs tightened. I do it about once a year and I'm always surprised by how many things are not tight anymore. Edit : for the love of god, I get it, blue locktite.",
   "created_utc": 1704023599,
   "score": 126,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp5dl6",
   "message": "Going into your attic…just to look. \n\n\nAll parts of the home to to be inspected regularly. So many people haven’t been in there attic for years. It can help prevent a simple repair into a costly one.",
   "created_utc": 1704031320,
   "score": 208,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfoypzr",
   "message": "Vacuum out the condenser coils under/behind your refrigerator. They get clogged with dust and pet hair.",
   "created_utc": 1704027631,
   "score": 79,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp3kjq",
   "message": "This is a really depressing amount of maintenance I've apparently been slacking on. Time to burn the house down for the insurance money and go back to the apartment.",
   "created_utc": 1704030379,
   "score": 220,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfox0pb",
   "message": "Clea your washing machine. Lint out of dryer. Scrub your sink including the tap and the plug.\nClean your jug/kettle.\nClean the extractor fan, kitchen and bathroom.",
   "created_utc": 1704026540,
   "score": 179,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfox4ke",
   "message": "Your dishwasher has a filter, clean it out now and then.",
   "created_utc": 1704026613,
   "score": 224,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp5xsj",
   "message": "The dishwasher has a debris trap that needs to be cleaned as part of regular maintenance. \n\nAlso, clean your dryer vents, not just the trap.",
   "created_utc": 1704031604,
   "score": 190,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfprkeq",
   "message": "I found a second, completely unhidden but also unknown to me, filter in my Shark vac two days ago.  5 years of dust in it.  I couldn't even tell what the filter was made of until I rinsed a half inch of dirt off it.  \nOops.",
   "created_utc": 1704040808,
   "score": 183,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpiy20",
   "message": "You need to periodically wash the walls and ceiling. Wipe them down. Get the doors and baseboards. Wipe off the molding and the window trim. They all get just as dirty as the floor.",
   "created_utc": 1704037426,
   "score": 177,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpsaiq",
   "message": "Wipe the underside lip of your counters. Most people only wipe the top and sometimes sides. So much gunk drips over and clings to the underside as well",
   "created_utc": 1704041090,
   "score": 7,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp80j4",
   "message": "Occasionally exercise the individual water shutoff on all of the supply lines. Hot and cold on the sinks, toilet supply... The time to find out they are seized or won't seal is not when you have a broken water line or fixture.  \n\nIt may already be too late for some really old valves, which can then leak or break, FYI..",
   "created_utc": 1704032632,
   "score": 243,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfonn78",
   "message": "Making sure that you don't have your rain gutter's drainage spout near the foundation of your home, lead it away! \n\nHomes with drainage spouts that end at the base of the spout's mouth, typically the pipe that moves the outflowing water straight down to where it hits the ground, tend to have that rain water pool around them slightly. That water then slowly, overtime, seeps down and that can eventually lead to cracking in your home's foundation! And I will tell you that that is indeed not a cheap fix! \n\nSo, I suggest getting an extension for the mouth of the spout, that leads a few feet away! It can possibly save you from a major structural issue in the long run!",
   "created_utc": 1704019712,
   "score": 29,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfq3l5x",
   "message": "I am convinced that doors, and cabinets, are one of the most commonly overlooked things in people's house, that get dirty as hell.\n\nYou don't realize how dirty your door is, until you take a good look at it.  Notice the discoloration around the doorhandles?  That's from your/other people's hands.  Wipe down the door.  Wipe down the inside part of the door (the side where it latches)\n\nAlso, the door frame accumulates a lot of oil, dust, debris, all kinds of crap.  Wipe it down.\n\nNotice your kitchen and bathroom cabinets, that there is a similar thing going on.  These are high touch areas that get dirty fast, but also... look closely at the drawers/cabinets *below* eye level, like where you might store your pots, pans, silverware, or your bathroom things if it's in the bathroom - you might not have noticed it before, but things like food, oils, etc tend to build up on these things.   Wipe the outside.   Wipe the top of these little doors as well since dust and other things has a tendency to accumulate there too\n\nEvery week or so, wipe down the inside of the cabinets as well.  In the kitchen, just open the cabinets, wipe with a cloth, you might notice little things getting stuck on the inside.\n\nI live in the south - it's hot, humid, and you can get palmetto bugs in your house pretty easily if you don't keep things clean (or if you have a ratchet neighbor).  It's not enough to clean the dishes and wipe down the counters, it's not enough to put the food away - the kind of crap that accumulates on doors and cabinets (hair, oils, crumbs) is a roach magnet.",
   "created_utc": 1704045407,
   "score": 81,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpji2s",
   "message": "Everything needs cleaned. E V E R Y T H I N G. Including walls, ceilings, under sinks, light fixtures, vents, and the space around the water heater.\n\nGood housekeeping keeps shit from breaking down as quickly, and saves you a buttload of money in the long run.\n\nIt also helps you monitor issues; you will notice every wobbly hinge and weird patch in your home.",
   "created_utc": 1704037651,
   "score": 0,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp3jvh",
   "message": "Washing machine filter.\n\nMost people remember dryer lint traps but neglect the washing machine until it literally won't drain and that is SUPER ANNOYING\n\nEdit: apparently this is a 'most frontloaders' thing! Ignore if you're a toploader person - sorry for confusion (grew up in Australian drought and have seen about 2 toploaders in my entire life)",
   "created_utc": 1704030370,
   "score": 184,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp8clw",
   "message": "Unscrew the aerator on your faucets and clean them at least once a year.",
   "created_utc": 1704032795,
   "score": 176,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp78q7",
   "message": "Bleeding the radiators then repressurizing the boiler!! \nLearnt this in my late 20s, had lots of boiler trouble. Had to teach some friends about bleeding radiators.",
   "created_utc": 1704032262,
   "score": 62,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpc55b",
   "message": "I have a lot of these. I've sorta had a weird unhealthy obsession with optimizing home maintenance so I've spent time going through the manuals for all my appliances and reading a lot about it.\n\nThe one I've never thought of before is lubricating your garage door opener coil. It's memorable because, though it hasn't happened to me yet, the stories of those coils breaking are kinda terrifying.\n\nOh and quick plug for a super high quality and free app for stuff like this called Upkept.",
   "created_utc": 1704034544,
   "score": 116,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpmsag",
   "message": "Oiling the garage door springs/ mechanism.",
   "created_utc": 1704038941,
   "score": 55,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp3c4g",
   "message": "Testing the temperature and pressure relief valve on your hot water system every 6 months. \n\nIf you have a storage hot water system, there should be a valve that you need to open every 6 months to make sure it is working in the event of an unexpected pressure or temperature build up in your tank. \n\nUsually involves opening a valve for 30 seconds and letting some hot water come through, ensuring the relief valve isn’t blocked due to a build up of minerals or corrosion. \n\nWorst case scenario, it could prevent an explosion in your hot water service.",
   "created_utc": 1704030256,
   "score": 148,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpr1da",
   "message": "Cleaning the clips on the toilet seat. I just installed a bidet and damnnnn I wish I had been doing that more regularly. Take your toilet seat off and clean.",
   "created_utc": 1704040600,
   "score": 52,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kforvyx",
   "message": "You have an outside AC unit? Pull the fuse to the unit. Carefully unscrew and open the top. And wash the inside fins with a water hose. Don’t bend the fins. Do this yearly and it will help with keeping your house a little coolers for a bit less money.",
   "created_utc": 1704022955,
   "score": 213,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfq62m6",
   "message": "(A) Are you okay all day, then find yourself congested as you wind down for bed?  \n(B) Are you fine going to bed, but then have to spend 2 minutes coughing up phlegm?  \n\nIt's something in your house. Specifically, dust and mites.  \n\nStart with where you lounge (e.g., your couch, cushions, sofa blankets, and the floor surrounding it). If you wake up fucked up, it's probably your comforter/quilt, pillow, mattress, or bedroom carpet.  \n\nThere are plenty of resource online to help you with what to wash and vacuum.",
   "created_utc": 1704046336,
   "score": 47,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfoyx8x",
   "message": "I would say one of the things people know but always forget is to put faucet covers on your outdoor spigots as well as leave the water dripping inside from a sink or two if it's extremely cold. At least here in the PNW, since it's so rarely below 30-35 at night, people forget and then a major freeze happens randomly and I see multiple people with tens of thousands of dollars of damages from water. Last year my dog walker had 2 clients who had damages I think, and mine nearly froze over because I forgot when I had done it the year prior. It just doesn't get *that* cold here so no one truly knows it, even if we know it in theory.\n\nOn that note: I also highly suggest water detectors, and putting them under your fridge and sink as well as dishwasher and by the water heater, because if you can turn off the water when a leak starts, you can save thousands in damages immediately.",
   "created_utc": 1704027755,
   "score": 145,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfplt6y",
   "message": "Some vacuums have a washable filter.",
   "created_utc": 1704038558,
   "score": 32,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfqg7zh",
   "message": "Maybe not exactly the same idea, but please please get a carbon monoxide detector. Mine went off a few weeks after it was installed. Everyone I know that has one has had it go off. \n\nMine literally saved my life. I was sleepy (as per usual) and was going to take a nap. If my detector didnt go off, my husband would have come home to a dead household. Cat, dog, wife. All dead. Please get one!",
   "created_utc": 1704049983,
   "score": 31,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfrc6gx",
   "message": "Clean the things you clean with. Clean the vacuum, the dryer, the washingamachine, dishwasher, etc.",
   "created_utc": 1704061851,
   "score": 24,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpc0se",
   "message": "We moved in to a place with a UV light in the hvac, but no one mentioned that the bulbs only last a year (yes we should have done our research, it just never crossed our mind). \n\nFast forward a few years and we got an expensive mold problem to deal with instead of a relatively cheap light bulb that needs to be replaced.",
   "created_utc": 1704034491,
   "score": 50,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfoy4mh",
   "message": "Spray for moose. Once you have a moose infestation, it's too late.",
   "created_utc": 1704027257,
   "score": 172,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpmaun",
   "message": "Wiping the skirting boards. They get really dusty and splattered.",
   "created_utc": 1704038749,
   "score": 47,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfqja4u",
   "message": "If you've never done so, lubricate your locks, it takes about 10 seconds, and it saved me from struggling with my lock every time I go in and out of my house.",
   "created_utc": 1704051063,
   "score": 22,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpqnew",
   "message": "I know a lot of people don't clean out the pipe from the dryer to the outside, but everybody knows to clean the removable lint screen after each load or at least each couple of loads, right?? \n\nMy buddy started exploring to figure out why his dryer wasn't working well. Single-story home, the vent pipe went up into the attic space and just ... ended.  There was a deep and wide pile of loose, fluffy, highly flammable lint everywhere, and it had finally piled up enough to collapse in and block the end of the pipe. 😳",
   "created_utc": 1704040452,
   "score": 21,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpeg6u",
   "message": "I’ve been many different lines of construction throughout my life. And seen a lot of dumb stuff by people living in homes. \n\nA big one is replacing your fire alarm batteries. My in laws should be dead because they took all their fire alarms down when the battery died, then replaced their dryer, shoved it back to far and pinched the vent hose, then the dryer caught fire. They woke up chocking and coughing from their house being full of smoke. Most people don’t wake up in that circumstance they just fall into the never ending CO2 sleep. \n\nHere’s a huge one most people don’t know about. Circa 2009 most HVAC systems will have a safety float shutoff. So if the drain line gets clogged it’ll shot off your whole ac system instead of flooding your house. It takes less than 10 minutes (99% of the time) to unclog the drain line. But you can also do preventative maintenance by dropping some bleach and hot water down the drain line. If your entire HVAC system is down and nothing is coming on, check YouTube videos for unclogging drain lines \n\nALSO CHANGE YOUR DAMN AC FILTER REGULARLY I’ve seen so many ax systems fail prematurely because they had to work extra hard sucking air through a dirty ass filter. Yes Mackenzie I know your filter says it’s good for 3 months but you have 4 long haired dogs shedding in here and have scentsies going constantly to try to cover up their smell. Both of these things will clog a filter up faster. The three months is timeframe is in ideal conditions",
   "created_utc": 1704035565,
   "score": 65,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfp7uby",
   "message": "Drain your water heater at least yearly.\n\nMake sure the shutoffs for all your water sources turn freely as well.",
   "created_utc": 1704032549,
   "score": 54,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfq36cl",
   "message": "Crap builds up on your faucets and shower heads.  Every couple of months, soak them in them in white vinegar.  You take a zippy bag of vinegar, tie it onto the faucet so that it's submerged, leave it there for 15-20 minutes.  Then take an old toothbrush and clean off any excess crap.  Then run hot water for about 5 minutes.\n\nSome of you might notice that your shower head aims better and has a better stream.  It's because there was so much hard water deposits, etc, causing water to spray everywhere.",
   "created_utc": 1704045250,
   "score": 19,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfqf1ju",
   "message": "Label the switches in your circuit box.",
   "created_utc": 1704049568,
   "score": 13,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfq3uu0",
   "message": "Replacing air filters.",
   "created_utc": 1704045509,
   "score": 13,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfolv8x",
   "message": "How to unclog a sink drain.",
   "created_utc": 1704018299,
   "score": 63,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpxypb",
   "message": "Chances are this issue affects some people in this thread.\n\nIs at least one of your radiators hot near its base but cold near the top?  If you have water-filled radiators throughout your house, chances are this problem is caused by pockets of air/gas that accumulate in water-filled radiators over time.  Now and then this air needs to be removed.\n\nIt's a very simple process which doesn't need a plumber or handyman.  You can just get a simple radiator key from a hardware store or Ebay, if you don't have one already (Google to see what one looks like).  \n\nGo to the radiator that is the most elevated one in your home with the radiator key and a cloth.  Find the valve that fits the key on the side of the radiator and use the key to sloooowly loosen it, with the cloth ready to catch any water that emerges.  You will hear the air build-up start to escape, and will maybe see brackish-looking water sputtering out.  Keep the valve open until ONLY water is coming out - meaning the gas build-up is now gone - and then tighten the valve again so that it is snugly closed and no water is emerging.  \n\nObviously, care will need to be taken not to get hot water on your hands.  If necessary, perform this procedure when the radiator is not yet up to temperature.\n\nYou will hear the radiator refilling as the system replenishes the water.  Once it is up to temperature the radiator will once again feel warm or hot to the touch all over.  Repeat the process for all radiators affected by this issue.\n\nImmediately wash your hands once finished, as stagnant radiator water can contain harmful microbes.  Discard or immediately wash the cloth you used.",
   "created_utc": 1704043265,
   "score": 12,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfqv1wn",
   "message": "This is a minor one, but I clean the top of the ceiling fan blades every summer before I turn the fan on for the first time.\n\nA few years ago my mom mentioned how dusty her room had gotten. \n\n\"Did you clean the top of the fan yet this year?\"\n\nBlank look. \"I don't think I've *ever* cleaned the top of the fan.\"\n\nI cleaned the top of the fan. I think she heard my reaction from across the house.",
   "created_utc": 1704055342,
   "score": 10,
   "submission_id": "18v4yg0"
  },
  {
   "comment_id": "kfpbb3s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18v4yg0"
  }
 ]
}