{
 "submission_id": "18v7l18",
 "title": "People over 40, what's one thing you regret the most in your younger years?",
 "selftext": "",
 "created_utc": 1704028663,
 "permalink": "/r/AskReddit/comments/18v7l18/people_over_40_whats_one_thing_you_regret_the/",
 "score": 10,
 "url": "https://www.reddit.com/r/AskReddit/comments/18v7l18/people_over_40_whats_one_thing_you_regret_the/",
 "comments": [
  {
   "comment_id": "kfp4bib",
   "message": "Not enjoying it more , didn't realize how fast my younger years would pass",
   "created_utc": 1704030769,
   "score": 113,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp14tw",
   "message": "Caring too much about what others thought of me.",
   "created_utc": 1704029042,
   "score": 240,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp4rea",
   "message": "Deferring too readily to the judgment of others. I had the naive belief that other people had my best interest at heart. Speak up for yourself. Defend your own decisions. No one is out there waiting to make you a star.",
   "created_utc": 1704031001,
   "score": 98,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp4pki",
   "message": "Not investing and not appreciating people who love you.",
   "created_utc": 1704030975,
   "score": 74,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7orc",
   "message": "Stretching and maintaining muscle mass. When I had kids I stopped both and it took a decade to get that back. Treat your body well. Something happens around 38 and the better shape you are in the better your 40’s and after will feel.",
   "created_utc": 1704032476,
   "score": 244,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp3ijc",
   "message": "Worrying so much. In hindsight all that stuff seem so silly now.",
   "created_utc": 1704030350,
   "score": 106,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp47fo",
   "message": "Speaking too quick not listening and thinking more.",
   "created_utc": 1704030710,
   "score": 98,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp67tq",
   "message": "Not setting firm boundaries with people.  Givers have to set limits because takers have no limits.",
   "created_utc": 1704031747,
   "score": 253,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp4d19",
   "message": "Seems so cliche but I did not wear enough sunscreen. I used to do the whole lay out with baby oil so I could get a \"savage\" tan. How stupid. Now my face looks like a topographic map of California.  Wear sunscreen kids!",
   "created_utc": 1704030791,
   "score": 104,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp0w57",
   "message": "Spending too much time worrying about love and not enough time concentrating on happiness.",
   "created_utc": 1704028906,
   "score": 66,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp63dg",
   "message": "Not appreciating how lovely I was",
   "created_utc": 1704031683,
   "score": 77,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp145b",
   "message": "Smoking for several years! Waste of money and not good for the health",
   "created_utc": 1704029031,
   "score": 171,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp0njx",
   "message": "Not saving money is a big one. The younger you are simple things like a dollar a day, or 10-20 etc in an account that you don’t withdrawal from.",
   "created_utc": 1704028774,
   "score": 20,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp4gks",
   "message": "Not asking older family members more questions about our family and forebears while they were still alive.",
   "created_utc": 1704030843,
   "score": 47,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5xi6",
   "message": "I have to say not being a kinder person and not realizing how important it is to save more",
   "created_utc": 1704031600,
   "score": 160,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp798h",
   "message": "I should've started traveling much earlier in life, while i was still young \u0026amp; fit. That \u0026amp; not taking better care of my teeth",
   "created_utc": 1704032269,
   "score": 46,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp3xbp",
   "message": "Worrying about what other people think.",
   "created_utc": 1704030565,
   "score": 62,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp8v2o",
   "message": "Thinking I needed a romantic partner to be happy. I stayed in an abusive marriage for so long because I couldn’t imagine doing things alone. It is infinitely better to be alone than in a bad relationship. When I choose to be in a relationship again, it will be because I’m happy and compatible with the person, not because I don’t want to be alone.",
   "created_utc": 1704033037,
   "score": 146,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5df1",
   "message": "Not learning a musical instrument. I’m trying now but it’s harder at my ancient age.",
   "created_utc": 1704031318,
   "score": 188,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp4tx1",
   "message": "Eating too much fast food in my 30's...",
   "created_utc": 1704031038,
   "score": 89,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp680g",
   "message": "Not being careful with my credit. I got my first credit card at 18 and went absolutely crazy. It’s taken me years to climb up to decent credit and even more years to get to excellent credit.",
   "created_utc": 1704031750,
   "score": 111,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7h2b",
   "message": "Getting married just to escape my mother",
   "created_utc": 1704032375,
   "score": 116,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7eoz",
   "message": "Not cutting out shitty friendships earlier.",
   "created_utc": 1704032343,
   "score": 57,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp812k",
   "message": "Not going harder at everything, thinking I had time.\n\nYou dont.",
   "created_utc": 1704032640,
   "score": 196,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpczhr",
   "message": "Drinking alcohol was the biggest waste of time.",
   "created_utc": 1704034923,
   "score": 181,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp83xf",
   "message": "Too afraid of getting rejected. Even when a girl showed interest it typically had to be overly obvious for me to act.",
   "created_utc": 1704032678,
   "score": 73,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp3qap",
   "message": "Not saving for my retirement as soon as I got a job when I was 18, started at 25. I’m 43 now, won’t retire until I’m closer to 70",
   "created_utc": 1704030463,
   "score": 51,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5zrh",
   "message": "Being so shy/anxious that others thought I was arrogant. I weren’t. I just avoided eye contact 🤦‍♀️",
   "created_utc": 1704031632,
   "score": 59,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp59io",
   "message": "Trusting authority figures and older adults above my own instinct on things.",
   "created_utc": 1704031261,
   "score": 108,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpanf9",
   "message": "I had about $100,000 to my name when I was 24/25. A guy told me to invest in a new company called Netflix. I went to a Fidelity website \nand tried to use $50,000 of what I had, but it was so fucking confusing I couldn't figure it out and eventually just gave up.\n\nI can't remember the exact price at the time but I remember dividing the amount I wanted to invest in half so it was probably about 2 bucks. I would have had 25,000 shares of Netflix.\n\nFuck.",
   "created_utc": 1704033872,
   "score": 55,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5vst",
   "message": "Wish I would have put more money away early, somewhere safe where the money grows and I don't touch.",
   "created_utc": 1704031576,
   "score": 102,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpe2nf",
   "message": "Not getting the mental health assistance I desperately needed.\n\nI've suffered from anxiety and mild depression since my teen years. In part, it made me a recluse and a social outcast because I felt I was unable to interact properly with people and the world.\n\nToday, on meds, I am a different person. I no longer fear social interactions, and if I was aware of the results back when I was a teen, I likely would have made better decisions for myself.",
   "created_utc": 1704035401,
   "score": 105,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp0kg3",
   "message": "Disrespecting my parents when I was a teenager.\n\nThey really *did* know what they were talking about, I was just too much of a shithead to see it",
   "created_utc": 1704028725,
   "score": 193,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp6p65",
   "message": "Spending most of my 20s drunk. I don't regret all the fun, because it was great fun. But I could have had that same fun without being so wasted. I kicked it in my early 30s, don't miss it.",
   "created_utc": 1704031992,
   "score": 194,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp56g3",
   "message": "Nothing. I’d do it all again. fuck ups and failures too.",
   "created_utc": 1704031217,
   "score": 76,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp8p7e",
   "message": "Living life on other people’s terms, and not mine. Young people of Reddit: it’s YOUR life. YOU are entitled to live it the way YOU want. ❤️",
   "created_utc": 1704032961,
   "score": 136,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5tjg",
   "message": "Not buying a property because my mother had a negative opinion about it. I would say make your own mind up, have the strength to follow your instincts. That was 30 years ago and I still feel regret every time I see the property.",
   "created_utc": 1704031545,
   "score": 206,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp6ful",
   "message": "Saving. I'm 59 now and will have to work til I croak. Why didn't I save all that bday cash.",
   "created_utc": 1704031860,
   "score": 169,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp4v5g",
   "message": "Caring what people thought\n\nNot concentrating on my education - I was and still am pretty smart but I didn’t apply myself the way I should have.  So I got mediocre grades and the lack of focus followed me into college where i struggled",
   "created_utc": 1704031056,
   "score": 92,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp57py",
   "message": "Lack of skills in relation to carpentry/electrical/plumbing etc...wish I would have went to vocational school the last couple years of high school",
   "created_utc": 1704031235,
   "score": 84,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpbrt0",
   "message": "Not enjoying being single. Looking back my social interactions were centered around finding the one. I should have just enjoyed getting to know people",
   "created_utc": 1704034379,
   "score": 43,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp83zd",
   "message": "1. Save a bit of money. Yeah, enjoy it, but save some too.\n2. Don’t waste time chasing girls. Those that want chasing aren’t worth it.\n3. Don’t smoke.\n4. Stay close to your friends, don’t drop them.\n5. Listen to your parents. Respect them. They won’t be there forever.\n6. Be in family pictures. Even if you look like shit, can be arsed.",
   "created_utc": 1704032679,
   "score": 70,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5947",
   "message": "Setting unrealistic expectations",
   "created_utc": 1704031255,
   "score": 37,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7itr",
   "message": "Not saving and investing more $. Compound interest is amazing",
   "created_utc": 1704032398,
   "score": 37,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp8gfi",
   "message": "Settling too young.",
   "created_utc": 1704032846,
   "score": 37,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpd6ve",
   "message": "Not going to therapy sooner",
   "created_utc": 1704035016,
   "score": 35,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp47mi",
   "message": "Not getting out and dating more. Or at all, for that matter.",
   "created_utc": 1704030713,
   "score": 150,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp8npv",
   "message": "Getting married young.  We were a fun young couple but when it came time for an adult relationship it was apparent we had completely different views on things like budgeting, cleaning, parenting, working.  Basically we were opposites on everything except the sense of humor and mutual attraction.",
   "created_utc": 1704032941,
   "score": 58,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpd18f",
   "message": "I take an *all's well that ends well* approach.  I know I used to have regrets, but now I can't even remember them.  My life turned out better than expected, and I'm comfortable, healthy, and at peace.  Any mistakes I made were part of what got me here, so it's all good.",
   "created_utc": 1704034945,
   "score": 26,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpkvhw",
   "message": "Wasting time. I threw away so much time. Time wasted doing nothing. Time wasted not being spent with the people that I love. Not paying attention to them and showing them my love.  In the end, we don't run out of love, money, breath....  We run out of time.",
   "created_utc": 1704038198,
   "score": 27,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7d7j",
   "message": "Renting for so long when I probably could have afforded a house back in 2008. Now it looks like I may never get one",
   "created_utc": 1704032322,
   "score": 50,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpc111",
   "message": "Not learning a second language. Trying to do it now is hard AF!!!",
   "created_utc": 1704034494,
   "score": 45,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp6obe",
   "message": "Partying too much. Wish I had done more fulfilling things \u0026amp; also I didn’t take my career seriously. Trying too hard with friends who weren’t my real mates. Quality over quantity.",
   "created_utc": 1704031980,
   "score": 23,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpbty1",
   "message": "Not saving more for retirement.  Yeah I was only making 30k a year but 5% of 30k adds up faster than 2% and it's pretax so you notice it much less than you'd expect.",
   "created_utc": 1704034405,
   "score": 22,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpcu6c",
   "message": "I would have been kinder to myself. I don’t mean easier on myself, but kinder to myself. You know,  like you are with a good friend. That would have made a real difference",
   "created_utc": 1704034857,
   "score": 21,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpd8ck",
   "message": "If I bought an ounce of gold instead of an ounce of weed every week when I got paid, I would have to work anymore. But I didnt…..",
   "created_utc": 1704035033,
   "score": 23,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp6hbr",
   "message": "Not voting in anything but presidential elections. I feel like my whole generation got tricked into letting the boomers stay in control because we didn’t understand the importance of local and state level politics.  Your vote can make a difference but you have to vote in ALL the elections and you have to have patience because it takes time for people to rise in politics and for policies to get enacted.",
   "created_utc": 1704031882,
   "score": 131,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpbqbr",
   "message": "Not matching every 401k I've ever had.  It's usually only about 2.5% of your pay and while it can be tight at times, it's the best investment choice you can make.  No where else will you get 50% increase in account value by simply saving.   Not to mention the years it has to grow.",
   "created_utc": 1704034361,
   "score": 19,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpd3e2",
   "message": "I’m 40 and I regret spending 36 years of my life in the Mormon church. \n\nI wish I would have actually lived my life. I wish I would have had a chance to have a couple of wild years and have fun. Explore my sexuality. Make more diverse friendships. It sounds silly but my biggest one is dressing cute. I am so sad that I wasted my youth wearing knee length shorts and tshirts. I was so young and cute and I wish I could go back and wear a bikini. \n\nI also got married when I was 19. Young marriage is quietly encouraged in the Mormon church. I actually don’t regret that because I adore my husband and we have a fantastic relationship. I do regret making him join the church of course.\n\nEdited to add…it wasn’t about just dressing sexy and showing skin. It’s about being taught that my body wasn’t my own and that it was something dirty that needed to be hidden. My mom altering my prom dress into a matronly monstrosity. It was all the times I was miserable in the summer wearing my magic mormon underwear under my clothes.",
   "created_utc": 1704034972,
   "score": 41,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpbyqg",
   "message": "My poor choice of a partner as the mother of my children.  Nothing destroys your lifes work quite as quickly as a divorce.  My daughter believes her mother has Borderline Personality Disorder.  I was driving down the road with my son one day, he looks at me and says \" The biggest mistake you ever made was getting married. \"\n\nThis is his own fuckin' mother he's talking about.  She is estranged from both kids lives.  She is truly a horrible person, but she had long black hair, long legs and a great ass.  She was a lot of fun when my 21yr old ass met her.  Looking back almost 30yrs later, I could have done a lot better.",
   "created_utc": 1704034465,
   "score": 55,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpl3fk",
   "message": "Not getting healthy sooner. Not exercising or going to the gym, eating a\nbunch sugar, drinking way too much and not getting enough sober time, smoking cigarettes. \n\nIt all kinda adds up in your 40s.",
   "created_utc": 1704038281,
   "score": 16,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp5zlh",
   "message": "Slept around far too much.  It sounds like a good thing but it's left me emotionally stunted and forming meaningful relationships has been very difficult for me.  Older people always told me to \"Play the field\" when I was younger but I realize now it was a con.  I should have just married my HS sweetheart and maybe I wouldn't be single in my 40's.",
   "created_utc": 1704031630,
   "score": 167,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp6sq7",
   "message": "i wish i could go back to my high school self and tell me that this clique shit does not matter.  it doesn't matter what these people think of you.\n\n\u0026amp;#x200B;\n\nbut overall spending too much money on people because i thought if I did, they'd know I cared about them, so they'd care about me.  so much time and money wasted on people who barely paid attention to me.",
   "created_utc": 1704032042,
   "score": 33,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp815r",
   "message": "99 problems...having fear was one.",
   "created_utc": 1704032641,
   "score": 16,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpci39",
   "message": "Putting up with toxic family and friends because I thought it was normal.",
   "created_utc": 1704034706,
   "score": 16,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp3d42",
   "message": "Drugs.  Nobody warned me.  Nobody told me.  Once you're hooked, you're toast.  I have never totally escaped, but I'm much better now.",
   "created_utc": 1704030269,
   "score": 153,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7vtn",
   "message": "Getting married when I was 23. I think I lost so many things about my 20’s.",
   "created_utc": 1704032569,
   "score": 31,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfp7yo8",
   "message": "Refusing to accept mental health issues and not seeking help earlier.",
   "created_utc": 1704032607,
   "score": 32,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpcw0k",
   "message": "1) Quit worrying about the other people who don't matter, and make sure the ones who do matter to you aren't toxic. Everyone tries to saddle everyone else with all these expectations and judgements. It's garbage. If you're doing your best where you are, it'll be alright so don't let it eat at you.\n\n2) Get organized and focused. You don't have to know what you want to do or be, but you should take the opportunity to get yourself together so that your planning, organization, and follow through skills are strong enough that as you do figure out meaningful goals and objectives, you can march forward toward them effectively. (Read The 7 Habits, one of the few self help books that isn't wimpy fluff)\n\n3) Take care of your body. Eat well and get regular exercise. There are so many ways to do something active that you don't have an excuse because you are unable to afford a gym or hating running. Also get good consistent sleep.\n\n4) Treat yourself and other people with respect. That means being kind when its appropriate, not being jealous or petty, and caring (at appropriate levels) for others, being helpful, courteous, etc.\n\n5) Acknowledge your debts to others even if you can't 'repay' them. If you show some promise, other people will try and help you, be appreciative, acknowledge and show appreciation. Do it for others when you can.\n\n6) Do things, try things, talk to people, read - basically learn. That's how you figure it out to the extent anyone ever does.\n\nLife is a marathon, building one you're proud of takes a long time and a lot of effort. You have to trust that doing good things the right way will always get you where you were meant to be. And you have to remember there is no script or map for a human life. So ideas about what you should be doing or where you should be are not generally useful or meaningful. As long as you are doing things, and doing your best to do them the right way (be respectful, care, put in effort, etc) then your life will turn out to be baller, for you, regardless of the trials and tribulations.",
   "created_utc": 1704034880,
   "score": 29,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpbgd4",
   "message": "I worked every hour I could mostly because I enjoyed my work. But regret all the fun and good times ,holidays etc that I missed out on",
   "created_utc": 1704034239,
   "score": 13,
   "submission_id": "18v7l18"
  },
  {
   "comment_id": "kfpf6x0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18v7l18"
  }
 ]
}