{
 "submission_id": "18vsc4o",
 "title": "What is the worst date you've ever been on?",
 "selftext": "",
 "created_utc": 1704097054,
 "permalink": "/r/AskReddit/comments/18vsc4o/what_is_the_worst_date_youve_ever_been_on/",
 "score": 86,
 "url": "https://www.reddit.com/r/AskReddit/comments/18vsc4o/what_is_the_worst_date_youve_ever_been_on/",
 "comments": [
  {
   "comment_id": "kftreoy",
   "message": "A coffee date with someone who was clearly still heartbroken over her ex. She talked about him the entire time, and even started crying at one point with her voice cracking. She talked and talked. I barely got to say anything. We finished our date and I politely said it was nice to meet her. \n\nAfterward, the the person who set us up told me, “She said you aren’t her type.” All I could say in response was, “I know. I’m not her ex.”",
   "created_utc": 1704112645,
   "score": 130,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftnrxo",
   "message": "Obviously catfishes to start. She pulled up in a minivan full of trash it looked like someone emptied trash bags in her vehicle.   At this point I know this date is going nowhere, but I'm not going to shame anyone and still gonna be a decent person.   We go for a walk and as we are, joggers are passing us. She is sweating profusely, pretty sure she hasn't ever walked this much.  I made a joke about at the last moment running past the the joggers pushing them out of the way to feel like we won.\n\nTo which she says \"I wouldn't push the joggers just the n-bombs\"\n\nWe are done here. The only problem, we walked a bridge and are now on the other side so long ass awkward walk back.   Zero talking because as far as I am concerned this date is super done. About half way back I notice.... This bitch has pissed herself.",
   "created_utc": 1704110012,
   "score": 202,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kft9pe8",
   "message": "Showed up to the time and place she wanted. She was an hour late and said she was bi but not really into guys. I think she was mad that I didn't buy her a drink or something because she blocked me before I even got outside.",
   "created_utc": 1704098911,
   "score": 134,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftiscr",
   "message": "Met through a dating app, and she was very nice.  Showed up to pick her up, and she was a completely different person.  She would barely respond to questions, and if she did, it was usually negative.  It was so bad that I asked her if someone else responded to her profile messages for her, and she gave me a funny look and said “no”.  She had wanted to go to dinner and a movie, but I could barely make it through dinner, and just brought her home after dinner.  She kept messaging me that she had a good time and wanted to get together again, and I told her that wasn’t going to happen.",
   "created_utc": 1704106179,
   "score": 133,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftwx7b",
   "message": "On the third date the woman brought out a copy of my credit report and started asking me why I had co-signed for my sister's house.  When I expressed a little shock at being suddenly interrogated she said, \"It's perfectly legal.\"\n\nThere was no fourth date.\n\nEdit: I will say, she was very attractive and nice. It was just so offputting and surprising that I couldn't see a future with her.\n\nEdit 2: I assume it was a credit report. It was some document you could pay a fee to get. Property history, perhaps?",
   "created_utc": 1704116147,
   "score": 115,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftsxy0",
   "message": "December 16th, 1998. A temp at our shop asked me out on her last day. We met at a restaurant near both our places. She ordered a glass of wine, which she didn't drink. She never took her jacket off. She rarely made eye contact. She was incredibly nervous. I thought we were going to eat, but she said she wasn't hungry, so I didn't eat either. By the time the date mercifully ended, I was starving, and stopped at a Boston Pizza on the way home and ordered a pizza. Not sure what her point in asking me out was as she never seemed to want to be there. It must have worked though. Over 25 years later, and we're married and she's asleep beside me as I type this. She's still weird, but I wouldn't have made it this far without her, nor would I want to go in if I lost her.",
   "created_utc": 1704113690,
   "score": 184,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftx1qs",
   "message": "Tinder date. I was in a dry spell and in need of a slump buster. We met at a bar. She looked decent enough. Proceeded to hammer neon blue colored shots and when the bill came she waited for me to pay. When I gave her a look and said I’ll pay for one only she smirked. When we got to hers there was cockroaches everywhere and a leftover container from Olive Garden on her bed that she proceeded to tear into. I almost puked. After she finished she got under the covers. I said are you gonna brush your teeth and she said no. I left.",
   "created_utc": 1704116220,
   "score": 68,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftoj8t",
   "message": "Girl was baby crazy and was talking about her desires of being a stay at home mom on the first date. It was the focus of our entire conversation despite attempts to learn other things about her. I think okay, this could be jitters, let's go out again and see if she calms down. Nope, that's really her only priority. There was no third date.",
   "created_utc": 1704110582,
   "score": 62,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kft84cv",
   "message": "dates where i have to ask all the questions \u0026amp; the other person shows zero curiosity. so awkward.",
   "created_utc": 1704097593,
   "score": 161,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kft7xja",
   "message": "Went to meet a girl on a first date after work. She had a guy colleague with her who just stayed there. Most of the talking was just between them. Eventually I asked if he had plans tonight and was heading off soon, he just said no he was enjoying the night there. I got up and left.",
   "created_utc": 1704097437,
   "score": 158,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftxa9f",
   "message": "We went to a dog cafe and she spent the entire time taking selfies with the dogs and uploading them to Instagram. I don’t think she said more than a dozen words to me the entire time. Then we got coffee, where she spent most of the time reminiscing about her ex",
   "created_utc": 1704116356,
   "score": 43,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftukcs",
   "message": "Went on a coffee date once with a guy.\n\nWe both ordered our coffees, the barista asked if he wanted a receipt after he paid ($9) and he said no.\n\nWe go to sit down with our coffees, I’m talking and he interrupts me and asks “wait, why was it $9?”\nI said “well I think both coffees are around 4 dollars, and then with the tax… $9 sounds about right.”\n\nHe sits there and thinks about it and he’s like “I’ll be right back, I don’t think it should have been $9”\nGoes back to the barista, says he would in fact like a receipt. \nShe prints it, it’s not an itemized receipt… just says the total. So he goes back and forth with her a little bit on why it was $9. She explained to him the price of the 2 coffees and tax like I did. \n\nHe comes back to our table, staring at the receipt, and says “I didn’t expect it to be this much. I think this made my account overdraft. I need to check my bank account.” \n\nHe didn’t overdraft, he said he still had a little bit left in there. Phew!😮‍💨",
   "created_utc": 1704114726,
   "score": 112,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftf3km",
   "message": "Went for a meal with a girl from Tinder. She looked nice in her photos but when I arrived and she smiled… those teeth had not been brushed maybe ever. All her photos had her mouth closed… \n\nI had this moment as we entered the restaurant as I held the door, like I could run right now. But I saw the date through, took ages as she had to cut the food into tiny pieces. \n\nThat was the last ‘first date’ I ever went on that was a meal, only drinks first to enable a quicker exist. Man those teeth were *grey*.",
   "created_utc": 1704103242,
   "score": 77,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftkbbh",
   "message": "Met up a girl from Tinder. She wasn’t recognisable to her profile and I would have walked past her if she hadn’t of said my name. She had used a combination of old and strategic pictures; she had obviously put a copious amount of weight on in recent years (which is fine, just don’t deceive people) and had obviously tried to hide this on her dating profile.\n\nI have come across this a couple more times since and I don’t understand why you’d want your first impression to be that of a deceitful person. \n\nThis girl had a particularly self-righteous attitude about her and one of the first conversations she offered was “I had a traumatic childhood and I want a baby to make up for it, I don’t care if the father is involved”. I finished the meet as quick as I could.",
   "created_utc": 1704107366,
   "score": 165,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu0czc",
   "message": "organised a date with a guy i met online (a sort of dating site). \n\nwell, he was late but messaging me. turns out in anticipation he had trimmed up down below and subsequently cut the delicate skin of his penis. it wouldn’t stop bleeding. \n\nwe end up on a phone call with me explaining to elevate the area (prop some pillows under his butt and apply a little pressure to the wound). \n\nhe kept umming and ahhing about coming to meet me (it was just a drink at the pub but we were flirting with the idea of other more intimate things previously). \n\ni had my make up on, a nice outfit and even did my hair. i do not do these things often. \n\ni became frustrated as he couldnt make up his mind to get in the car or not - bare in mind i told him we should reschedule and i was going to meet some friends if he was staying in (didnt want to waste my effort getting ready) again, no hard feelings. \n\nafter about 45 minutes to an hour of his indecision i told him “you come now or we are never seeing each other”. \n\nhe was in that car and at the pub in 35 minutes. \n\nwe are still together now and i take care of that delicate skin 🖤",
   "created_utc": 1704118094,
   "score": 99,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu7gw0",
   "message": "Girl I meet at college. Within 20 minutes of the movie starting she was already acting like I was her long lost soulmate and was more in love with me than anything ever in her entire life. Was literally whispering to herself in the movie stuff like \"I said this wasn't going to happen again\" and \"What if he doesn't love me as much as I love him.\"\n\nRemember this is after about an hour hanging out together after class one day and 20 minutes into JACOB'S LADDER, a psychological horror/drama, not the freaking Notebook or something romantic.\n\nStuck with it for about a week. She was super clingy, wanted to make out CONSTANTLY which was great except for when we went to a small-theatre production of Macbeth at our school. Making out in a dark cinema is fine, making out in a room that is only a little dim with at least two of your professors about 3 feet away is not.",
   "created_utc": 1704121691,
   "score": 24,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfub34p",
   "message": "Not my date but my friends cousin took out this girl who from the beginning said she would pay for the first date. Mind you he’s rich and tried insisting but she was very adamant—said she always paid for the first. They have a great time and the date turns into like, 6 hours at this restaurant and at some point she starts ordering shots of tequila. He’s impressed cuz it’s top shelf stuff she’s getting for them (I forget what it was called exactly).\n\nWell the bill comes and with these shots is 700 DOLLARS. She looks at it and bursts into tears… turns out she meant to order shots of well with a very similar name. Now she doesn’t have enough in her account, is drunk, and having a full on meltdown. He tried to calm her down and paid (something he was fine with as he’s rich and knew it was a mistake) but she was mortified and straight up sobbing.",
   "created_utc": 1704123315,
   "score": 13,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuas39",
   "message": "This was 20 years ago and I was in my early 20s.  I had met this girl at a party some weeks before, flirted a bit and exchanged phone numbers. Anyway, we agreed to go on a date and I went to pick her up at her co-ed dorm. While she was getting ready I waited in their common room and this guy came up to me and told in no uncertain terms that he was “not going to give her up without a fight” and I should not get in his way. I tried to brush him off but he just kept going on about that “she was the one” and so on. Kinda a creepy guy, actually. She came back from her room and sensed the tension and was like, yeah - let’s just go. \n\nWalking out of the dorm, I asked her if there was something I should know. Me paying acute attention to her reaction I didn’t realize the glass door in front of me and walked directly into it. Next I know I’m on my ass and blood is pouring out of my nose down my (of course) white shirt. She helps dizzy me back to the dorm common room and finds some towels to stop the bleeding. All the while that fucking guy is laughing his ass off.\n\nWe actually did go on the date (first stop was to buy a new shirt 😄), and she was cute and all, but I was super embarrassed and keeping a conversation going sounding like a walking sinus infection and blood still trickling out of my nose was challenging 😆 Afterwards I realized that I actually broke my nose 🤦🏼‍♂️  \n\nHappy though that I made her aware that this guy was quite toxic, though.",
   "created_utc": 1704123183,
   "score": 11,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftdkqn",
   "message": "He came back to my place, I put Death Proof on the TV, and he wasn't into it. Still not sure what I did wrong.",
   "created_utc": 1704102037,
   "score": 51,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftmr9a",
   "message": "My time has come.\n\nMet a woman on a dating app, seemed cute and she was keen to get straight to phone calls. Ok then. First call we chatted for 2 hours and had a lot of laughs, second call over an hour, still going strong. She did live over an hour away though so I was hesitant to see if anything could come of it. Well, she convinced me so I drove to her coastal town on a Sunny Sunday for a picnic by the lake.\n\nSo we meet in the car park of a local restaurant. It’s immediately clear her photos were quite misleading, think 10 years old and 10 kilos ago… Red flag number 1. I pushed on though, telling myself to not be superficial. The banter was strong and we went down to the lake in my car. Weirdly, the sunny day was suddenly dark clouds but I thought nothing of it…\n\nAfter some small talk the conversation turned to COVID. It was late in 2020 so it was a hot topic. She asked me if I’d be getting vaccinated when it became available. “Day 1” I replied, having been a health care professional previously I would have no hesitation. Red flag number 2 was raised when she said she wouldn’t because she didn’t trust the ‘mainstream media’. In Australia, that’s an unusual expression to hear, so I was immediately suspicious that I was dealing with a ‘do your own research’ type of operator. So down the rabbit hole I went, gently probing her on her thoughts on everything to the shape of the earth, climate science, Donald Trump, 9/11, you name it.\n\nThe result you can guess. She thought the Donald was Man of the Year material and was fully on board with every conspiracy I could think of.\n\nSo yeah, wasted trip, but it gave me a good story and a list of red flag questions for future romantic prospects.",
   "created_utc": 1704109246,
   "score": 87,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftnyvs",
   "message": "Matched online. Photos were ok, listed no smoking on her profile, listed athletic and liked exercise and so forth. Basically looked good on paper. \n\nMet in person. Well she may have been able to photoshop the hairy mole out of her pics, but not off her actual face. And I think the only exercise she got was walking too and from the fridge. As for non smoking, the footwell of her car was filled with empty cig packets and fast food containers. \n\nAfter contemplating burning my shoes, I blocked and deleted her before I got into my own car and left after that. \n\nAnother date with a woman I was connected with on LinkedIn of all things. We’d been out on a date, fire conversation and obvious chemistry and so she invited me back to her place. Cool cool. \n\nFucking fish tanks everywhere. Some had fish, some had axelotyl or lizards or other things in there. Not sure if she was breeding them or what but damn what the actual fuck? \n\nWent straight to her room because trying to make out with the sound of fish pumps and aquarium lights in your eyes does not work. \n\nSex was not great. Mainly cos she was on SSRIs and they are libido killers. But also she did t want to use lube because it made her feel self conscious that she couldn’t get it on. \n\nSo after hours of desert dick and attempting to get either of us off orally, we admitted defeat. She didn’t call back and I didn’t go back. \n\nAnother woman I matched with. Crazy cat lady. Now I didn’t mind that she had like 7 or 8 cats, but lady you have got to change the litter out daily. \n\nWant to know what the wildest “post nut clarity kicked in” is? Shooting your load and then dry wrenching because the smell of cat piss is so strong you can’t take it anymore. \n\nShe wasn’t even some young woman that didn’t know any better. She was mid 40s and unless her nose was completely broken, she should have k own her house smelt god awful. \n\nAnd one final story. Met a cute woman online. We went to a science museum for our date and kept sneaking out of the evening tour to make out in the exhibits. She was hot for it, I was hot for it, but she was also on the blocks. \n\nChanneling my inner Jon La joie *I don’t mind ketchup on my hotdog, as long as the bun is tight*. And so we yolo’d the period sex. She assured me it was light and near the end and so why not. \n\nGet back to her place. Lots of playtime in the dark, lots of hands, lots of good wet feelings. We finally finish up and decide to have a shower. \n\nFuuuuuuuuuuuuck. Her bed looked like the deck of a Japanese whaler and both of us were painted red. Even her wall had smears on it because of the hot and heavy up against the wall play at the start. \n\nWe had a very long shower. Played some more because fuck it the water will wash this away and we were still hot for each other. \n\nThen we had to strip the bed, wash the wall down, make the bed again and then went to sleep. \n\nWe had a brunch the next morning and I thought we were ok, but she never called me back so I’m guessing ultra embarrassment or maybe she just needed her fix? Shame. I really liked her.",
   "created_utc": 1704110161,
   "score": 43,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuanor",
   "message": "Girl asked me to meet for a nice coffee date at a local shopping mall. We had spoken a bit online, and she seemed very nice, reasonably attractive, so I was like, sure, why not.\n\nWe met, had our greetings, and then I asked, okay which coffee place, and she said she doesn't drink coffee, and she had brought her own water if she gets thirsty. Well, okay, I would like a coffee though, so we went to a quick Starbucks and had usual just-met small talk while waiting in line.\n\nAfter getting my coffee, we decided to just walk around and chat. You talked about usual first date stuff, what the other likes, what they're looking for, etc. It got to describing ourselves, or how we think of ourselves, and she asked if I considered myself more of a serious person or a silly person. So, I said that depends on the situation, but I'm generally a silly person overall. And she said \"ah, ok, I'm definitely a serious person.\"\n\nWhat followed was probably the most awkward nearly hour of nearly silent walking around the mall, known to man. We didn't say a whole lot, but talked about various things here and there, definitely not first date topics, more like, barely-knowing my colleague type topics.\n\nAfter that hour, we said bye, and texted each other afterwards, \"you were very nice, it was, nice to meet you, wish you good luck in your dating!\"\n\nIt's not super bad, nothing dangerous, nothing crazy, but it was the worst date I have been on.\n\nI guess I might be considered lucky.",
   "created_utc": 1704123129,
   "score": 8,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftd4t4",
   "message": "She seemed to be digging my jokes and we were having a decent conversation. At one point she laughed so hard I made a surprised expression because no girl ever laughed at my jokes like that. She saw it and I'll never forget the face she made. Like \"oh, something's wrong with you.\" \n\nAnyways, then the conversation started to get a little one sided and she got a call from someone mid date. Took it, saying something about a brother or family member. I waited. She left but said take care of yourself in a kind way. She didn't respond for a day or so. I, being inexperienced and anticipating being ghosted again said \"maybe we can just be friends\" to try and save it. She took offense and wouldn't accept an apology. I was devastated, because I really liked her. Had to delete her number to avoid talking to her again.",
   "created_utc": 1704101694,
   "score": 33,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftulbc",
   "message": "Oh my God, I win! Ok, it was a minor league hockey game. He brought his brother, and when I went to the bathroom, the game ended and they forgot about me.",
   "created_utc": 1704114744,
   "score": 45,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfthxo9",
   "message": "She showed up in her gym outfit without taking a shower. Worst date yet. Yet she wondered why I never called back",
   "created_utc": 1704105507,
   "score": 14,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftuno4",
   "message": "I once had a date with a woman I was talking to for a bit. When I went to pick her up, she had brought her \"friend\", who was her ex bf on our date. I shifted the date to just a few drinks at the bar instead of a proper date. As I was saying goodbye, she insisted on coming to my apartment and having her ex sit in the car until morning. I declined, obviously. A few years later she 'liked' my profile on a dating app, and when I asked her about it, she had zero recollection and said it must have been a fun date and that her ex is awesome and still her bff. People are strange.\n\nAnother time, I had been talking to a woman for a bit, and we went on a few dates. We had a lot of fun, until someone cut me off in traffic (who happened to be brown), and she went off on a disgusting racist tirade about how \"brown people are ruining our country and can't drive and blablablabla\". I pulled over, had some words with her, she yelled at me that I am not manly enough for her, so I reached over to open her door and told her she can walk the rest of the way home.",
   "created_utc": 1704114785,
   "score": 25,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftg2iv",
   "message": "I'm a workaholic. So I rarely indulge myself in dates. But I had recently bought a new sports car after a few years of moonlighting. So now I've reached a point where I can balance things out by shifting my ambition to my social life. \n\nUsually my approach is modest for vetting purposes but since I have the privilege of having a work car and a fun car. I figured why not take the fun car, a lady, and have some fun?\n\nWell...it wasn't so fun after all. I like to gradually build my dates up, so I took her to a casual Vietnamese cafe. Small, mom and pop owned, popular place in town. As we pull up I have to manuever the car carefully as to not damage it due to the poory kept parking lot. \n\nOnce I park, out of nowhere this girl with a straight face says to me \"You drive an audi and you eat at a place like this?\". \n\nDumbstruck? Appaled? Insulted? I don't know. It just happened so suddenly I didn't even know how to respond. I tried to laugh it off and gave a smartass remark thinking she was just teasing/testing me. But then she goes on and says: \"Oh, so you drive your dad's cars when you take girls out?\"\n\nAt this point I realized the entire date was a mistake and a waste of time. \n\nFor one, my dad was never in my life. I was raised by a single mom who slaved away at two minimum wage jobs to feed me and my siblings. \n\nTwo, I worked hard for this car. I work hard because my mom worked hard. My mother just started her own food business. She is 53 and she works 12 hour days running and operating  out of a poorly ventilated trailer.\n\nYou have NO IDEA how triggered I was having a white collar raised, suburbanite broad judge me like that. My mind was made up that very second. So, I took her inside, ate, split the bill and left her hoe ass there in that shitty parking lot.",
   "created_utc": 1704104020,
   "score": 63,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftzjjb",
   "message": "When I came out to my colleagues at work in 2000, they were very nice and set me up with a “perfect” match. He was apparently the only other gay person they knew - a drag queen named Ginger Snap. We had absolutely nothing in common. No interests or activities other than being gay - it was one of the most awkward dates but was still trying to be nice to my work colleagues for “trying”.",
   "created_utc": 1704117644,
   "score": 21,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuedoy",
   "message": "Went to pick her up for a hockey (house was close to the venue so it made sense). I pull up and see her and her sister in a full fist fight rolling down the lawn and everything. Drive off after about 10 seconds of watching this go down. Texts me the next day apologizing and telling me she ended up in jail that night, I let her know I’m not really interested in attempting to see her again, she says sorry it didn’t work out for ME. What?",
   "created_utc": 1704124705,
   "score": 5,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuh54t",
   "message": "She told me she was pregnant and didn’t know who the father was. I was confused what to say. Then she said it might be kinda rough being a single mom at 15. I thought she was at least 25. I turned that car all the way around",
   "created_utc": 1704125832,
   "score": 5,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftb4im",
   "message": "We went to a grocery store and suddenly she disappeared behind some shelves. After a while she came back out and said she saw her parents and they can't see her in public with a man. It was our last date.",
   "created_utc": 1704100095,
   "score": 20,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfudaep",
   "message": "We met at Bennigan's for dinner. I hit it off, but after dinner, she tried to drag me into the back seat of my car for sex in the parking lot of Bennigan's. I noped out of there.\n\nWhen I met up with someone who seemed to hit all the right buttons, I did warn her I had a three-month rule. \"What's that?\" Three months to know someone before I have sex. She smiled and said, \"Oh, we will see about that, with a Cheshire cat grin.\"   Made it ten weeks. We've been together for 25 years.",
   "created_utc": 1704124253,
   "score": 9,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuejht",
   "message": "I got one. First, she only had pre pregnancy photos on her profile, 50 pound difference at least. Date was planned for dinner at a sushi restaurant, she didn’t bring up any concerns. Besides the shock of her being much bigger than anticipated, she brings her 4 year old kid to dinner. She never mentioned bringing the kid along. The kid doesn’t allow any real conversation, hardly anything on the menu for him to eat, so he was fussy being hungry. I ate, paid for dinner and left, no second date.",
   "created_utc": 1704124772,
   "score": 5,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftvni2",
   "message": "I may be the asshole in this story but someone I met on a dating app turned out to be different from her pictures, she was simply ugly. I lost all my motivation for the date and left early. Afterwards, deleted all dating apps",
   "created_utc": 1704115394,
   "score": 12,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuib24",
   "message": "I went out with this guy that I met at the hospital during a shift (I’m a medical student). He asked me to grab a coffee, I told him ok (meaning ok we can have a coffee sometime later today). He walked me home from hospital and 5 minutes later told me he was ready for coffee.\nI went downstairs and he was there.\nWe went to a bar and started talking about our interests. Turns out he loves horror movies.\nHe mentioned that his roommate recently moved out and that he’s having trouble paying the rent, I suggested looking for another student and he said “if you saw my house you would understand why I can’t. And repeated several times I should visit his house.\nThen we started taking about medical careers and he mentions that he would love to become a coroner one day.\nHe said he recently started going to the morgue and he viewed the autopsy of a 5 year old kid who chocked eating something.\n\n“We found grapes in his lungs” he chuckled.\n\n\nI was already ready to escape and when he started talking about how much he enjoyed his first newborn autopsy I pretended someone was calling me and went away",
   "created_utc": 1704126296,
   "score": 3,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuiqwl",
   "message": "She started talking about \"the Jews\"...",
   "created_utc": 1704126468,
   "score": 3,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftbfy8",
   "message": "September 11th, 2001. Truly awful date.",
   "created_utc": 1704100364,
   "score": 21,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu3psy",
   "message": "[deleted]",
   "created_utc": 1704119876,
   "score": 6,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu1j7r",
   "message": "He was just very awkward and nervous and shakey I felt like I couldnt even talk to him because he seemed so uncomfortable",
   "created_utc": 1704118738,
   "score": 4,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfttt5i",
   "message": "I was ready all fresh to go meet her but i told her i just wanted to go lunch because at the  cinema you can’t talk so i thought lunch was better and she didn’t like it and jumped out the window, i never got to go",
   "created_utc": 1704114249,
   "score": 4,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuazr8",
   "message": "Had a date with a guy who had been divorced a few months prior. We met for coffee. The entire time the only thing he spoke about was his desire to have children. He divorced his wife because she couldn't have children. He wanted children to carry on his family name. He daydreamed about teaching his son to play football. And on and on and on. My breaking point came when he said that if we were to get married, he would want to make sure my \"insides were in tiptop condition\". His words, not mine. \n\n\nSurprisingly enough, there was no second date.",
   "created_utc": 1704123277,
   "score": 4,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftvlji",
   "message": "You guys have dates ?",
   "created_utc": 1704115358,
   "score": 11,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfug65c",
   "message": "NYE 1986, my roommate set me up on a blind date with Sandy. When we met, she promptly introduced me to her boyfriend. I walked home in the rain.",
   "created_utc": 1704125435,
   "score": 2,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuitxh",
   "message": "he got high, choked me, and tried to SA'd me.",
   "created_utc": 1704126500,
   "score": 2,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuiuht",
   "message": "I got food poisoning before going on a date. It was a walk along the beach at night. Near the end of the date the poisoning hit. I, in the middle of conversation, and without any warning scream-vomited into the abyss. Not once, not twice, but thrice. \n\nI spent the next two days in bed recovering. Suffering, and considering without irony if I were dying or not, she asked me out for the next weekend.\n\nProbably should have kept seeing her. Folly of youth.",
   "created_utc": 1704126506,
   "score": 2,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu5r2o",
   "message": "3 date with a woman I’d been talking to for a weeks. We hook up, great time. I get a call a week later saying I gave her HSV1. It was a special type of arrangement and now we  have partners at risk. I’m waiting on my test results. I had a partner for 20 years and her tests came out clean because we still fooled around when I’m single sometimes and neither of is have ever had an outbreak.  I never had HSV1 come back in any of my StD tests and we used all the protection. . I got the news Christmas Eve and if I did unknowingly cause something like this, the guilt and shame I feel now will just be multiplied.",
   "created_utc": 1704120874,
   "score": 4,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftxtqq",
   "message": "Friend in high school set me up on a blind date with his girlfriend's \"single\" friend. From the start it was made very clear that she wanted a guy over 6'3, athletic, massive dick, wealthy, owned a Camaro and a Harley, and no baggage. She was 5'2, obese, white trash, chain smoked, racist but openly wanted to screw any black guy she saw, in the special needs program because of laziness and picking fights with teachers, and pregnant for the second time. I say \"single\" in quotations because her boyfriend was very much still in the scene but apparently too broke to buy her more cigarettes and gas that night.",
   "created_utc": 1704116673,
   "score": 4,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftmlk4",
   "message": "She wouldn't say a thing before she had drunk some alcohol and it took her three drinks to start talking more. \n\nShe had really bad self esteem and talked badly of herself all the time. It made me (nonbinary, in my late twenties at the time) feel weird about being a university student with hobbies. \n\nI felt bad for her, and also like there would have been plenty of ???'s later on. Also, I don't drink.",
   "created_utc": 1704109124,
   "score": 4,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu2lco",
   "message": "He said he didn't have any empathy, because he had aspergers. On the way home he said \"I am not racist but I think all Muslims should leave the country.\" When I was almost home, he asked if he could use my toilet, because he really had to pee. I said no, he sighed and unzipped his pants in the middle of the street. I ran home, had to get away fast as possible lol.",
   "created_utc": 1704119300,
   "score": 3,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu1qro",
   "message": "I matched with that girl on tinder some years ago, we instantly vibed and had a blast texting. Just like everything clicked. We had at some point a sort of guessing game going on, where she eventually would slip me her phone number in a very clever way, and so on. It was just very sympathetic, matching humour, and we texted for days.\nWhen we finally met, awkwardness. Very hard to keep the conversation flowing, awkward silence, somehow the vibe was gone. It just felt massively uncomfortable.",
   "created_utc": 1704118848,
   "score": 3,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu31dy",
   "message": "After a fair bit of him a coworker, from a different department, almost begging for a date (seriously, it was cute at first), he wore me down enough to agree to a coffee date.\n\nConversation started off somewhat normal, but gradually veered into him trying to get me to join his MLM scheme. Turned out he thought \"someone with your looks and my smarts\" ...\n\nOK, I can clean up nice but I know I'm not all that. \n\nThe BS was way over the top. I finally told him that there were easier ways to talk a woman into bed - and money-making side hustles weren't it.",
   "created_utc": 1704119532,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuc5cs",
   "message": "He called the waitress over by smashing his cup and saying \n\nBar maid \nMore ale \n\nI said he should apologize and then I went home",
   "created_utc": 1704123769,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfugbyc",
   "message": "We matched on a dating app. After messaging back and forth for a few days, we decide to meet. \n\nShe then messages me asking for 5 good reasons that I would make her a good boyfriend. I waited for another message to see if there was a punch line. There wasn't!\n\nSo I just started messaging back taking the piss. She then messages me telling me she is good looking, fit, a high earner, from a good family etc. \n\nShe messages me about an hour before we are to meet to say she will be 15 minutes late, so I texted her 🫡 this emoji and say aye aye Ma'am. \nShe then cancels the date because she thinks I called her a dick head using that emoji. \nI'm half way into town to meet her and have to turn back. I explain to her that that is not what that emoji means. We sort it out and I go back into town to meet her. She messages me saying, dont make her regret coming in. She rings me to say she is 5 minutes away. 15 minutes later she is still not here. So, I go to get some food where we had planned to go after a jar. She eventually comes in. We chat have some good Japanese food and she doesn't pay her half of the bill. \n\nLesson: stay away from good looking girls from Belfast.",
   "created_utc": 1704125502,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftuy6n",
   "message": "One of my friends said he had tickets to a concert, asked if I wanted to roll with him. Fall Out Boy was playing the Arena that night, so I’m like “Sure, sounds cool, guys night!.” He picks me up, takes me to a fondue restaurant and then to an opera at the Civic Center called The Ten Tenors. It wasn’t guys night, it was 110% a date…….\n\nI",
   "created_utc": 1704114967,
   "score": 253,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu98tm",
   "message": "Had two..\nOne catfish \n\nShe was super nice and all but nothing like on the pictures.. \n\nShe was kinda obese which was turnoff for me and\nShe was to quick with everything like i wasnt confortable..\nI cancelled the dare atm when a kid walks by and says: mommy look she is pregnant.\n\nWhich she wasnt \n\n\nThe other one was a psycho bitch\n\nWe sat at the rhine and she started yelling and chasing birds \nThan startetd cleaning her nose with her clothes..\n\nAnd in the last one she had atleast 2 dudes in her contact list named honey or darling+number one two etc \n(Honey 1,honey2 ) \n\nWell i dodged the bomb \n\nShe and her familiy were messis and synthy or roma ...\nAnd super stalking etc..\n\nAfter that i took the longest shower in the hottest water in  life to get rid of the disgusging feeling",
   "created_utc": 1704122500,
   "score": 0,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu7sqv",
   "message": "This guy I met while I was working asked for my number, a few hours later he called me like a dozen timez while i was working and kept texting me.well we went to a park for a date and walked around, it was terribly awkward and we didn't really know what to say to each other. We got back in his car and asked to kiss me but I said no",
   "created_utc": 1704121845,
   "score": 0,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftpot3",
   "message": "30 december 2006",
   "created_utc": 1704111430,
   "score": 252,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuiz1j",
   "message": "Worst one for me was falling absolutely head over heels for someone. I knew immediately it was who I wanted to be with.\n\nHowever, this person has (quite rightfully) stalked me a little on social media before to check I was legit. Had no issue with that as I am me.\n\nBy absolute chance, one of her colleagues started stalking me on LinkedIn. I, very wrongly, assumed she was double-staking and called it all off.\n\nHeartbroken 💔 \n\nHowever, I am pleased to say we got past it and I found out the truth and she is dozing right next to me.",
   "created_utc": 1704126557,
   "score": 0,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftqyak",
   "message": "February 24th 2020 was pretty bad for me",
   "created_utc": 1704112330,
   "score": 246,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfu8xzx",
   "message": "When in one last night. Total bummer. No connection at all. She was very hot. But we had zero spark.",
   "created_utc": 1704122366,
   "score": 254,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfui5s2",
   "message": "Reading these stories... ! Women are fucking weird.",
   "created_utc": 1704126237,
   "score": 254,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kftvoxr",
   "message": "Probably when I drive to her house and she didn’t text me “you’re gonna hate me” as soon as I got to her driveway and I had no idea where the fuck to take her so all we did was drive around and talk \n\nDated for 10 months till I fucked everything up",
   "created_utc": 1704115416,
   "score": 253,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfue58b",
   "message": "Chatted to a girl on dating app and checked out her instagram. She had a POV pic of some legs on a rather nice bicycle. Great I thought, we can go on lovely summer cycles together. \n\nShe asked what I was doing the next day and I mentioned I was going for a long cycle, which she sounded excited about. so I invited her along. Baptism of fire and all that. \n\nI turn up to the meeting point in full Lycra and with fancy bike, expecting similar to come out of the train station barriers. \nWhat actually turned up was someone on a city bike with a carrier bag strapped to the back, who did not look like cycling was their thing. \nThat was the first moment I considered just riding away before I was seen. \n\nFirst words out of her mouth were “sorry I’m late I’m so f@\u0026amp;£\u0026amp;g hungover. You mind if I have a ciggie first?”\nThat was the second moment I considered leaving. \n\nWe started what would have been a 100km cycle. I was barely pedalling and rolling most of the time. She was huffing away being me. At the first set of lights she asked if I could slow down a bit. This was the third time I just wanted to call it a day. \n\nI spent the next 2km fighting the urge to gun it away from her, never looking back; but it seemed harsh to abandon her in north London. \n\nAfter a slight incline she arrived at the top drenched in sweat and ashen faced. And asked if we call just sack the bike ride off and go for I drink. By this point I was consumed partly by disappointment and partly by anger as I felt pretty duped. So I just said “there’s a train station over there. You get yourself home and back to bed. I’m going to finish my ride” \nShe said “you’re serious??!”. I nodded, she burst into tears at the side of the road, at which point I saddled up and got the hell out of there and had a lovely ride.",
   "created_utc": 1704124609,
   "score": 251,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kft8jnv",
   "message": "I went on a few dates, got married and screwed anyone I could after that-she probably did too. That date I went on where I married my ex after about 3 months was the worst.",
   "created_utc": 1704097950,
   "score": 229,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuh6r0",
   "message": "Coffee date with man who was constantly talking about his ex and making comparison of me and her",
   "created_utc": 1704125850,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuiq2s",
   "message": "It was a blind date/double date a friend set up. Should have been awesome. She was tall, blonde, beautiful. (She had worked as a walk on for Kate Capshaw in the airport scenes shot at Hamilton Field in The Temple of Doom) We shared the same profession, she did some other modeling and was learning to play bass. I can't even tell you where it went wrong, maybe we spent too much time looking at her modeling portfolio and in general carrying on about how wonderful she was. But at some point I just checked out. We sat in the back seat of my friends car to go to S.F. to see a movie and the only thing I really remember was sitting there trapped in the car the pouring rain staring out the window as my friends argued vigorously in the front seat. Never saw or spoke to her again. Friends never brought it up again.",
   "created_utc": 1704126458,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuixeb",
   "message": "I was having a great date with an attractive woman.  The topic of jobs came up eventually and I told her that unfortunately I was laid off recently in my position as a Grants Mgr. Her whole demeanor changed at that point and I could tell she wanted the date to end sooner than later.  I walked her to her car, and she gave me what I could only describe as an \"ass-out hug.'",
   "created_utc": 1704126538,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfujbtw",
   "message": "Went on a date, they were a furry and wanted to hangout longer after getting food, I just made up an excuse and left.\n\nThe other time someone else texted me after hanging out at theirs saying why didn’t I make a move, then they phoned me drunk demanding I come over at 2am. I told them nah but they wouldn’t take it and kept demanding, I just wanted to chill at home and play some games so I blocked them.",
   "created_utc": 1704126691,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfujclr",
   "message": "Went on a date, they were a furry and wanted to hangout longer after getting food, I just made up an excuse and left.\n\nThe other time someone else texted me after hanging out at theirs saying why didn’t I make a move, then they phoned me drunk demanding I come over at 2am. I told them nah but they wouldn’t take it and kept demanding, I just wanted to chill at home and play some games so I blocked them.",
   "created_utc": 1704126699,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuk2c3",
   "message": "On a date, and we went to eat. We had hung out for a bit before, going for walks, went to the bookstore the whole thing. Was really fun. Anyway, without asking she orders this really expensive glass of wine, then picked one of the most expensive things on the menu….generally people dont aim for 15 dollar drinks and 50 dollar plates of food. So i ordered my meal, and she then says “hey just so you know, I like you, but I want a guy exactly like you, but not you.”\n\nI was floored and I just stared then she said “I wanted to tell you earlier but I was so hungry I didnt think you would pay for dinner if you knew…I dont have my purse on me”\n\nWe hadnt even discussed how to pay for dinner yet. So i ordered a glass of wine as expensive as hers and made small talk for a bit. Then when our food arrived, i excused myself to use the bathroom, and left. Blocked her on my phone as well. No idea how she got that 150 dollar meal paid for or how she got home…\n\nI know you cant force attraction and thats okay, its just To this day it still hurts to think about the phrase, “I want to date someone exactly like you but not you”\n\nLike whats so wrong with me?",
   "created_utc": 1704126975,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfukacj",
   "message": "March 3rd. What a weird day....",
   "created_utc": 1704127060,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kful3l7",
   "message": "Top 3:\n3. Fell in a river trying to pull my dog out.\n2. She asked me if i was autistic - id jusy said when i make a decision i usually stick to it.\n1. On holiday in edinburgh, ate a rancid scallop at dinner. Got the runs mid date, literally ran off and sat in a spoons toilet for an hour. And that date was going very well",
   "created_utc": 1704127370,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfulcse",
   "message": "She just talked about herself the whole time. Never asked me any questions about myself. Like, what was the point of me even being there?\n\nComplete waste of time",
   "created_utc": 1704127468,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfulfhv",
   "message": "November 2023. I ask my boyfriend if he wants to go to a cat cafe. \nWe travel 2 hours there and back because he wouldn't believe me that we had to pay to view the cats.\nI start sobbing at the vegan cat cafe and he starts Googling what to do.",
   "created_utc": 1704127497,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuljfx",
   "message": "Oh where to start. Back when I was 25 I went on this date and she brought her mom with, which was odd. Then I find out she's not 21 but 17. Her mom had no issues with the age difference but I did. Told them I was uncomfortable with the age difference and the fact I was lied to and that I'm sorry but I have to go.",
   "created_utc": 1704127538,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfulr7g",
   "message": "When I was a kid I had a huge crush on one of my big  brothers friends. They were so cool, worked qnd hung out in the video store, loved mosh pits and gothy stuff. Tall, kinda weird, handsome in am alternative way, etc.Of course I was just the ugly fat little sister of his mate. \n\nA few years later I'd buffed up due to gym etc and he messaged me on Facebook asking if I wanted to get a drink. I was thrilled and  said what about that very night?\n\nI agreed to meet him at a pub in a manky part of town and walked right past the toothless junkie holding up the bar. Of course when he called me over I sat and chatted with him,hoping he was still the same person inside. But he was so edgy and shake, it was like he was barely there. \nI was going to politely leave when another tweaker showed up, his friend, and I didn't know much back then being a lonely stupid fucking teen but the back of my neck was tingling and my brain was just saying *run*.  I excused myself to the bathroom leaving a rather nice jacket behind and squeezed out of the bathroom window. Ended up taking off those stupid clunky gothic heels and running through the streets til I managed to find a taxi rank.\nOddly enough the taxi driver was very kind,  drove me home and wouldn't take any money from  me. We saw each other a few times after that, it never amounted to much but it was nice to see there were still good dudes in the world, considering how that night could have gone.",
   "created_utc": 1704127621,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfulswv",
   "message": "Met a chick on a dating app. She was recently divorced and had a small child (all okay).\n\nFirst (and only) date, she takes me to meet her parents and I end up babysitting her 9 month old while her and her mom chitchat...\n\nIt was the most nerve racking experience of my life and I don't really like kids...",
   "created_utc": 1704127638,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfumifj",
   "message": "Went out on a date with someone I met online that I had talked to for weeks before meeting up. He didn’t smile with teeth in any of his pictures, and I quickly realized why. I am not judgemental about teeth - I think crooked teeth or gaps can be charming. However, he was missing some teeth, and a couple of the remaining ones were black. He did not look like someone who would have teeth like that, and I was incredibly taken aback. I had to force myself not to stare at his teeth the whole time, and all my attraction evaporated.",
   "created_utc": 1704127906,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfumiq4",
   "message": "Went to pick up a young woman for a second date. Walking up to the apartment door, I noticed a lot of people dressed in all black carrying rifles. There were FBI signs on their backs. They asked me for my ID, why I was there, and suggested returning in a couple of hours. The woman's brother was wanted for murder (Sinaloa drug cartel type). I never went back.",
   "created_utc": 1704127909,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfunkwe",
   "message": "Went on a blind date once. When we met for dinner, she made no attempt to hide the fact that she hated working and wanted to be one of those real housewife types. She had a plan to get into that lifestyle too. All I had to do was agree to financially support her and her three young kids since her two exes refused to pay child support. She got loud when I said absolutely not and stormed out.\n\nFriend who set me up swears to this day that she had no idea this woman was like that or even had kids. It's been a running joke between us for many years.",
   "created_utc": 1704128311,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfunqz1",
   "message": "He invited me to a dinner date. I had short hair and was wearing trousers. He got so drunk, he mistaken a long hair girl who was wearing a skirt as me. He touched my hair and asked me if I was wearing a wig (which I was not). It was the first and last date.",
   "created_utc": 1704128372,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfunt28",
   "message": "The one my friend set me up with with his at the time girlfriend's sister. I go there and see wouldn't look at me or respond to questions. She I guess tried to make the flirty anime look and it didn't work. I left as soon as possible. I would have gotten better feed back talking to a wall",
   "created_utc": 1704128395,
   "score": 1,
   "submission_id": "18vsc4o"
  },
  {
   "comment_id": "kfuo7e7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18vsc4o"
  }
 ]
}