{
 "submission_id": "18wdgau",
 "title": "What does it feel like to lose a parent?",
 "selftext": "",
 "created_utc": 1704160786,
 "permalink": "/r/AskReddit/comments/18wdgau/what_does_it_feel_like_to_lose_a_parent/",
 "score": 40,
 "url": "https://www.reddit.com/r/AskReddit/comments/18wdgau/what_does_it_feel_like_to_lose_a_parent/",
 "comments": [
  {
   "comment_id": "kfx4r57",
   "message": "Lost my Mom when I was 27 and she was 51, 13 years ago. I still have days where I will just burst into tears. The worst loss I’ve ever felt thus far, never get over it \u0026amp; will miss her forever.",
   "created_utc": 1704161295,
   "score": 65,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx42ix",
   "message": "I did in September 2023. I was kind of stoic about it and had to be strong for everyone else, so I didn't have much of an emotional reaction, but it really hurts when I have a funny story, exciting news, and my mom was the first person I would have told, but she's not there.",
   "created_utc": 1704161021,
   "score": 106,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx4gz8",
   "message": "It's an empty feeling that never goes away.\n\nBasically had a 2 month speed run of them coming to visit, finding out they had cancer a month later, then finding out it spread and her asking for me a few days later. I'm glad I got to see her but... You always think there is more time.",
   "created_utc": 1704161181,
   "score": 42,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx4w8a",
   "message": "I lost my Father when I was 5. In a way I would say it’s the “best” way to lose a parent. I didn’t have a lifelong relationship with him that I then lost. \n\nThe flip side of that is only getting to know who he was through second hand examples from people in my life. I’ll never actually get to know him and that is a real struggle. Another struggle for me is that I don’t know how many of my memories of him are real and how many have been manufactured from the stories of us together. That’s been a real trip for me lately as I can nail down only 2/3 memories that I know are truly my memory.",
   "created_utc": 1704161353,
   "score": 40,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx6m0r",
   "message": "I lost my mom when ai was 22. I lost my dad when I was 25. \n\nSince then they visit me in my dreams and in memories on certain days. You don’t ever lose your parents, they live in your heart.",
   "created_utc": 1704162045,
   "score": 35,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx4332",
   "message": "You never get over it, like being abandoned",
   "created_utc": 1704161027,
   "score": 54,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx6cew",
   "message": "Like phantom limb. Or tinnitus. It's always there. People say it gets better with time, and in some ways yeah like the shock or heaviness of the initial event, but with time I just miss my mum more because it gets longer and longer since I've seen her. I still feel like I can pick up the phone and call her, or that I'm going to get a text from her. Her absence is just a constant hum in the background of my daily life, especially now that I'm Mum to a little girl. I have so many questions for my mum, and am nostalgic for conversations that will never happen. And I cant help but replay the times as a teen when I wasnt nice to my mum. It's fucked.\n\nAugust 2019. She had Pulmonary fibrosis, but still some years to live. During a recomennded routine lung biopsy, they accidentally tore a hole in her lung. There was no recovering from it. She developed pulmonary edema, puffed up like a balloon and was gone within the week. Her loss stays with me like my shadow.",
   "created_utc": 1704161937,
   "score": 21,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx4wff",
   "message": "Awful. Eventually it gets different. Still never goes away. I always have this feeling of just seeing them but also not having seen them in decades at the same time. It's hard to explain.",
   "created_utc": 1704161356,
   "score": 16,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxc9k7",
   "message": "I lost my mom when I was 26, she was only 58. It was 8 years ago and I still think about her every single day. My little girl asked me if I could have anything what would it be, and I told her the opportunity for you to have been able to meet your grandma. I can smile more when I think back on her, but damn it still hits me like a ton of bricks. The hardest part is when my kids ask me about her; people say it gets easier with time, I am just not sure if that is true yet.",
   "created_utc": 1704164312,
   "score": 10,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxbx4g",
   "message": "Im 45 and I lost my dad 5 years ago. It's weird because this giant staple of your life is no longer there. Someone you spent so much of your life with is not available to share memories or have a conversation with. It's hard and life does go on but there is always a void that's impossible to fill and certain things can snap you back into mourning like *that* \n\nI found 2 voice-mails from him that he had left me before he passed and I saved them both and listen to them from time to time. I visit his grave often but less often as time goes on. I actually meant to go this weekend since I missed Christmas but life is so hectic that you don't prioritize it. I miss him a lot and used to have dreams about him but those are more and more rare. I miss his voice and I wish I remembered his fave better. Luckily I have photos. \n\nOn a different note, I realized time is what it is and my mom and I and sister are closer than ever and spend time with each other on a weekly basis, which I wish I had done with my old man when he was still alive. Bittersweet silver lining. I feel like I am the Patriarch now too, which is weird because I don't feel like I'm old enough but I have to organize everything and make everything happen haha.",
   "created_utc": 1704164174,
   "score": 9,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxk5me",
   "message": "Lost both of my parents in 2020, still haven't fully recovered. It's one of the most devastating things I've ever had to experience. Just writing this comment caused my eyes to begin welling up. There's just an emptiness in your soul that can't be refilled. No longer having the two people that were always there for in my life left me feeling helpless for a while. They were the only two people in my life that I was certain loved me unconditionally and no longer having either of them is something that's hard to put into words. I can no longer pick my dad's brain when I'm having trouble with vehicles. I can no longer ask my mom for advice on cooking. Food I'll never be able to eat again because my mom or dad made it a specific way that was never written down. Never getting to hear my mom sing me Happy Birthday or hear my dad complain about football. Its all these things and so much more. I honestly wish no one had to go through this, even though it is an inevitability of life.",
   "created_utc": 1704167621,
   "score": 6,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx5nwp",
   "message": "I wasn't that close to my dad, at least for awhile, but it still hit me at his funeral.   He was 77 years old at the time, and I had been away from \"home\" for 25ish years.  I didn't think I'd feel much about it, but it still struck me hard when they played Taps at the funeral.",
   "created_utc": 1704161661,
   "score": 7,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx5ui8",
   "message": "It's awful. I lost my father when I was 27, we had begun rekindling a relationship but never got to where I'd hoped it would be. And now I know it never will. \n\nEveryone deals with grief differently, but I always tell someone when they lose a loved one that eventually even the most painful memories that make you sad, will make you happy as it's still a memory you have to revisit them. \n\nAlso to listen to Carrie and Lowell",
   "created_utc": 1704161734,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxaosq",
   "message": "Lost my dad at 12, which was a key developmental stage as I got my first period at 11, so puberty was JUST kicking in. \n\nIt feels like you can’t exist, but gets easier. However, I have some MAJOR daddy issues, abandonment issues \u0026amp; health anxiety. If I was any younger, I’d be blessed with not remembering him at all, any older and I’d have the mental development to correctly deal with it without developing lifelong issues.\n\nIt’s weird, I was too young to know him as a person, but old enough to know him as a Dad. Having that figure ripped away completely unexpectedly at such a prime age was the worst thing I’ve ever been though.\n\nHis body in the casket is the freshest memory I have of him, but I can’t remember his voice. It’s been 13 years.",
   "created_utc": 1704163688,
   "score": 8,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxciyt",
   "message": "Lost my mom in 98 when I was 26. I always tell people it never gets better, it just gets easier. \n\nI think of her daily and see her in my son’s mannerisms sometimes.",
   "created_utc": 1704164416,
   "score": 6,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxh8lw",
   "message": "Lost my dad in early 2020 unexpectedly. He had health conditions that he kept secret for whatever reasons. Uncle came to the house one day and said he had bad news. I figured it was my grandma. He said it was my dad which I replied, “what hospital is he at and how long will it take to get there?”. (I live in Indiana and he lived in Tennessee). Uncle said we’re not going because he passed away. \n\nI instantly burst into tears and didn’t know what to do, where to go or how to function as a 27 year old man. My kids watched me crumple, my wife tried best to hold everything together but losing a parent, especially unexpected, is something that will always leave a hole in you. My dad has been gone for 3 years and I’m so happy that all of my kids got to meet him and he got to hold them. There are moments in my life, and my kids lives that I know he would absolutely love to see and he can’t and the pain that brings is something that words could probably never describe.",
   "created_utc": 1704166358,
   "score": 7,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxk76i",
   "message": "Oh idk how to feel, grief and relief and devastation and guilt and a weird ambivalence, Ive been feeling oddly disconnected from reality sometimes. Weird since we lost contact for all my teen and young adult years then after we reconnected we only had five years before dementia did its thing so it's a lot of layers of feelings about it",
   "created_utc": 1704167641,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxkbbx",
   "message": "Lost my Father in Feb 2023 and it felt losing the whole support system, like when you fail and there is one hand pushing you forward thats your dad \nYou realize your dads contribution either when you become a dad or your dad passes away.\nStill I had to strong for everyone\nAnd I am currently following his footsteps and taking care of the business \nI hope he is watching over me.\nAnd great power to everyone who wrote about losing a parent",
   "created_utc": 1704167693,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxsj2z",
   "message": "I haven't lost a parent, but I did lose a grandparent that fulfilled that role for all intents and purposes. \n\nIt felt like I lost a safety net, an advocate. A close friend. A confidant. They were a connection to my past, and because the future follows from it it felt like my future was now more random and indeterminate. \n\nMostly though it was knowing that those \"little\" moments that actually mean a lot wouldn't happen again. The jokes, the bits of knowledge, the insider moments. The help, the shoulder to cry on when I needed to. \n\nYou mature *fast*.",
   "created_utc": 1704171539,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx67vr",
   "message": "Not great.",
   "created_utc": 1704161887,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx6kfx",
   "message": "Today's my dad's birthday. Second birthday since he died. It's not great.",
   "created_utc": 1704162028,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx6ku1",
   "message": "I did in April 2022. It fucking sucks. I had to be the stoic and strong one about it to keep everyone together.",
   "created_utc": 1704162032,
   "score": 4,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx6uf7",
   "message": "In its own way it's heart breaking unlike anything else and although you never get over it you do get used to it. My mother passed away 23 years ago and although I still miss her the pain of loss is not there like it is at first.",
   "created_utc": 1704162138,
   "score": 4,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx9my5",
   "message": "Not great",
   "created_utc": 1704163263,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxcm17",
   "message": "I lost mine within a week of one another in 2023. Like being hit by a train and then hit while you're trying to get up. Life feels emptier. That feeling of not being able to call hits hard. Little things that would annoy me about them before are things I'd trade anything for to have again. I realise now how much I failed them and there's nothing can do to make it right. So my advice to you would be to treasure your time together, never part on a bad word and do your best not to take them for granted.",
   "created_utc": 1704164450,
   "score": 4,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxl2dz",
   "message": "For me it was a tremendous breath of fresh air.",
   "created_utc": 1704168028,
   "score": 4,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxp1no",
   "message": " I lost my mother 50 years ago when I was 14. It was and still is the worst thing that has ever happened to me. I still think of her all the time and it still feels like it just happened yesterday.\nI quit trying to get over it years ago. I’ve been on this constant quest of just trying to cope and live my life as she would have wanted me to.",
   "created_utc": 1704169859,
   "score": 4,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxzzj1",
   "message": "Lost my mom in 2018, then my dad in 2021.\n\nI was closest with my mom, so I struggled a lot - had my child 8 months prior, and navigating motherhood for the first time proved to be even more difficult without her. I desperately wanted to be able to pick up the phone at any given moment just to hear her usual sing-songy voice - more times than not, I’d dial her number, only to be hit with that rawness she was truly gone forever.\n\nIt’s a club no one wants to be a part of. Time is definitely healing, but for me, only in a numbing sort of way. I’m starting to forget their faces, which makes it all the more sad/painful.\n\nThe beauty in their losses I suppose is seeing them come out in little ways in my child - like how my son eats (he takes forever, because he talks the whole time, which was my mom), or how excited he gets when pointing out deer while driving down the road (something my dad would do with me). I’m thankful for that.",
   "created_utc": 1704175442,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy25dl",
   "message": "So, my mom died when I was ten years old and my father died almost one year ago to the date. Growing up I was always so jealous of people that actually had parents. My mother overdosed on heroine and my father overdosed on fentanyl. The feeling is unreal. I wish I could learn more from my father. I had so many questions about being a man and learning how to live that i never got to ask him. I had a good relationship with him when he died but my mother was a different story. i treated her like shit. i was such an asshole. I left our house a mess, would constantly yell at her and just overall cause her way too much stress. For anyone with a bad relationship with either of their parents you need to know how soul crushing it is to not forgive them when they are alive. The last thing my mom ever said to me was fuck you. Those words and the way she yelled them at me will never leave my mind. Tell your parents you love them. Hug them, even if you hate everything about them just be the bigger person because it makes me physically sick to think about the way i treated my mother and i can never take that back. I’m begging you, just be kind and considerate. Thank you reddit, i still struggle with coming to reality with the death of my parents but it’s slowly getting easier. Be good people.",
   "created_utc": 1704176762,
   "score": 5,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx6n4y",
   "message": "Losing my father didn't hurt as much as losing my infant son.....",
   "created_utc": 1704162057,
   "score": 6,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx67bw",
   "message": "You never fully get over it. It becomes tolerable but never fully goes away.",
   "created_utc": 1704161880,
   "score": 3,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxn56e",
   "message": "My birthday two years ago I lost my mother due to COVID issues... It hurts that she is gone but she was a shell of her old self...being in the hospital for months and lack of exercise and neglect ... She didn't have to go... But COVID had its own rulings in the hospital...my own father could not visit her and many things were overlooked...  I love you mom... I'm so sorry you left the way you did...my birthday isn't mine anymore...  ☹️",
   "created_utc": 1704168970,
   "score": 3,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxqnoh",
   "message": "Relief. My alcoholic mother passed of cirrhosis in 2020. Our relationship was strained for years, particularly because in 1998 my older brother unalived himself. She was an alcoholic from my earliest memories. I say relief, because 1) she was incapable of being happy, for herself or others and 2) I could at last stop feeling guilty for keeping my own children away from her.\n\nI hope she's at peace.",
   "created_utc": 1704170636,
   "score": 3,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx5abl",
   "message": "Never hand them around. So I wouldn't know.",
   "created_utc": 1704161510,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx8im3",
   "message": "I’m sure it varies was but I was incredibly close to my mother and rather young(and the man that basically stepped up as my father) and even after the initial pain and misery leaves you  don’t ever really get over it and it kind of just leaves an unremovable mark that’ll forever stain your life. Like most life changing events it’s one of those things that you never return to who you were afterwards but in a way that always makes you sick to your stomach and will forever leave you feeling partially hollow.",
   "created_utc": 1704162819,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxekuy",
   "message": "You never get over it \nYou are always reminded  especially on the holidays, so be good to them while you have them. Tell them how much you love and appreciate them and what they did for you because when they are gone you will be wishing you could talk to them or tell them something",
   "created_utc": 1704165239,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxf1ow",
   "message": "It feels like your heart has been ripped out of your chest \n wrung out like a wet kitchen rag, then ran over by all of the wheels on a humongous semi, and to top it all off grabbed violently with kitchen tongs and shoved back into your chest and sewn up without anesthesia, I lost my mom 6 years ago and while it has gotten easier it never does go away.",
   "created_utc": 1704165433,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxhyoy",
   "message": "Incredibly lonely. I never met my dad so losing my mom took everything from me. Life definitely ain’t the same.",
   "created_utc": 1704166668,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxjcvc",
   "message": "It’s devastating don’t think I’ll ever recover to be honest",
   "created_utc": 1704167270,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxjzvq",
   "message": "Both of mine are gone... it's simply awful.",
   "created_utc": 1704167551,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxkozx",
   "message": "It depends on what kind of relationship you had with them. I don't miss my father at all, but I do get sad about what could have been, if he had been a decent human.",
   "created_utc": 1704167864,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxkp6g",
   "message": "Terrible. When I was 30, my dad died at 59. The only thing that got me through was this thought; this deep grief only comes because of the great joy I was lucky enough to have. On a darker, weirder note, there’s also a strange feeling of liberation from the feeling that your own life is still controlled by another.",
   "created_utc": 1704167867,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxmtm1",
   "message": "Lost mom almost two weeks ago.  Thought I was ready for it.  I was not. It sucks rocks.",
   "created_utc": 1704168824,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxnn19",
   "message": "So, I didn't know my dad had died until i was 12. I just assumed that he wasn't in the picture (that part was accurate). However, he died when I was 6. I didn't get news of him dying until I asked my mom. He died of a heroin overdose in 2010. I was sad, cried my eyes out. Turns out, my mom's \"friend\" was actually my aunt. One of my classmates was actually my cousin. I have a picture book of him. Sadly, I wasn't named in his obituary.  Turns out, I have a half-brother because of him as well. He was mentioned, I wasn't. So, it's hard because you question why and why they didn't want me (in my case). I'm over it, though. He's dead, can't do anything about it.",
   "created_utc": 1704169198,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxo7so",
   "message": "Lost my mum suddenly 10 years ago. I think part of me stopped existing when she died. It’s horrible, something you never get over. When it happened I felt like I became part of some horrible club that no one ever talks about. Also, when you lose a parent at a young age it’s really hard to talk about with friends because no one wants to think about a parent dying.",
   "created_utc": 1704169466,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxow3e",
   "message": "Devastating in every sense of the word. It's surreal and hard to describe. The pain of missing someone is only rivaled by the enormous love that made the missing possible. But goddamn, that pain is like nothing else. I'm two years out and it still hurts every day.",
   "created_utc": 1704169787,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxqpwa",
   "message": "In my 22 years of life ive never seen my father cry , right after he came home to tell me (i was alone ) i hear the loudest crying ive ever heard come from the living room\n, i go there and find him crying trying to tell me that my grandmother died . So i can only imagine how he felt",
   "created_utc": 1704170666,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxqtkt",
   "message": "I lost my father when I was 11. Didn't show much emotional reaction at the time because I wanted to show everyone that I was strong. It hurt a lot and completely changed me. Instead of being a kid that was happy I became very emotionless. In some way it made me grow up really fast.",
   "created_utc": 1704170716,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxrm4w",
   "message": "My father died back in 1992, when I was 14.  I only cried that first night, when I realized that many plans he'd had for the future, things he'd done recently that he'd intended to benefit from, would now be unfulfilled.  He'd had a protracted illness, leukemia, for the better part of a decade leading up to that point, but had seemed to have crossed a major hurdle, so it was quite unexpected.\n\nI loved my dad, but he was a workaholic, and a projective one at that.  He'd grown up on a farm, and he wasn't taking well to having to go on disability leave, and the cut in pay was causing him financial anxiety.\n\nIn a way, it was better for him to go quickly, rather than drawn out.",
   "created_utc": 1704171100,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxs44o",
   "message": "I lost my dad when I was 25, he was 59. He was going to turn 60 that year. We were excited about him turning 60. But he died very sudden and unexpected.\n\nAt the time I wasn't being the best person and I hadn't been visiting my parents very much. Then my dad got sick all of a sudden. I regret that I didn't spend more time with him in the hospital. It actually makes me really sad.\n\nBut I can't beat myself up over what I can't control and change. I try to think about the good memories. It just sucks because I've learned things I wish I would have known when he was alive to talk about. I also have so much I'd like to ask, just life stuff. But mostly I wish he was around to see me live up to my full potential and make him proud. I hate he died seeing me not live a good life.",
   "created_utc": 1704171337,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxsc6n",
   "message": "Watch the episode \"Free Churro\" of 'Bojack Horseman'.\nIt's really described perfectly , the pain and the anguish",
   "created_utc": 1704171447,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxsohz",
   "message": "I saw him die of a heart attack when I was 26. I was in shock and denial. It didn't become real to me until my phone got quiet. Dad use to call me everyday. I wanted to dial his number and hear him answer. 15 years later, I still look for my phone to ring. How quiet it is during the Holidays is what hurts the most.\n\nLife goes on and I'm moving on how he would have wanted me to, but there are still moments that hit me like when he doesn't call and tell me Happy Birthday.",
   "created_utc": 1704171612,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxw1zx",
   "message": "My mother died when I was just shy of two years old. \nI’ve seen pictures constantly growing up, but don’t feel a connection. I have no memories of her. She sounds like a wonderful woman whom I’d have had a great relationship with. This I am sure. \n\nIf I had to describe it, would be a character from a movie. I know about her but have never experienced her (from memory anyway). \n\nNo videos of old family christmases or anything. Thinking about it now…. I’ve come to the realization that I don’t even know what her voice sounds like. Damn.",
   "created_utc": 1704173354,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxz6aa",
   "message": "Lost my Mom a month after I turned 18 \u0026amp; right before HS graduation. She was only 38 but had a heart condition the last couple of years of her life. The doctors couldn't do anything more. \n\nIt was definitely the worst time in my life. I missed by Mom dearly. I mourned every day for several months. It was pretty devastating.",
   "created_utc": 1704174978,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy04wf",
   "message": "Losing a parent is very difficult. I lost my dad in 2020. After his passing it felt absolutely unreal, going to his funeral services made everything that much more difficult for me. \nI didn’t have much of an emotional reaction to his passing but, now almost 4 years later the emotional toll is still there. I’ve came to accept he’s gone and there’s absolutely nothing I can do about it but, knowing he’s not there to see me accomplish my goals or there to talk to, ask advice, etc. is very emotional and bothersome.",
   "created_utc": 1704175527,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy0hm3",
   "message": "I lost my mother to a house fire in 2020. I was angry that she was taken that way. No one deserves that. I then drank heavily for about a year before coming out the other side. So, if you’ve lost a parent and did not have a mental breakdown, you’re doing great.",
   "created_utc": 1704175731,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy1fv6",
   "message": "I lost my dad when I was 36. Two things stand out. One, he used to visit us every Sunday afternoon at around 4. It took me six months to get over the feeling that he would be visiting us. I would just stop what I was doing in anticipation that he would visit.\n\nTwo, I felt like an adult for the first time in my life. I had lost my sounding board. My advisor.",
   "created_utc": 1704176316,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfygt6e",
   "message": "Lost my mom when I was 17 and my dad when I was 26 both to cancer. Feeling is surreal",
   "created_utc": 1704187494,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyhq1f",
   "message": "When I lost my dad, it destroyed me. I only knew him for a few months before he died in my arms when I was 23 almost 24. his liver was failing him and he kept going into comas and the last coma he went into he didn't make it. he even told me and his sister, if he went into another one he wouldn't come out of it.\n\nWhen I lost my mom I was 25. honestly it didn't hit me, didn't bother me. i felt kind of like in a dream like state but felt okay. didn't cry, didn't shed a tear. wasn't sad. I grew up watching her trying to end her life or just self harming for attention. and she always talked about not wanting to be alive, missing her dad and missing her mom both who were dead. I knew she was unhappy and didn't want to be around anymore. so it wasn't much for me.",
   "created_utc": 1704188222,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyhscs",
   "message": "Gut wrenching. The reality still hasn’t fully set in. I go over to my parents expecting my dad to be there. I want to call him on my way home from work, like i did every other day at least. But I can’t. And sometimes I forget that I can’t and then it hits me. He died very suddenly two months ago, and most of the time I’m okay, but it hits me every once in a while and just takes me down. I wouldn’t wish it on anyone, but unfortunately it’s part of life.",
   "created_utc": 1704188274,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyjipr",
   "message": "I lost my mother to cancer (well… the chemo is actually what killed her) when I was 14.\n\nLost her on mother’s day, it absolutely sucked, and took me about three months before I could go without crying from the thought of her.",
   "created_utc": 1704189640,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyjwwl",
   "message": "I was 16 when I loss my mom in 2013 to cancer. We found out she had cancer in 2012 when I was 14 almost 15 and In a way I feel like I loss her twice.  The first time seeing her physical appearance change and not being able to do the things she used to do. Her skin got paler and she got weaker and skinnier. She had to get chemo and radiation and take medication. It made me sad when she had to stay days in the hospital before we really knew what was wrong. It broke my heart when she told us it was cancer and I was so naive at the beginning thinking everything would be okay and back to normal eventually. It broke my heart that she couldn’t enjoy food cause the radiation destroyed her taste buds and she would always feel sick from her medicine. I would always hear her cough and struggle to breathe and it broke my heart.  There was a few short months where life kind of felt a little normal and I started to get a little bit of hope and then soon she just kept getting weaker and weaker and eventually passed away. It was the first death I experienced that affected me so deeply and for many months I cried every night before she passed and even after she passed. She only lived a little over a year after she was diagnosed with cancer. I still miss her so much and there’s times I still cry about it and I try not think about it too deeply otherwise I’ll cry really hard. It’s almost her birthday and she will forever be 49 sadly and she never saw me drive or graduate high school or graduate college or she never met my first boyfriend and she never saw me in a prom dress and she wasn’t there when I had a miscarriage and she won’t see me get married and she won’t know how work is for me and she never got to see her 2 grandkids at the time grow up and she will never meet any other future grandkids. It’s very hard not having a mother especially being a woman and Mother’s Day is hard for me and birthdays and holidays are hard. I really wish she was still here and I’ll forever grieve that she’s gone and what she missed or will be missing. I even miss the ordinary things we would do and I miss her cooking even if she wasn’t the greatest or I miss sitting by the pool with her or watching shows together with her or I miss when her lipstick would stain her coffee cups or she never really was tech savvy and I miss her asking her help doing something on Facebook and i miss seeing her dancing around the house and listening to music in the kitchen. I miss when she would accidentally burn scramble eggs and I miss her taking us to get frozen yogurt and watching a movie together at home. I miss just waking up in the morning and laying in  her bed with her and taking. I miss her so much and my heart will always hurt and miss her and just writing this is making my eyes watery. I will love her and miss her forever and I wish people didn’t have to experience this kind of heartbreak and pain.",
   "created_utc": 1704189944,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfymbad",
   "message": "I feel weird reading these comments perhaps something is wrong with me. When my mother died i felt nothing it was just another day because everyday spent with her she was high or manipulative. She chose an abusive boyfriend and the person who got her hooked on heroin over her two children. Why did she do this i haven’t the slightest clue, but she did and when she was found under a bridge dead from her 5th or 4th overdose? I continued about my day. No sadness. No tears. Nothing it was as if my grandparents distant friend ive never met passed away “oh im sorry for your lost” type of feeling. My grandma began to build resentment because i never cared her daughter (my mother) died only thing i regret. Theres more im leaving out clearly, but thats the jist.",
   "created_utc": 1704191784,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfync00",
   "message": "Lost both of mine to covid. Dad is 2021. Mom in 2022. My saving grace was that I had a loving, supportive family of my own with my wife and two daughters. They were definitely all my rock during that time. There was one thing that helped tremendously, when my brother passed back in 2008, my parents setup a family trust in my name. This made things much easier when going thru it all. I’d highly recommend for everyone to setup a family trust before it’s too late.",
   "created_utc": 1704192550,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyqvx5",
   "message": "Lost my dad to suicide 10 days before my 12th bday.. I’m 33 you never get over that shit you just learn to cope. After so many years I’ve just dealt with it. I still miss him so much.",
   "created_utc": 1704195103,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfysa4q",
   "message": "Content warning for suicide.\n\n\n\nHorrible. I lost my mom in February. To make it worse, it was suicide. I think I was the last person to see her alive, I'd visited her around 2 days before her body was found, had helped her move her stuff into a hotel room. She was homeless, but an RN so was able to make enough money to stay off the streets.\nShe was found around 2 days later when she missed her checkout date. \nI didn't find out till the day after, and I found out when my grandma called me. When she told me, I felt like my heart was physically ripped out, I couldn't stop screaming and crying. My mom had been my best friend, the one person I felt always truly understood me. She was my only parent, and the only person who was always there for me, no matter what. I knew she was feeling down, but not to that point. But before I left, I asked her if she'd be safe that night, she said yes. That's the only reason I felt ok leaving. \nI still miss her all the time, her birthday was the December 29th, and I cried a lot. I cry so much it's not even funny, she was literally my best friend, and was with me when I wanted to die, and I wish I could've done the same for her.\nI keep a shrine with her ashes, and I also have a necklace with some of them in it, so I can keep her with me. I dont think I'll ever get over it though.",
   "created_utc": 1704196070,
   "score": 2,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfx74l3",
   "message": "Depends on your relationship, but if it was close then little things that remind you of them will trigger feelings. Maybe not full on cry, but you’ll remember what it was like to just have a simple conversation or even a hug. Nothing makes me more sad than watching the last breath they took. (Parent with cancer passed during covid lockdown)",
   "created_utc": 1704162252,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxd6g0",
   "message": "Fairly confident we lost my father in law.  Wife feels betrayed and abandoned by him.",
   "created_utc": 1704164678,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxi7j2",
   "message": "well as soon as it happened (22 days from it being 2nd year without my dad) i obviously cried and was sad as soon as i saw him but at first it was oddly unaffecting but then as months passed i got even more sad and sad and fuckin bad in the brains",
   "created_utc": 1704166772,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxk0un",
   "message": "I've seen a lot of people experience this and it's really bad. Some struggle to express it but deep down inside the affection is there.",
   "created_utc": 1704167563,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxlmyj",
   "message": "I cannot even begin to comprehend how horrible it would be to not have them",
   "created_utc": 1704168282,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxm536",
   "message": "It sucks. That’s all it sucks.",
   "created_utc": 1704168513,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxpjsm",
   "message": "Guess it depends. If you hate the person, it might be a relief.",
   "created_utc": 1704170101,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxppr5",
   "message": "Have felt like a piece of me has been missing since I was 13.",
   "created_utc": 1704170179,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxptaa",
   "message": "Lost mine in 2018 and 2019. I haven't really grieved.  Wasn't close to either one. My inlaws are still alive.  I think I will grieve their deaths when the time comes.",
   "created_utc": 1704170225,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxsfll",
   "message": "I tell people it feels like a fence on the cliff has been removed.",
   "created_utc": 1704171493,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxsuoz",
   "message": "Like a piece of you is missing. My Dad passed away over three years ago from a heart attack. I never got to say goodbye. I still miss him every day.",
   "created_utc": 1704171697,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxuabx",
   "message": "Can depend on your relationship with a parent. How well you know them. And also just how you process grief. I've lost friends and I've lost family members and my Dad was  the hardest. Everyone processes grief and death differently.",
   "created_utc": 1704172428,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfxz0ja",
   "message": "It’s bad when it happens, obviously, and in some ways it gets easier, but in others it gets harder because you carry on with life and they’re missing all the things that happen in your life and that you wish you could share with them.",
   "created_utc": 1704174892,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy2rzk",
   "message": "Life feel pointless. Multiply the total pain of all the failures and breakups n disappointments n unfulfilled dreams to infinity, then may be you can understand a fraction of it. No matter how devoted or respectful you have been, when you loose them you always feel incomplete. There is a constant thought in back of your head i could have done this , i could have done that , etc etc. it teaches you so many lessons in a second and in next second those lessons become worthless because now you dont have a single person around you who will proud of you no matter what. Parents leave you in a void as deep n dark as black hole.",
   "created_utc": 1704177159,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy3nv7",
   "message": "He had pain in his stomach so we brought him to the hospital. A month of being bed ridden and multiple hospital tests including a barbaric spinal tap eroded the strongest man I had known to a weak and fragile man that often wet his hospital bed. His Leukemia, which was in remission was not. Many family members thank the hospital staff for their compassion and warmth while sick loved ones are there. I never witnessed any heart warming events that I could praise. Just my family and I doing what we could to help him as he slowly waited...  \nThe Friday morning his heart give out, I can vividly hear the blood oxygen monitor alarming as his heart grew weaker. I'm not certain he knew how close the end was but I could see fear in his eyes. In a small room surrounded by his family, he died around noon.   \nHe had sponsored countless large and expensive family dinners out, he was the head of our clan, he had a large group of life-long friends and with him gone absolutely nothing or no one could fill his role. We are no longer close knit.  \nIt's been 10 years now and I can sometimes hear him in my hearty laugh that I never noticed before. We were never really close, never had any heart to heart conversations but I still miss my pops.",
   "created_utc": 1704177727,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy4tvc",
   "message": "I lost my mom (only parent) a handful of years ago. I feel lost a lot of the time.. I was 35 she was 57. You go to look for advice and she’s not there. I go through phases like around Mother’s Day, her bday, etc. some days are better than others",
   "created_utc": 1704178495,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy52id",
   "message": "My dad passed away in 2000 when I was seven years old. Although it was an accident, and very sudden, it caused lifelong problems with trust, abandonment, and anxiety. I can only speak for losing a parent as a child right now. It's awful, and impacts you in many ways most people don't realize -- if you have a good relationship with them.\n\nAs for losing a parent as an adult, I have yet to experience it. However, I know it will happen someday, as my mom is still alive but getting older.",
   "created_utc": 1704178659,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy53x4",
   "message": "You always think about it once you get to your 30s, so you think you're ready.\n\nYou're never ready, but you pretend anyway because you need to prove to them that your parent raised a strong person.",
   "created_utc": 1704178686,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy55u7",
   "message": "I felt sad and then nothing because they were sort of absent in my time of need and development. 😞",
   "created_utc": 1704178722,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy5qid",
   "message": "Went numb for a week until the funeral and then every thing reminds you of them and it's a gut punch for a while sometimes you get jealous of people doing mundane things with their parents etc. \n\nEventually it goes away and you can appreciate the good times but damn it hurts.\n\nLost dad at 18 he was 51 fuck cancer.",
   "created_utc": 1704179119,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy5vfj",
   "message": "January 22 2017 i  talked to my dad the day before and took him to his big rig after leaving the doctor for a cold or something small..  the last thing he said to me was ill only bother you for 20-25 more years then you wont have to take care of me anymore.. i told him to shutup and i love him and then he died in his parents driveway from a heart attack after getting them breakfast. I havent went a day without thinking of him and its the worst pain ive ever felt like someone is ripping out your organs through your throat and you cant breathe or move just sit there and wish it wasnt real.",
   "created_utc": 1704179213,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy61wa",
   "message": "I lost my dad almost 7 years ago. When he first told me he was sick I was sad but knew he wouldn’t want me to be sad and focused on gratitude for all of our time together.\n\nAfter he died I was just a little muted for a while, and some other stuff happened that was pretty traumatic- my new girlfriend turned out to be very abusive- and the further it got from his passing, and the more abuse I experienced, the more a feeling of emptiness overcame me. Where there was once meaning, now there was nothing. \n\nI think there are many philosophers and thinkers who say it’s our job to make meaning in life, and sometimes I think that’s true, other times I’m overcome with just wondering what the point of anything is, and feeling deep, deep grief and anguish.\n\nSo many moments when I think of him and just want to call him. The calm mornings with a cup of coffee, a random grocery store run, hiking with my partner and her son and seeing the mountains, being a parent to her son etc. i tear up anytime a character dies or death is talked about in a movie or show now. I bawled my eyes out watching *A Christmas Story Christmas* which isn’t even a particularly sad or poignant film, but because we watched it together all the time growing up.  \n\nWhat has really changed is my tolerance for discomfort- I just don’t have the tolerance for anything that I don’t want to experience anymore, like say I’m working a job and I’m in a situation where I should keep my mouth shut and ignore what someone has said, or simply enduring the tedium of the 8-9 hour work day, day after day- I just can’t. This has caused me to go through 10 jobs in the last 3 years (not good) and to lose friends, relationships and just make poor choices (drinking a lot). I’ve cut out friends and ended relationships over the smallest slight. I’m working on getting better about this \n\nI’ve also started experiencing intense anxiety, panic, and terror- specifically about health and death. It’s something I’ve tried to face head on and learn and understand, but it’s not easy. Though I do recognize it as an opportunity for awareness, growth, and understanding  \n\nI just miss him and wish I could spend one more day with him, or at least see him in my dreams\nmore often",
   "created_utc": 1704179336,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy64s6",
   "message": "Lost dad last year and I wish we had spent more time together so I missed him more but parents split when I was only a teen and haven't had much time for either of them since I grew up and had kids myself about 25 yrs ago so I'm trying to spend as much time as I can with my own kids before my times up",
   "created_utc": 1704179391,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy65yc",
   "message": "Lost my father in 2016. It was tough as bone cancer quickly took him without much notice. He told us in July 2015 and was gone in February 2016. My mother passed this past Labor Day. She had dementia so I had years to prepare. Still not easy and still dealing with estate things now.",
   "created_utc": 1704179414,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy6gmi",
   "message": "It doesn't hit you when you find out.  It all comes crashing down when something very minor happens and just punches you in the face.  \n\nFor me it was a small town gas station high school student asking how my father was doing.  I was back in town for funeral. I opened my mouth to say  \"we lost him\" and could not speak.  A minute later I  snapped punched my truck window cut my hand and laughed with my buddy about it.\n\nIf you are asking for yourself only those that know that can relate to you.  If you are asking on how to relate to a friend....do not send a text email or call saying \"if there's anything I can do let me know\"",
   "created_utc": 1704179622,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy6heq",
   "message": "Lost my mom in the last year of undergrad. We knew it was going to happen soon..she had lung cancer. Despite that, I wasn't prepared for how it would feel without her around.There has been an empty spot ever since. Nothing and no one can ever fill it..I have a few other maternal figures in my life and as much as I appreciate and love them, it's not the same. There will be times when I'll remember her and I'll have a good cry (like now, so thanks OP). \nThere are so many things I wish she could have seen or experienced and I always wonder how different it would have been if she were here.",
   "created_utc": 1704179637,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy71qv",
   "message": "I lost mine when I was less than 5 year old ,I don't even remember them .I felt nothing .",
   "created_utc": 1704180037,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy79md",
   "message": "I never believed in broken hearts.  But I had chest pain for 2 weeks after my mom died from cancer .\n\nIt was a real physical pain.  Did some research and it's called broken heart syndrome. High stress releases hormones that can weaken the heart temporarily.",
   "created_utc": 1704180195,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy7qiq",
   "message": "I lost my mom when I was 11, my dad was already out of my life but word got to me when he passed and I was 21.  I never got over it.  It stunted my emotional growth.  I have no concept of family.  I have a young son and I cling to him and watch him grow because that’s about the only joy I can feel.  I remember before my mother’s funeral being told that it isn’t likely, but if my dad does show up he can take me.  I never heard from the guy after my 9th birthday so that never became an issue.  All my friends growing up had these parents they could fall back on when things got tough, and I always resented them for it.",
   "created_utc": 1704180534,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy8i5l",
   "message": "I had been estranged from my dad for years. He had been sick for awhile but I think we had only talked over txt like maybe twice during that time.\n\nI woke up from a nap and saw a message from an uncle saying he’s sorry to hear about my dad. Either that meant 1. he had only recently heard that my dad had been sick, or 2. my dad just died. I assumed it was #2 and shrugged just thought *I guess it’s all over*.\n\nI went into the kitchen and my mom (they divorced when I was like 6 or 7) had come over while I was napping and she hugged me and started crying. I didn’t do anything and just waited for her to stop.\n\nI didn’t go to his funeral or do anything. Might as well have been a stranger who died.",
   "created_utc": 1704181091,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy9atz",
   "message": "emptiness. especially if it could have been prevented, I still blame myself and cannot forgive myself.",
   "created_utc": 1704181676,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfy9nsh",
   "message": "Worst feeling ever. Something you never heal from",
   "created_utc": 1704181937,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfya2e7",
   "message": "Have both my parents, luckily. But lost my grandfather in 2021 who literally was a parent to me, raised me since I was 1. Did everything for me, that a parent does. I was not in town when he passed away. My father didn’t tell me he has passes away, but all my time in flight I had a feeling that he has. When I landed, didn’t ask anything to my cousin in fear that he will say the word and I will break down. I was in denial and wanted to stay the same way. Once I got down from the car, saw the crowd and him lying there, it just felt like something shattered inside and I started crying uncontrollably. For the next few days, it was same grief coming in waves and I would cry a lot then next moment I will be okay. It took me a lot of time to have normal sleep. I was afraid to sleep as I would dream about him and when I would wake up the feeling of loosing him will become raw and I would cry again. I would revisit his pictures and videos in the fear that one day I will close my eyes and not be able to remember his face, voice and smell. Grief is hard, it takes time to get over this. But it gets better, as time passes you start accepting the loss and living again. You never forget the loss, you miss them in every good and bad moments in your life. But you accept the fact that it is how it has to be. You just start to live again. It takes a lot of time to be with yourself and be Okay but you surely get there.",
   "created_utc": 1704182236,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyavrf",
   "message": "I didn't realize my dad was truly gone  until the casket was put in the ground. Life as I knew it ended... I miss him everyday.",
   "created_utc": 1704182841,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyaw0c",
   "message": "I lost my dad way to early, I had just turned 21 and he died on his 60th birthday in his sleep out of no where, perfectly healthy. It was terrible. I love him him so much and miss him dearly. I have my favorite picture of him in my desk. That was 10 years ago. I hope to be half the man he was",
   "created_utc": 1704182846,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyc7sa",
   "message": "It depends on how reliant you are on them",
   "created_utc": 1704183858,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfydjvc",
   "message": "It's a mental wound that scars your soul, and neither fully heal, you just learn to cope.",
   "created_utc": 1704184912,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfydqb2",
   "message": "Lost my dad no long after my 20th birthday. We found him in his apartment, 7 years since and I can still remember that day. I lost a piece of myself that day.",
   "created_utc": 1704185058,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfygyvk",
   "message": "Awful horrible feeling that never goes away and you think about it daily",
   "created_utc": 1704187620,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyifmb",
   "message": "You lose your absolute safety net. The last people that 100% have your back",
   "created_utc": 1704188783,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfykbks",
   "message": "My mother died in November 2023. It's soul crushing. She was my best friend, my world. She died from a long illness and I was her caretaker. There simply aren't words for how it feels, honestly. It's a pain that makes you feel like a lost child, and it makes the world feel alien to you.",
   "created_utc": 1704190258,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfylns6",
   "message": "Like your heart has broken in 2, literally.",
   "created_utc": 1704191287,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfymk4r",
   "message": "A lot of it depends on your relationship with that particular parent, and whether you have any major unresolved issues with them. \n\nI had strong, grown-up relationships with both my parents, and no lingering issues or resentments. Each of their deaths was like having a pillar of support knocked out from under me, even though they had been very ill for a while and no longer really able to enjoy life. So, they were ready to go. But you’re never really ready to let them go. That’s just how it is. \n\nEven now, many years later, there are things I want to tell them, and will feel briefly sad, remembering that I can’t. I miss their counsel and perspective. But the thing is, I already know what they would tell me, so I don’t really need it.",
   "created_utc": 1704191970,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfymubc",
   "message": "it's horrible",
   "created_utc": 1704192184,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyo32r",
   "message": "The world becomes darker,  smaller. It feels less safe and also becomes less of yours. You feel alone and without the security your parents gave you when you were little. I still go to call my father years after he died. My mother is late stage alzheimers and has forgotten who I am. I call her a lot and we chat. Sometimes she remembers me briefly, then if I ask if she knows me she will say \"no.. but please keep talking. Your voice is familiar and makes me happy... I don't know you, but I know I love you. \"... that is heartbreaking... but nowhere near as hard as saying goodbye.",
   "created_utc": 1704193101,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyptv1",
   "message": "Lost my father at 10 although he wasn’t the greatest dad it still impacted me especially as I’m a dude though I feel I’ll always lack experiences because of how he treated me it kinda felt like hey man war is over and so is all the abuse so 10 yr old me showed no emotion but also due to the lack of understanding death I just didn’t care until I got older in my late teens now and he never saw me get my first tailored suit or meet my girlfriend or go to football games (more of a basketball dude) but he loved him some football. The only real feeling is just the lack of experience and a little disappointment/envy when seeing my homies have great dads n shit",
   "created_utc": 1704194354,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyqyka",
   "message": "Depends on the parent.",
   "created_utc": 1704195154,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyvpii",
   "message": "Guess it depends on how the relationship was. My dad and i rarely met up, i was lucky if it was more than 5 times a year but even when were apart we would have calls/video calls soemtimes. Just reached the one year mark of his death last week. It was painful for me, because there are so many things that happened within that one year that i thought would make him so proud. My cadet graduation, my first office job ever, etc . The couple of weeks after my degree convo though, it was the saddest i had been since i \"got over\" the grief of losing him. I guess you just never get over the feeling idk. \n\nWhen i was in uni, if i ever got sick even slightly , i would call him up first just to tell him that, and then i would call my mum.  The week after his passing , i felt so sick, got heavy fever and everything and it took every fiber of sanity in me to not drop him a call. Even up until now also when i get sick, i still get the urge to call him up but know i cant. \n\nI tend to try to not forget about his demeanor and everything. I hope i never forget how he sounded like or how he looked like when he was healthy and not sick. I always always get reminded of him when i saw his car model in the same color, or a stranger in the same style/physique as him etc. I recently moved to a rental unit and there was this old man (neighbour) in the same style and built as my dad and he would hang around in the hallway smoking there at nights. From the back view he looked 100% the same . I guess these feelings just linger. I mean youre gonna miss them when they're gone, but what can you even do when you cannot physically meet them and talk to them and update them of your life, and thats when the pang really hits at random times.",
   "created_utc": 1704198279,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyvt75",
   "message": "My mum passed from cancer when I was 12 in 1999 \nIt's one of the most soul crushing, painful and traumatic moments of your life. \nYou lose a part of yourself and you know you'll never get it back.\n\nNot a day goes by that you don't think about them either. I still feel miserable years later. The pain will never go away but it's easier to deal with over time. \n\nI've been told byy partner that a lot of the times I sleep talk I say I just want my mum back , mum why did you go, and mummy no don't go and other things like that.",
   "created_utc": 1704198341,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyw9tm",
   "message": "My mom passed away October 2015 from cancer.\n\nI had to hold it together for everyone else. Cried in my car in private somewhere but showed up places poker faced. Never did like showing emotion. Especially hard when you go to the hospital and you’re watching your parent die before your eyes. It isn’t like the movies where there’s final words and then they just die peacefully. \n\nWithin one day she went from talking and smiling to eyes going different directions and convulsing violently…then gone. Hard to watch.\n\nI remember going outside for a smoke because I couldn’t bear (bare?) to see her going through what she was. Get a call from the hospital that she was gone 10 minutes later while I was outside finishing my cigarette.\n\nIt doesn’t feel real. I guess it’s the shock like “Wow. This really happened.” \n\nTakes 2-3 days to kick in. Sometimes longer depending on the person.\n\nI’ll tell you one thing though. You can actually FEEL when someone is gone. When someone dies you look in their eyes and it’s just emptiness. Hard to explain.",
   "created_utc": 1704198621,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyxeng",
   "message": "Depends on how you lose them. \n\nIn my case, dad commited suicide. He had a severe depression and if that wasn't enough, his dad died from a lung infection not much earlier and a place that was really, really important to him was going to be sold. So he drove off and killed himself somewhere in the woods. But we only found out three days later. Now, I was used to not seeing him in the morning since he left very early for work but when he didn't come home in the evening and no messages or calls were answered it started to worry us. Next day came around and still no sign of him. We started to seriously panic and my mother decided to call the police to track his phone later that that day. It still took another whole day for them to find him. The anxiety at that point was unbearable. It's one thing to be terrified every waking moment but the moment when you actually have the confirmation is its own kind of torture. I remember playing Subnautica in an attempt to distract myself a little, to flee from the ever present anxiety at least for a few hours. The phone rang, my mother picked up and when I heard that soul-tearing crying from upstairs I knew it was over. Those cries. Once you hear them they become burned into your brain. And no matter where or when you hear anyone crying like that again you'll know what has happened. With my heart beneath the floor I walked upstairs to see my mother and sister crying like never before. In most cases I'm not one to easily cry and I thought that would change here but something strange happened. I wasn't able to naturally cry at that moment. My guess is that I was quite simply not able to process what I had just heard. Still, I forcefully cried because not crying seemed right then just seemed wrong. I took the next two weeks or so off from school and the entire time I actively tried to not think about my father or anything to do with him. I just wanted to get through the griefing process. At the moment it seemed like a good idea but now I regret it because I'm starting to slowly forget him. \nGetting back on track took actual years. After his death my grades declined rapidly and I became more and more self-isolated. I spent nearly every second I could alone in my room, avoided other people whenever possible. I even became depressive and suicidal myself for some time. To the point where I held a knife to my stomach. Thankfully I have since massively improved my mental health and now can wake up with positive thoughts again. But I have to live my whole life knowing that the person I was closest with never got to witness how me and my siblings turned out. I'm sure he is watching somewhere but... I don't know... \n\nIn general, dark thoughts and sudden outbursts of strong emotions will follow you for years. I honestly do not wish what I went through on anyone. Not even my worst enemy. The worst part is that I could have never imagined he would do such a thing, I always thought he loved us too much to leave us forever. And I couldn't share any final words with him. He and I had so much in common, he was a major part in shaping me into who I am today. My interests, strengths, hobbies, music taste. I always wanted to go to Wacken Open Air with him one day, he and I were the only true metalheads in the family. I haven't gone to WOA yet but I have gone to a Slipknot show and a Lorna Shore show last year with a friend. It was great but somewhere, buried underneath the excitement and happiness was that small part of me that knows that I would have wanted to make those memories together with dad. My graduation, the day I started my first job. The list could go on for so much longer. \n\nAt some point a started to believe that my dad merely faked his death and that he will come back one day. I still hold on to this believe because it gives me hope and doesn't make me sad. It even makes me a little happy. Because no matter how unlikely it is, it can happen.\n\nYou will go through your life and eventually learn to smile again and the world will start to become warmer. But at every achievement you make, graduation, proposal, promotions, everything, you will always see an empty chair and there will always be that tiny voice in the back of your mind that whispers this one sentence in your ear: I wish you were here right now\". \n\nAs a final advice, if you love them, don't push your parents aside for any reason. They won't be with you forever and you never know when they go. Spend time with them, create memories.",
   "created_utc": 1704199288,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyz2di",
   "message": "I don't have a first hand account, both my parents are still living, but I helped an ex survive his father's sudden death (started with pain complains in late December, was dead in mid April, fast paced lung cancer). He was an only child, very much dad's boy and it was so hard for him at the time. Our relationship crumbled 2 years after, he was just never the same. And my husband was raised by his single mom (father left the picture when she was pregnant, he died when my husband was 14 and he never met him), she was a constant staple in our lives, helped us raise our 2 older boys. And then she died suddenly January 30th 2021. Sudden heart attack, she thought it was her asthma's flairing up, did some medicine (Drs told us she sped the process by doing it) was dead in 30 minutes. He was a wreck, mid confinement and was hard to go to the funeral ( I tested positive for COVID that very day and couldn't go, he tested negative so he could go). We had our 3rd kid last march and I catch myself almost every day thinking how she would love this boy, he's her spitting image and she was a terrific grandma! Husband was almost in a breakdown if it was not for me and his sister, we helped him heal and mourn. Almost 3 years gone now and now he can talk about her, and laugh about her cleaning freak...",
   "created_utc": 1704200234,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyz3sx",
   "message": "its like there’s a wound in my body that never recovered. when you remember them it stings. but on normal days they are just there, reminding you of the loss",
   "created_utc": 1704200256,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfyz76j",
   "message": "I lost my mum 6 years ago suddenly, I was 22. It really was sudden, we knew she was in ill health, she was thin but she always was and still had plenty of energy.\n\nI remember I was playing rock band 4 and she started singing along/dancing in the kitchen while ironing some clothes to, black Betty by ram jam. Two days later she was on her deathbed unconscious.\n\nNight of she watched a movie with my dad and she said \"we should do this more often maybe a weekly thing\" My dad agreed and an hour later he was performing CPR on her in the upstairs hallway.\n\nIt feels like you had this solid foundation, a constant presence and then it's just ripped away from you, you never really get over it. You just kind of get used to it, unwillingly.\n\nThe switch is so difficult, the day after she passed. I started to go upstairs to get my charger for my phone and I said to myself \"oh I can use my mum charger, actually no she might need it for her phone\" and it just hit all at once. I just sat on the stairs and cried.\n\nI think that's as close as I can describe for you.",
   "created_utc": 1704200311,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfz2old",
   "message": "I lost my mom when I was 20, almost 18 years ago. I still miss her. \n\nNot every day, probably every week or so. I think it's mostly because I still feel a bit lost from time to time and she was always there to guide me and love me no matter what. I still dream about her meeting my wife and kids and she never will, I think that is what hurts the most. \n\nMy dad is getting very, very old and he's sick, and I often think what I would be like when he's gone as well.\n\nBut not having my mom also made me realise how much my dad loves me and my brother. Like unconditionally and endless support as well. He did the best he could, I think.\n\nSo yeah, I still miss her a lot, but I think of the loss, the grief and sorrow as love between us, that refuses to go away. Corny and unoriginal, I know.",
   "created_utc": 1704202175,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfz2v38",
   "message": "Lost my Dad when I was 32. I never really cried and I don't fully understand why. I loved my dad and had a better relationship with him then my mom. Even now my mom and I aren't super close. \n\nAs I age I have more regrets and guilts about my dad.",
   "created_utc": 1704202269,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfz5sb9",
   "message": "Your parents have been there since the day you were born like the sun in the sky or the ground under your feet.\n\nWhen my father passed suddenly from cancer, it was the most uncanny feeling. It felt like he was always in the next room or upstairs or just a text or phone call away. Just as you’re sure when you walk outside there will be a sun or moon in the sky.\n\nHe died in 2020, and it still feels like he’s there. I think I understand where the stories of ghosts and spirits come from, because he’s just always there. But he’s not. It’s a bizarre feeling and intellectually I know he’s gone but like a phantom limb there’s a presence. I think about my dad every day, just some lesson he taught me or advice he had.",
   "created_utc": 1704203728,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfz75d2",
   "message": "I lost my mum last August 2023, she died suddenly of a heart attack. I still struggle on a daily basis and I have to keep telling myself to carry on. I still have lots of firsts to get through,(first mother's day \u0026amp; my birthday) just had the first Christmas without her and I would say it's the hardest thing I've had to do in my life!",
   "created_utc": 1704204381,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfzbek4",
   "message": "You physically feel your heart breaking. It’s been 3 years since my parent passed and aside from their funeral, having their clothes not smelling like them anymore was painful.",
   "created_utc": 1704206328,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfzj5b7",
   "message": "Well. Seven year old me was too concerned with playing with my toy cars at the time. I can even faintly discern from my memories that I found the funeral to be boring and annoying.\n\nTbh I wish I could go back and slap that fucker in the face. :/",
   "created_utc": 1704209541,
   "score": 1,
   "submission_id": "18wdgau"
  },
  {
   "comment_id": "kfzzexg",
   "message": "It was a relief.\n\nShe was a psychopath. \n\nI found someone else to replace her. \n\nNo one is owed the title \"Parent.\"",
   "created_utc": 1704215572,
   "score": 1,
   "submission_id": "18wdgau"
  }
 ]
}