{
 "submission_id": "18wlywe",
 "title": "Your partner/date had a kink you just couldn’t get into. What was it?",
 "selftext": "",
 "created_utc": 1704189760,
 "permalink": "/r/AskReddit/comments/18wlywe/your_partnerdate_had_a_kink_you_just_couldnt_get/",
 "score": 222,
 "url": "https://www.reddit.com/r/AskReddit/comments/18wlywe/your_partnerdate_had_a_kink_you_just_couldnt_get/",
 "comments": [
  {
   "comment_id": "kfz598j",
   "message": "This guy told me he liked to wear shoes while doing the deed. This is actually a turn on for me for whatever reason, so I was down. We talk the day we’re supposed to meet and while Im getting his address he decided to tell me the full truth, which is that not only does he like to wear shoes, but he likes to wear his sneakers in the tub and fully saturate them with water and then proceed to have sex. The squishing sound of the water along with the feeling between his toes is what drive him wild apparently. I thanked him for his candor but told him we wouldnt be a good match. Unfortunately I had to block him cause he couldnt take no for an answer",
   "created_utc": 1704203470,
   "score": 183,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz0tvg",
   "message": "Public stuff. Not public but kinda discrete, she wanted to do public stuff right out in public, middle of the day, in the park, on the street, wherever. \n\nWhen it got to where I either did this or we broke up, we broke up. We remained friends.\n\nSo much so that when she needed someone to bail her out for indecent exposure, I got the call.",
   "created_utc": 1704201207,
   "score": 35,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyqgxu",
   "message": "I dated a girl that liked to bite me and not playfully either. I mean hard and leave a mark for life. Didn’t last long at all.",
   "created_utc": 1704194805,
   "score": 110,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz2mvq",
   "message": "Dated a girl who wanted to be beat the shit out of during sex. Not just rough. She wanted me to hit her as hard as I could so she could ‘see stars’.\n\nBeing good at sex is hard enough without having to throw haymakers the entire time.",
   "created_utc": 1704202150,
   "score": 252,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyz70v",
   "message": "Oh man, she was beautiful and fun but she wanted to be slapped around until her ears rang while having sex and that’s just not my scene",
   "created_utc": 1704200308,
   "score": 125,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyo8b6",
   "message": "She wanted to roleplay as a cat in the bedroom. I'll be honest, I wasn't bothered by the cat ears and tail, that's just decoration. It was the actual 'acting like a cat' part that made me feel gross, I don't want to fuck a cat....",
   "created_utc": 1704193207,
   "score": 107,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz4pfa",
   "message": "He needed ultimate control during sex. I could use my safeword any time during, but that was it. He told me his rules were that I could express preferences beforehand of things I'd like him to do, but not during. He also asked me if he could ignore my safeword if he was close to finishing, which was the biggest turn-off.",
   "created_utc": 1704203199,
   "score": 168,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzfgc8",
   "message": "Oh man, hooked up with one girl that called me 'dad.' Not daddy, not papi (which are also kinda weird in their own right) but 'DAD' That legit threw me.",
   "created_utc": 1704208046,
   "score": 118,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyqyny",
   "message": "Had a girlfriend who was into fisting. Personally I just found it dull and about as sexy as trying to unclog a drain, kind of ruined the moment.",
   "created_utc": 1704195157,
   "score": 136,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfykwqz",
   "message": "I dated a girl who wanted me to penetrate her but not move inside her. We didn’t last long",
   "created_utc": 1704190716,
   "score": 249,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfykm5j",
   "message": "Suckng my dick with Ice in her mouth. It was fine, but I don't like being cold",
   "created_utc": 1704190487,
   "score": 93,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfypa5g",
   "message": "One girl started to hit me with her fists once, proper punching despite me asking her to stop.",
   "created_utc": 1704193967,
   "score": 173,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyv8ki",
   "message": "Oh man, story time.\n\nI was in my mid-twenties and wasn’t in a real relationship but hit it off with this one chic and we started hanging out for daily “sessions”. It rapidly escalated where she was wanting me to choke her while we were getting busy. A little out my comfort zone but I complied. Then she wanted me to start slapping her in the face and requesting that I verbally degrade her; “tell me I’m a dirty fuck toy” “put it in my ass without telling me first and tell me you will cum on my face because I’m nothing but a living cum towel” Really pushing my limits of being comfortable, but I tried my best.\n\nThe last time we’re going at it, things are going great and then she just gets up off me, walks to her closet and pulls out a baseball bat.\n😳\nI had so many initial thoughts at once;\n“Omg, this crazy bitch is going to kill me now” and “omg, this crazy bitch wants me to hit her with that.” and pretty much so on. She then tells me she wants me to fuck her with it. Instant boner kill, “I’m sorry I just can’t do that” and left.\n\nThen I really began to freak out that she would stock or harass me. Two days latter I receive a bouquet of flowers at my work with a note thanking me for a great time and sorry that she was too much for me. Never saw or spoke to her again.",
   "created_utc": 1704197991,
   "score": 129,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyk2kp",
   "message": "Snorting coke outta my cupped foreskin",
   "created_utc": 1704190066,
   "score": 184,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyx0un",
   "message": "Person wanted to eat my ass , but wanted me to poop and not to wipe so they could it eat it then. Hell no no no no no.",
   "created_utc": 1704199064,
   "score": 49,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzarf4",
   "message": "Sleep sex. As in, waking her up with my dick, having put it inside her while she's asleep. The lack of explicit consent freaked me out, but I'll try anything once.\n\nSo there I am. It's a hot July day, 8am. She's asleep, naked. I'm at the foot of the bed _ahem_ getting myself ready. I gently push her knees apart and am on final approach...\n\n...when she lets rip the nastiest fart of all time and rolls over.\n\nMy laughter woke her up, and we had much more enjoyable, fully conscious sex twenty minutes later.",
   "created_utc": 1704206045,
   "score": 74,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfynlia",
   "message": "A guy I was dating was into knifeplay. I have no objection to any kink as long as it's consensual and people are sane about it, but I have a history with self-injuring and it just seemed like the world's worst idea for me to start associating knives with sexual pleasure so I had to break up with him.",
   "created_utc": 1704192743,
   "score": 105,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz228q",
   "message": "I was on top of this girl once and she slapped me, i didn't like nor dislike it but i said harder and follow through as a joke but i think she got the idea that i liked it then did it again and nearly sparked me right out 🤣🤣",
   "created_utc": 1704201851,
   "score": 10,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz6ncr",
   "message": "His insistence that he be the one to flush the toilet after me whenever I shit 😐",
   "created_utc": 1704204143,
   "score": 230,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyxuqg",
   "message": "I once briefly dated a girl who was always trying to get me to pee in her mouth and she had some weird “abuse” fetish.  She used to intentionally make me angry and pick fights with me when she wanted sex.  One time she even said, “come on, slap me around a bit” when she was doing her whole “start a fight as foreplay” thing.  I couldn’t do any of those things and we didn’t date very long.",
   "created_utc": 1704199545,
   "score": 251,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyt3l4",
   "message": "She was a \"little\"\n\nWanted to suck a pacifier and snuggle a blanket while being fucked\n\nIt left me as erect as a wet tissue.",
   "created_utc": 1704196614,
   "score": 114,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyzf14",
   "message": "[removed]",
   "created_utc": 1704200432,
   "score": 215,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzrn6z",
   "message": "An American woman and I (UK) had “cybersex” in the early internet days. It was 1995. She was very submissive/masochistic. She found out that I could speak German and this turned her on. She told me she was half Jewish and wanted me to play out a concentration camp scene fantasy with her. She was even willing to pay me to fly out to her to do this irl. I refused to do this, so she settled on us doing another scene where I swore, cursed and belittled her during sex. I decided to stop “”seeing her” after this one last session. She had also started faxing me barely discernible photos of herself at work and I was a little freaked out by this too!\nI was a bit lost about what degrading names to call her during the sexting (online forum chatroom) but soon got into it. I called her a stupid bitch at one point. She halted the role play and broke up with me right there. Her reason - she loved being called a bitch, but would never stand for being called stupid. That was when I confirmed that Brits and Americans have a weirdly different relationship with the word stupid.\n\nETA: I just remembered a lot more about this. It’s been so long since it happened. The incident in question happened over the phone, not in the forum we’d met on - she would call me from her work after everyone else had gone. A few days later she sent me an email saying she’d received my photos (sent by snail mail), and she was glad she broke things off as I “looked too Mexican”.",
   "created_utc": 1704212779,
   "score": 184,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz97xv",
   "message": "She liked cheating on me and I just couldn't get into it.",
   "created_utc": 1704205348,
   "score": 194,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyq27l",
   "message": "I’ve dated submissive women and I’m a submissive man.",
   "created_utc": 1704194517,
   "score": 170,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz3t94",
   "message": "My partner is into me, and I just don't see the appeal.",
   "created_utc": 1704202750,
   "score": 88,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzqd88",
   "message": "Fisting and extreme gape.  Cool, I know what your cervix looks like and your vagina has lost its connection in my brain as a sexual object and is now a medical anomaly.",
   "created_utc": 1704212308,
   "score": 122,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz6s2w",
   "message": "Pro MMA fighter insisted on teaching me to grapple",
   "created_utc": 1704204207,
   "score": 243,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyq8ab",
   "message": "My fwb years ago was a black chick with a race kink and wanted me to call her the N-word in bed - with the hard \"r\" sound. The fwb thing didn't last long after that",
   "created_utc": 1704194636,
   "score": 101,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyshrn",
   "message": "He’s on Reddit and comes up on my account sometimes so might see this oops \n\nOn our second “date” within 5 minutes he asked “what are your kinks” which shocked me a bit and then he immediately told me he has a piss kink \n\nWhen consensual and safe, piss kinks don’t bother me and I don’t judge. It’s not promoting violence and it’s not unethical. Just not for me at all and same goes for any bodily fluids. \n\nHe never seriously tried to get me to try it and respected that fact though",
   "created_utc": 1704196211,
   "score": 120,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzf7gs",
   "message": "He wanted to blindfold me and bring in strangers to have sex with me in front of him. I wouldn't know who these strangers were and I wouldn't get to see them before or after the sex. No judgement toward him but having sex with anonymous strangers does not sound hot to me at all.",
   "created_utc": 1704207943,
   "score": 84,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz0jir",
   "message": "Had an ex who was super big into pet play. I just couldn’t do it, I couldn’t take it seriously. I’ll call you whatever you want but I can’t bring myself to make you eat from a fuckin dog bowl, that’s just too much for me",
   "created_utc": 1704201053,
   "score": 72,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyukrw",
   "message": "slapping her in the face i don’t want to hurt her i love her but sometimes i do slap her as she likes it but i don’t really like doing it",
   "created_utc": 1704197575,
   "score": 96,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzdaeh",
   "message": "Washing cars.\n\nUgh. 2am, she rolls over, nudges me in the back with a bucket of soapy water.\n\nIf I’m feeling it, I’ll have to get dressed, take the bucket, and start washing the cars that she can see from the bedroom window.\n\nLike, I get kinky, I’m into it, but in January?? Babe, you’re insatiable.",
   "created_utc": 1704207146,
   "score": 1,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz6ibt",
   "message": "After i fucked this chick i met earlier in the day in her hotel, she wanted to sleep with my finger in her pussy, every I time removed it she woke up and put it back, weird af",
   "created_utc": 1704204077,
   "score": 249,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzeswz",
   "message": "Dated a girl who was into MMA and doing MMA, she trained jiu jitsu and wanted me to punch her in the face while i fucked her. Not like softly either, she wanted me to fully punch her and basically fight her while inside of her. \n\nTo this day ive never slapped someone as hard as i slapped her and she wanted more. Just couldnt do it.",
   "created_utc": 1704207774,
   "score": 227,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyp4yx",
   "message": "She wanted me to hit her during sex. Not playful slapping either, I'm talking closed fist,  punch her in the back of the head. \n\nI'm not one to Yuck somebody's Yum, but she had some serious issues",
   "created_utc": 1704193864,
   "score": 201,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzjwa9",
   "message": "ball busting. i am normally an open girl when it comes to kinks and everything. but this one was too much for me.\n\nhe wanted me to, without exaggeration, step on his balls when he was lying down on his back and his legs up. not just step. but place my foot down and hit him hard OVER AND OVER. he also told me he wanted me to kick his balls randomly. i don’t know, personally this made me sick to my stomach.\n\nEdit: it’s funny to imagine too because I am a 5’2 asian girl and he was a 6’3 black man who was the stereotypical “male” (loving sports, overly compensating by being hypermasculine). Imagine during football practice you see this guy bending down AND YOU SEE MY BRIGHT PINK THONG ON HIM?!?!",
   "created_utc": 1704209837,
   "score": 87,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzlxpu",
   "message": "My ex husband and I were getting passionate ...he sat back and made the boobie hands 🙌 like babies do and said \"Come to Uncle Scooby\" ....I didn't know whether to laugh or cry.",
   "created_utc": 1704210628,
   "score": 250,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzkvvf",
   "message": "Guess Im not as degenerate as I thought, only half the shit in this thread turns me on",
   "created_utc": 1704210224,
   "score": 0,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyv3tj",
   "message": "Sounding.",
   "created_utc": 1704197908,
   "score": 46,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyueyn",
   "message": "She wanted candles, candles everywhere, and instead of fucking, i had to drip the hot wax on her back, ass, tights, pssy.\n\nShe was a really catch though, aside from this kink, she was a really beautiful ginger with blue eyes ... :D",
   "created_utc": 1704197472,
   "score": 126,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyv02l",
   "message": "My ex one day told me she would like it if I held her while another guy fucked her. That was one step of my losing feelings for her.",
   "created_utc": 1704197844,
   "score": 32,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzey5i",
   "message": "he kept wanting me to pretend to be dead whenever we had sex",
   "created_utc": 1704207837,
   "score": 160,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzcgk9",
   "message": "an ex that was into body suspension. had to let her off the hook",
   "created_utc": 1704206790,
   "score": 209,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzd1wk",
   "message": "She wanted me to act like a thief, break into her house then take advantage of her.\nFYI i am a black dude.\nAt that point i knew it was a trap, i had to leave.",
   "created_utc": 1704207045,
   "score": 197,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz8c80",
   "message": "No, please don't piss in my face while I'm going down on you, because you \"ex totally loved it as well\".",
   "created_utc": 1704204942,
   "score": 128,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzup6z",
   "message": "Threesomes.\n\nDidn't do it but he expressed that he wanted to have a third for a 1 guy 2 women even though I wasn't into other women. But that was fine with him as I didn't have to do anything with the 3rd, basically he just wanted to do 2 women at once.\n\nI asked \"How about with a guy for me?\" Without irony he said that it was gross, he wasn't gay, and the fact that I even considered it was emotional cheating.\n\nEdited some wording\nEdited again because I don't want to get the order wrong and give the wrong idea of what was being asked, thanks xargling_breau",
   "created_utc": 1704213890,
   "score": 161,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzpl78",
   "message": "Bro how do all of you guys find these people the most I’ve gotten is the pillow princess special 😭😭 mfs out here like “she wanted me to beat her ass with a baseball bat and wear a catsuit” 😭",
   "created_utc": 1704212016,
   "score": 64,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz3qfj",
   "message": "I dated a dude that wanted me to step on his junk in heels. I tried it, did the whole Dominatrix bit. But I could **not** bring myself to use the actual heel. I was open to just pressing down on him with the toes a bit, degrading him, slapped him around a little Like, some pressure on the package won't alter him for life....but if I fuck up with the stiletto heel? One stumble and his life is ruined.\n\nTurns out I'm a much better sub and very much prefer that to being asked to have his reproductive abilities in the grasp of my toes and ability to balance.",
   "created_utc": 1704202710,
   "score": 122,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyrymn",
   "message": "A guy I was seeing for a few months wanted to literally eat my shit as it was coming out of my ass. \n\nFor context, both guys and he had done it before with another guy, first time we met he \"drank from the tap\" 4 times.",
   "created_utc": 1704195851,
   "score": 185,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyxp0w",
   "message": "I had a FWB kind of thing with a really sweet girl a few years back. Things started off normally, regular sex that left us both satisfied.\n\nOver time she added things she wanted to try. Spanking, face fucking, choking, slapping, things like that. \n\nThe last time we were together she was on the bed on her back. I was fucking her face, my hands were alternating between pulling on the choke collar she was wearing to yanking on the chain connecting the nipple clamps to smacking her clit \u0026amp; pussy. She pushed me back and asked me to piss on her face. \n\nI took a step back and looked at what was going on and wondered how we ended up here. I told her I wasn't comfortable with this anymore and ended things with her right there.",
   "created_utc": 1704199453,
   "score": 155,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyu62f",
   "message": "The dog/pup mask. Nope.",
   "created_utc": 1704197314,
   "score": 154,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyrn90",
   "message": "He had a hair fetish. Also, he seemed like a very negative person to me.",
   "created_utc": 1704195633,
   "score": 110,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzuayf",
   "message": "Please god let me find a girl even half as kinky as all the girls people are complaining about in this thread! 🙏",
   "created_utc": 1704213746,
   "score": 192,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyxwym",
   "message": "Kept trying to shove things up my ass. No likey. No feel goody.",
   "created_utc": 1704199582,
   "score": 220,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfywwnd",
   "message": "I had a girl scream at me to punch her in the face mid sex.  I stopped and chuckled and said  “I am not doing that” and she gave me a pouty face before begging me to keep going.  Super awkward and it was wild that in the moment she wanted me to hit her.  She told me later she just wanted me to be really rough with her.",
   "created_utc": 1704198996,
   "score": 218,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyp9y0",
   "message": "She wanted me to put my penis into her vagina.",
   "created_utc": 1704193963,
   "score": 184,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzd10g",
   "message": "One woman, after many drinks, asked me if I'd be willing to fuck her in the ass while drowning her in the bathtub.\n\nI don't know, anal just gives me the ick",
   "created_utc": 1704207034,
   "score": 156,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kg0jlzx",
   "message": "She wanted us to have sex while her brother was in the room masturbating. We broke up shortly after this suggestion.",
   "created_utc": 1704222569,
   "score": 43,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfzdxff",
   "message": "My wife is really into public sex. Like anywhere. On a plane, in a park, you name it. \n\nI cannot do it for the life of me. I get so anxious I’m doing something wrong. I find the idea hot but when it comes to following through it doesn’t work. \n\nWe compromised and we go backpacking in some remote areas and have sex outside.",
   "created_utc": 1704207412,
   "score": 250,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfytesw",
   "message": "Rape.  That’s a hard no for me.",
   "created_utc": 1704196821,
   "score": 173,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyyy9o",
   "message": "Was with a guy who had to be told very firmly to stop licking my armpits. No. Just fucking no.",
   "created_utc": 1704200169,
   "score": 159,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfz0zlt",
   "message": "i dated someone who would feel proud of how her boobs didn’t feel anything even if she pinched them real hard. she asked me to pinch them as hard as i could. i just could not bear the sight of it cuz my brain was registering it as painful and it left a trauma in my head. needless to say we didn’t date for much longer.",
   "created_utc": 1704201292,
   "score": 152,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kfyszjg",
   "message": "“just couldn’t get into” means I couldn’t do it? Or I wasn’t into it? \n\nI once met someone who’s really into BDSM. All the way to her crying from pain but still not using her safe word. \n\nI was fine doing it. I would totally do it again if anyone likes it. It’s an interesting experience and I’m glad to give people what they need as long as it doesn’t cross my boundaries. But it wasn’t much of a turn on for me.",
   "created_utc": 1704196540,
   "score": 173,
   "submission_id": "18wlywe"
  },
  {
   "comment_id": "kg0vbn5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18wlywe"
  }
 ]
}