{
 "submission_id": "18wqs7u",
 "title": "People who refused to let police search your vehicle during a normal 'run of the mill' traffic stop, what happened next?",
 "selftext": "",
 "created_utc": 1704206000,
 "permalink": "/r/AskReddit/comments/18wqs7u/people_who_refused_to_let_police_search_your/",
 "score": 60,
 "url": "https://www.reddit.com/r/AskReddit/comments/18wqs7u/people_who_refused_to_let_police_search_your/",
 "comments": [
  {
   "comment_id": "kfzxh07",
   "message": "Car smelled like weed because my dumbass friend brought his packed pipe and stuck it in the glove box. Calmly refused the search. Cop said that was fine but now he was going to call the dogs to come have a sniff. Made us sit and sweat for about 20 minutes, then walked up, said I was \"lucky\" and he had been called away somewhere else, and to not drive stoned.",
   "created_utc": 1704214881,
   "score": 20,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzsaha",
   "message": "The one time I’ve declined it went like this cop: “why does your vehicle smell like marijuana?” Me: “I wasn’t aware it did” cop: “ may I search your vehicle?” \nMe: “No” cop: “ok have a nice day”\n\nThis was a once off. Before that I was dumb and let them search my car. That was the last time I’ve been pulled over so I’ll see what happens next time.",
   "created_utc": 1704213017,
   "score": 230,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzv2k0",
   "message": "I’ve always said no I do not give consent to search. It’s never been an issue.",
   "created_utc": 1704214025,
   "score": 151,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzy98v",
   "message": "K9 officer walks his dog around my car after I said he did not have permission to search after a broken taillight stop.  \n\nDog \"hits\".  I ask him how he knows.  He's \"specially trained\".  Searches my car, finds nothing...but someone definitely smoked weed in this car (they didn't).  \n\nFavorite part of that stop is my car was messy AF so he had to sift through everything just to find nothing.",
   "created_utc": 1704215162,
   "score": 114,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg02m3h",
   "message": "Back in 2001, I was 17 years old and picked up my buddy from work at 11 pm on a Friday, who was also 17 years old. I was waiting in front of the grocery store where he worked. He ran out of the store just being an idiot and got in my truck. There was a police car behind me. Police car followed me out of the parking lot and immediately pulled me over.\n\nHe asked if he could search my truck. My truck was a tiny 2-seater; if we'd stole anything, there was no place to hide it. I said for what reason? He just asked to search it again, and I said no. He could see that my buddy was still wearing his work clothes.  Cop came back and gave me a ticket for having a clear license plate cover (they were legal at the time), but said it was cloudy and obstructing my plate. Obviously looking for something to punish me for.\n\nI pled \"not guilty\" to the ticket and requested a trial. Went to initial hearing, told Judge the story and showed Judge the cover (that it was clear). Just asked me to just leave it uninstalled and threw out the ticket.",
   "created_utc": 1704216696,
   "score": 217,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzpbkf",
   "message": "Context from Montana driving through Minnesota in my wife's bugeye WRX.\n\nPolice: Mirror tinting is illegal, I'm going to need to search your car since I can't see into it.\n\nMe: Sir if you take a closer look you'll see that it's not mirrored. It starts dark at the bottom and turns blue from the middle to the top. You should absolutely be able to see in.\n\n**Police checks then walks around and comes back.**\n\nPolice: Looks like you have an illegally modified exhaust.\n\nMe: Sir that's stock exhaust on a WRX and it's completely legal in Montana.\n\nPolice: Why are you in Minnesota?\n\nMe: Visiting family.\n\nPolice: You're free to go.\n\nMe: You don't need my license and registration?\n\nPolice: *sighs* Just go.",
   "created_utc": 1704211915,
   "score": 101,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg03phc",
   "message": "I had an old honda with bad paint.The panels of the car were different shades of the same color. Officer told me straight that my car looked like a drug carriers car.After i declined to cooperate they brought out the dogs found nothing and i was begrudgingly allowed to leave.    For about the next two years i was pulled over ALL the time. Always with a made up reason like saying i crossed over a dividing line.  \n\n It was very frustrating and i tried to find out the magic formula to be on my way quicker.I tried letting them search once.that was a mistake, my car was so aggressively searched as they tried to find hide spots that i knew to never do that again plus it didnt save any time .\n\nI tried different ways to talk to approaching officers. Tried short and sweet.tried super respectful.tried asking about the legality of my stops.All methods. Generated the same reaction..some accusation or quesioning of why i was being \"suspicious\" or \"nervous\". Oh yeah 90 percent of the time when i refused a search they brought the dogs. \n\nI never cracked the code.i did learn a lot about officers during those two years.only in the very first incident did the officer reveal that my car was basically profiled.The others knew better.police officers..theyre all different but theyre also all the same. Two different times my car was approached with gun drawn in officer hand. It sucks to be broke and look broke",
   "created_utc": 1704217078,
   "score": 83,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzmmqt",
   "message": "At a DUI checkpoint, an officer asked to search my car. I made it perfectly clear that I do not consent to searches. So the officer claimed to smell weed coming from my car and that magically gave him probable cause to search.\n\nI haven't smoked weed in over ten years, and my car has never had weed inside, smoke or otherwise.  It seems cops are using the *\"I smell weed\"* excuse to circumvent search and seizure laws.\n\n*Edit 1: spelling errors.*\n\n*Edit 2: Since so many asked about the outcome. The cop searched my car, found nothing, and sent me on my way.*",
   "created_utc": 1704210895,
   "score": 132,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzxw67",
   "message": "Pulled over for not turning my lights on in a parking lot (realized they were off and turned them on before getting to the road). \n\nThe cop asked if I’d been drinking, to which I replied no. He asked if I had any open containers, to which I said no, and I stated I didn’t consent to a search when he asked if I minded if he checked.\n\nHe then informed me that turning your lights on late was a sign of being drunk, so he really needed to check. I said that I’d already responded that I hadn’t, and I still wasn’t consenting to a search. He then went straight pissy mode claiming he was just going to give me a warning until I started getting all “unfriendly” with him. I told him that I agreed that I turned my lights on fairly late, but he was effectively calling me a liar to my face, so unless he had reasonable suspicion and I was being detained, I’d be happy to take my ticket and move on.\n\nHe cut me off just before the end of it and said I was free to go. It’s sort of like a game to them, but if you’re saying enough of the right words, they have to decide if they have anything better to do that night or not. Luckily for me, it seemed there were other things for him to do.",
   "created_utc": 1704215033,
   "score": 243,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzgls8",
   "message": "A lawyer guy on U tube just revealed that the police won't necessarily ask to search your car but they'll say things like: \n\n\"I see something odd in your back seat, can I take a look at that ?\"\n\nOR\n\nCOP: \"You have a tailight out.  Pop your trunk and let me see if it's a wiring issue\".\n(No, officer, You're not a qualified mechanic and maybe not even a good electrician.  So I'll get that looked at by my guy\".)",
   "created_utc": 1704208522,
   "score": 191,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzwuv4",
   "message": "Was at a gaming party with my colleague bros. Played COD tell 2am. Went to drive home and I saw a cop outside the house I was hanging out at. As soon as I left he followed me and pulled me over. I asked why I was being pulled over as I barely got to even leave the driveway. He told me he ran my plates and that the vehicle was stolen. Turns out he never ran my plates just wanted to check if I was drinking. Was very upset to be pulled over for a false cause. Told him only thing I had to drink was Mountain Dew and monster energy.",
   "created_utc": 1704214660,
   "score": 154,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfznkea",
   "message": "I was sent on my way with a warning. A friend and I were leaving a New Year's Eve party and got pulled over. The officer asked if we had been drinking, I hadn't and was driving. He then asked if he could search the car for any open containers of alcohol which I declined. He then said I had been swerving and to pay better attention. I wasn't swerving.\n\nMy girlfriend's mom was a traffic court judge and told me this was most likely an attempt to get the first arrest or ticket of the year and win an office pool. Since I wasn't obviously doing anything he didn't want to waste his time and sent me on my way.",
   "created_utc": 1704211251,
   "score": 33,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg020q1",
   "message": "I got searched anyway. \n\nFYI when this happens, just state your refusal to give consent and dont answer any questions without a lawyer present. They can lie and manipulate you into giving consent. Sure, they'll probably search your car anyway, but the time to fight that is in court. \n\n\u0026amp;#x200B;\n\n\"Officer I do not consent to a search of my person or vehicle, am I being detained?\" the last bit is kind of a meme, but its an important question to ask.\n\nIf you can, record the interaction. I have a dashcam thats meant for uber drivers but after my experience with the cops, I have it angled so it can record me and my interactions at a traffic stop.",
   "created_utc": 1704216487,
   "score": 228,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg054a9",
   "message": "FYI In the state of Massachusetts smell is not lawful reason to search a vehicle without consent…\n\nKnowing that saved me a whole lot of trouble back when I was 16",
   "created_utc": 1704217568,
   "score": 186,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg094qz",
   "message": "I went through cop school and graduated. Had a change of conscience after graduating and an undetected heart defect was also going against me. \n\nLet me just say this. \n\nRegardless of whether you have anything illegal in your car, NEVER consent to a search. \n\nRegardless of whether you have anything illegal in your car, NEVER agree to wait for a drug dog when they threaten to call for one. \n\nRecord all interactions, just as they do with you.",
   "created_utc": 1704218953,
   "score": 172,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg09145",
   "message": "They searched the car for Late Triassic fossils of trees but didn't find any, and let us go.  \n\n\n(Petrified Forest National Park)",
   "created_utc": 1704218918,
   "score": 22,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzkll9",
   "message": "They will reverse a question to trap you.\n\n\"You don't mind if I look in your trunk do you?\"\n\nYou reply \"yes\"\n\nWas it yes, as in it's ok or yes I mind? Illegal search? The judge will most likely side with the police. Seen a lot of 1st amendment constitutional videos, they have taught me a ton. \n\nAlways R-E-C-O-R-D your interactions with law enforcement. It's your right.",
   "created_utc": 1704210112,
   "score": 216,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg01ns3",
   "message": "Context:  was 16 years old in 2004,  first couple months of having my license.  Small city of maybe 20K.  Earlier in the evening my friend and I saw some of our other friend in a parking lot.  We went over and talked to them for a bit,  as kids do,  and then we left.  Was basically just driving around all night hanging out,  no drugs or booze.\n\nWhat happened:  got pulled maybe 20 minutes after leaving our friends in a parking lot (they had their own cars).  Police officer said someone called and said we were dealing drugs and she needed to search the car.  I stood my ground and said “no” over and over again while my friend shit his pants.  She eventually got me out of the car and was trying to intimidate me into letting her search it.  I didn’t have anything illegal on me or in the car but I knew she was in the wrong.  She eventually gave up and told me to go home, which opened up a whole other discussion.",
   "created_utc": 1704216363,
   "score": 8,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzhvcl",
   "message": "They asked why I was refusing. “Because you asked, so I have the option of saying no” the cop continued, “what are you a lawyer?” My response “no, actually I’m a veteran and voluntarily giving up my constitutional rights for no fucking reason isn’t something I do lightly, and if there’s no other questions I would like to be on my way?!” Handed my documents back and that was it. Simply put, if a cop asks to search your car the answer is always, NO! Why? Because they asked!",
   "created_utc": 1704209035,
   "score": 164,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg0owum",
   "message": "I refused to give consent to having my car searched.  I was then asked to get out of my car and take a field sobriety test.  I declined and insisted that I be given a blood test instead.\n\nI was taken to the ER, while my car was impounded, my blood alcohol level was determined to be 0.0 because I had not been drinking.  I was still expected to pay to get my vehicle out of impound, where it had been searched \"for safety reasons,\" (nothing illegal was found, of course.)  Not only did I refuse to pay, but the damage done to the car in their \"search\" was extensive.  (They didn't search the car in the impound lot, they just vandalized it extensively, including ripping up carpet, shredding the car seat's vinyl and stuffing, smashing windows and ripping off door panels and poking holes in the gas tank.)\n\nI sued in court over this whole thing, and since the cop who initially pulled me over kept lying to the judge about his reasons, and getting caught in those lies, since he *thought* he had turned off the dash cam in his car, he assumed that he couldn't be heard or seen when he and the other cops he called to the scene conspired to penalize me for refusing the search.\n\nI won.\n\nI won so much I was able to get an even nicer car on the taxpayers dime.\n\nNothing, of course, happened to the cop who fabricated the whole situation.",
   "created_utc": 1704224386,
   "score": 217,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg045nf",
   "message": "I just told him no, I'm not consenting to a search.\n\nThe cop brought a K-9 in to sniff the outside of the vehicle. No idea why, because I was only pulled over for an expired inspection sticker. He seemed a bit irritated when nothing was found and wrote me a ticket for the sticker. He could've written the ticket at the beginning and saved us both an hour.",
   "created_utc": 1704217233,
   "score": 195,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg03oll",
   "message": "Got pulled over because I pulled out of a shady hotel parking lot. Cops asked to search my vehicle since the hotel is a known drug den. I respectfully declined. The officer was extremely pissed. He said if I didn’t consent to the search they would bring a K-9 unit out and if they got a hit, they’d search and I’d be arrested. I called their bluff. After waiting for the K-9 unit for 40 minutes (which never came), they sent me on my way.\n\nEdit: I pulled into the hotel parking lot because my gps was going crazy and I didn’t know where to go. I never got out of my car in the hotel parking lot. I’ve never done or had possession of any drugs in my life.",
   "created_utc": 1704217070,
   "score": 131,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg05qs7",
   "message": "They impounded my vehicle.\n\nThe follow-up lawsuit cost the cop, the prosecutor, and the deputy chief their jobs.",
   "created_utc": 1704217784,
   "score": 189,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzkrpg",
   "message": "The usual next step is they will have a K9 sniff around and if the dog alerts then you're getting searched whether you want to or not.  If the police think they have sufficient cause to search your vehicle, they'll find a \"reasonable cause\" to do so.",
   "created_utc": 1704210180,
   "score": 179,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzrjgg",
   "message": "I said, \"You have the right to walk around this car and look inside it, from the outside, you have no probable cause to search it.\" \n\nOne time it was because \"I ran a stop sign\", (which I absolutely did NOT) and it was really because I drove a hoopdie at the time, around a small town I was visiting. It was absolutely a case of profiling, because he was *visibly* shocked when he came up to the window and saw I was a petite white woman. \nThey wanted to search, I said no. They didn't. (I didn't get a ticket for the stop sign either, because that shit was bunk.) \n\nThe other time I was stopped for a headlight out, and my passenger was a felon. They pulled us out of the car, and asked to search it. I gave the exact answer I gave above. They walked around the car, shining their flashlights inside, gave me a fix it ticket, and let us go. \n\nPeople get tripped up with this because, if they have committed an arrestable offense, their rights are already gone when the cop asks. \nIf you say no, they're going to do it anyway. \n\nThe cop doesn't even have to arrest you for the infraction they got you for, (in my case, it was driving w/o ins, without knowledge, an arrestable offense, but inside the ability of an officer to issue you an appearance ticket. I had refused consent to search, but it didn't matter, because already in arrestable trouble) \nBut they definitely will, if the officer finds something in the car that they want to charge for.\n(In my case, I had joint roaches in my ashtray, back in the day when that was criminal behavior. The cop was a bro, and only made me throw them in a puddle) I got an appearance ticket and went home that night.",
   "created_utc": 1704212741,
   "score": 70,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzzt20",
   "message": "He shined a flashlight in my windows and then went back to his car.  This went on for about 45 minutes, back and forth.  Then he wrote me a ticket because one of my two little license plate bulbs was out.  Same guy pulled me over 5 times.  Same deal, but received different warnings/tickets.  One for an air freshener on my mirror, one for a parking pass displayed on my dashboard, all stupid things.  He told me once that he pulled me over because there was a car ahead of me, and drunk people follow other cars.  He was fishing on a college housing road late at night.  I was never drunk. I worked two jobs and had to use on-campus labs for school work, so I kept weird hours.  Dude acted like I was the one inconveniencing him.  All of the other neighboring police, campus police, and AFB police were all cool.  It was just that one city full of assholes and their city limits started half way down that road.",
   "created_utc": 1704215711,
   "score": 222,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg00kky",
   "message": "He pulled me over for my tint, but I kept the receipt in the car with the % which was right at the legal limit, so he had nothing to get me with there. He insisted my car smelled like cologne/Axe Body spray for the reason he needed to search my car which I told him that isn't close to probable cause. He told me to wait in the car dicked around him his and again tried to give him consent to search my car which I can told him to fuck off in a more polite way. He dicked around in his car more than told me I could go.",
   "created_utc": 1704215982,
   "score": 151,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzazmm",
   "message": "My ass got searched.",
   "created_utc": 1704206146,
   "score": 169,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg0caz0",
   "message": "I’m an attorney and politely declined a vehicle search in Maryland. Backup arrived. I was never told why I was pulled over nor did I ask. After declining the search, they brought the K9 which inevitably hit after I saw the officer give the dog the signal by tapping on the door three times. Of course, they tore my car apart and found absolutely nothing as I don’t do drugs, drink, or take any medications beyond the occasional multivitamin. I’m in law enforcement and know that many, MANY police officers train in a backdoor signal to drug K9s that manufacture probable cause to search. They might tap a couple of times or say a code word and the dog will “hit” whenever they do. Nothing ever came of the stop, after 6 cruisers, 8 officers, and a K9. All because I refused a search and politely refused to answer any questions. After the stop was over I was issued a warning for 37 in a 35. I also made sure to alert the officer handling the K9 that the dog’s false-positive needs to be added to the dog’s report as it’s discoverable evidence the next time he secures an arrest. He didn’t like that.",
   "created_utc": 1704220059,
   "score": 2,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg03bqn",
   "message": "Standing up for your rights and not answering questions should never be a reason for police to search your vehicle/retaliate against you.  I'll say it once again, cops are not your friends.  They are fishing for probable cause.  Don't answer questions and be polite.\n\n\u0026gt; Where are you coming from?\nSorry, I do not answer questions.\n\u0026gt; Where are you going?\nSorry, I don't answer questions.\n\nYour answers will be used against you.  \"Oh, you are coming from the bar?  I detect the odor of alcohol.  How much have you had to drink?\" or \"You are coming from xyz neighborhood?  That's a known drug area.  Do you have drugs?  May I search your car?\"\n\n\u0026gt; Do you know how fast you were going?\nYes.\n\nThat's it!  You don't want to admit guilt by saying you were speeding and don't want to come off as you aren't paying attention.\n\nYou don't need to roll down your window all the way to speak to the police.  It only gives them leeway to \"smell\" something or peek in your car.  If they think they smell anything deny everything so it's on camera.  You should also record your interactions with the police.\n\nAdditionally, in Florida you do not need to consent to a road side sobriety test.  \"Well, I'm going to have to make my determination based on all the information you've given me then\".  If you are drunk or even if you aren't, doing the rest will not be in your favor. You do need to submit to a breathalyzer or blood test and step out of the vehicle if they request you.  YMMV. IANAL.",
   "created_utc": 1704216946,
   "score": 74,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg08j26",
   "message": "Was pulled over for \"breaking curfew\". I was 23 and my wife was 20. It was around 11pm and we were driving home after a date night.\n\nOfficer looked over my license, registration, and insurance and then asked to search the car since we were \"too young to be out that late\".\n\nHe then asked to search the car. I said no. He then told us to wait there while he called it in and that other units would be there shortly.\n\n10 minutes later, he just drives off. So we continue on home.\n\nSmall town cops.",
   "created_utc": 1704218746,
   "score": 71,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg011as",
   "message": "Within seconds of being pulled over for “swerving” (I wasn’t) a second car pulled up with a drug dog. He said “your dad’s license is expired”. To which I said “does that affect my license some how?” He pauses then goes “No…We are performing random searches, stay in the vehicle”. \n\nProceeds to bring the drug dog to my trunk and starts barking and jumps on it which gives them probable cause. I’ve never done drugs in my life. They put me in the back of a cop car and proceed to tear everything out of my car including my musical instruments on the side of the highway for an hour. They asked me about 5 times if I have any hard drugs and had me do DUI tests. Finally let me go when they found nothing. I get back into the car and I can see they even went through my GPS looking at where I was going. Immediately they go around me and flip the lights on for the very next car they see. \n\nI’m probably fortunate I was friendly, relaxed, and white. They were just looking for any excuse to get someone. I’m still absolutely convinced they trained the dog to bark on command to give them probable cause for searches whenever they want.",
   "created_utc": 1704216144,
   "score": 97,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzu424",
   "message": "He made my wife and I get out of the car. I put my car in valet mode when he lit me up (as I do anytime I’m getting stopped) which locks the glove box and trunk. I keep my car very clean so all he found was Tums, insurance/registration, and sunglasses in the center counsel. In my door pocket was a KitKat wrapper. The backseat had my hoodie with nothing in the pockets. Since he can’t open the locked glove box or trunk without a warrant he wrote me a ticket for 4mph over and sent me on my way.\n\nHe originally stopped me for 74 in a 70 but was extra pissy because he was going 70 in the fast lane and I passed him on the right.",
   "created_utc": 1704213676,
   "score": 40,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg09j32",
   "message": "They bring a dog, say it hit on your car, and search it anyway. \n\nPolice dogs are scams. They are nowhere near as reliable as they make it seem, and the police officer can make it \"hit\" on anything he wants.",
   "created_utc": 1704219092,
   "score": 220,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg09jal",
   "message": "I've said no twice.\n\nThe first time, the officer kept asking questions and stalling. Then a k9 unit showed up and walked around the car. Then he let me go without searching.\n\nThe second time, the officer just said ok and let me go without any follow up.",
   "created_utc": 1704219094,
   "score": 52,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg0d4x8",
   "message": "There are a ton of misconceptions out there on this topic. I was on the other side of things in a previous career. In brief:\n\nDuring a traffic stop an officer may ask to search your vehicle. There are really only two likely scenarios: \n\n1) they already **do have** probable cause and are going to search anyways, but are being polite. \n\n2) they **do not have** probable cause and need your consent to search. \n\nIn scenario 1 you denying consent doesn’t really matter, because they already have enough to legally search your vehicle. That being said - you should likely still deny consent. If it goes to court (no judgement, I dunno what you folks are into) your lawyer may be able to challenge the probable cause. \n\nIf you gave consent and the probable cause was bad it doesn’t matter, because you just consented to a search. \n\nIf you **do** consent to a search you can withdraw that consent at any time. As stupid as it sounds you could pull it back right before they search the glove compartment, or something like that…however, the officer may develop probable cause from a consent search - at which point it goes back to scenario 1. \n\nOn a related note: * smelling marijuana is probable cause in most states. That’s changing, but worth being aware of. Same with seeing shake on the floorboards, etc. the latter would be really dicey in court, but it depends on where you live. \n\n* *yes, literally everyone can smell your weed…*",
   "created_utc": 1704220348,
   "score": 60,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg04vz3",
   "message": "The cop yelled at me for half an hour about how much I wouldn't like it if he had to call in the dogs or get a warrant. I had a panic attack and was crying but I still stood my ground and refused to let him search my car. Eventually he gave me a speeding ticket and let me go.\n\nI didn't have anything illegal in the car, but I know how cops are. If he had wanted to find something, he'd have found something.",
   "created_utc": 1704217488,
   "score": 141,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzbihb",
   "message": "They gave my license back and I went on my way.",
   "created_utc": 1704206379,
   "score": 133,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg08o2x",
   "message": "Got pulled over for speeding near the end of a long road trip. Cop wanted to search my car. I asked why? He said that there was some stuff around the dash board that looked like I had opened up a bag of pot and it had spilled. It was one of those stupid granola bars that spills crumbs everywhere. Then he pointed to dried grass between the driver's seat and the door. I explained that this was indeed dried grass, the lawn kind.\n\nHe then told me about this other \"kid\" he had recently stopped. He had told him that if he had a pipe or something, he could just chuck it across the road and see how far it went, but that he wasn't interested in paraphernalia. I though that a cop encouraging me to destroy evidence and couldn't tell granola crumbs from pot was probably not very trustworthy. \n\nHe asked me what my problem with having him search my car was. I told him I had a fourth amendment problem (against unreasonable searches and seizures). On hearing that, he lost his jovial side, told me that he had a K9 unit in his vehicle and that he was allowed to have the dog inspect the outside of the car and if he detected anything, they would impound my car. I said that was fine as long as the dog wasn't hungry for granola.\n\nHe ordered the dog around in German, occasionally telling her in English to \"Find the drugs, girl!\" She did not find any drugs. The cop wrote me up for the ticket, plus an expired inspection sticker. \n\nI called the town hall later and spoke with the prosecutor who agreed to knock the charges back to a 2 point violation of parking on the sidewalk, which was about $400 cheaper and much less impactful on my insurance.\n\nI didn't have any drugs in the car, which made it easier to stand my ground, but that was intense.",
   "created_utc": 1704218793,
   "score": 48,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg0mqn0",
   "message": "I am a former cop. The success rate of asking to search a vehicle and being granted was what I would consider today to be staggering. There's this feeling of obligation to just agree to everything. I can only remember 1 or 2 times where the driver refused. \n\nHere's a tip... if the cop is asking to search, they don't have enough probable cause to do so. Never consent to a search. It doesn't matter if you have nothing to hide, that's not your problem (but the cops usually make it seem like one). It is your constitutional right to refuse. If they really have probable cause, they will search your vehicle anyways. \n\nBut always be polite. Don't poke the bear. As hard as it may seem sometimes, it is not in your best interest to raise your voice or escalate higher than the police, even if only verbally.\n\nTo answer the OPs question, the few times people refused a search were either met with a K9 walk around or given a ticket/warning and sent on their way. I think the dog alerted one time and it ended up being MJ less than an ounce which is a waiver-able offense in my state (pay the fine in the mail type thing).",
   "created_utc": 1704223645,
   "score": 50,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzk4rf",
   "message": "I stood my ground. Refused to get out of my car. Kept repeating “you pulled me over for my license plate lights being out is that correct” \nFinally he gave up and told me to get the lights fixed",
   "created_utc": 1704209930,
   "score": 13,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg03qcv",
   "message": "They made me wait while more and more \nThey told me they needed to search. I told them I needed warrant. They told me a drug dog is in the area. I told them OK. They told me they smelled weed. I told him he's full of it. They told me they smelled alcohol. I told him he is still full of it. \n\nAfter 20 minutes they let me go. Multiple cops stopped by but none would do anything. I sat there in my car with my hands on the wheel.",
   "created_utc": 1704217086,
   "score": 36,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg07tls",
   "message": "My best / worst moment… I came barreling down a highway exit ramp too fast. Cop pulls me over, asks why I’m in such a hurry? From the backseat, my kids start chanting, “Lock him up!  Lock him up!” Cop lets me go, sad \u0026amp; disgusted with both me and his career choices.",
   "created_utc": 1704218501,
   "score": 58,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg0a90d",
   "message": "a long time ago I had some friends get pulled over for speeding in New Hampshire.  Had all sort of grateful dead stickers on the car. Cops wrote the ticket and asked permission to search.  Friends said no and cop let them go.  Then they got pulled over by the K9 cop about 3-4 miles later.  Got busted for devils lettuce.",
   "created_utc": 1704219347,
   "score": 37,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg07ik9",
   "message": "they didn't search my car because they didn't have cause....\n\nalthough another time it ended with me being parked on the side of the road while drug dogs went over everything.\n\nand then when they didn't find anything the cop decided to call me a slur for gay people and pretend like he was going to punch me because he wanted an excuse to ruin my life.",
   "created_utc": 1704218395,
   "score": 42,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kfzx9f7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg0fjtv",
   "message": "\"No\" is a complete sentence. So is \"no thanks\", \"not today\", \"not right now\", \"I appreciate your concern but I really would like to get going,\" and so on. You don't need to use any of the epic, long-winded speeches people are posting here.\n\nBut be aware of the Kansas two-step. It goes like this:\n\n**Officer:** *conducts a lawful traffic stop, such as pulling you over for speeding*\n\n**You:** *fully comply with the requests of the officer*\n\n**Officer:** \"Here's your license and registration back. You're free to leave.\"\n\n**You:** *take your license and registration, begin putting them away*\n\n**Officer:** *takes two steps back towards their car, then turns around and says something like* \"Hey real quick while you're stopped here, do you mind if I ask you about / did you happen to see / can I just ask you something real quick / where did you get that coffee from, it smells amazing?\"\n\nAt this point the traffic stop has ended and the officer has legally started a new encounter. It's exactly the same as if an officer started chatting with you as you were walking down the street. It's 100% legal, and it avoids any concerns about improper search or probable cause. They may say something like \"I know you have nothing to do with this but we get a lot of drug trafficking through the area. You don't mind if I just take a quick look through your vehicle, right?\"\n\nAt this point, you're free to say something like:\n\n**You:** \"No thank you, I'd like to leave now.\"\n\n**You:** *rolls up window, waits for the officer to move a safe distance away from your vehicle, pulls away when traffic permits.*",
   "created_utc": 1704221177,
   "score": 32,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg08dfx",
   "message": "Got pulled over at 1am after dropping off my brother and his friend from the airport.  Shady part of town, I pulled in and pulled out, to the cop I'm sure it looked like a drug deal.  \n\nCop said my license plate light was out (it was), asked me what I was doing (I told him I picked up my brother and his friend from the airport and dropped them off) and then asked me what all the stuff in my backseat was and if he could have a look.  I said,\n\n\"It's dirty work clothes and McDonalds bags, it's 1am on a Tuesday and I want to go home, so no, you can't have a look.\"\n\nHe just shrugged and ran my stuff, let me off with a warning.",
   "created_utc": 1704218693,
   "score": 27,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg09s3i",
   "message": "was speeding. refused search of the vehicle. cops tried a bunch of scare tactics. To my surprise they actually called the K9. They tried to scare me while waiting for the dog saying even if i don’t have anything if the dog hits they’ll take my car for the length of the investigation. Dog didn’t hit on anything but even after that they tried more scare tactics. The K9 officer specifically said “the dog didnt hit on anything but he finds your car very suspicious so why dont you tell me whats in there.” I found that one funny like yeah im totally gonna confess now. Then I got my speeding ticket and went home. Fuck the police",
   "created_utc": 1704219181,
   "score": 67,
   "submission_id": "18wqs7u"
  },
  {
   "comment_id": "kg37dgf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18wqs7u"
  }
 ]
}