{
 "submission_id": "18wsyu2",
 "title": "What is the weirdest reason you've broken up with an ex?",
 "selftext": "",
 "created_utc": 1704211831,
 "permalink": "/r/AskReddit/comments/18wsyu2/what_is_the_weirdest_reason_youve_broken_up_with/",
 "score": 91,
 "url": "https://www.reddit.com/r/AskReddit/comments/18wsyu2/what_is_the_weirdest_reason_youve_broken_up_with/",
 "comments": [
  {
   "comment_id": "kfzy3fw",
   "message": "Her only hobbies were playing Candy Crush and clubbing. She was cute and sweet, but I was always bored with her.",
   "created_utc": 1704215105,
   "score": 146,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzvq72",
   "message": "His feet smelled. I mean so bad. They were so bad one night I thought he shit the bed. Wasn't going to go the long haul with that.",
   "created_utc": 1704214258,
   "score": 118,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0986e",
   "message": "She was married. To some Nashville country musician. All of her friends kept telling me he was going to shoot me when he got off tour. I figured that was good enough and better leave well enough alone.",
   "created_utc": 1704218986,
   "score": 47,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzv299",
   "message": "She was an extremely picky eater.  Chicken tenders, milk, French fries ONLY.  I am a former chef, I like to cook.  She was a sweet girl and all but I simply didn't want to navigate the minefield that was her diet and try to accommodate, so we split.",
   "created_utc": 1704214022,
   "score": 69,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzuawq",
   "message": "An ex broke up with me cause I use paper plates.",
   "created_utc": 1704213745,
   "score": 32,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg09978",
   "message": "He always tried to order Catalina salad dressing in restaurants despite me telling him repeatedly NO restaurant has it.  In fact, I hadn't even seen Catalina dressing in like 20 years.  He was a nice guy otherwise.  Just couldn't let it go.",
   "created_utc": 1704218996,
   "score": 33,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg04nsn",
   "message": "I broke up with my first real girlfriend because there was nothing wrong with her. I identified quickly that if I didn’t end things we would end up getting married because she was perfect, and got intimated. Anyway we got back together and now we have been married for 10 years.",
   "created_utc": 1704217408,
   "score": 128,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzubes",
   "message": "I broke up with a guy because I wanted him to fight for me (I know, I was young and beyond stupid).\n\nWe were in Hawaii together to attend a family wedding. Five seconds after I suggested breaking up, and he said \"fine!\", **the largest goddamn centipede I have EVER seen crawled across the hotel room floor.**\n\nI immediately jumped on the bed and insisted he give me a piggyback ride out of the room. He rolled his eyes and did so.\n\nHe grunted, carrying me out the door, and I said \"I know, I'm heavier than  I look.\"\n\nHe deadpanned \"you look it.\"\n\nDespite all this we got back together within hours.",
   "created_utc": 1704213750,
   "score": 139,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzpfok",
   "message": "Her friends annoyed me too much :(",
   "created_utc": 1704211958,
   "score": 56,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfztxx9",
   "message": "he looked like a rat (he was also a horrible person)",
   "created_utc": 1704213615,
   "score": 25,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0c9nq",
   "message": "When we would go out to eat, he'd take his retainer out and put it in his water glass.",
   "created_utc": 1704220047,
   "score": 27,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfztb96",
   "message": "As I got to know her I began to see we weren't as compatible as I thought. Tried to make it work but the weirdest reason why I broke it off...she would roll her eyes all the time, it was just another check mark.",
   "created_utc": 1704213389,
   "score": 45,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzux9u",
   "message": "Long distance about a four figure plane ticket away, and neither of us had any money, solid plans for the future to have money, so because it couldn't practically work (I was really young and not willing to endour no in person contact for years or once a year) until we got our act together. Just seemed like a recipe to prolong suffering.",
   "created_utc": 1704213972,
   "score": 21,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0akwm",
   "message": "Cause my dad mentioned that she resembled my sister and I couldn't unsee it.",
   "created_utc": 1704219462,
   "score": 17,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0hjh6",
   "message": "I can finally tell someone about this - \n\nMet a girl through some friends, and we hit it off instantly. Crazy chemistry, similar sense of humor, personalities, etc. We had the best time together in the early stages of flirting, and getting to know each other. \n\nThen we go on our first date, great dinner, back to her place and we're on the couch and it's \"go\" time. I lean in to kiss her and in an instant, I knew immediately it was all wrong. It wasn't how she kissed, smelled, etc. I found her incredibly attractive, great teeth, breath, etc. etc. But the moment my lips touched hers, my brain triggered the \"NOPE - GTFO\" and that was it. \n\nI did my best to exit the situation with grace and consideration. But I have NEVER had an experience that was so unexpected and yet so clear.",
   "created_utc": 1704221857,
   "score": 34,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzwfod",
   "message": "She was talking about marriage and how our kids would look like only weeks after dating.",
   "created_utc": 1704214508,
   "score": 33,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg12psm",
   "message": "We were in high school and he was a year above me, about to go into his senior year. I asked what his plans after high school were, and he said touring with his band. I was surprised, and said I didn't know he was in a band. He wasn't, he planned to start one and be big enough to tour within the year.",
   "created_utc": 1704229100,
   "score": 13,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0y92k",
   "message": "She looked at me once and all I saw was Garth from Wayne’s world. She was a pretty girl but from that angle she was Garth…I couldn’t unsee. But hey she is happily married now.",
   "created_utc": 1704227574,
   "score": 12,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzs4c4",
   "message": "Highschool summer romance. She was younger than me which didn't really bother me until school started up and her and her friends started showing up at my locker. I was a senior and this wasn't gonna fly.",
   "created_utc": 1704212955,
   "score": 19,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg07evl",
   "message": "https://youtu.be/9bBns6ZUn0U?si=zSpGMzHkEnHO-RB6\n\nSaw this happen live at an NHL game. Whole place is going berserk people are hugging strangers and I look back and my ex is still seated politely clapping.\n\nIt was just a moment that made me realize our differences.",
   "created_utc": 1704218359,
   "score": 23,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg12dmu",
   "message": "A game of monopoly. She was such a sore winner (is that a phrase?) that she became genuinely insulting, and I realised that if she could get like that over a game, she wasn’t likely to hold back in real life.",
   "created_utc": 1704228982,
   "score": 7,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzya1s",
   "message": "She ate her peas one at a time.",
   "created_utc": 1704215170,
   "score": 18,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0kmmj",
   "message": "She told me that she had anxiety because she needed to find content to post on her Instagram, then called herself a “micro influencer”.\n\nThe content she posted later that day was just a photo of her in a bikini and a quote about how she’s ’finally learning to love herself’. \n\nI lost all interest in that moment. I couldn’t bring myself to pretend like the attention seeking behavior was normal or healthy, I just wanted out.",
   "created_utc": 1704222920,
   "score": 15,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0aldp",
   "message": "An ex broke up with me cause I was “too independent “ and didn’t show that I needed him in my life enough. \nWhich was true…… so can’t blame him",
   "created_utc": 1704219467,
   "score": 14,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0cn86",
   "message": "Peach lip balm. I hated it, she loved it. I still hate it.",
   "created_utc": 1704220178,
   "score": 8,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0kyh7",
   "message": "She called while I was out on a sunny day re-reading a favorite book. I said we could meet up in an hour or so when I was done. She said \"why do you waste time on those things?\" and I hung up.\n\nThere may have been some underlying issues.",
   "created_utc": 1704223034,
   "score": 7,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzqep1",
   "message": "She could see ghosts and spirits Along with seeing the future. I asked reddit for help, and I got called bad because it was \"normal, and as long as it didn't hurt anyone, it was fine.\" Now it's an inside joke with me and friends.",
   "created_utc": 1704212323,
   "score": 30,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg00wy8",
   "message": "Her constant farting.",
   "created_utc": 1704216101,
   "score": 11,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg00ior",
   "message": "1. We started called each other booboo but when he texted me he’d spell it ‘boboo’ which I thought was psychotic cos that’s BOboo not BOOboo.\n\n2. He started adding ‘ey’ to words. For example, he opened my fridge and asked if I wanted some ‘juicey’. The ick was palpable. \n\n3. I had a chocolate-coloured lil chubby mug that I loved, for about 4 years. It cracked one day when I was making coffee and I was really upset and when I looked up the shop I’d brought it from, I found out it had closed down permanently. I was telling him about it on the phone and without skipping a beat he said ‘it’s a mug, whatever, just get another one’. \n\nOk Buddy, I’ll just get another one of YOU.",
   "created_utc": 1704215963,
   "score": 24,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzspr0",
   "message": "In high school my friend said he would give me a pack of gummies if I broke up with my girl... I did",
   "created_utc": 1704213173,
   "score": 13,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzsibx",
   "message": "Her teeth were gross and my brother didn’t like her.",
   "created_utc": 1704213097,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0foko",
   "message": "She never validated my emotions but told me she did and that i just had to grow up because saying that i felt terrible didn't mean i actually felt terrible, and saying that my life was completely ruined for over a year wasn't true because it was still \"a life\" and she just couldn't comprehend that those were my feelings.\n\n\\*Wasn't an ex, but i dated her for short while",
   "created_utc": 1704221222,
   "score": 5,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0uzmh",
   "message": "I was in my teens and I broke up with a guy as his breath was so bad. I feel bad that I broke up with someone over something petty, but I wasn’t confident enough to talk to him about it at the time.",
   "created_utc": 1704226462,
   "score": 7,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg128vr",
   "message": "She got her braces off, I don't know what it was but I was just unattracted to her after that.",
   "created_utc": 1704228937,
   "score": 5,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg17i3g",
   "message": "He was too much of a yes man. Ironically my next bf was a totally difficult individual and i regretted my decision",
   "created_utc": 1704230732,
   "score": 6,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg19vzb",
   "message": "She boiled her period cup at my place while I was at work then left the pot and period water on my stove for me to find when I got home after a 14 hour shift.    There was other stuff not jiving and this was the final straw. I think it’s a pretty good reason,  but not a very common one I bet.",
   "created_utc": 1704231552,
   "score": 5,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1c6yz",
   "message": "Reverse case here, but I got dumped by a girl one time because I \"wasn't hairy enough\".  I thought it was a huge cop out until I saw here out at diner with her dad and who I assume was her new boyfriend.  Dad was bald but had hair comming up out of his shirt neckline on all sides and the boyfriend had one of those black beards that you could insert a #2 pencil into and it would stay put.",
   "created_utc": 1704232349,
   "score": 5,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0h6yo",
   "message": "Too clingy and constantly created situations to make me have to speak up for her. I consider relationships to be a team sport where we compliment each others strengths \u0026amp; weaknesses. This was too selfish for me. Would not be shocked if she cheated. In fact I had hoped she would to give me an easy blunt way out. Knowing her, she did and hid it to get more out of me.",
   "created_utc": 1704221736,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0n4jc",
   "message": "He was addicted to eating mustard sardines. The smell. 🤢",
   "created_utc": 1704223777,
   "score": 5,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0ntxo",
   "message": "Head was too painful",
   "created_utc": 1704224020,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1amjl",
   "message": "He accused me cheating on him, with my brother.",
   "created_utc": 1704231808,
   "score": 4,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg067tc",
   "message": "This was all in middle school, 6th grade-8th grade. \n1. I was dating a good friend of mine and I didn’t want to him or actually date anymore 😂 so I wrote him a break up note.\n2. I was dating this dude in 8th grade and my siblings talked me into breaking up with him so I did. Sent him a text saying it was over \n3. This guys friend asked me out for him  and I said no to his friend and the friend went back to the guy saying yes. Didn’t find this out until later in the day when he came up to me and was talking about how much he liked me and was glad I said yes. Had to break his little heart saying I said no sorry I don’t feel the way you feel.",
   "created_utc": 1704217945,
   "score": 8,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzpcdz",
   "message": "Because there was a long distance relationship I just HAD to be in 🙄",
   "created_utc": 1704211923,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg06d0v",
   "message": "Anyone that quick with a zinger is a keeper.",
   "created_utc": 1704217994,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0bokj",
   "message": "He jokes about everything.. LITERALLY EVERYTHING\nEven if it comes to someone's feeling or insecurities\nLikeeee UGHHHH",
   "created_utc": 1704219844,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0ogza",
   "message": "he touched and scratched under my chin as if I were a cat... it scared me away and the next day I wrote him that very phrase “it’s not about you, it’s about me” 😂😂🐈",
   "created_utc": 1704224236,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg11sqy",
   "message": "The weirdest reason is that there was no reason.  He just changed for no reason.",
   "created_utc": 1704228784,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg18cfd",
   "message": "He wrote me a love letter, and he kept spelling love “luve” because he legitimately thought that’s how it was spelled. It suddenly hit me that we had literally nothing in common at all. He was insanely hot but that was it. The next time we talked he told me our song is “with arms wide open” and that was the final nail in the coffin.",
   "created_utc": 1704231022,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1deeg",
   "message": "She knew wayyyy to much about celebrities life and had no sense of focus for her own, if that makes sense.",
   "created_utc": 1704232767,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzsftq",
   "message": "She became vegan...",
   "created_utc": 1704213071,
   "score": 12,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzwzf4",
   "message": "I was \"dating\" a girl in middle school and she told her friend that we weren't dating. TBH I don't actually know if she was right or I was, but when she told me we weren't dating, she followed it up with \"but we can be, I do like you\". I liked her too but I was offended and embarrassed so I said we weren't gonna lol",
   "created_utc": 1704214705,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg13lhu",
   "message": "He was addicted to paying camgirls, escorts... Paying, \"Findom\" was the kink.\n\nThat's still weird AF to me",
   "created_utc": 1704229398,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg18w91",
   "message": "Well I was just broken up with because I asked her what to get her mom for Christmas. She and I had talked as friends before we dated and she told me she broke it off with a guy because he put the conditioner back in the wrong spot in the shower. Another because he stopped to put gas in his car. People are wild.",
   "created_utc": 1704231211,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1dznt",
   "message": "She ate her peas one at a time",
   "created_utc": 1704232974,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1g832",
   "message": "Went out to a club on Halloween. She was dressed like a cat.  Guy at the door tried charging her, even though ladies were free.  She had to show her license to show she was female.  In fairness, she was quite flat chested.",
   "created_utc": 1704233758,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1hs6k",
   "message": "On the way to meet her folks for the first time, she told me I was too nice, and it was over.\n\nThe next guy she dated was an ex-con who proceeded to steal a car and get into a gunbattle with police. He was shot but lived. She called me afterward, told me that story, said that he had been violent toward her too, and asked me what she should do.\n\nI said, “Don’t call me anymore. I’m too nice.”",
   "created_utc": 1704234313,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg069u0",
   "message": "Her favorite band was Roxette. “It Must Have Been Love,” among others. I know it was petty. I just couldn’t imagine a life listening to that over and over.",
   "created_utc": 1704217963,
   "score": 3,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0aun9",
   "message": "I’ve never broken up with an ex, but my last ex broke up with me because I was too nice…",
   "created_utc": 1704219558,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1blhp",
   "message": "After losing my mom to Covid, she wore a perforated vanity (blingy?) face mask when she got into the car. When I realized what it was I turned the car around and dropped her right back off to her door, never spoke to her again.",
   "created_utc": 1704232144,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzvwf8",
   "message": "Not an ex but I ended a potential FWB situation b/c I felt like she wasn't paying attention to me during a breakfast at a restaurant. To put it in perspective, she:\n\n* Wasn't asking relevant follow up questions. I would ask her about her life and things she's doing and expand on it. She didn't reciprocate.\n\n* She would be on her phone for most of the conversation. I wouldn't even look at mine.\n\n* Often times she just stare at the kitchen's 'out' door waiting to see if our food was coming while not saying anything. \n\nThese are pretty nitpicky things, imo, but I felt like they were windows into how she'd behave in other situations. While she had previously expressed wanting to have sex with me, I felt like it would be a mistake to do that. The way i've always viewed FWB is that it should be with someone you don't mind accidently getting pregnant. I could see on our first \"outing\" that it would be a catastrophically life ending event if I accidently knocked her up and was forced to be in her life more.",
   "created_utc": 1704214318,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0xvym",
   "message": "I once kicked a girl outta bed because Starcraft 2 Wings of Liberty dropped. It wasn't a breakup but it ended the fwb thing.\n\nI made the correct decision, I don't care if Starcraft 2 didn't meet the hype.",
   "created_utc": 1704227448,
   "score": 2,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzputx",
   "message": "She was fat and I had something better on the line.",
   "created_utc": 1704212117,
   "score": 248,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg16d2b",
   "message": "Political views.",
   "created_utc": 1704230346,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kfzp76m",
   "message": "[deleted]",
   "created_utc": 1704211870,
   "score": 0,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg0hq0q",
   "message": "nah, she broke up with me without giving a proper reason ;(",
   "created_utc": 1704221920,
   "score": 0,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg18cya",
   "message": "lol she had tinder on her phone",
   "created_utc": 1704231027,
   "score": 0,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1e3fd",
   "message": "She had a really hairy butthole.",
   "created_utc": 1704233011,
   "score": 255,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg184el",
   "message": "Dated a girl in middle school- she dumped me but then later in college we were at a party and she said she wanted to have “glorious sex with me”. Really cute and cool girl I’m still friends with- we were having a good time in the city and it was getting late at my friends apartment. But she started eating French bread pizza doused in ranch sauce and I saw it getting on her mouth. I could not proceed with the glorious sex. To this day I question my actions.. cuz she really is wifey material . But I just couldn’t make out with someone who just guzzled ranch and shitty microwaved pizza . We even went on a date later on to a concert and had a great time - but the attraction wasn’t quite there from me. Still good friends tho",
   "created_utc": 1704230945,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1ey00",
   "message": "Because I didn’t “love her all-in” even though I’d thought about having kids with her and marrying her. Didn’t realize that all-in was a choice you made bc till then I’d only ever had short or shallow relationships. She was great for me. \n\nFigured it out in therapy a while later when it was way too late.",
   "created_utc": 1704233306,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1keua",
   "message": "His sweat smelled like wet dog. He could walk out of the shower freshly cleaned and still smell like wet dog if he was sweating",
   "created_utc": 1704235264,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1meyj",
   "message": "I once broke up with my back then girlfriend because I found out she hadn’t broke up with her previous boyfriend or the boyfriend before that boyfriend. She had three relationships at once.",
   "created_utc": 1704235989,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1oh8h",
   "message": "She had a really REALLY weird kink",
   "created_utc": 1704236755,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1ore0",
   "message": "She (a full-grown adult) thought it was fun to shoplift, at pretty much every store. I couldn't even catch it, we'd get in the car and she'd say, \"look at what I stole!\" \"How? Why? Stop doing that!\"",
   "created_utc": 1704236862,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1pilt",
   "message": "She loved watching reruns of “Friends.” I’m not saying the show was terrible but I just grew to hate it.",
   "created_utc": 1704237147,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1qcz2",
   "message": "She asked the waitress if the buffalo sauce was made from real buffalo.",
   "created_utc": 1704237467,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1szko",
   "message": "I wound up dating this really nice girl who happened to be somewhat wealthy. We got along really well, but one day we were in a disagreement on whether leasing or buying a car was a better financial decision. I have experience in the auto industry and some level of knowledge about this, but her resolute counterpoint was “well my financial advisor…” and at that moment I knew we would never get along long term.",
   "created_utc": 1704238463,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1uemt",
   "message": "Well, you know, we were having dinner the other night, and she's got this strangest habit: she eats her peas one at a time. You've never seen anything like it. It takes her an hour to finish them. I mean, we've had dinner other times. I've seen her eat corn niblets, but she scooped them.",
   "created_utc": 1704238999,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1uv07",
   "message": "He wiped from back to front",
   "created_utc": 1704239172,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1w677",
   "message": "She scraped her teeth on her fork every time she took a bite of something and was overall a really gross eater.",
   "created_utc": 1704239672,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1y4ji",
   "message": "She was a pick me, attention seeker, always threatened to end her life or some shit.\nYears later, she's still alive.",
   "created_utc": 1704240422,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg1zni7",
   "message": "Because I didn’t pay her college tuition fee, I just took care of her living expenses (rent+food+transport) 😞",
   "created_utc": 1704241007,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg26g75",
   "message": "She made me chili without crackers after I told her not to.",
   "created_utc": 1704243585,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg28qcu",
   "message": "Dated a girl for like 6 weeks and then she cut all her hair off (like a boy's hair cut). The same night I found out she was a heavy smoker and had been going to great lengths to hide that because she was quote \"going to quit\". Then she wanted sexy time and the combo of her short hair and smoking literally made me think of my grandma (who had boy length hair and smoked like a carton a day) and well, that's a boner killer.",
   "created_utc": 1704244458,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg29cfz",
   "message": "He had weird eyes. No drug use or anything, just oddly buggy eyes that made me uncomfortable.",
   "created_utc": 1704244692,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg2afge",
   "message": "Idk if this counted as an ex or not but it was when I was 12 y.o\n\nWe broke up after a month in a relationship because I got being moody from my first ever period hormonal experience.",
   "created_utc": 1704245105,
   "score": 1,
   "submission_id": "18wsyu2"
  },
  {
   "comment_id": "kg2bcqp",
   "message": "Her mom was arguing with her friends instead of her, I just didn't like that shit and it bothered me",
   "created_utc": 1704245462,
   "score": 1,
   "submission_id": "18wsyu2"
  }
 ]
}