{
 "submission_id": "18x6w95",
 "title": "If a loved one you live with passes away unexpectedly do you move houses cause it’s too hard to live in the place where they used to live or do you stay in the same house because you have good memories of them in that house?",
 "selftext": "",
 "created_utc": 1704245989,
 "permalink": "/r/AskReddit/comments/18x6w95/if_a_loved_one_you_live_with_passes_away/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/18x6w95/if_a_loved_one_you_live_with_passes_away/",
 "comments": [
  {
   "comment_id": "kg2cyvm",
   "message": "That’s entirely up to the individual and situation",
   "created_utc": 1704246082,
   "score": 9,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2d914",
   "message": "Happened to us. We moved because it was just too hard. We didn’t have the guts to repurpose my brother’s bedroom and the fact that his bedroom was intact was disturbing.",
   "created_utc": 1704246189,
   "score": 6,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2dadb",
   "message": "I stayed but can understand if one’s pain is too much and the home haunts their memories. At that point we have to take care of the living.",
   "created_utc": 1704246203,
   "score": 4,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2dsgm",
   "message": "Lots of psychological layers to this, also kind of depends on the circumstances.  The night after my dad killed himself, I stayed in my mom and dad’s apartment while blood was pooled in the locked room where he did it (was just a 2 bedroom apartment).  Swore I’d never stay there again, but my mom lived there for almost a year after.",
   "created_utc": 1704246396,
   "score": 3,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2ecvg",
   "message": "I think it’s depends of person, but i personally would stay in because i was so happy there, how could i just left it all behind ? i don’t think that this would stop me from moving on, but it would keep me feeling safe in space which once was full of love and happiness",
   "created_utc": 1704246614,
   "score": 3,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2eddo",
   "message": "Depends on how you feel after it happens.  People move away or stay, but empty it of all memories, or turn it into a memorial, never changing a room, etc.  whatever it takes to reduce your suffering after the passing is the right answer.",
   "created_utc": 1704246620,
   "score": 2,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2iv15",
   "message": "I moved around after my mom died, same week.",
   "created_utc": 1704248382,
   "score": 2,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2kpfn",
   "message": "This is yet another reason why I live alone. I’m not moving again.",
   "created_utc": 1704249124,
   "score": 1,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2n9gb",
   "message": "For me it would have been too hard to move away: it was my children’s home, where all their memories of their dad resided.",
   "created_utc": 1704250157,
   "score": 1,
   "submission_id": "18x6w95"
  },
  {
   "comment_id": "kg2o826",
   "message": "I had to move 🙁",
   "created_utc": 1704250547,
   "score": 1,
   "submission_id": "18x6w95"
  }
 ]
}