{
 "submission_id": "18xao9u",
 "title": "Who has known someone who has had a secret second life?",
 "selftext": "",
 "created_utc": 1704256922,
 "permalink": "/r/AskReddit/comments/18xao9u/who_has_known_someone_who_has_had_a_secret_second/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/18xao9u/who_has_known_someone_who_has_had_a_secret_second/",
 "comments": [
  {
   "comment_id": "kg33ba3",
   "message": "Hannah Montana",
   "created_utc": 1704257209,
   "score": 9,
   "submission_id": "18xao9u"
  },
  {
   "comment_id": "kg3cb18",
   "message": "I got engaged to a much older man after dating for about 2 years, only to find out a week later he was married the entire time. His wife hated him because he had already cheated on her before, but she got diagnosed with cancer and needed his insurance to get treatments. So they decided to stay together with their kids (who were both older than me). He was able to spend a ton of time with me and even stay at my place most weekends because she was in the hospital dying. He seemed to think that if he kept lying to me for long enough she would die and he could marry me without ever having to tell me the truth. But she got better miraculously and went back to living with him in their house, and he eventually ran out of lies to cover it up.",
   "created_utc": 1704262013,
   "score": 6,
   "submission_id": "18xao9u"
  },
  {
   "comment_id": "kg33waz",
   "message": "Me! My sisters ex bf had a double life. He was married and had a home with his family. But at his brothers house he had a room, he pretended they were roommates and that he lived there. He didn’t… it’s just where he would meet women.",
   "created_utc": 1704257493,
   "score": 5,
   "submission_id": "18xao9u"
  },
  {
   "comment_id": "kg33lrh",
   "message": "Me on reddit, ama",
   "created_utc": 1704257351,
   "score": 2,
   "submission_id": "18xao9u"
  },
  {
   "comment_id": "kg3p7cf",
   "message": "My uncle had a whole second wife and family. He was busted when his kids from one family, contacted one of the other kids from the other family. \n\nFrom what I was told, it was a family secret that got leaked out one night when the adults were drinking\n\nHe passed away a couple of years ago, but now the 2 families actually get together a fair bit and go bowling and stuff like that",
   "created_utc": 1704270803,
   "score": 2,
   "submission_id": "18xao9u"
  }
 ]
}