{
 "submission_id": "18xvkqk",
 "title": "What movie sex scenes make you want to scream \"that's not how it works!\"?",
 "selftext": "",
 "created_utc": 1704319560,
 "permalink": "/r/AskReddit/comments/18xvkqk/what_movie_sex_scenes_make_you_want_to_scream/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/18xvkqk/what_movie_sex_scenes_make_you_want_to_scream/",
 "comments": [
  {
   "comment_id": "kg7671h",
   "message": "So many movies where the implication is that they just had sex, but they roll out of bed with underwear on. I mean it’s *possible* but it’s not very likely.",
   "created_utc": 1704323995,
   "score": 66,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6x3zj",
   "message": "All of them in \"The Room\"",
   "created_utc": 1704320757,
   "score": 170,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg79cme",
   "message": "In the movie Excalibur from 1981, there's a scene between a knight, and a princess. The woman is completely nude on the bed. The knight is in full plate armour. The only bit of skin you could see on him was his face. And that was just because he didn't have his helmet visor down. He was 'thrusting' between her legs and acted like she was enjoying it.\n\nI first saw that movie at home when I was 15. I'm a dude, and even then I was thinking, 'wouldn't all that metal be cold to her? What happens if something gets pinched? Does the cod piece unlock just so he can get his dick out? Couldn't the sharp edges cut either of them?'\n\nVery odd scene",
   "created_utc": 1704325156,
   "score": 115,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6xd1f",
   "message": "All softcore porn where it looks like the guy is humping her bellybutton.",
   "created_utc": 1704320842,
   "score": 217,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg79do8",
   "message": "Brokeback Mountain.\n\nThey've been eating nothing but baked beans in the mountains for god-knows how long, and you're telling me that with no preparation whatsoever they're going to have passionate, spontaneous bum sex?",
   "created_utc": 1704325167,
   "score": 87,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg71nks",
   "message": "Showgirls",
   "created_utc": 1704322351,
   "score": 13,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg768zu",
   "message": "There's a scene in *But I'm A Cheerleader* where the characters more or less address this. It's these gay teens in a conversion camp, and they're watching a simulation of what \"straight sex\" is supposed to be like. One boy raises his hand and asks, \"umm, what about foreplay?\" The director says, \"No, foreplay is for sissies! Real men go in, unload, then pull out!\"",
   "created_utc": 1704324014,
   "score": 186,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6vmlc",
   "message": "Pretty much every movie with a sex scene where they finish and just roll right over and go to sleep. Where’s the cleanup?",
   "created_utc": 1704320239,
   "score": 42,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7vfw0",
   "message": "Not a movie, but a TV show. True Blood. Bill is buried in the ground naked. Sookie thinks he's dead. Is crying on his grave. Dude comes out of the ground and they immediately start fucking.\n\n\n\nFirst off, she is not wet yet. She was just crying her eyes out \n\n\n\nSecondly, he doesn't clean the graveyard dirt off his dick??? I smell an infection in Sookie's future",
   "created_utc": 1704333465,
   "score": 1,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg70mtn",
   "message": "Not a movie but the sex scenes in Weeds always bothered me. They would make out for like 2 seconds and then the guy would bend her over, shove her pants down and roughly start fucking her. Every single time. No foreplay for either of them, no warning, just BAM! Extremely rough pounding with no lube and he's done in 30 seconds or less. I assume a lot of the target audience is women and I can't for the life of me understand why this is supposed to be sexy to them.",
   "created_utc": 1704321990,
   "score": 153,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg73a2n",
   "message": "Showgirls.\n\nOr maybe that was a realistic depiction of what it looks like to have sex with someone while they have a seizure in a hot tub",
   "created_utc": 1704322933,
   "score": 188,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg76q8w",
   "message": "Not exactly a sex scene per se, but when people have sex and then it shows them waking up the next morning and the girls wearing her bra. I mean find some other way to maintain your pg rating. Keep the sheets up, or wear a shirt at least. Who the fuck goes to sleep with their bra on?",
   "created_utc": 1704324188,
   "score": 198,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg70hr0",
   "message": "Team America: World Police. Because reasons.",
   "created_utc": 1704321941,
   "score": 173,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg71mj3",
   "message": "Brokeback Mountain. It _definitely_ doesn’t work like that.",
   "created_utc": 1704322340,
   "score": 44,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg74iof",
   "message": "The sheer number of romantic sex scenes in movies where they are very slowly moving in sync the first time they sleep together as if they were mythical soulmates. Instead of, you know, awkwardly stumbling and laughing because new body new rules.",
   "created_utc": 1704323384,
   "score": 139,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7183z",
   "message": "The one in scary movie where she was going down on the dude and he ejaculates and she gets splodged to the roof. Everyone knows that’s not how it works, she would have had the back of her head blown off if it was real.",
   "created_utc": 1704322198,
   "score": 92,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7zcb5",
   "message": "Revenge of the Nerds.\n\nNerd (in mask and costume) follows hot cheerleader into 'funhouse'. They bone. He takes off the mask to reveal he's not her boyfriend. She's totally cool with this and decides nerds are better in the sack than Alpha Betas.",
   "created_utc": 1704334959,
   "score": 61,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg70vhl",
   "message": "Pretty much every scene. \n\nBoth people ALWAYS reach orgasm at the exact same time.......THAT'S NOT HOW IT WORKS\n\nEveryone just falls alseep in each others arms, no one ever gets up to get a towel....THAT'S NOT HOW THAT WORKS",
   "created_utc": 1704322075,
   "score": 34,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6u1dj",
   "message": "Any scene where the guy just slams his cock into her with zero foreplay and she starts moaning/enjoying it. That would be really painful.",
   "created_utc": 1704319678,
   "score": 190,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7723w",
   "message": "Any gay sex scene. I swear they just dont get it, there's an insane amount of prep that a bottom has to do to have a good time",
   "created_utc": 1704324308,
   "score": 137,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6ulso",
   "message": "Every movie where people check into hotels by just saying their name and being handed a key. A scary amount of people think it really works like this and tantrum if you ask for their ID.\n\nThere's also an unreasonable amount of people that think every hotel has full room service. No Karen, you have to come down to get the free breakfast at Best Western.",
   "created_utc": 1704319877,
   "score": 218,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7e3aw",
   "message": "Not a movie but that new Netflix show Obliterated. \n\nShelley Henning was violently pounding on top of dude. She was trying to jackhammer his balls with her booty cheeks",
   "created_utc": 1704326898,
   "score": 40,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg78jcv",
   "message": "Any movie with Steven Segal.",
   "created_utc": 1704324859,
   "score": 29,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7cmqq",
   "message": "The English Patient. Sex in a tub? That doesn't work! Please, give me something I can use!",
   "created_utc": 1704326359,
   "score": 76,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg72xp8",
   "message": "Demolition man.",
   "created_utc": 1704322807,
   "score": 153,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg72hhd",
   "message": "Brokeback Mountain",
   "created_utc": 1704322646,
   "score": 23,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7kvkn",
   "message": "Any of the “impulsive anal sex” scenes between Mickey and Ian in the US version of Shameless. There’s so many scenes where they go from fighting/arguing to anal in 10 seconds with nothing more than a licked or spat in palm for lube. \n\nPower bottom Mickey would be so raw and prolapsed as fuck. It’s just not how bum stuff works.",
   "created_utc": 1704329449,
   "score": 76,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg71ilo",
   "message": "Any time it is in a shower",
   "created_utc": 1704322302,
   "score": 235,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg734b6",
   "message": "I remember watching the first Underworld movie and wondering why in the sex scene he was sticking it in her belly button. Edit: Should have said the second movie.",
   "created_utc": 1704322874,
   "score": 49,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg75vf3",
   "message": "Any one where they immediately start throwing each other around like they're in an MMA match and then fuck with zero foreplay . Just walked into an apartment with someone? Rip all the buttons off their shirt and angry fuck them on the kitchen sink.",
   "created_utc": 1704323877,
   "score": 69,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6y353",
   "message": "Any one where the guy caresses a girl down and immediately slips it in without looking, using his hands or even having light. Bull shit.",
   "created_utc": 1704321095,
   "score": 177,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg774rz",
   "message": "I’m gonna go with Deliverance on this one",
   "created_utc": 1704324335,
   "score": 65,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg729ww",
   "message": "**The Exception (2016):** both the main characters are just going to start having sex without lube or foreplay and somehow it works and isn't uncomfortable? Eh, Lily James boobs and Jai Courtney penis though.",
   "created_utc": 1704322571,
   "score": 39,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg8sy1r",
   "message": "The exact opposite of a sex scene, a Sunday sermon. In church.\nPastor gave a passionate and extremely homophobic speech about gay sex as the \"greatest of Satan's temptations\" and making love to his wife as a \"sometimes difficult, but holy, labor for the Lord.\"\n\nDead silence amongst the congregation.  Both because the congregation was quite a bit more liberal than the guest speaker, and because that's.... Not how straight people think. At all.\n\nThat's just not how it works.",
   "created_utc": 1704348467,
   "score": 18,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7o6qy",
   "message": "That one scene in Hot Shots. No matter how hot a girl is, it’s never going to be enough to cook a slab of bacon on her belly.",
   "created_utc": 1704330703,
   "score": 58,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg6tyvm",
   "message": "Pretty much all of _50 Shades,_ but one that does this to me the most is in _Booksmart_, an otherwise great movie. \n\nIn the scene, one young woman goes down on another young woman, but accidentally performs on \"the wrong hole.\" Which, no. \n\nThat kind of confusion might happen with a penis, maybe even with fingers. But there is no way someone (especially someone who _owns a vagina themselves_) is going to think an anus is a vulva for more than a second when using _their mouth_. The texture and general make-up is just too entirely different. _And,_ the vulva would be right there, right around where their nose would be. They would have to go past it.   \n\nIt is simply not a thing that would happen.",
   "created_utc": 1704319654,
   "score": 235,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg76iue",
   "message": "In The Idol when he's eating her out in the car but she's wearing a leotard that she doesn't take off at all and his head is at her abdomen.",
   "created_utc": 1704324115,
   "score": 17,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7hvmk",
   "message": "Team America is the only film that has ever captured the clumsy fury of true romance",
   "created_utc": 1704328312,
   "score": 42,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7093j",
   "message": "Pretty much every gay movie.\nNo prep, no cleaning out, anal sex takes time.",
   "created_utc": 1704321857,
   "score": 68,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg760ah",
   "message": "Anytime they are falling onto the bed after climaxing",
   "created_utc": 1704323926,
   "score": 26,
   "submission_id": "18xvkqk"
  },
  {
   "comment_id": "kg7g14t",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18xvkqk"
  }
 ]
}