{
 "submission_id": "18y2k82",
 "title": "What seemingly insignificant decision drastically changed the course of your life?",
 "selftext": "",
 "created_utc": 1704337566,
 "permalink": "/r/AskReddit/comments/18y2k82/what_seemingly_insignificant_decision_drastically/",
 "score": 9,
 "url": "https://www.reddit.com/r/AskReddit/comments/18y2k82/what_seemingly_insignificant_decision_drastically/",
 "comments": [
  {
   "comment_id": "kg87s68",
   "message": "When I was 18, I drove with my cousin to our other cousins going away party. On the drive there, we (impulsively) decided to move out and get an apartment together.\n\nThat’s how I met my sons father. He’s not in the picture anymore at all, but I can’t imagine life without my 11 year old and I’m so thankful that we drove together that day instead of driving with our parents",
   "created_utc": 1704338295,
   "score": 4,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg88flv",
   "message": "Took control of my brother's character (by his request) in an MMORPG to kill an easy mini boss that dropped a good item. It would respawn every 20 or 30 minutes. I didn't do it all day or anything, just occasionally.\n\nEnded up playing the game myself for like 7 years and it legitimately ruined my life.",
   "created_utc": 1704338561,
   "score": 4,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg8cmmo",
   "message": "I made a Discord server about a niche video game from 15 years ago.\n\nNow I’m well known in my online content, have had a wide variety of opportunities to collaborate with cool people and I’m also in a year long LD relationship with the sweetest man.",
   "created_utc": 1704340321,
   "score": 2,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg8ap8f",
   "message": "Went to an ugly sweater with friends, left the husband and kids at home. Wound up coming onto a woman after a few drinks and then she kissed me. Biggest rainbow aha moment. Been together 6 years and married for 2.",
   "created_utc": 1704339501,
   "score": 255,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg86nhr",
   "message": "The decision to play a game with myself when I was maybe 14 where I would start with a state ment and ask why? Then I would as why to the answer and so on. Boy did I get and existential crisis real quick.",
   "created_utc": 1704337832,
   "score": 1,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg8iqni",
   "message": "Going to one random party.",
   "created_utc": 1704343098,
   "score": 1,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg8lsy5",
   "message": "Parents encouraged me to get a job at the bookstore at my college bookstore. After a chance interview and job offer, the second coworker I talked to happened to invite me to a club he was in and a few months later I attended a party where I met my future wife. That was 13 years ago and we have two kids now.",
   "created_utc": 1704344592,
   "score": 1,
   "submission_id": "18y2k82"
  },
  {
   "comment_id": "kg8nq2w",
   "message": "In university one eve, I was at a night club with some friends and around 2AM it hit me that I needed to apply for jobs pretty soon.\n\nSo I sat down and wrote out an email on my phone to HR at a company I had done a co-op for in the past and hit send. I'd been hemming and hawwing about going back there - extremely stressful and fast paced, but interesting industry and great career development. Short story shorter, got the job.\n\nAbout 2 years later, I got recruited into a dream job in the same industry and relocated to the US. So I guess getting drunk and writing an email is what got me here?",
   "created_utc": 1704345580,
   "score": 1,
   "submission_id": "18y2k82"
  }
 ]
}