{
 "submission_id": "18ycth4",
 "title": "What are some real life cheat codes?",
 "selftext": "",
 "created_utc": 1704373807,
 "permalink": "/r/AskReddit/comments/18ycth4/what_are_some_real_life_cheat_codes/",
 "score": 88,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ycth4/what_are_some_real_life_cheat_codes/",
 "comments": [
  {
   "comment_id": "kgaajh1",
   "message": "Being polite increases your odds of getting what you want",
   "created_utc": 1704380649,
   "score": 24,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgagtdr",
   "message": "You can make more friends in two months by becoming interested in other people than you can in two years by trying to get other people interested in you.",
   "created_utc": 1704383021,
   "score": 222,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaqkdq",
   "message": "I don’t think any of these are “cheat codes” many are personality traits that make life easier. In my opinion something closer to an actual cheat code was in 2005. The US treasury introduced a $1 coin with free shipping, so some clever people bought a ton of $1 coins on their credit cards. Paid off the credit cards with the $1 coins and earned infinite airline miles. Free flights for life with this one easy trick. The devs have since patched the exploit.",
   "created_utc": 1704386472,
   "score": 241,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgab373",
   "message": "Listening  \u0026gt; talking.",
   "created_utc": 1704380861,
   "score": 251,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9uxgp",
   "message": "Being funny and a good cook",
   "created_utc": 1704373828,
   "score": 233,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgarolx",
   "message": "Build social skills and the ability to understand human behavior. This will help you in everything in life rather than just existing on pure talents and being an expert",
   "created_utc": 1704386857,
   "score": 97,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga61lg",
   "message": "Someone yesterday mentioned how you can scroll through your text by holding the spacebar on iPhone and my life has already improved because of it.",
   "created_utc": 1704378838,
   "score": 211,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga6ojz",
   "message": "The word \"no\" is a complete sentence. It is the most powerful cheat code.",
   "created_utc": 1704379102,
   "score": 146,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9y01k",
   "message": "Personal finance is probably the biggest one. Understanding credit cards, savings rates, investing, debt, etc. will save you so much time and money in the long run. What you decide to do with your money could be the difference between retiring early and having decades of freedom or working until you die.",
   "created_utc": 1704375311,
   "score": 117,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaad3s",
   "message": "Cooking - your life will be better, and it's a great way to impress friends or a date.\n\nAsk a follow up question or two - if you're getting a negative result in a non-personal interaction, you can sometimes find out about alternatives. In a conversation, asking people to tell you more about something they thought was worth mentioning once in a while often makes for a better conversation. Sometimes you even learn interesting things you didn't know.",
   "created_utc": 1704380580,
   "score": 193,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9vz5x",
   "message": "Be born wealthy.\n\nObviously that's not accessible.  But, learn how to make small talk, as those kinds of details can be the difference between getting opportunities vs getting shut out.  I'm a genuinely curious person so I ask people questions about themselves, and it turns out, most people love talking about themselves, so they have a positive association with me.",
   "created_utc": 1704374348,
   "score": 2,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaoys8",
   "message": "Everyone in these comments is calling buffs and starting traits \"cheat codes.\" It's like they've never played video games. I'll give you a couple real ones.\n\nCompliment your friends behind their back, your relationships will improve magically.\n\nIf you ask someone you don't know well for something small, like to borrow a pen, they will actually like you just a bit more. (for best results, return pen) (does not stack)",
   "created_utc": 1704385917,
   "score": 79,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgang59",
   "message": "Wanna mute those annoying gas station video ads while filling up? Press the second button from the top on the right-hand side. It works most of the time, but some of the newer ones have eliminated this feature",
   "created_utc": 1704385386,
   "score": 129,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaut6i",
   "message": "i know it sounds cliche; but i just turned forty and if i had to distill every thing i’ve ever learned into one piece of advice it’s the idea of “no zero days” daily incremental progress is life changing. it could be a fitness goal, work goal, interest in a new hobby. don’t let the day pass without some progress. even if it’s 1 push-up at 11:59. that’s progress. the time will pass anyway.",
   "created_utc": 1704387935,
   "score": 95,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaa0k7",
   "message": "Don’t drink alcohol. You save a ton of money and you never get hangovers. My son can’t drink for medical reasons. When I realized how much more time he had as a college student it was pretty eye opening. \n  \nDownside: you miss out on the social aspects of sharing drinks, and being the only sober person can suck.\n  \nEdit: I’m not even talking about getting drunk. I only have about one drink two nights a week and I can still get a headache from that.",
   "created_utc": 1704380443,
   "score": 95,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgavgjg",
   "message": "Sobriety. After 20 years of drinking, being sober is like playing life on easy mode.",
   "created_utc": 1704388159,
   "score": 84,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgap5k7",
   "message": "Being attractive, ugly people are seen as creeps for doing the exact same thing an attractive person does.",
   "created_utc": 1704385983,
   "score": 21,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbk47v",
   "message": "Be good looking",
   "created_utc": 1704396480,
   "score": 21,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9vwe6",
   "message": "Roth IRA",
   "created_utc": 1704374310,
   "score": 101,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga9vrb",
   "message": "Do what you need to do to avoid doing the same mistake twice.",
   "created_utc": 1704380390,
   "score": 38,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgan4nd",
   "message": "If you join the military, and choose the right MOS/rating, you can set yourself up for a lifetime of success with a paltry 4 years of suck.",
   "created_utc": 1704385275,
   "score": 42,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga4f6p",
   "message": "The best cheat code to life is making your decisions based on logic instead of emotions.\n\nAlso, take care of yourself.  Start strength training at an early age (this applies to women as well), use sunscreen and try to eat relatively healthy.  \n\nDevelop discipline; discipline is the compass that guides you through life’s challenges.",
   "created_utc": 1704378161,
   "score": 1,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgamee2",
   "message": "Minding your business. \nDont make assumptions. \nStop making excuses. \nComparison is a thief of joy.",
   "created_utc": 1704385018,
   "score": 54,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9wszt",
   "message": "Drink water, eat psilocybin.",
   "created_utc": 1704374746,
   "score": 169,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaq8ri",
   "message": "Compounding interest instead of character faults.",
   "created_utc": 1704386361,
   "score": 14,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga3lgg",
   "message": "Working in IT is a pass to go anywhere you want in most companies.\n\nThere is tech everywhere, being systems engineer really does mean I can be anywhere doing anything and only my direct manager knows if I am making it up.\n\nI mean, I am full time WFH now but, 10 years ago...",
   "created_utc": 1704377814,
   "score": 72,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9vdvg",
   "message": "Time management techniques and leveraging technology for productivity",
   "created_utc": 1704374058,
   "score": 32,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9v2fn",
   "message": "Up, down, up, down, left, right, left, right, A, B, A, B, Start",
   "created_utc": 1704373898,
   "score": 110,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga58qm",
   "message": "Don’t keep your savings in the same account as your monthly budget.\nAs soon as you get paid, move half (or a quarter) to your savings account.\nYou’d be surprised how quickly your savings would grow.",
   "created_utc": 1704378504,
   "score": 18,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgarxwq",
   "message": "Good sleep.",
   "created_utc": 1704386949,
   "score": 17,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga35jv",
   "message": "Pay off higher interest debt first",
   "created_utc": 1704377625,
   "score": 8,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgb5rvw",
   "message": "Buy an EDU email once or twice a year. Reap a-lot of benefits of college students.\n\nBuy a Filefactory account and never worry about buying stream services or cable. (I have a lifetime account)\n\nInternet Download Manager - Speed up download speeds",
   "created_utc": 1704391646,
   "score": 10,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga3see",
   "message": "workout. u will look good and feel good",
   "created_utc": 1704377895,
   "score": 45,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgamf3p",
   "message": "Be handsome.\nBe attractive.\nDon't be unattractive.",
   "created_utc": 1704385025,
   "score": 31,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgap8pg",
   "message": "It's much easier to buy into Ferrari as an investor than it is to actually buy a car from Ferrari.",
   "created_utc": 1704386013,
   "score": 23,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgb9xf2",
   "message": "If you’re nice to people most of the time they will be more willing to help you and even go out of their way for you.",
   "created_utc": 1704393051,
   "score": 7,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbbnnu",
   "message": "\"Kids, don't buy drugs. Become a rock star and they will give them to you for free.\"",
   "created_utc": 1704393635,
   "score": 7,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgamae9",
   "message": "Quit drinking.\n\n(Obviously YMMV, before y'all @ me) You will immediately lose weight, have more energy, have more expendable cash, be less anxious, be mentally sharper, look younger/fresher, feel younger/fresher, accomplish things you've been putting off, have bandwidth to tackle personal problems, get rid of dead weight friends, improve your existing relationships, vastly lower your chance of getting arrested or killing yourself/somebody else.\n\nAnother one: Just ask. The answer is always NO if you don't ask. The answer is sometimes YES if you do ask, and often a stupidly quick and easy YES. To further expand on this, most things are negotiable. I'm not great at it, but getting better, and it requires taking a chance and asking. You pretty much shouldn't pay full price for anything semi-valuable (anything beyond everyday essentials, but even if you wanna haggle on toothpaste, you can go to the flea market lol).",
   "created_utc": 1704384978,
   "score": 14,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbh24z",
   "message": "Drilling pilot holes",
   "created_utc": 1704395436,
   "score": 7,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbncw5",
   "message": "Go to a place where there's more woman than man.",
   "created_utc": 1704397574,
   "score": 6,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaqyno",
   "message": "Work out. Everything in my life improved since.",
   "created_utc": 1704386608,
   "score": 17,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga6sl3",
   "message": "[removed]",
   "created_utc": 1704379149,
   "score": 21,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9vvq5",
   "message": "[removed]",
   "created_utc": 1704374300,
   "score": 28,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9v1dr",
   "message": "[removed]",
   "created_utc": 1704373883,
   "score": 6,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgasuik",
   "message": "Using unwanted veg to make soups is a recent life hack i've picked up. Just get a decent blender and they're so easy to make. They feed alot of people/multiple servings and are usually quite healthy as well.",
   "created_utc": 1704387260,
   "score": 5,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbb05p",
   "message": "Being rich and good looking",
   "created_utc": 1704393415,
   "score": 5,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbqlqy",
   "message": "Regular exercise (even just walking) a couple times per week.",
   "created_utc": 1704398664,
   "score": 5,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9zbv3",
   "message": "money",
   "created_utc": 1704375923,
   "score": 8,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgay2az",
   "message": "Drink water, eat *only* vegetables at least 5 meals a week, sleep more, do at least 30 minutes of cardio a day. You'll feel 10 years younger.",
   "created_utc": 1704389042,
   "score": 9,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgb95wk",
   "message": "If you buy a house, keep one room empty and ask single women how you should decorate.  Your welcome.",
   "created_utc": 1704392793,
   "score": 9,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9v0tx",
   "message": "Having a high credit score",
   "created_utc": 1704373875,
   "score": 17,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kg9v9y3",
   "message": "I learned to read Korean script with almost zero effort.\n\nI simply watched Kpop videos (with Korean subtitles on) for a year.\n\nEasiest free ride I ever had. I wasn't even intending to become literate in Korean. I just liked the music. It wasn't till later I discovered -- when shopping at H-Mart -- that I could read all the labels. lol",
   "created_utc": 1704374003,
   "score": 15,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaj5a7",
   "message": "Buy a motorcycle instead of paying for therapy.",
   "created_utc": 1704383859,
   "score": 14,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgahtsc",
   "message": "Getting good at public speaking. And dress well. That will set you up big time.",
   "created_utc": 1704383386,
   "score": 9,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgaplsy",
   "message": "I work in the aviation industry. It is the best cheat code to travel. I also have met lots of cool people who share that passion which has its residual effects.",
   "created_utc": 1704386142,
   "score": 3,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgau8vz",
   "message": "When warming soup in the microwave put a tortilla on top to stop the splatter and then dip in your soup.",
   "created_utc": 1704387740,
   "score": 4,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgb21cp",
   "message": "Boundaries. When properly set life becomes easier.",
   "created_utc": 1704390385,
   "score": 4,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbiw4x",
   "message": "Never stop learning. And I don't mean easy stuff like watching informative YouTube videos. Try to get certifications in your field of expertise, pick up and find new tools. Get a skilled hobby and learn about it, woodworking, gardening, acrobatics, drawing, playing instruments. Hell, learn about learning and get better at learning.\n\nEnd of the day, when all else fails you. What you've learnt will always be there, providing value.",
   "created_utc": 1704396062,
   "score": 3,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga7vmw",
   "message": "Have connections as much as many to the powerful and affluent people. –Or just be wealthy",
   "created_utc": 1704379595,
   "score": 8,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kga4gea",
   "message": "In the theme of cheat codes being lame and kinda scummy... \n\nYou can buy most seasonal decorations off amazon, use them and return them after the holiday for a full refund.\n\nNot saying it's ethical, not saying it's right, and if you are going to do this, make sure it's an amazon basic item shipped direct from amazon.",
   "created_utc": 1704378175,
   "score": 12,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgasmjl",
   "message": "Being polite increases your odds of getting what you want",
   "created_utc": 1704387184,
   "score": 7,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbxixx",
   "message": "Get paid in cash. Don't declare it on your taxes.\n\nYou can shoplift a lot of things. No one is paying attention.",
   "created_utc": 1704401026,
   "score": 7,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgam78a",
   "message": " Being attractive",
   "created_utc": 1704384946,
   "score": 8,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgamnto",
   "message": "Learn to style your own hair nicely. Idc what anyone says; hair will make or break your entire look. ,’;)",
   "created_utc": 1704385112,
   "score": 3,
   "submission_id": "18ycth4"
  },
  {
   "comment_id": "kgbczb0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ycth4"
  }
 ]
}