{
 "submission_id": "18yfad1",
 "title": "For those who have successfully transitioned to a four-day workweek, how has it impacted your productivity and work-life balance?",
 "selftext": "",
 "created_utc": 1704380826,
 "permalink": "/r/AskReddit/comments/18yfad1/for_those_who_have_successfully_transitioned_to_a/",
 "score": 77,
 "url": "https://www.reddit.com/r/AskReddit/comments/18yfad1/for_those_who_have_successfully_transitioned_to_a/",
 "comments": [
  {
   "comment_id": "kgagcyp",
   "message": "Mostly good but I'm worried my employer will find out",
   "created_utc": 1704382854,
   "score": 42,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgajak5",
   "message": "I'm still on a 5 day but i'm hybrid and work from home 3 days a week and my job is more or less a results-only environment, meaning no one gives a fuck where I am or what I'm doing if my deliverables are delivered on time.\n\nIt's great. In fact, I'll never accept another job that doesn't let me work this way again. Ever. So to all the Elon Musks and Mark Benioffs and all the other dipshit CEOs who have their heads up their own asses who expect \\*EVERYONE\\* to commute in to their jobs every day to put in the time and grind it out, eat a dick. I'm happier, less stressed, more productive.\n\nWork/Life balance means more to me than making you feel like you're captaining...something. Pay for my services or don't. Either way, fuck you. LOL\n\nP.S.\n\nI'm sure it's only a matter of time before some Fox News-watching Boomer or fascist moron who believes in the importance of being seeing toiling away by \"the boss\" still means something and how \"entitled\" I sound. Don't care. Adapt to the new world or die.",
   "created_utc": 1704383911,
   "score": 31,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgabjx0",
   "message": "It's great! I've become 20% more efficient at procrastinating and my plants have never been happier with all the extra conversations we're having.",
   "created_utc": 1704381043,
   "score": 25,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgae2jv",
   "message": "I transitioned straight down to a 0 day work week.",
   "created_utc": 1704382005,
   "score": 23,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgai757",
   "message": "Not a 4 day work week, but I have a schedule where I work \"9/80\" so in a 2 week span I work 9 days, average about 9 hours each for a total of 80 hours. Effectively I get every 2nd Friday off.\n\nI've had the set up for years, since before the pandemic. Honestly it's spoiled me in a great way. Every big errand (dentist, car appointments, grocery haul) I try to schedule on that off Friday. It makes taking mini-vacations a lot easier.\n\nI'd say it's great for productivity but my job is usually one that occurs in bursts of activity. When it's busy we're all busy, when it's calm it doesn't matter if we have a 5 or 4 day week.",
   "created_utc": 1704383519,
   "score": 7,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgadymb",
   "message": "Its great if the company you work for honors it and didn't just buy themselves an extra workday because of it.",
   "created_utc": 1704381963,
   "score": 6,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgajivv",
   "message": "I work outside sales In a niche market. It’s a salary/no commission job. Most Fridays I “work from home”. Mostly just answer my phone if I someone calls me. \n\nAs long as I answer my phone. No one knows or honestly cares",
   "created_utc": 1704383994,
   "score": 2,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgali8x",
   "message": "I tried 4/10s and I'm convinced that only maniacs do that.",
   "created_utc": 1704384701,
   "score": 2,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgadktq",
   "message": "It works great if you are an individual contributor. You are able to dedicate your days better and overall better balance.\n\nIf your\\ are a manager or above it gets somewhat difficult. Meetings never align on your day off, issues arise where you are needed on days off, decisions get delayed because you are out. Overall its frustrating to yourself and others and so I advise against it if anyone is looking to you as a decision maker.",
   "created_utc": 1704381820,
   "score": 5,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgahx8l",
   "message": "Who are these people and how did they do that?\n\nAlso, how do you have 59 upvotes but only like 5 comments?",
   "created_utc": 1704383421,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgakf6u",
   "message": "It’s much better. One thing to watch out for is spending money on the extra day off.",
   "created_utc": 1704384314,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgakgux",
   "message": "We are now fighting for a 3 day week",
   "created_utc": 1704384331,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgamu0y",
   "message": "Instead of five days, I would only want to slam my skull against a wall for four.",
   "created_utc": 1704385173,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kganmff",
   "message": "I transitioned to 80% hours for 85% pay and my life changed soooo much for the better. Finally I had time to get shit done at home and I could actually rest and enjoy life on the weekends. 1 year down the road I started to lean more into a hobby of mine and I now make more money from that hobby then I would have ever gained from working 20% more",
   "created_utc": 1704385448,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgaodzk",
   "message": "I'm on a \"9-80\" schedule, so not exactly what you're asking but close to it. I work 9 hour days M-Th and every other Friday I work 8 hours and get the opposite Friday off. In a two-week pay period, I get 80 hours in. \n\nIts great to use those Fridays off for errands while stores have less shoppers than on weekends, parks and beaches have less people, restaurants are easy to get seated at, and generally there seems to be less traffic. Knowing every other week brings a 3-day weekend is great to look forward to, however the opposite weekend two days off doesn't feel like enough time away from work anymore.",
   "created_utc": 1704385715,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgaore3",
   "message": "It is genuinely amazing and the only reason I'm still at my current company. Makes me feel like a real person who can actually get things done in my personal life those 3 days. Makes weekend trips so much easier, I can go to gym and run errands on my off day with no one to bother me. The work is completely the same, if I really need to work on my off day on a specific project nobody will bother me so I can actually finish it much faster. If they take it away I'm leaving immediately.",
   "created_utc": 1704385845,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgaoso0",
   "message": "I'm a 9 hour schedule where we get every other Friday off. It's amazing. Barely feels any different than an 8 hour day but having a three day weekend every other weekend is amazing.",
   "created_utc": 1704385857,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgapnpu",
   "message": "i did 4/10s for a year at my old firm......no thanks, i prefer 5/8s, days go by much faster",
   "created_utc": 1704386160,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgaq1lx",
   "message": "I used to have a 4 day work week, it was the best. 10 hour days aren't too bad. You still have just enough time to do all your \"after work\" stuff and still get enough sleep every day. And you have a 3 day weekend every weekend. I was also hourly at the time, and they always said yes to overtime so I would always come in and work a 1/2 day Friday (or full day if there was a lot going on) which just let me rake in the money. On those Fridays I'd roll in late, super casual, just jeans and a t-shirt. Work for 4-5 hours. Go to lunch with some coworkers, and go home from there.\n\nI've also worked 12 hour shifts, where I worked 3 days one week, 4 days the next week. That was also nice, but a little less good. As you don't really have time for \"after work\" stuff on a 12 hour shift. But the extra days off were super nice.",
   "created_utc": 1704386293,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgaqb5c",
   "message": "I'm a physiotherapist working at a rural hospital. Having a four day a week schedule is the only way I  can stay at my job without burning out. Working 5 days a week was unsustainable. I need a full day off of doing absolutely nothing just to recover from work week. Having 3 day weekends is awesome, I can go on a longer trip or get stuff done around the house. The salary difference is not that noticeable because of taxes. I work Tuesday to Friday, that way most stats fall on my day off and don't affect my paycheck.",
   "created_utc": 1704386384,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgarbl6",
   "message": "Currently on a 4-10 schedule. Workday starts at 6am. It sucks getting up early. But that extra day off each week is amazing! I'd have a really hard time going back to a 5-8 job now.",
   "created_utc": 1704386732,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgasmkl",
   "message": "We are now fighting for a 3 day week",
   "created_utc": 1704387184,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgat90g",
   "message": "I work 4 days a week with Wednesdays off. I work in allied health. I earn 20% less than before, but my mental health has improved, as has my work ethic in general since I'm not so tired. \n\nGives me a nice mental break part of the way through the week, and time to work on my other freelance work as a musician.",
   "created_utc": 1704387399,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgatfus",
   "message": "It's actually great. My wife and I both work from home, but she has to go into the office on Fridays, so I use my Fridays off to pick up groceries after dropping the kid off at school (I place online order pick-up on Thursday night), then after putting the groceries away, I do a little tidying up, clean the bathroom, and then I have lunch. After lunch I either nap or play games on the Xbox. She picks up the kid on her way home, and I make dinner.\n\nIf there are appointments to be made or bills to be paid or errands to run, I get them done on Fridays as well, so the weekends are reserved for actual fun/relaxation. \n\nBecause of the way Christmas and New Years landed, I took the 26th - 28th off from work and ended up getting an 11-day vacation: Friday 22nd (normal off day), 23-24 (weekend), 25th (Monday, Christmas), 26-28 PTO, 29th (normal Friday off), weekend, 1st (Monday, New Years). \n\nThis week is only a three day work week because Monday was a holiday and I'm off again on Friday!",
   "created_utc": 1704387464,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgatlzr",
   "message": "I’ve always been the type of salary worker that “grinds hard” in bursts. So this type of change really works with that style since I would have unproductive days anyway. Only now, I don’t have to pretend and can do whatever I want. So it’s nice.",
   "created_utc": 1704387522,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgatqfr",
   "message": "4/10's is the best thing since I started working 25 years ago. I love 3 day weekends every single week. I work 6-5.",
   "created_utc": 1704387563,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgau4ii",
   "message": "It’s fucking awesome",
   "created_utc": 1704387697,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgau8ju",
   "message": "I started a new job in November that is a 4 day work week (4x 10 hour days). Note I don't work from home, I'm a healthcare professional that sees patients in an outpatient clinic. Here is my take:\n\nPros: Obviously it's great to have a full extra day off every week. I'm assigned to have Mondays off, so all my weekends are 3-day weekends. It will help me use less vacation time, and when a statutory holiday falls on a Monday, I can take my stat on a day of my choosing. Usually I pick the Tuesday after, or the following Friday to have a 4 day weekend. My 10 hour days are usually quite productive, I never feel like I have to \"catch up on things\".\n\nCons: I now have to schedule most appointments on my day off, since I can't make them when I work 10 hour days. Sometimes I'll have 2-3 appointments in 1 day, so it doesn't really feel like a relaxing day off. I also have to do way more food prep, since I eat breakfast and lunch at work instead of just lunch. My partner has been taking on more of our dinner prep since I don't get home until 7pm now. I don't work out as much as I used to, since I'm pretty tired after a 10 hour day. I've been forcing myself to go to a gym class on my way home 2x per week. Also since it's winter where I live (Canada), it's often dark when I leave the house and dark when I come home. I try and go outside at lunch to get some sunlight.\n\nOverall though I've really enjoyed this shift and I think it should definitely be the new norm for a lot of employers.",
   "created_utc": 1704387737,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgawxln",
   "message": "I’m a union tradesman and have been on a 4 day work week since I started the trade as a first year apprentice back in 1995. On my first day I asked what the hours were and they said 4-9’s. I was like what the hell is that and they said it’s Monday to Thursday 9 hours a day for a 36 hour work week. I thought they were joking with me. It’s amazing and when there is a holiday Monday I get a 4 day weekend.",
   "created_utc": 1704388660,
   "score": 1,
   "submission_id": "18yfad1"
  },
  {
   "comment_id": "kgazwkn",
   "message": "I work 4 days a week, 10 hours a day. The union fought hard for a 4 day week, however, the union only exists in the main district.\n\nI work in an off-branch of the main district, in a separate location where there is no union. There is also no balanced power structure, so my boss has absolute power over me (and has no experience in my field of work). I have faced nonstop abuse and gaslighting from my boss, and I have no idea what to do. I have nobody to reach out to. My best bet is to quit soon, which is sad, because it could have been the perfect job. \n\nIt was ruined by one person, who decided to be shitty to me, and happens to be my boss. Sucks man.",
   "created_utc": 1704389667,
   "score": 1,
   "submission_id": "18yfad1"
  }
 ]
}