{
 "submission_id": "18yjfxs",
 "title": "What is a story you tell to impress someone?",
 "selftext": "",
 "created_utc": 1704391371,
 "permalink": "/r/AskReddit/comments/18yjfxs/what_is_a_story_you_tell_to_impress_someone/",
 "score": 3,
 "url": "https://www.reddit.com/r/AskReddit/comments/18yjfxs/what_is_a_story_you_tell_to_impress_someone/",
 "comments": [
  {
   "comment_id": "kgb85xo",
   "message": "I saw a car that hit a pole once. Helped the guy out. Helped to park the car which was in the way.\nThe guy was full drunk so I took away the keys. \nHe peed hinself and during my manouver with the car my jeans got fully soaked. Ot was itchy and cold. He tried to get the keys back. He was stronger, I was sober and faster. Called the police while he was chasing me.\nMenanwhile my girlfriend called that when will I bring food, I was away for too long time. Told her I have these issues.\nThen we won't eat today. This was the response.\nTurned out that the guy's driver's license was revoked for drunk driving before.\nHe said during the hearing that he wasn't drovong which is evidenced by the fact that his driver's license was revoked. Car was driven by a friend who had a dog. he wasn't there because I was distracted the pet.\nI called the police because I was jealous of him. He will press charges against me for perjury\n\nI bought food on the way home, but by then everyone had eaten and noone was hungry. In the morning frost, the initially pleasant warm pee become cold and froze on my thigh.\n\nGood times",
   "created_utc": 1704392457,
   "score": 2,
   "submission_id": "18yjfxs"
  },
  {
   "comment_id": "kgb5b9b",
   "message": "I met some celebrities",
   "created_utc": 1704391491,
   "score": 1,
   "submission_id": "18yjfxs"
  },
  {
   "comment_id": "kgb5dbk",
   "message": "I have been to China for a students exchange.",
   "created_utc": 1704391509,
   "score": 1,
   "submission_id": "18yjfxs"
  },
  {
   "comment_id": "kgb6pvs",
   "message": "I went to Miley Cyrus’ 16th birthday party",
   "created_utc": 1704391969,
   "score": 1,
   "submission_id": "18yjfxs"
  },
  {
   "comment_id": "kgb9kju",
   "message": "Oh man, I got a good one for ya. I once convinced this babe at the bar that I was an undercover agent on a top secret mission...until she saw my fake badge fall out of my pocket and realized it said Detective Dangles instead of FBI. Good times.",
   "created_utc": 1704392931,
   "score": 1,
   "submission_id": "18yjfxs"
  },
  {
   "comment_id": "kgbzh0l",
   "message": "I worked… with kids… Quite impressive considering the fact I didn’t give up. You should have seen them…",
   "created_utc": 1704401672,
   "score": 1,
   "submission_id": "18yjfxs"
  }
 ]
}