{
 "submission_id": "18ys94e",
 "title": "What are your thoughts on the old saying “children should be seen and not heard”?",
 "selftext": "",
 "created_utc": 1704412896,
 "permalink": "/r/AskReddit/comments/18ys94e/what_are_your_thoughts_on_the_old_saying_children/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ys94e/what_are_your_thoughts_on_the_old_saying_children/",
 "comments": [
  {
   "comment_id": "kgcy7fr",
   "message": "Outdated. I was personally raised like this by my parents. This negatively affected my confidence and public speaking. My opinions and statements were hardly ever validated. My parents idea of being heard was \"uhuh, yeah, I see.\" I didn't find my voice until I was in my 20s. \n\nToday as a dad of 2, I let my kids voice their opinions and emotions. I allow them to be comfortable telling me their concerns and things going through their mind. I respond and allow them to ask questions about my own responses. I help them walk through things like death, heartbreak, bullying, and so on. \n\nKids arent just a shadow following you around. They're little humans trying to make sense of the world just like you are. They don't have an expansive vocabulary to have a thoughtful conversation, but that doesn't mean their voices don't matter.  They're trying to make sense of the world just as all adults are. It's only fair that we give them the space and comfort to be able to communicate and feel heard.",
   "created_utc": 1704413853,
   "score": 17,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcz8rp",
   "message": "I think it implies to children that everything the adults say at the table is correct. Like ‘I’m right, you’re wrong’ kind of thing. A bad way to raise a child if you want them to have their own opinions and be outspoken.",
   "created_utc": 1704414239,
   "score": 8,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd0w2l",
   "message": "We have birth control now, if you don’t like kids you don’t have to have them.",
   "created_utc": 1704414857,
   "score": 8,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcw6g9",
   "message": "Not a fan of it personally, they’re people and not decorations",
   "created_utc": 1704413093,
   "score": 19,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd0fff",
   "message": "If you don’t respect children, you’re just helping to grow untrusting, antisocial and insecure adults.",
   "created_utc": 1704414683,
   "score": 9,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd2jmn",
   "message": "In my experience, people who say that are uptight assholes.\n\nKids are generally carefree and having fun.\n\nWishing they were quiet is the opposite.",
   "created_utc": 1704415476,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd5swq",
   "message": "Oh god no, when they are quiet is when it’s dangerous. \n\nWhen I can’t hear my toddler is when I know he is *breaking something*.",
   "created_utc": 1704416703,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd5xxh",
   "message": "It is the root of a lot of my childhood trauma.",
   "created_utc": 1704416755,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd77w5",
   "message": "I think you are quoting the Milford School from Arrested Development wrong, its \"Children should be NEITHER seen nor heard\",",
   "created_utc": 1704417234,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcy5lk",
   "message": "Spoken by people who either don't have kids or regret having them. Let kids be kids.",
   "created_utc": 1704413834,
   "score": 5,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcxd59",
   "message": "I think it's a little taken out of context.",
   "created_utc": 1704413539,
   "score": 3,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcwvyx",
   "message": "Given that lots of folks these days make every excuse under the sun for why their kids should be able to run amok with impunity I think the phrase needs a bit of a comeback.",
   "created_utc": 1704413358,
   "score": 0,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgczhyp",
   "message": "Wouldn’t ever think or say it myself. \n\nSeems like an outdated, unhealthy way to raise kids. Probably only really propped up these days by 20-something year olds that are no less self-absorbed than children.",
   "created_utc": 1704414335,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcw0mi",
   "message": "Most of the time, yes.",
   "created_utc": 1704413032,
   "score": 252,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgcy408",
   "message": "Doesn't go far enough. I don't even want to see them.",
   "created_utc": 1704413818,
   "score": 254,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd2zx0",
   "message": "Time and place.",
   "created_utc": 1704415645,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd3g8p",
   "message": "Depends on the context. \n\nAs a teacher, I feel that a lot of children have really no expectations at home that there are times where they need to control themselves and behave. Being able to be a little bit reverent and quiet, even though yes, you're kinda bored, is important. This has always been an issue, its more prominent now.\n\nThere are also times where a kid should be a kid.",
   "created_utc": 1704415817,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd3rgp",
   "message": "So, I simultaneously agree with it and loathe it. When I have a migraine, these are the wisest words ever strung together. Otherwise, I hate it. They are humans. Slightly noisier than average humans, but humans. \n\nThe only time my parents ever used the statement was when one of us was doing a dramatic reenactment of an emergency siren of some sort, complete with giant crocodile tears. Once the overzealous screeching ended, we were entitled to be heard no matter how nonsensical it seemed to my parents. It was the fake crying that deserved no attention. If you wanted to throw yourself on the floor in a full on tantrum, have fun — but do it quietly. If you want to act like a tantruming child, it’s your prerogative, but no one else has to hear it.  It’s a lesson that’s served me well. Words first, explosions never. \n\nSo for me, migraines and screaming, fake crying children get that response, at all other times it’s a nonsensical statement. \n\nI admit though, it has infuriated me before, being on the receiving end of it. Granted, I was a full grown adult, in a foreign country with my husband for my BiL’s wedding and my uncle tagged along. Every time I spoke, my uncle said this to me, and I finally snapped. I reminded him I was an adult with my husband on a trip he wasn’t even invited to and he just invited himself. If he said the sentence one more time, I would personally guarantee that my bil would ban him from the actual wedding and he’d have to stay alone in a completely different town in a foreign country because then he wouldn’t have to hear us “children” speaking. He was furious the rest of the trip, but didn’t dare say it again because I wasn’t kidding and he knew it.",
   "created_utc": 1704415931,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd5kfn",
   "message": "I'll be the dissenting opinion here: I somewhat agree with this.\n\nI was raised like this. However, it was only applied when we were in public or had company. It's an acknowledgment that the antics of children can be an annoyance to others. \n\nThe expectation was that, even as a kid, you should not be causing a ruckus or annoying others. You are responsible for how you act and you understand that the playful behaviors you naturally have as a child are not appropriate in every environment.",
   "created_utc": 1704416613,
   "score": 1,
   "submission_id": "18ys94e"
  },
  {
   "comment_id": "kgd9m3d",
   "message": "It’s the perfect recipe for raising a narcissist.",
   "created_utc": 1704418137,
   "score": 1,
   "submission_id": "18ys94e"
  }
 ]
}