{
 "submission_id": "18yx66p",
 "title": "Do you feel hopeful or hopeless, and why?",
 "selftext": "",
 "created_utc": 1704426515,
 "permalink": "/r/AskReddit/comments/18yx66p/do_you_feel_hopeful_or_hopeless_and_why/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/18yx66p/do_you_feel_hopeful_or_hopeless_and_why/",
 "comments": [
  {
   "comment_id": "kgdun8r",
   "message": "i just feel hoeless",
   "created_utc": 1704426572,
   "score": 5,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdunq4",
   "message": "hopeful. i make mistakes, but i think i can learn from them.",
   "created_utc": 1704426579,
   "score": 3,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgduu3c",
   "message": "I feel hopeful. I do not believe that the current culture can survive for too much longer without major push back.",
   "created_utc": 1704426654,
   "score": 2,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdx6f6",
   "message": "i feel hopeless. i went through l mental health issues around 2018.  Went to inpatient twice and essentially missed the 1st semester of my senior year. It didn’t help that after I got out I was in the wrong medication and it made me extremely manic. I made mistakes I still regret to this day and burnt a lot of life long bridges. The only thing that got me out of it was that my life will get better when i’m older. Now 5 years later i’ve had a major back surgery that pretty much causes me consistent pain and limitations. All of the people i’ve talked to have drifted apart and i’m on the brink of failing out of college. The fact that most of the people I went to high school with have graduate and progressed it life has me wonder what I did wrong. It just feels like the past 2 years have gone by in the blink of an eye and i’m still in the same place. I decided to get a job as a back up plan if I really do flunk out and I honestly hate it. Ive been there for almost a year and I still feel clueless. The best part is just  yesterday my insurance company denied my coverage so now I need to find a new plan. I commute fairly far to my job and i really don’t know what i’m going to do. It just seems like the world is crashing around me and it feels like i’m at a breaking point.",
   "created_utc": 1704427686,
   "score": 2,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdungf",
   "message": "Neither",
   "created_utc": 1704426575,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgduwne",
   "message": "hopeful, as of today because I feel a little more aligned with the goals, etc",
   "created_utc": 1704426684,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdvbrt",
   "message": "I feel hopeless because I don't have money to transition.",
   "created_utc": 1704426864,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdvil2",
   "message": "Hopeful. I havent even made big changes to my life but just by carrying myself with confidence my life has improved so much",
   "created_utc": 1704426947,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdvo6g",
   "message": "Hopeful I can sleep tonight",
   "created_utc": 1704427016,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdvr1l",
   "message": "hopeless because i gave up trying to be happy/joyful when there is nothing to be happy/joyful about",
   "created_utc": 1704427052,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdvt1f",
   "message": "I'm cautiously optimistic, so I guess I'm hopeful\n\nMy mind has a nasty tendency to torture me to no end thinking of worst-case scenarios that rarely happen. I have to deliberately stop myself from falling too far into that rabbit hole",
   "created_utc": 1704427076,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdx1hq",
   "message": "Hopeless, life is not the same since she’s gone and I can’t forget her, I haven’t been able to hope fora future since",
   "created_utc": 1704427624,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdyqay",
   "message": "Right now I feel directionless and isolated.",
   "created_utc": 1704428395,
   "score": 1,
   "submission_id": "18yx66p"
  },
  {
   "comment_id": "kgdzd1r",
   "message": "hopeless. i have tried everything to get better but nothing seems to work",
   "created_utc": 1704428687,
   "score": 1,
   "submission_id": "18yx66p"
  }
 ]
}