{
 "submission_id": "18zl0tw",
 "title": "What’s a fact that could save your life?",
 "selftext": "",
 "created_utc": 1704497413,
 "permalink": "/r/AskReddit/comments/18zl0tw/whats_a_fact_that_could_save_your_life/",
 "score": 170,
 "url": "https://www.reddit.com/r/AskReddit/comments/18zl0tw/whats_a_fact_that_could_save_your_life/",
 "comments": [
  {
   "comment_id": "kgjrb0d",
   "message": "Teach your kids that if they're ever separated from you to find any closest adult (in emergencies).\n\nThe likelihood of THE next person you would walk up to being a pedophile are slim to none. But the odds increase dramatically waiting for the first person to approach a child alone.",
   "created_utc": 1704519578,
   "score": 50,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgilpif",
   "message": "don't mix bleach with anything but water",
   "created_utc": 1704501616,
   "score": 58,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgipm27",
   "message": "You lose heat 20 times faster when wet vs being dry.    Shed wet clothes.",
   "created_utc": 1704503103,
   "score": 247,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjc09v",
   "message": "Losing weight without trying could very well be cancer.",
   "created_utc": 1704512173,
   "score": 101,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj7qgw",
   "message": "Don’t pull a knife or anything else out of a puncture wound. The object may very well be keeping you from bleeding out, only a medical professional should remove something stuck in you.",
   "created_utc": 1704510333,
   "score": 170,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiwq1e",
   "message": "Baking soda will extinguish a fire, even grease and electrical fires.\n\nYou should always keep a box of it nearby when you're cooking and grilling.",
   "created_utc": 1704505868,
   "score": 22,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj1n7n",
   "message": "If you fall through the ice... the dark spot is the way out.\nEdit \u0026gt; the sun reflects off the ice surface.  The spot you entered has no ice or reflection, so will be dark ... opposite what we would naturally think",
   "created_utc": 1704507839,
   "score": 233,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgitbpl",
   "message": "Don’t pour water on a grease fire put baking soda on it instead",
   "created_utc": 1704504544,
   "score": 104,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjdkvg",
   "message": "If you get lost in the wilderness the best thing to do is to stay calm and stay put. Unless there is an immediate threat to your safety in the area, just sit down and wait for someone to come find you.\n\nMany people die or get seriously injured because they keep moving and Search \u0026amp; Rescue can't catch up to them.",
   "created_utc": 1704512870,
   "score": 14,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjzpxl",
   "message": "You should still attempt to dial 911 in an emergency even if you have no bars of signal. There are protocols that allow your phone to bounce signals off any tower available, including military/first responder ones and towers not on your network in the event that you attempt to call 911.",
   "created_utc": 1704524677,
   "score": 155,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgja3jn",
   "message": "If you can’t find you kid in your house, don’t search common places they would be.  Search the most deadly places; pools, freezes, washing machines and dryers.  Seconds count and if they are hiding under the table for an extra minute, who cares.",
   "created_utc": 1704511336,
   "score": 67,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiqjkg",
   "message": "Carbon monoxide is odorless. Get a detector.",
   "created_utc": 1704503461,
   "score": 59,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjey4o",
   "message": "The rocks from a river absorb water. When rapidly heated it causes the absorbed water to boil much quicker than steam can escape the rock. This buildup of steam causes the rock to explode, sending hot rock fragments everywhere.\n\nSo don't use rocks from a river to make a fire pit.",
   "created_utc": 1704513487,
   "score": 37,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgifxre",
   "message": "Signs of a stroke: FAST.\n\nFace drooping? Arm weakness? Speech slurred? Time to go to the hospital! \n\nSpeed of response makes the difference between \"sometimes walks a little funny when tired\" and \"bedbound lump.\" If you know old people, you need to know how to spot a stroke.",
   "created_utc": 1704499437,
   "score": 184,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiutc4",
   "message": "If you get caught in a rip current, don’t fight it. It won’t pull you under. People die because they panic, fight it, and get tired and then drown. \n\nWhen you can, swim parallel to the shore out of the rip and then diagonally back to shore.\n\nEDIT: I’m taking out the part about “let it take you out” because people bring up a point below that you should start swimming parallel immediately. I just meant you shouldn’t fight it and swim against straight back to shore. That’s not going to end well. Stay safe out there everyone!",
   "created_utc": 1704505124,
   "score": 117,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj669e",
   "message": "Just because someone rings your doorbell, doesn't mean you have an obligation to answer.",
   "created_utc": 1704509686,
   "score": 94,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiejo3",
   "message": "Choking is silent. If they’re coughing, they’re not actually choking. If someone goes silent and starts pointing to their neck, start the Heimlich maneuver.",
   "created_utc": 1704498910,
   "score": 135,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiaux1",
   "message": "A fishy smell in your house could mean there’s an electrical fire",
   "created_utc": 1704497521,
   "score": 29,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjb93n",
   "message": "If someone comes at you with a weapon and tells you to go with them, DO NOT. Never go to the second location.",
   "created_utc": 1704511841,
   "score": 87,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgir1ql",
   "message": "I live in Canada, this only applies to cold climates. They are not dead until they are warm and dead. There are many cases where somebody got stuck outside and froze then doctor revived them.",
   "created_utc": 1704503656,
   "score": 100,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjlnkm",
   "message": "Do not I REPEAT DO NOT lay in the snow or walk home alone in the cold when you are far too drunk. I had a friend die from hypothermia and alcohol poisoning because she wanted to take a nap in the snow.",
   "created_utc": 1704516670,
   "score": 30,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjdwq6",
   "message": "Check your breasts/testicles regularly for lumps",
   "created_utc": 1704513017,
   "score": 209,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjdfeh",
   "message": "If your car is broken down, do not stand in front of it while waiting for help. I had a friend killed when another driver swerved and hit her vehicle, causing it to run over her.",
   "created_utc": 1704512803,
   "score": 197,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjagec",
   "message": "1. Wool is warmer than anything that feels warm, even when wet.",
   "created_utc": 1704511494,
   "score": 131,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgioe8x",
   "message": "If you've gone two and a half or more days without water, and you have to choose between drinking water without any way to sanitize it or not drinking water, drink the water. If you don't, you'll definitely die soon. Most of the diseases you can get from bad water take a couple days to set in, which gives you more time to find help.",
   "created_utc": 1704502635,
   "score": 13,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj1lfc",
   "message": "Never walk/ski/snowboard near trees when there is heavy snow- there is something called a \"tree well\" that sometimes forms under trees where if you fall in you will become impacted by snow, often upside down and suffocate to death",
   "created_utc": 1704507819,
   "score": 201,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kginnub",
   "message": "If you get bit by a wild animal, get yourself to a hospital ASAP and tell them that. You don’t want rabies to set in.",
   "created_utc": 1704502357,
   "score": 99,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjca2w",
   "message": "My mom always taught me to count rows between your seat and the emergency exit. So if you can’t see where you are going you can feel where you are going. I’ll never forget that.",
   "created_utc": 1704512292,
   "score": 154,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj7hdv",
   "message": "if it feels wrong, it probably is. trust that gut feeling, it’s there for a reason.",
   "created_utc": 1704510228,
   "score": 208,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj78n8",
   "message": "Bring a lot of water, if you head into the desert. Like way more than you think you need.",
   "created_utc": 1704510126,
   "score": 214,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiiw3i",
   "message": "If your kid gets kidnapped, don’t teach them to say “help”. Teach them to say something like “who the fuck are you, you’re not my fucking dad, fuck you.” That’s gonna turn a lot more heads and get you actual help a lot quicker.",
   "created_utc": 1704500558,
   "score": 100,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiog1i",
   "message": "* Elephants can outrun you. \n\n* Elephants can outswim you.\n\n* Elephants can throw objects at you.\n\n* Elephants do not think you are cute.\n\n* Elephants are very emotional.\n\n* Elephants remember.",
   "created_utc": 1704502654,
   "score": 223,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjk592",
   "message": "The symptoms of a heart attack are different for women.\n\nHave a mole check as soon as you can. \n\nNever put off going to the Dr if you think something is wrong.\n\nFight your Dr if they don't help you. Never give up. It's YOUR life that is in danger, not theirs.",
   "created_utc": 1704515932,
   "score": 48,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjmyc7",
   "message": "Orange to your thigh, blue to the sky. When you need to use an epi-pen.",
   "created_utc": 1704517321,
   "score": 200,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgidgnd",
   "message": "If you live where the winter gets cold and you are traveling by car:  \nAlways bring extra clothes  \nHave candles in the car  \nTry to always know where you are\n\n\u0026amp;#x200B;\n\nAlways run from a street fight no honor in winning and deadly if you loose.\n\n\u0026amp;#x200B;\n\nBasic rule of 3 you can survive  \n3 minutes without breathing (asphyxiation, blood loss)  \n3 hours without shelter in an extreme environment (exposure)  \n3 days without water (dehydration)  \n3 weeks without food (starvation)\n\nproriority",
   "created_utc": 1704498503,
   "score": 162,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgigyhh",
   "message": "Don’t drive distracted please guys",
   "created_utc": 1704499829,
   "score": 193,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgja8ab",
   "message": "know the signs of sepsis. \n\nT – Temperature higher or lower.\n\nI – Infection – may have signs and symptoms of an infection.\n\nM – Mental decline – confused, sleepy, difficult to rouse.\n\nE – Extremely ill –  severe pain or discomfort, shortness of breath.\n\n\nsepsis kills within HOURS, and kills 11 million people a year. that’s 1 in 5 deaths. and it’s the number one death in hospitals.",
   "created_utc": 1704511394,
   "score": 119,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgihu9n",
   "message": "Knowing that the symptoms of a heart attack are often very different for women compared to men.",
   "created_utc": 1704500162,
   "score": 14,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgieuv0",
   "message": "Inflammable does not mean non flammable. It means it's something that could catch in fire that you don't want to catch on fire. \n\nTank of CO2: Non flammable. \n\nTank of Propane: Flammable. \n\nTank of Oxygen: Inflammable",
   "created_utc": 1704499025,
   "score": 198,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjpchs",
   "message": "lets say you or someone youre with needs emergency medical assistance, and theres a crowd around you. dont just say “someone call 911!” instead, point at a random but specific person and demand they call 911. when you speak to everybody, theres a big chance everyone will assume everyone else will do it.",
   "created_utc": 1704518548,
   "score": 135,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgilzjz",
   "message": "If you're at the beach and the water recedes suddenly, run and get to the highest ground you can find. A Tsunami is on the way",
   "created_utc": 1704501721,
   "score": 32,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgikhbd",
   "message": "Getting a second or even third opinion. You know yourself better than they do. If you don’t get answers please keep looking. Please don’t settle.",
   "created_utc": 1704501151,
   "score": 252,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjddw5",
   "message": "Removing the clip / magazine from a handgun doesn't make it safe. One bullet can still be in the chamber.",
   "created_utc": 1704512784,
   "score": 106,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjj44w",
   "message": "If you are on a sidewalk getting robbed/someone is fucking with you, go into the street. \n\nCars will just drive by usually even if they see someone in trouble. If you’re in the street, you have a very small risk of being run over, and a much higher likelihood of the attacker simply not following you into the street or someone actually going to help you.",
   "created_utc": 1704515433,
   "score": 225,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj6bef",
   "message": "CPR requires a flat surface! \n\nWhen Michael Jackson died, it was mentioned on the news that someone tries CPR with him on his bed. My mom said, \"You're just pushing the mattress up and down!\"",
   "created_utc": 1704509743,
   "score": 208,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjcl91",
   "message": "Bleach and ammonia should never be mixed, the fumes will kill you.  Check the ingredients in the cleaning solutions, so you know what it contains.",
   "created_utc": 1704512429,
   "score": 192,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjhjyc",
   "message": "As soon as your car door is unlocked, relock it. People get back into their cars and fiddle with their wallet or whatever all with their car doors unlocked and it makes them an easy target.",
   "created_utc": 1704514690,
   "score": 100,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj5h8b",
   "message": "Colon cancer screening starts at age 45",
   "created_utc": 1704509398,
   "score": 132,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjekpu",
   "message": "If someone is bleeding heavily, put pressure on it, don’t just watch",
   "created_utc": 1704513319,
   "score": 40,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjn1gm",
   "message": "Some random person knowing CPR saved my life a few months ago.",
   "created_utc": 1704517364,
   "score": 137,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgit4p1",
   "message": "Use the prongs of your carseat headrest to break the window if your car ever becomes submerged",
   "created_utc": 1704504468,
   "score": 81,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kginc8y",
   "message": "If you are traveling at high speeds in a car and the car(s) in front of you come to a sudden stop, you can always use the shoulder to slow down if need be (I know this might seem obvious but I didn’t realize it for quite some time). \n\nAlso, when getting out of the shower or tub, I think it’s always good to grab on to something. Once heard about a woman who died by cracking her head on the toilet after slipping when exiting the shower. \n\nStay safe y’all.",
   "created_utc": 1704502238,
   "score": 153,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj80qz",
   "message": "Know how many rows to the exit on an airplane. Know how to open the emergency exit, read the seat back pamphlet.",
   "created_utc": 1704510451,
   "score": 136,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj9sps",
   "message": "Swans can run faster than you can.",
   "created_utc": 1704511209,
   "score": 1,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjblrf",
   "message": "If you're in the hood and hear someone say, \"I got something for your ass. Wait, right here.\" DO NOT WAIT RIGHT THERE. Leave immediately",
   "created_utc": 1704511998,
   "score": 124,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjescd",
   "message": "The best way to survive a fight is to avoid one at all cost. Once your in to, survival matter more then morals",
   "created_utc": 1704513416,
   "score": 4,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgiw8cb",
   "message": "If you are genuinely choking, DO NOT drink something to try and get it down.",
   "created_utc": 1704505675,
   "score": 107,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjsiki",
   "message": "Those uncomfortable cancer tests when you get older, such as colonoscopies, aren’t some kind of conspiracy to humiliate you or drain insurance money. Cancer is real and it can get you, this message brought to you by my uncle who ignored lung cancer until it reached stage 4 and killed him within a week of discovery",
   "created_utc": 1704520238,
   "score": 122,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgijtgi",
   "message": "If you are getting chased by bees, don't try to get underwater to escape them. The bees will simply wait for you to emerge from the water.",
   "created_utc": 1704500906,
   "score": 29,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgie8yy",
   "message": "Wearing the seat belt in a car\n\nI was a passenger in a car that was moving at 55 miles per hour along a very winding road. The car swerved off the road and hit a tree. Wearing the seat belt saved my life.",
   "created_utc": 1704498797,
   "score": 242,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjj8wh",
   "message": "To use an EpiPen:  take off the cap. Then the blue safety cap on the white end (you press this end) Put the orange end down on the thigh of whoever is having the reaction (over the clothes, the needle is long) stick your thumb on the other side and push down HARD. Hold it for ten seconds, then release. The epinephrine kicks their heart into high gear, so they’ll shake, and flash between hot and cold. They need to go to the hospital for observation. Also, the expiration date is written on the side. They’re still safe to use if they’re a year old.",
   "created_utc": 1704515498,
   "score": 224,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgkagz9",
   "message": "If someone breaks into your house at night, don't switch on the lights. You know your house better than they do.",
   "created_utc": 1704532461,
   "score": 109,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjsm42",
   "message": "It's totally Okey to be rude when being pestered by a stranger. Looking at you fellow women. Better rude then dead.",
   "created_utc": 1704520292,
   "score": 50,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgj14km",
   "message": "Bridges freeze first",
   "created_utc": 1704507632,
   "score": 45,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgikoln",
   "message": "If a concert hall, venue or building has an emergency or fire, don’t go to the front. There are back doors, you have a better chance. I watch a lot of Mr. Ballen.",
   "created_utc": 1704501229,
   "score": 164,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgitwo3",
   "message": "How to do the Heimlich Maneuver. I saved my mom’s life.   Came here to say that, saw someone beat me to it but it’s worth repeating.",
   "created_utc": 1704504774,
   "score": 93,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjcq37",
   "message": "Never put you child’s name on thier backpack",
   "created_utc": 1704512489,
   "score": 30,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjcmb5",
   "message": "If you ever feel dizzy or tired after a short ride in your car,get your car checked,cause  there might be some exhaust leak leading into your cabin and might leak some harmful substances like CO",
   "created_utc": 1704512443,
   "score": 8,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgimns4",
   "message": "Be aware of your surroundings at all times, know where the exits are, etc, and remember in case of a shooting in a public or workplace, “run, can’t run, hide, can’t hide fight back”",
   "created_utc": 1704501979,
   "score": 62,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgje4yx",
   "message": "If you’re about to get hit by a car (as a pedestrian), best chance of surviving is to jump at the last moment. The impact itself isn’t typically what kills you, it’s getting crushed under the tires.",
   "created_utc": 1704513119,
   "score": 90,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjcbdn",
   "message": "Never pull out an object that is stuck in you. Like a knife, fork, branch, pole, fence post, etc. It might be keeping you from bleeding out.",
   "created_utc": 1704512308,
   "score": 91,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjnl63",
   "message": "Don't walk down stairs with your hands in your pockets",
   "created_utc": 1704517642,
   "score": 174,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgib8uu",
   "message": "Do not look down the barrel of a weapon to see where the \"boom\" noise comes from.",
   "created_utc": 1704497668,
   "score": 94,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgib67h",
   "message": "If you're ever stranded in the wilderness without food, just remember, mushrooms are like playing Russian Roulette with a salad. Same with water, try to filter it numerous times with a cloth or something clean.",
   "created_utc": 1704497639,
   "score": 233,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgieap1",
   "message": "Driving is not a race or \"game\" that you have to win. There are no prizes.",
   "created_utc": 1704498815,
   "score": 116,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjifgr",
   "message": "Know that what seems to be a pimple that won’t heal could be cancer - from MD Anderson - know the signs:\n\nSkin cancer symptoms may include:\n\nA new spot on the skin \nA changes in the size, shape or color of an existing spot.\nA spot that is itchy or painful\nA non-healing sore that bleeds or develops a crust\nA red- or skin-colored shiny bump on the top of the skin\nA red rough or scaly spot that you can feel\nA growth with a raised border and central crust or bleeding\nA wart-like growth\nA scar-like growth without a well-defined border",
   "created_utc": 1704515103,
   "score": 83,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjwl2n",
   "message": "Whenever you go somewhere new- auditorium, museum, concert, zoo… whatever- make note of the exits.  I teach my kids this in case of a “fire” or “earthquake” but truth is I’m American and what I’m really worried about is an active shooter situation.",
   "created_utc": 1704522652,
   "score": 86,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgjpx96",
   "message": "I live in Minnesota - If you drive out onto a frozen lake, first roll down your windows and unbuckle your seatbelt. If you fall through the ice, you’ll be able to swim out of the car through the open window. Electric doors or windows may not work underwater.",
   "created_utc": 1704518854,
   "score": 77,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgkby91",
   "message": "When the forest goes quiet you should too, there's a reason they're shutting the fuck up, a predator is nearby, could be a bear could be wolves, but you better gtfo",
   "created_utc": 1704533589,
   "score": 74,
   "submission_id": "18zl0tw"
  },
  {
   "comment_id": "kgn3rwm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18zl0tw"
  }
 ]
}