{
 "submission_id": "18zqzow",
 "title": "Girls who get hit in the cervix, what’s it like?",
 "selftext": "",
 "created_utc": 1704513989,
 "permalink": "/r/AskReddit/comments/18zqzow/girls_who_get_hit_in_the_cervix_whats_it_like/",
 "score": 46,
 "url": "https://www.reddit.com/r/AskReddit/comments/18zqzow/girls_who_get_hit_in_the_cervix_whats_it_like/",
 "comments": [
  {
   "comment_id": "kgjin53",
   "message": "Like if period cramps came in punches instead of waves.",
   "created_utc": 1704515204,
   "score": 107,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjhy6v",
   "message": "That shit fucking hurts",
   "created_utc": 1704514875,
   "score": 126,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk4nwo",
   "message": "Usually it hurts pretty darn bad, to the point that it feels like you're passing out. But here is the thing: Met a guy with \"the perfect size\". He bearly hit the cervix everytime he went deep. So the pain was very sublte. It was heaven.\n\nOr I have issues, don't know. Lol.",
   "created_utc": 1704528139,
   "score": 68,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjilha",
   "message": "I felt like passing out. wanted to throw up. my whole body started shaking, got shivers.",
   "created_utc": 1704515182,
   "score": 3,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjl8ac",
   "message": "A girl I met back on Myspace told me once that she wanted my dick to hit her pelvis. Pretty sure she meant the cervix. It weirded me out.",
   "created_utc": 1704516463,
   "score": 117,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk9xwe",
   "message": "I played against a guy in Rocket League last night and his name was Cervixsmasher69.",
   "created_utc": 1704532059,
   "score": 220,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk6q1s",
   "message": "Pain, lots of pain. And i felt winded",
   "created_utc": 1704529650,
   "score": 81,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk6xkm",
   "message": "Depends on if I’m ovulating.",
   "created_utc": 1704529806,
   "score": 241,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk3yu1",
   "message": "Depends. We talkin during sex or like an IUD insertion? \n\nIf turned on properly, a woman’s cervix actually lowers a bit and relaxes slightly during sex; depending on the position it can feel great, or as others have said it can kinda hurt lol. Usually feels good to me tho, unless I haven’t done it in a while. \n\nI would rather slit my eyeballs with a butter knife than go through another IUD insertion, but I’ll do it cuz I don’t want kids lol. That shit made me cry and I’ve already done it twice.",
   "created_utc": 1704527631,
   "score": 5,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk6x0m",
   "message": "Painful and nauseating. It makes me immediately end the fun times because that's how fast it stops being fun. Donuts (the sex toy, not the food) help with this though. \n\n\n(fun fact, labour pains come from the cervix)",
   "created_utc": 1704529795,
   "score": 2,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkbke7",
   "message": "I got a bruised cervix from rough activities. I had to go to the doctor because I couldn't sit down comfortably. It hurt bad, and deep, for a long time. 0/10 would not recommend.",
   "created_utc": 1704533296,
   "score": 52,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk90v2",
   "message": "Oh my god it hurts so bad. I can’t believe some people like it lmao there was nothing good about it to me",
   "created_utc": 1704531366,
   "score": 178,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjj44n",
   "message": "Ah the Ol' Punnani Jab.",
   "created_utc": 1704515433,
   "score": 81,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkctcv",
   "message": "I had a girlfriend some years ago who liked that, and told me to go as deep as I can.\n\nThing she didn't told me before hand, is that she would have a seizure while have an orgasm.\n\nMe panicking a lot, her, retrieving her senses: \"oh, I should have told you, that pretty normal for me\"\n\nLesson learned that day: ask your partner about stuff like that, and communicate",
   "created_utc": 1704534247,
   "score": 54,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjxf17",
   "message": "It hurts. It's like period cramps",
   "created_utc": 1704523174,
   "score": 142,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjyngn",
   "message": "Some girls like it some girls don't, I had one partner who loved it and was her favorite way of getting off.",
   "created_utc": 1704523972,
   "score": 85,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk8wc4",
   "message": "For me it’s the after that really sucks. The mild pain after results in bloating. A really sensitive soft organ just got sucker punched, so it’s not comfy for like a day or two, and because of where it’s at, it results in bloating like you can experience on a period. Not fun.",
   "created_utc": 1704531272,
   "score": 48,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjqikd",
   "message": "Like the feeling of pushing a q-tip too deep and hitting your ear drum but on steroids.\n\nSpeaking on behalf of my wife who I've unfortunately done that to by accident a few times.",
   "created_utc": 1704519163,
   "score": 26,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgki0q6",
   "message": "I'd rather choose a fat medium size d than a long d.",
   "created_utc": 1704538179,
   "score": 22,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjya5g",
   "message": " It hurts sometimes but also mind numbing good other times",
   "created_utc": 1704523737,
   "score": 111,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk4r5a",
   "message": "Painful, it happens most times I’m in doggy depending on how soft my tissue is.",
   "created_utc": 1704528204,
   "score": 18,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkl631",
   "message": "\"you're crushing my cervix\"\n\n\"oh, I'm sorry. do we need to change positions?\"\n\n\"no, no, in a good way\"\n\n\n\nas a man, that's the only time I've specifically been told.\n\nhowever\n..\nI will always thank her for her cervix 🫡",
   "created_utc": 1704540491,
   "score": 76,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk701q",
   "message": "Lots and lots of pressure and force. Like being whacked in the diaphragm upwards through the abdomen. Can be pleasant depending on your depth, partner size, time of cycle, and position, but if you do it wrong it simultaneously hurts like a mofo and feels like you're gonna barf.",
   "created_utc": 1704529858,
   "score": 11,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjjlu8",
   "message": "Nauseating",
   "created_utc": 1704515672,
   "score": 32,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjxf5t",
   "message": "Just seeing this made me remember the pain",
   "created_utc": 1704523177,
   "score": 28,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjm3eq",
   "message": "Like a punch deep inside your vagina. If they keep going, that’s over and over and over. Sometimes it feels good 😩 other times it hurts like fucking hell. I guess it depends on how hard you’re being fucked.\n\nGot fucked like a dog days ago. Still recovering. Not complaining since I begged for it raw and he delivered. He really laid that shit on me, fucked the craziness right out of me. Took it cuz momma ain’t raise no bitch.\n\nSize don’t matter and it never will to me. It’s how you use it and the connection you have with the person. Communication is key*\n\nEdit: I’m a whole 21 year old woman. My name literally says “lover girl”. Yall sound dumb saying this was written by a man. 💀\nSorry not sorry for the sentence that was disturbing.",
   "created_utc": 1704516889,
   "score": 134,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk4huz",
   "message": "YEOOOWCHHH!!!!",
   "created_utc": 1704528016,
   "score": 9,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjvgeq",
   "message": "Bro just ask my gf since I have such an ENORMOUS WANG-O-LANG. I been beatin that box like Tyson in the 80s brother.",
   "created_utc": 1704521956,
   "score": 122,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgjuzox",
   "message": "Hurts so good lol",
   "created_utc": 1704521675,
   "score": 60,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk833c",
   "message": "One of my previous exes had a shallow vagina, so if we were in certain angles of doggy I would hit. Depending on how \"into it at the moment\" she was she would like it. Other times, she would nope out and she would obviously request a different position. She said it's like bottoming out inside her stomach (to a guy). But obviously was more painful cause it's a squishy but firm muscle.",
   "created_utc": 1704530665,
   "score": 8,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk8irj",
   "message": "I went to my bathroom right afterwards, locked myself in, sat on the floor and just stared at the wall while trying not to cry 🥲",
   "created_utc": 1704530991,
   "score": 15,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkinvn",
   "message": "I actually dated a guy that would gently rub my cervix when he fingered me. He said it ALWAYS pushed me over the edge if I was close to orgasm. Thank you Scott!",
   "created_utc": 1704538654,
   "score": 7,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkiq2m",
   "message": "Smut writers made me believe it's some dope shit, some orgasmic feeling but my views have significantly changed after going through the comments.",
   "created_utc": 1704538698,
   "score": 7,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkvg0b",
   "message": "\"Guys who get kicked in the balls, what's it like?\"",
   "created_utc": 1704546987,
   "score": 7,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk6udx",
   "message": "Feels like cramps. Sucks when you get a pap smear and the doc scrubs it. Just thinking about it makes mr feel cramps.",
   "created_utc": 1704529741,
   "score": 13,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk8qaw",
   "message": "a really deep, nauseating pain",
   "created_utc": 1704531146,
   "score": 11,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk7gwj",
   "message": "It fucking hurts",
   "created_utc": 1704530202,
   "score": 6,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk76pk",
   "message": "I'm told there's a spot which can be *gently* stimulated in that region for a g-spot type of effect, but it's difficult to reach, and towards the front (stomach side) edge of the cervix and not the center, so most people don't know about it 'cause it takes something somewhat thin and curved to get to it without just painfully pressing on the cervix itself.\n\nThis is from a Wikipedia rabbit hole a few years back; I'll see if I can find the article again.\n\nEdit: possibly the anterior fornix? \"A-spot\" sounds familiar, but I thought there was something about it being difficult to stimulate. Dunno.",
   "created_utc": 1704529997,
   "score": 20,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk4adj",
   "message": "It hurts very much and is usually unexpected and rather shocking. Kinda like getting sucker punched, but in the vag. Ow.",
   "created_utc": 1704527864,
   "score": 12,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgk8f7p",
   "message": "My ex wife had this problem, I had to be careful not to go too deep. After a few years tho she started to like it, so I don’t know if that tells you anything..",
   "created_utc": 1704530918,
   "score": 15,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkduih",
   "message": "I actually love it",
   "created_utc": 1704535032,
   "score": 5,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkgnt6",
   "message": "Don’t make it an aim please! It’s not the nicest feeling",
   "created_utc": 1704537164,
   "score": 5,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgkfkfr",
   "message": "It can feel really good in a pain is awesome type way but it can also be horrendous if the angle is wrong. Husband once threw me up in the air and slammed me back down onto him and that had me doubled over unable to speak and considering going to the ER hahahaha. But usually I enjoy it.",
   "created_utc": 1704536340,
   "score": 3,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kgl1ddg",
   "message": "It gets sore after a while of going at it but it’s not super bad 👀",
   "created_utc": 1704549993,
   "score": 4,
   "submission_id": "18zqzow"
  },
  {
   "comment_id": "kglbepf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18zqzow"
  }
 ]
}