{
 "submission_id": "1900kcg",
 "title": "Redditors, what's the most unexpectedly romantic or sensual experience you've had that still makes you smile when you think about it?",
 "selftext": "",
 "created_utc": 1704549587,
 "permalink": "/r/AskReddit/comments/1900kcg/redditors_whats_the_most_unexpectedly_romantic_or/",
 "score": 190,
 "url": "https://www.reddit.com/r/AskReddit/comments/1900kcg/redditors_whats_the_most_unexpectedly_romantic_or/",
 "comments": [
  {
   "comment_id": "kgm53uo",
   "message": "When I was a senior in highschool I got in a bad car accident. I got pretty severe chemical burns on my face from the airbag and my contacts came out and sliced my cornea. I had to wear sunglasses so I was just wandering around basically blind because I have very poor vision. My boyfriend was so gentle and caring during that time. We were supposed to go on an overnight school trip and he talked my mom into letting me go and stuck by my side the whole time so I could still participate. \n\nWhat particularly stands out to me is that while my classmates were having a water balloon fight I was sitting on the porch of our cabin to avoid the mayhem because I wasn't allowed to get my face wet. He came and sat down next to me and I told him, \"I really don't mind it all, I just wish I could read my book. I was at the good part.\" I even brought the book with me hoping I could get it close enough and squint but it didn't work.\n\nSo he went into my cabin got my book and read it to me for at least an hour. It's been 16 years but I can still remember it clearly in my mind. Us in rocking chairs on the porch, with the sound of his voice until it got too dark.\n\nWe didn't work out but he was a good person and I hope he's happy.",
   "created_utc": 1704565454,
   "score": 165,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgl5z7q",
   "message": "Back in college I was staying on campus for winter break and the last day of work I found a girl who was in the same boat.  Long story short we spent Christmas Eve through New Years day together.   We talked, watched movies, made cookies, and fell in love.  It was just supposed to be us watching Christmas movies and eating pizza.  She was killed by a drunk driver about a year later.",
   "created_utc": 1704552141,
   "score": 151,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglla7m",
   "message": "When my boyfriend worked at his previous job, he would leave the house early when I’d still be asleep. Every morning before he left, he would kiss me on the forehead. That’s how I woke up pretty much every morning. That has always stayed with me.\n\nNow with his new job, he works from home. So I leave for work when he’s still in bed. I make sure I ALWAYS kiss that man’s forehead. No matter what.",
   "created_utc": 1704558315,
   "score": 95,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglnlv5",
   "message": "Helped my international Vietnamese friend from college get groceries and drove her home. Brought her bags down to her rented basement room and she kissed me in the doorway before pulling me inside the room\n\nI don't think I'll ever experience passion like that again tbh, we had an unfortunate falling out but I still think of her often, great person and great sex",
   "created_utc": 1704559176,
   "score": 110,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgll94y",
   "message": "I went on a two week camping trip to Spain and France with my boyfriend at the time. We drove from campsite to campsite with a guide book to direct us and ended up in a nice little site outside Bordeaux. We'd had a lot of busy days so decided to spend one evening hanging out at rhe campsite.\n\nThat evening the social activities gradually petered out and the sun went down. The bartender started quietly cleaning up at the outside bar and put on music while he did so - an acoustic album of 10,000 Maniacs songs in fact. It was a warm evening and the bar faced onto a now totally empty area of decking with hundreds of tiny coloured lanterns strung up as decoration. As no one was using it, my boyfriend invited me over to the decking and we danced to the music all alone. I remember the little lights swirling in my vision as he spun me around. It was the best part of the whole holiday.\n\nWe are married of course!",
   "created_utc": 1704558305,
   "score": 63,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglwilp",
   "message": "I remember many years ago, as a teenage,  walking downtownb with my fairly new GF and she spontaneously put her arm through my arm to walk arm in arm...heart started pounding",
   "created_utc": 1704562411,
   "score": 183,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm8l8z",
   "message": "There was this guy in a friend group I had just been accepted into I had huge crush on and he invited me over for what I thought was a netflix and chill situation. But when I came in he had set up a whole blanket fort in his living room and told me we could put on whatever I wanted to watch. I called his bluff and chose “Particle fever” a very good, but also very nerdy documentary about the first experiments performed with the large hadron collider. He was more of a meat head type guy, but he was totally into it. \n\nBut the big romantic thing was when I said I was hungry and he told me go into the kitchen and see what he had that I might want to eat. When I opened the freezer he had an enormous box of mozzarella sticks, which was one of my favorite snacks. It was something I’d mentioned in passing in group settings but I was shocked he had picked up on it and stocked some just for me. I’ve never been so charmed in my life and it was such a simple gesture but showed that he really listened to me and that was incredibly romantic. \n\nAnyway, he’s my husband and we still make blanket forts and eat mozzarella sticks but now our two kids steal most of them.\n\nEdit: a word",
   "created_utc": 1704566693,
   "score": 187,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglhljq",
   "message": "When I lived with my ex I would sometimes pretend to still be asleep when he would leave for work in the morning hoping I’d fall back asleep before my shift and I remember him kissing me on the head one morning. That’s always kinda stayed on my mind it was one of the most pure moments and to this day still makes me smile to think about .",
   "created_utc": 1704556922,
   "score": 218,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglyw8w",
   "message": "Dated a guy who was a bit of a bad boy. Told him I loved stargazing but because I'd been living in a city, I'd barely seen any stars in years. On a date, he drove me (in a ute) out of town to a very secluded area. We got out and lay on a mattress in the back and talked and kissed for hours under the stars. To date, I've not seen so many as I did that night; it was truly awe inspiring. Same guy would bring me hand picked flowers. I don't miss him per se but I miss being romanced the way he did me.",
   "created_utc": 1704563251,
   "score": 72,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm0w4u",
   "message": "There was this girl I was crushing on for well over a year. She worked at a store I frequent a couple times a week. I made it a point to chat her up every time I went in there, but tried not to be that creepy dude \"flirting\" with her with suggestive talk. I kept the conversations non-suggestive and friendly. When my father died, I guess she heard from someone else about it. The next time I came in the store, she kinda acted a little different towards me and consoled me and all that jazz. It felt like she was firing some signals towards me. I had lost over 100lbs in the past year so I was feeling a little confident at that moment and shot my shot. It was a success. We had our first date not too long later. \n\nA couple dates later, things got a little more serious. I woke up one night next to her and had to go to the bathroom. I got back into the bed and was resuming my big spoon position when I heard her chuckling. I thought she farted or something. When I asked her what she was laughing about, she said I was trying to hump her in my sleep. That wasn't really the case. I just do this thing when I'm hugged up with someone and sleeping, I try to keep inching closer or pulling the other person closer to me. I guess I was doing this and she thought I was dry humping her in my sleep. We both ended up laughing hysterically at like 4:30am. It's just a moment that has stuck in my head ever since. I laugh every time I think about it. \n\nShe ended up moving halfway across the country for her job. It sucked so bad. But every time I think of her, I think of that moment and laugh.",
   "created_utc": 1704563953,
   "score": 116,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm59n5",
   "message": "I used to go to my ex-girlfriend's apartment and stay over for the weekend. I swear, lying next to her those nights and waking up next to her during the mornings were always so beautiful and serene. Seriously, it just seemed like the mornings were a bit brighter and it would always be awesome and adorable when her cat came up to the bed to enjoy some petting and rubs from the both of us as well.\n\nThere isn't a specific instance, but every time I would wake up and use the restroom in the middle of the night, I would come back to bed, especially on the cold nights, shiver a bit, give her a quick squeeze hug, and then a kiss somewhere around her face. If it was morning and I was sort of getting up, I would just put my head on my hand, look at her, and just watch her be so at peace before peppering her with more little kisses. I really think about those Saturday mornings a lot. It's... Comforting and homey.\n\nI miss her dearly and more than anyone could know, but life unfortunately happens and... Yeah. It's just unnecessarily hard on people, sadly. If you guys have someone you truly love and feel safe with, do me a favor: Admire and adore them. You never know what might happen or what might tear you away from each other - enjoy that happiness.\n\nEdit: \"car\" to \"cat\", heh.",
   "created_utc": 1704565510,
   "score": 124,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgl1bfo",
   "message": "A girl and I had a late night impromptu date. She invited me to visit. She made a chocolate pie. Earlier that day.  We sat under the dim island light. And ate a piece.  A short but very lovely date. I consider it one of the best dates I've ever had",
   "created_utc": 1704549967,
   "score": 166,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm67j2",
   "message": "Met this guy through my flatmates. He was very friendly and good looking, we got on really well. Went out one day with our friends, it was super cold so we went back to the flat I lived in with our friends. Another flatmate had people over In the living room so we just sat in my bed. Slept the whole night and in the morning we ended up doing the deed. \n\nAfter I thought, ah well he’ll dip now and leave. So I got in the shower to give him his out and I nearly jumped through the roof when he came to join me. It was the most sensual and romantic non sexual experience of my life. I still laugh thinking about how shocked I was when he came in. \n\n4 years later, we live together, got 2 cats and are planning the rest of our lives together.",
   "created_utc": 1704565845,
   "score": 103,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglvyzn",
   "message": "There was a point in my life where me and this girl I was incredibly attracted to were sorta dealing and going out a lot together with friends and just having good times out. Nothing was ever sexual between us or like a date but regardless I was always excited and very nervous when we'd go out because I wanted her to like me and I didn't wanna screw any chance I may have up. \n\nAnyway, one time we're out at a friend's drinking and we're all in a circle basically. Everyone is talking, someone says something, others join in yadda yadda. At a point, I go to say something then someone else starts up talking and I see everyone else is more focused and joining in on what they said. No biggie, it happens, so I go to stop talking and I look beside me and the girl I was interested in was still paying full attention to me. Like what was going on in the rest of the group never happened and I was the only one there and... I've been chasing that feeling for a long time. Nothing ever happened between us; my advances for something more were politely turned down and we fell out of contact later on. \n\nI'm ashamed to say, I'm in a relationship now but I still haven't had that sort of indescribable feeling I had since, even in the new one. Life is odd",
   "created_utc": 1704562215,
   "score": 152,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm3ymm",
   "message": "I went through a really bad depressive episode around Christmas time of 2022, and with that came insomnia stemming from racing thoughts and unstoppable night crying. It was honestly very scary. I’d leave the bed I shared with my fiancé to go and sit in the living room because I didn’t want to disturb him - partially because I didn’t want to disturb his sleep when he had work in the morning, partially because I didn’t want to burden him with my constant crying. \n\nOne morning, I woke up to my duvet being tucked into my sides. My fiancé was tucking me back into bed before he went off to work, kissed my head and told me to get some more sleep before he left for work. When he came back from work that night and I asked him more about it, he said he knew I was probably up most of the night and wanted to make sure I was cosy. He also wanted me to know that, even though I might not want to/be able to talk about what I feel in the moment, he still cares and wants to make sure I’m safe and loved, and he’ll always be around to make sure of that. He said he’d been doing it for a while and that he didn’t mean to wake me up. \n\nHe’s the kindest man I’ve ever known and I have no idea what I did to deserve him.",
   "created_utc": 1704565049,
   "score": 89,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgle4dd",
   "message": "I went on a date with a guy a while back, and things seemed to be going alright. We walked around a bookstore, went to Target, got food. The only problem was that he seemed disinterested in me. He was only talking about his own interests and didn’t ask me anything about myself, didn’t give me compliments, didn’t flirt with me like I was with him. \n\nAfter the date we were texting for a while and I brought it up. He revealed that he was actually quite nervous and flustered while around me, to such an extent that he could only focus on talking about things he was knowledgeable about in order to keep his composure. He apologized and wanted to make it up to me, and asked if we could meet up again sometime. I asked him if he would like to meet later that day, and he said yes. \n\nSecond date, same day, things are going much better. He is attentive to me and my words, asks questions, compliments me, and even holds my hand at some point. By the end we are laughing, still holding hands, and poking fun at each other. Me telling him he’s a girly guy for liking sailor moon and stuffed animals, and him telling me my interests are that of an old lady (journaling, reading and annotating, scrapbooking). \n\nOne thing that stood out to me was the way he would squeeze my hand twice in a row to tell me he needs to let go in order to do something with that hand. \n\nAnyway, he’s my boyfriend now. We’re cuddling right this moment, he claims I’m joining his cuddle sesh with his stuffed animals.",
   "created_utc": 1704555563,
   "score": 106,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm16ry",
   "message": "Not romantic-ish but meeting my husband. It just felt right. We went on our 1st date and we had dinner, went to see the newer Pet Cemetery (we made fun of it throughout the whole thing and he was getting pretty handsy) and then had ice cream where we kissed. \n\nOur second date we took a picture and I looked at it later and he looked so content. I remember going to my job and I couldn’t stop smiling and my co workers noticed and they all said “oh girl, your in love)\n\nIt took us 3 days to fall in love and we went away and told each others That we legit love each other, naked on the hotel room floor\n\nJust makes me smile. When people say you just know, ya you will just know this was the one",
   "created_utc": 1704564058,
   "score": 152,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgltffm",
   "message": "Oh my god, my first kiss! On vacation with two families around middle school and I snuck out to meet up with a cutie who was hitting on me by the pool. We went off to the hot tub and he said I was like a little teddy bear and he wanted to take me with him everywhere in his pocket.  He kissed me and then just held me for a bit.  Soon thereafter, I heard my name being called out in my father's voice from a hotel balcony.  Fun ended there, but it still makes me smile.  Thanks Dave.",
   "created_utc": 1704561298,
   "score": 203,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgl9kmt",
   "message": "My very first girlfriend played the violin.  We hadn't been dating long and she tells me all the Orchestra kids have to do individual recitals for a grade, and could I drive her to hers because her parents were traveling. Well, of course I would. \n\nI met her at her place, and she is getting dressed...\n\nBlack taffeta formal gown that contrasted stunningly against her pale skin.  Her hair up, but one stubborn lock of hair hanging freely at her temple in a curl.  An elegant embroidered black choker with a alabaster figurine at the center that made me realize how graceful her neck was.\n\nHer neck?! Was I really getting hot and bothered staring at her neck of all things?  Yes... yes I was. \n\nShe looked like a goddess, and it took all my willpower not to rip that dress clean off her right there and then.\n\nSo off we go to the recital and she is up on our high school auditorium stage and starts playing.  I knew she was state-ranked in orchestra, but I had never heard her actually play till that moment.\n\nMy god she played beautifully, and with passion, and looking at her up there on the stage I realized I was *madly* in love with her.\n\nRecital ended and we drove back to her house so she could change out into regular clothes.  She asked me to help her take off her choker.  It took supreme effort to keep my hands steady as they came up around that graceful Audrey Hepburn neck of hers.  I undid the choker and I let it fall down the front of her dress as my hands slid down her neck to her shoulders and that's all of the story you are gonna get because we were 16.",
   "created_utc": 1704553698,
   "score": 154,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgln0vc",
   "message": "Nice try robotic YouTube channels.",
   "created_utc": 1704558959,
   "score": 181,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmdvpr",
   "message": "On a first date from bumble. We went to a hiking spot with no one around. (Bad idea. I know) but we danced under the moon. It was cold but amazing. \n\n\nTurned out to be a psychopath and slit his arm open not a few days later because I had online guy friends.",
   "created_utc": 1704568587,
   "score": 55,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm5lig",
   "message": "First date with this boy was going really well. We were just walking around the downtown area of my home town, each of us looking for an excuse to keep the date going. \n\nIt was cold out though and while we kept ducking into shops to look at things we always ended up back out on the cold street. I had some gloves that I eventually put on to keep my fingers from freezing.\n\nCasually he reached over and held my hand, smiled and said it was because his hand was cold. I knew at that moment he was the one for me. \n\nHe’s my husband now :)",
   "created_utc": 1704565627,
   "score": 102,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglk2dc",
   "message": "I’m usually the one who cooks for me and my partner, but one morning after I couldn’t sleep due to my insomnia, she came an brought me some fried eggs to eat in bed. It meant so much to me.",
   "created_utc": 1704557863,
   "score": 244,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglxrzg",
   "message": "My husband often leaves for work around 4:30am, when I'm still sleeping, but he'll wake me up to kiss me goodbye. Sometimes my comforter has fallen off the bed during the night, so he'll pick it up and tuck me back into bed 🥰😭",
   "created_utc": 1704562854,
   "score": 44,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm46gs",
   "message": "There was a girl from Belarus who was here on a summer work visa for tourism workers.  She was a hostess at the restaurant I was waiting table at. She didn’t really speak English well but one night as we were closing down she said to me “when you tell your tables you will take care of them I wonder when you are going to take care of me at night….” \n\nIt was a great night and few weeks until she went home and I never heard from her",
   "created_utc": 1704565126,
   "score": 46,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm3rx4",
   "message": "Oh I got this.\n\nSo when my(m17) gf(18) started dating, we were like honeymoon for a looong time. But in her philosophy class, she had that one project about aestehitcs. Her task was to write a diary about things she finds beautfiul or stunning. \n\nShe is pretty ambitious so she wrote like 10 Chapters, each about 2 sites long. One evening I saw her sitting in front of it and asked if I could read it. She said yes and so I began to read. The first chapters were alot about her dreams and how she realises the nature around her. I was pretty damn impressed about the way she wrote, because I thought it could be a roman. \n\nAnother day, she told me she wrote a chapter about me. I was flattered and again asked if I could read it and so did I.\n\nThe title was:\" My boyfriend is the most beautiful and I am gonna proof it.\"\nThe whole chapter was about how she sees me and what she loves about me. She wrote about the many liver spots I have and how they are like paintings on a wall. She wrote that she finds it so cute that my eyes, most of the time, only halfway open and only open fully when Im really happy or really suprised. She mentioned so little things, I thought no one ever realises and was absolutely convinced this is the girl im gonna mary.\n\nsorry for my english xd",
   "created_utc": 1704564982,
   "score": 88,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm4ixj",
   "message": "I love when the lilacs bloom in spring - we have a few bushes by the front porch. It's my favorite time of year. My ex left for work before I did (and came home later) and one morning I walked out to find a bunch shoved in my driver's door handle. Sometimes he'd walk in and put a sprig behind my ear. Made me feel so special!",
   "created_utc": 1704565248,
   "score": 42,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglfyag",
   "message": "Me and my ex happened to stumble upon each other in public, we were still friends but both of us had already started crushing. We saw each other, both of us smiled and when we finally approached one another, I hugged her. I spun her around a bit and ran a hand through her hair, she blushed and asked me out on a date at that very second.",
   "created_utc": 1704556286,
   "score": 168,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm01a8",
   "message": "Went to a Muse concert a few months ago with my wife. It's a rock concert so we're pretty much jumping throughout the concert. Then they start playing Madness and I just hugged her from behind and started to kinda slow-dance to it and it was unexpectedly romantic and sooo good i feel like i was in heaven.\n\nThank you Muse \u0026lt;3",
   "created_utc": 1704563652,
   "score": 70,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglldot",
   "message": "On the 2nd date with my now bf, we went to his place. This was during covid as well, so I technically wasn't supposed to go but whatever. \n\nIt was an indoor dinner and a movie date. I got to his place around 12, and we were going to make pizza together! Along with any other small snacks.\n\nWhile making the dough, we were talking, joking, laughing. He kept making puns and I kept asking for no more 😅. We prepped some sauce and got our toppings together. We also made mozzarella sticks together. We prepped the pizza, cooked it, and watched Emperors New Groove.\n\nWe snuggled, laughed, talked, flirted. After the movie he kissed me. I kissed him back. Next thing I knew he lifted me right off the couch and took me to his bed where we made love.. more than once.\n\nBeen together for 2.5 years :)",
   "created_utc": 1704558351,
   "score": 194,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgluvq1",
   "message": "When I was in 8th grade I got in trouble in class and was sent to sit out in the hall. A girl that a lot of guys including myself liked walked by. Then she came back and sat down next to me. Then out of nowhere she grabs my arm and puts it her shoulders placing my hand right on her boob lol. She then leaned her head on mine, grabbed my face, and started making out with me. When she was done she just stood up and walked away smiling. I didn't say anything because I was in complete shock.\n\nI still think about that moment all the time. Sad thing is, it didn't lead anywhere. She move after that school year and I never saw her again.",
   "created_utc": 1704561822,
   "score": 105,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm1wyt",
   "message": "A few months ago I’d just gone back to an old workplace. There is an absolutely gorgeous woman who works there now. We’re checking each other out and chatting a bit on shift. After work we get to chatting properly. Over the next few days we’re hanging out after work almost every day. We had one really cute wine/cheeseboard/card games date night and she stayed over for the night. We got along so well, clicked on a deep level and had lots of fun in each other’s company. It felt like we could have had something really special.\nA couple of days later she left the country for 2 months, and a week after she got back I left the country… (I’m currently halfway through a 2 month trip).\nIt’s the fastest I’ve ever fallen for someone. I still think about her a lot. But we don’t message, our relationship was only ever in person and it feels like there’s a bit of a wall there. Who knows how she’s feeling or what she’s going through, a lot can happen and change in 4 months. But regardless I’m happy I got the opportunity to get to know her and fall for her, even though it was short lived it was beautiful.",
   "created_utc": 1704564318,
   "score": 29,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm3v85",
   "message": "I have been getting sick every year winter hits for the last two years. Last year was COVID mixed with pneumonia, this year was COVID mixed with bronchitis. Both times I'm pathetic, unaware and just trying to survive. I mentioned once in a fever dream how much I wanted a home made chicken noodle soup (I'm allergic to garlic and guess what every canned soup has). I woke up one morning smelling chicken broth and went back to sleep not thinking anything about it until that night when he woke me up with fresh chicken noodle soup, lots of noodles and lots of steamed carrots. Oh my goooooddss if I hadn't been sick I'd have been ALL OVER him! He does more than just these gestures but this one struck me because of how pathetically sick I've been.",
   "created_utc": 1704565014,
   "score": 25,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm7z7x",
   "message": "My fiancé brings me coffee in bed every morning. She knows when my alarm is set and she is up before me so she makes it ready for then. I wake up and it’s perfect drinking temperature. This makes me feel loved as fuck. (I’m a man so these things are huge bonuses in life)",
   "created_utc": 1704566476,
   "score": 28,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgme8fe",
   "message": "Years ago, when I was backpacking across Western Europe, I was just outside Barcelona, hiking in the foothills of Mount Tibidabo. I was at the end of this path, and I came to a clearing, and there was a lake, very secluded, and there were tall trees all around. It was dead silent. Gorgeous. And across the lake I saw, a beautiful woman, bathing herself. but she was crying...\n\nI hesitated, watching, struck by her beauty. And also by how her presence; the delicate curve of her back, the dark sweep of her hair, the graceful length of her limbs, even her tears, added to the majesty of my surroundings. I felt my own tears burning behind my eyes, not in sympathy, but in appreciation of such a perfect moment.\n\nShe spied me before I could compose myself. But she didn't cry out. Instead our eyes held and she smiled, enigmatically, fresh tears still spilling down her cheeks. I was frozen. I knew nothing about this woman, and yet, as we stood on opposite sides of a pool of water, thousands of miles from my own home and everyone I had ever known, I felt the most intense connection. Not just to her, but to the earth, the sky, the water between us. And also to the entirety of mankind. As if she symbolized thousands of years of the human condition.\n\nI wanted to go to her, to comfort her, to probe this feeling of belonging I had never encountered before. But I couldn't. Because I knew that if I spoke, if she spoke, that moment would be ruined. And I knew I would need the memory of that moment to carry me through the inevitable dark patches throughout my life.\n\nAnd so I watched her lower her hand, turn, and slowly walk to the shore opposite me. The rest of her perfect form was gradually revealed to me, and I held my breath as I watched her disappear behind a copse of trees near the water.\n\nI didn't follow her, in fact I turned around. I knew there was nothing else we could experience together that would be more perfect than that moment...and it still remains the most profound experience of my life",
   "created_utc": 1704568711,
   "score": 20,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmitli",
   "message": "A girl in college was leaving a party one night. I was walking home from my work shift on campus and passed by her Uber ride. Her and her friend were sitting in the car trying to leave while a drunk guy was holding the door open trying to get in the car with them. They were telling him no. The driver started yelling at him and the girls managed to get the door shut. The drunk guy freaked out and punched the car window, cracking it. The girls started panicking and the Uber driver called the cops. Drunk guy runs away.\n\nI calmly went back to the car and asked the girls if they were okay. They said they are fine and not hurt. I opened the door on the other side for them to let them out while the driver is assessing damages and looking for the drunk guy. I talk to the girls and tell them I will call them a new ride and they can chill in my apartment down the street while they wait. The new ride arrived and I escorted the girls to the car. \n\nBefore they left, one of them turned and asked for my phone number. She was WAY out of my league and was absolutely gorgeous. I gave it to her and told her to let me know they got home safe. She kissed me on the cheek and gave me a big hug. Fast forward about a month later, I see her out at the bars near campus. She walks straight up to me and says “Hey thank you again so much, I won’t ever forget what you did for us that night”. We chatted for a bit and next thing I know we’re heading back to my place to hookup. \n\nChivalry pays off guys. Be a good person.",
   "created_utc": 1704570351,
   "score": 24,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm6dzr",
   "message": "When I was about 35, I spent a month in Paris and took an intense French language class. At the end of the class I was fried, and really looking forward to speaking English for a bit so I took an ‘international’ meetup group bus trip from Paris to Étretat to see the cliffs on the north coast.\n\nThe trip was billed as English speaking, as it would be a mix of nationalities. Wouldn’t you know it, a cute woman invited me to sit beside her… and she only spoke French. And over the course of the 12 hour trip we told stories, laughed, held hands, got lost in a couple cafés and on the cliffs, kissed, and she slept with her head on my shoulder on the way back. It was really romantic and sweet.\n\nParting in the metro, we traded phone numbers and a couple last kisses as she told me to call her, which I did.",
   "created_utc": 1704565910,
   "score": 21,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglpenj",
   "message": "My wife cuts my hair and it's just wonderful",
   "created_utc": 1704559833,
   "score": 41,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm6c86",
   "message": "We’ve been laying down on the bed after our first time. I felt incredibly happy, I was literally in tears, to be around him, smelling him, touching his skin with all my body, I wanted it for so long and now it’s real oh my god. \n\nThe same minute someone started to play saxophone on the street. Probably it wasn’t the best performance ever, but the moment couldn’t match any cheesier, just like in a stupid melodramatic movie 😀 \n\n\nWe both snorted, and he said “no, no, it wasn’t me paying to the busker”, so I laughed out. \n\n\nAfter a few years passed, I recalled this in a conversation, but he said that he couldn’t remember the moment I described. So tbh I’m not sure if it was real, or just my romantic imagination draws fake memories up. I’m epileptic, so this actually may happen. Every seizure affects cognitive function and the brain cells unavoidably die. But I swear I remember this like it was yesterday.",
   "created_utc": 1704565893,
   "score": 17,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglxo6h",
   "message": "I met this really cute girl at the gym. initially, she really just wanted to ask me about weight training because I’m really fit. I try to keep it respectful, and I never made a move. This went on for a few months, and I would only see her sporadically here and there for a little bit. Eventually, she started catching my attention because of her cute personality and I asked her phone number. We texted here and there very frequent but eventually I found out she loves to get high and we hung out after the gym in her car in my car a couple times getting some food like a drive-through or just talking. I an in my exploratory phase right now, where I am doing substances, very safely, but exploring nonetheless. anyways, somehow without really knowing each other, we agreed that we should get away, get a really nice Airbnb, and do Molly. I didn’t really believe that she would go because I was this mysterious man. She kept saying that I was scary and busy and that she couldn’t figure me out. Anyway, the day came we went. She dressed very sexy. I was very surprised we did it, and I had one of the most fun, playful, delightful nights of my life, and we’re about to go to hot yoga tomorrow.",
   "created_utc": 1704562816,
   "score": 50,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm1cdh",
   "message": "In rehab over Christmas a long long time ago, touching each other was not allowed but on Christmas Eve in front of the fire I ended up giving this lad a foot and lower leg massage without getting caught.\n\nIt was perfect because it was forbidden!",
   "created_utc": 1704564115,
   "score": 18,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm28yk",
   "message": "I don't think I've had any.\nGuess I have been in a lot of shit relationships.",
   "created_utc": 1704564436,
   "score": 17,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmj7y4",
   "message": "Met a girl from a dating app for an afternoon drink. Didn't expect much because she was supposed to be flying out of my city later that day. But I went to it because it was a beautiful summer day and none of my friends were available to go grab drinks outside. \n\nFirst off I knew she was attractive from her pictures but they didn't pay her justice. I had to describe her it would be a Margo Robie-like manic pixie disney princess girl, very lively and bubbly. I've dated some pretty damn attractive people and I'm not bad myself but it was the first time I told myself that I was punching wayyyy above my weight. The amount of looks she was getting just walking in the streets was surreal.\n\nHad a very nice couple hours and at some point I told her something along the lines \"Oh you should leave soon to take your plane.\" and jokingly added that she was absolutely welcome to crash my couch.\n\nShe cancelled her plane right there and ended up staying a week with me. She definitely didn't sleep on the couch. \n\nKind of a bittersweet memory though, we both agree that we were some of the most compatible people we met (both character, sex, values, life goals) but our career choices meant that there was no way we could be together without one totally abandoning his career. And we were both experienced enough that we knew that long distance wasn't something we wanted. \n\n\nShe stills sends me random gifts from time to time and we will always hook up if I'm single and she's swinging by Paris for work.",
   "created_utc": 1704570494,
   "score": 13,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmlk2f",
   "message": "My wife and I are both nurses. Before we even started dating, at work she used to color coordinate everything. So she would have baby blue scrubs, baby blue painted nails, baby blue eye shadow, and blue contacts. \n\nWhen it would be busy and she'd be running around the unit. Her bra strap would would fall off her shoulder onto her upper arm and I could see that her bra would also be baby blue too.\n\nIt really made me wonder if her undies were also blue. \n\nI told her one time that her bra strap was showing and she nonchalantly pulled it back over her shoulder and handled her business. \n\nIt took a couple years before I found out she also coordinated her underwear as well. Haha.\n\nAnyways, this woman still gets me hot and bothered to this day.",
   "created_utc": 1704571336,
   "score": 14,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm8u1k",
   "message": "When I met my wife 11 years ago. We connected on a dating site (okc) and set up a time to meet at a coffee shop. It was the first date off the site for both of us. When I came in I found a spot at a booth and texted her “I’m here, sitting under the red cat” (there was a cute painting above me). She came in, sat down, smiled and it was game over. I mean I’ve never known or ever imagined experiencing “love at first sight” but we just instantly clicked. We ended up buying the red cat painting from the owner (his son painted it) a few months later. Still have it.",
   "created_utc": 1704566779,
   "score": 26,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmbafa",
   "message": "Lately, it was this: I had some coins from the country I visited recently. And I was staying at my friend's place. I adore that woman. My wallet was full of them and I didn't know what to do with them. So passing through the hall, I gave her one. For good luck, I told her. I got the best, tightest, sweetest, most genuine ambush hug of my life. I still want to live inside it. ******, I fucking adore you.",
   "created_utc": 1704567656,
   "score": 15,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgls3du",
   "message": "the man who was never fully mine. one night, we had went to the casino with his friends. it was a pretty wild night. when we got home, his roommate went missing. the guy and his other friend were not as sober as me, so i went out looking for his friend. i found him. i drove around town at 5am to find his missing ass. when i got back into bed with said man, he put both hands on my legs before shutting off the lights, looked me in the eyes, and said “thank you for being you.” cried like a baby on the way home that morning because i realized i loved him that day. nothing big came of it, but i have never loved someone so fiercely",
   "created_utc": 1704560813,
   "score": 25,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglxdc2",
   "message": "An old boyfriend, in the beginning of our relationship decided to pop by with flowers one day, but I wasn’t home and he didn’t know. My mother on the other hand was, she was working nights at the time and was woken up by the front door opened and knew it wouldn’t be me. So she took a broom and charged out to the hall and met my new boyfriend for the first time. To this day we still talk about she didn’t know who was more surprised, her or my boyfriend. A romantic little gesture that I think of from time to time even though it’s more than 20 years ago.",
   "created_utc": 1704562709,
   "score": 23,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm6dlt",
   "message": "Sweet kiss with your best friend in a summer night park next to blooming jasmine✨",
   "created_utc": 1704565906,
   "score": 12,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmaqv8",
   "message": "The first time I made love to my wife. We dated for about a month and a half before doing the deed. For some, that might not seem like all that long, but we literally hung out every single night... I respected her and wanted to wait until she was ready. By time we actually did it for the first time, we both loved each other, and it was absolutely amazing sensual experience.  I should mention, neither of us were virgins at the time, but the wait made it that much better for me.",
   "created_utc": 1704567461,
   "score": 12,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglwhv4",
   "message": "I’ve kinda got one actually. I was staying in my new place and all my other roommates were gone on a tour. I had just moved back in state and someone I had a big crush on during high school (this was several years later) came by. We had been in touch recently and had stayed friends for awhile. Anyway she came over and we played piano together and were sitting across the coffee table from one another. I asked her why we had never hooked up. She gave me a look I’ll never forget, literally jumped over the coffee table on my lap and kissed me. We lost touch a little while after",
   "created_utc": 1704562404,
   "score": 9,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm9gce",
   "message": "I stopped by this girls place that I saw sometimes for booty calls. This time though we were missionary and wound up hold hands looking into each others eyes and it became this really emotional thing. It was definitely unexpected",
   "created_utc": 1704567006,
   "score": 10,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmkidv",
   "message": "I had started seeing a guy I had known all my life and when he kissed me for the first time, he told me he had been waiting 10 years to do that.\n\nRemembering that comment makes me smile still.",
   "created_utc": 1704570956,
   "score": 10,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmqrl0",
   "message": "I did a bunch of traveling in my early 20s. I had several intense, romantic experiences with a level of passion I'm not sure I'll ever be able to recreate.\n\n— I was studying abroad in Guatemala and had a whirlwind love affair with another student in the language school. We all went out salsa dancing, and I could feel him staring at me. He was so attractive. I'd never been a girl that was chosen by the guy everyone else liked, but I could tell he liked me. He walked me home, kissed me, and we ended up having sex outside down a back alley. I've never experienced passion like that before—we just couldn't wait. We were inseparable for about two weeks, and it was amazing. But even though we lived in the same city, when we got back home, it just wasn't the same. I still think back fondly on those days together.\n\n—I was backpacking solo in Mexico. When I arrived, at the hostel, everyone was eating dinner. I sat down at a table by myself because I didn't know anyone. This Spanish guy sat down with me, and we ended up talking for hours and hours. We went out walking and ended up kissing on the beach. We spent the next 36 hours together. We rode bikes around Tulum, explored the archaeological site, and swam together in the bright blue water. When he went back to Spain, I became depressed for a few days. But I had just gone through an awful breakup, and it was delightful to know that another person could make me feel that deeply. We never spoke again.\n\n—I was working in Mexico City. I went out to a birthday party an acquaintance had invited me to. Everyone was dancing. This guy asked me to dance. It was instant chemistry. I went home with him, and it was the best sex I've ever had. He took me out for breakfast the next morning and begged to see me again. I remember his words: \"me cautivaste.\"  I basically moved in with him after two dates, and we spent the next four months together exploring Mexico and each other. The relationship went up in flames when I moved back to the states, but we are still friends.\n\nRemembering these experiences has made me extremely nostalgic for my carefree travel days. What fun times.",
   "created_utc": 1704573230,
   "score": 11,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm6m1a",
   "message": "I was 21 banging a 42 yo f for a few months, just a hookup. One night she was going down on me and suddenly started to rim me. I was like \"holy shit, this really feels awesome!\" She did it a little more then asked if I was okay and if I liked it. I replied \"Uh, yeah! Like that feels really good!\" \n\nShe grinned and said \"Well, let's step it up a notch\" then proceeds to stick 2 fingers in me and give me a prostate massage. I swear I saw Jesus!\n\nThis woman changed my like over 20 years ago and still remember it today",
   "created_utc": 1704565990,
   "score": 19,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmdbo7",
   "message": "I was at a campground and flirting with one of the guys who worked there all weekend. I was going back to the pool when he grabbed me from behind and threw me up against the fence for a steamy makeout sesh.",
   "created_utc": 1704568389,
   "score": 9,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmuw71",
   "message": "Thirty years ago I was trekking up a mountain with my girlfriend at that time (I was 20 and she was 18) and... her mother. Quite unexpectedly, the weather turned for worse and we were forced to shelter in a mountain chalet with a couple of rooms, along with other unfortunate trekkers. The host had to squeeze everyone in, so we ended up in one small one person room, with mother sleeping on the bed 2 feet away and us two on the floor, on some blankets. Needless to say that the hormones were running free in both of us, so as soon as the mother fell asleep (or at least that's what we thought), we started to kiss passionately and grind each other as silent as possible. Of course, we reached the moment when we couldn't hold it anymore, so she turned around and we started to have sex very, very slow. I am not sure how to explain this better, but that incredible feeling of extremely slow and hot repeated penetrations, combined with the horror of getting caught in the act was so exhilarating, that I couldn't come for quite a long time, an unusual thing for me at that age :) . Multiple times, as I struggled to be more aware of the noise we made, I had to almost stop moving my pelvis, against all the logic, and whisper in her ear to breath more slow and more deep, as she would start to breathe louder and louder. I'm telling you folks, this was a tour de force from all the points of view, for the both of us, and we managed to end it after half an hour, completely exhausted and  drenched in sweat, but in total quietness, with me grinding my teeth and squeezing her breasts and her biting down the pillow, and without waking up her mother, who was actually lightly snoring. My girlfriend told me the second day that she came more than 10 times, until she lost the count. It was the most mind blowing sexual experience for both of us and, even now after all these years, nothing came close to it, although both of us had various other partners and we're both married with other people. I know this, as we're still friends on FB, we're reminisce now and then and this topic comes up quite often.",
   "created_utc": 1704574738,
   "score": 9,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmbd3x",
   "message": "I used to always fall asleep with my glasses on. My ex boyfriend used to try to gently remove them but it would always lead me to waking up and haughtily proclaiming that I wasn't tired at all....only leading to me falling asleep again five minutes later.\n\nIt always used to crack him up, but I always thought it was so sweet that he would even think to do that.",
   "created_utc": 1704567683,
   "score": 8,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmblkf",
   "message": "My now boyfriend drove almost 2 hours to save me from being stuck in the middle of nowhere after my car got totaled. He kissed me in the parking lot and we've been together ever since.",
   "created_utc": 1704567766,
   "score": 8,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglxs23",
   "message": "Back in 8th grade, we all had to go to a 7th grade class since our teachers were busy with an event.\nThis one girl, who my friends kind of talked to in the band, recognised me. She gave me a fist bump, and a few more later, when we met again in the band. I remember that while some 2nd graders were performing a dance, we all danced along to the music in our seats. It was probably the highlight of my life.\n\nShe said we were best friends a bit before the final performance, I don't think we were since she hadn't even heard my voice. Still think about her from time to time.",
   "created_utc": 1704562854,
   "score": 16,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmjuu6",
   "message": "Went on a side by siding trip with my boyfriend and a whole bunch of people from work including our bosses. We were secretly dating as it was only a couple months into the relationship and we didn’t want our work lives to be affected. I had been sick and in a lot of pain for about a month but didn’t want to miss out on the fun so decided to push myself through the day. In the afternoon the pain was simply too much and I blacked out while standing at a lookout point by a waterfall. When I opened my eyes my head was in my boyfriend’s lap and he was asking “baby are you okay??” and was stroking my hair to comfort me. He helped me get up and when we were off to the side and alone I told him he shouldn’t have done that because he blew our cover in front of everyone and our jobs were on the line. He told me nothing in the world matters more to him than me and that it absolutely terrified him to think about losing me. \n\nWe didn’t get fired, we’re still madly in love, and I still smile thinking about the day that I realized he really truly loved me",
   "created_utc": 1704570721,
   "score": 8,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmrn4l",
   "message": "i was in a mental facility where we were VERY comfortable with each other. we were talking about boobs for some reason and a girl came up and said “wanna see my tits?” and we were all like “ok”. so she showed us her tits and we all made analytic commentary on them. we concluded they were quite perfect with a nice round and perky shape. it was more hilarious than anything.",
   "created_utc": 1704573550,
   "score": 5,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmfpxz",
   "message": "I was camping with my ex. The forest was on walking distant from the camping. Bordering the forest was a widespread field of flowers. We decided to walk there in the night under the full moon. I have never felt as serene as walking there hand in hand seeing him smirk under the moonlight while seeing a background of a glowing field.  He later wrote a story about it that puts it into words way better thab I could. It's one of those things, aside from the love letters, that I will keep with me no matter what.\n\nI'm lucky enough to have a few different romantic experiences. Another was with some one else. After our first date when I sat on his bike he decided to ask me to step of. In the middle of the street he threw away his bike and kissed me right then and there. He couldn't wait to kiss me a few streets later. We had quite a wirlwind romance that led to a few poems written about me. Not all positive but I suppose that matches our past ups and downs.",
   "created_utc": 1704569245,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmn5hu",
   "message": "I went on a date a couple years ago with a woman.  It was the middle of winter and though I was bundled up, I didn't have any gloves, and my hands were freezing. \n\nWe were sitting outside a bar because it was too loud inside. I guess she noticed me rubbing my hands together. She stopped talking, took both my hands in hers, and blew hot air over them. \n\nThat act did things to be. I can't even properly start to describe what I felt. Some combination of sensuality and a deeply sense of being cared for. It's a memory I look back on with great fondness. :)",
   "created_utc": 1704571916,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmuba8",
   "message": "I regret it to this day. Was on a date and this really cute girl said “I would kiss you if you didn’t have food in your mouth” and I just went “hm” and took another bite.",
   "created_utc": 1704574524,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm8sas",
   "message": "My bf smokes. I don't. It doesn't bother me that he does. The second-hand smoke and smell bothers me a bit. I finally mentioned it, and he changed his entire routine to a different part of the house and doesn't smoke where I'll get smells or smoke. He changed his entire routine for me. I didn't want to be intrusive and was fully expecting to just open the windows or something occasionally. It was such a simple gesture, but it really made me feel loved. Had me crying a bit, not gonna lie.",
   "created_utc": 1704566762,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmn2ye",
   "message": "Was in college and went for a road trip by myself.  Stopped in Baton Rouge LA to sleep and get some cajun food for a couple of days.  Met a woman by the pool who was 20 years my senior and black.  She was there to see her daughter at LSU.  Her husband had died 5 years prior.  Don't know why but we hit it off despite me being a 22 year old white guy with long hair and having pretty much nothing in common.  Spent two days with each other both having sex and having some very honest conversations that I still think about frequently.  Then, I knocked on her hotel door and no one answered.  I hope you found what you were looking for, Vivian.",
   "created_utc": 1704571890,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmo0zd",
   "message": "It was towards the end of my senior year of high school. Parents went out of town so I took it upon myself to throw a party/bonfire at my place. Party got pretty big so I stepped away to take a breather and check everything out around the house. As I was walking back outside to the fire, I was suddenly stopped by an attractive girl who was in my grade but whom I didn’t really talk to much being in different clicks and all. As she was headed out to be picked up by a friend, she stops me, gives me a extremely long kiss followed by a “god, I’ve wanted to do that for so long,” then just walks away, leaving me stunned with my tail between my legs. When we graduated shortly after she went her own way and I went mine without ever really talking about it again. Still think about it every now and then to this day.",
   "created_utc": 1704572234,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmr2vn",
   "message": "When I was a teenager I worked on a farm. My best friend who was a guy worked there too. We had accidentally fooled around once before. Things happen when you’re 16. \n\nWe got to my house and I turned on the shower. He had to call someone and finally said he had to go take a shower. And joined me. \n\nThat summer was filled with a lot of little moments like that. He had been my best friend for years, so most people assumed absolutely nothing. We are still friends, many decades later.",
   "created_utc": 1704573344,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgl5ty1",
   "message": "When they have clean feet",
   "created_utc": 1704552076,
   "score": 10,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglqywt",
   "message": "I accidentally took a friend of mines virginity and it started a three year relationship. \n\nI was 21 and she was 20. She still lived at home with her parents and her parents actually grounded her from video games due to her not having a job. \n\nShe walked over to my apartment to play some games. At one point later she was looking at something on her phone and I was trying to get her attention. \n\nWe somehow ended up laughing and trying to wrestle the phone away from her when I ended up standing over her and she gave me this look which made me pause. \n\nShe blushed and I don't know why but I kissed her. Her hands started roaming places and mine did to. We ended up on my bed where she told me I would be her first. \n\nI didn't really go hard. Just went slow and let her get used to it before she finally wrapped her arms around my neck and pulled me close as I was close. \n\nAfter she got up and wordlessly walked into the bathroom where I heard the shower starting. I thought I fucked up until she walked out and grabbed my hand pulling me into the bathroom with her. \n\nWas quite a funny moment that weekend when she learned that guys can't really go more than 7-8 times without serious performance dip. We had sex 10 times one day and the tenth time she said it was more work keeping me hard than it was finishing me off. \n\nI told her that most guys limit is five. It's definitely more than five, but most of us refuse to go more than five.",
   "created_utc": 1704560401,
   "score": 40,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmcfpx",
   "message": "I made out with some lesbians in the green room after one of my DJ sets because they wanted to have a kissing contest…",
   "created_utc": 1704568067,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmd8en",
   "message": "Not too long after dropping out of high-school I was walking around in the park bummed out thinking about what I was going to do. I met a chick who was wandering around and we started talking and immediately hit it off. We went back to my place and smoked some weed and played video games which led to us making out and talking about what we want to do in the future. I told her I really liked her and wanted to be bf and gf and she told me she couldn't date me because she lived in another state and was only visiting for the weekend and she doesn't believe in long distance relationships. After that she caught a bus back to her hotel and I never daw her again. I still think about that day from time to time.",
   "created_utc": 1704568355,
   "score": 5,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmdsri",
   "message": "A woman looked me in the eyes.",
   "created_utc": 1704568557,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmkb0f",
   "message": "A girl I was dating cooked my favourite dish while getting the instructions over the phone from her older sister because she had no idea how to make it.",
   "created_utc": 1704570883,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmnbjf",
   "message": "There was a blackout so we lit like 60 candles, poured some whiskey, and had quite a lovely time until the lights came back on quite some time later lol",
   "created_utc": 1704571977,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmofhg",
   "message": "I was a senior in high school going to school downtown. I had a friend who went to a different school downtown and she asked to meet me for my birthday before we both started school. I got up at about 5am to make it down early enough for us to have time to hang out before school. We stopped and got coffee, then took a walk towards the river to watch the sun rise. She gave a painting she did of the rain with a box in the middle that read \"Pluviophile - a person who enjoys rain and rainy days, and who is fascinated by the sights, sounds, etc., of rain\" \n\nIt was something I had mentioned in passing years prior, and she remembered it and made a painting for me. We sat and watched the sun rise over the river and went to school. Nothing ever came from it, but she made me feel so special that day and I wish I had had the guts to ask her out on a true date.",
   "created_utc": 1704572380,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmujlj",
   "message": "Was in a LDR. Flew in to see my girl. It was a late night flight.  She picked me up from the airport. On the drive home, after undoing my pants, she crawled over onto my lap while driving and got on top of me. There were about 5-7 seconds where I couldn’t see the road because her body was blocking my view. Could of died but 19/10 would do it again.",
   "created_utc": 1704574609,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgn5sjc",
   "message": "My fiance (boyfriend at the time) and I were long distance. One of the times I was visiting, he greeted me at the airport with roses, picked me up and spun me around. Some people smiled at us. I remember feeling like I was in a movie. The flowers ended up staying at his house when I had to fly home. But he got them pressed and framed (unbeknownst to me). \n\nSome time passed, and he made the 600-mile move for me. Despite having to drive so many miles and despite leaving everything he knew behind, he put in the effort to surprise me. When I approached him from our new place and headed out to the driveway, he was holding the frame of pressed flowers. Strong and proud. After 12+ hours of driving, he picked me up, and spun me around again just like he had the first time with those very same flowers. That frame is now hanging in our home. \n\nI get to marry him this year.",
   "created_utc": 1704578709,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgnbqlq",
   "message": "For our first date, my now husband invited me over to his house and made me chocolate chip pancakes and we sat and talked for hours. we laughed so much, and I seriously knew right then that he was the man for me. We just fit like puzzle pieces. He still makes me chocolate chip pancakes to this day.",
   "created_utc": 1704580875,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgnj3ad",
   "message": "Late teens, early twenties? Used to work at a pizza joint/restaurant with a server named Erica. There was always some banter as cooks and FoH do. Anyways we had the close one night and locking up her ride had called said wasnt gonna make it.\nThere's a 24/7 steak and shake across the parking lot, do you want to.grab something while we wait and find you a ride? And we went that way and it started lightly raining so we started dancing in the rain in an empty parking lot a very nice takeout session .\nWe got inside,.got burgers and shakes making eyes the whole time, and then her fiance(I did not know about) came to get her since the original ride failed.",
   "created_utc": 1704583622,
   "score": 4,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmfs93",
   "message": "Date with my fwb. We still hadn't made it official then, but acted like a couple. Went to an amusement park. We ate at a Chinese place and then went on one of those rides that go round and round and are lifted into the air. I ended up being violently sick, and I puked the food up, hitting myself. I was sobbing and just a big mess, but he didn't care I was gross and took me to the bathrooms to help me clean up. He was so sweet. Decided to ask him soon after that if he wanted to be officially together, and he said yes.",
   "created_utc": 1704569267,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmuwbj",
   "message": "Happened a while ago. \n\nI had, hours prior, been removing hardwood flooring from around sill plates when one of the planks popped and smacked across my face. Minor septum break \u0026amp; 2/3 inch cut above my lip. Nothing too serious, i cleaned it up and continued working.\n\nSoon-to-be partner \u0026amp; I work together. He came to my jobsite to help me finish out the days work, saw my face. Grabs my hand and leads me over to a window where he could look at it in the light. \n\nLifted my chin up and tilted my face with his thumb, and ohhmyyygawwd. The way he was looking at me was so full of love, concern, and definitely sexual tension. I just about melted 🫠 \n\nI think thats the moment I fell in love with him.",
   "created_utc": 1704574740,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kglyld7",
   "message": "I went out on a date with a girl I met through okcupid. After the date, she said that she wasn't attracted to me but really liked to be friends. Since I had just moved to the area, I was honestly fine with it. I didn't have friends. She came over, I would cook her food and we would catch up and watch Family Feud while we ate. Occasionally we would go out and eat. We'd vent to each other about dating life, work life, and other things. It was honestly a great friendship.\n\nAbout 4 months and a dozen or so friend dates later, we were coming up on her birthday. I asked her what she wanted. She said she \"wanted to have fun\". I thought she meant going out. It did not. Never even hinted at it before that point in time. It turned into me taking care of her, and then me doing whatever I'd like to do. It lasted like that for about 6 months or so.\n\nWe still talk on occasion and she's doing great. I'm really, really happy for her because she deserves the world. But I'll always be a bit confused on how that all happened.",
   "created_utc": 1704563145,
   "score": 6,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgm2ors",
   "message": "Hot socal day, back of a motorcycle, riding through the desert, up over a mountain pass to a crystal clear lake, stopped , smoked a little, watched the sun bounce on the waves like diamonds. Royal blue sky, tree covered mountains surrounding the water. Watched the sun set and rode back. We just snuggled. It was amazing. 40+ years ago. I can still picture it.",
   "created_utc": 1704564593,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmaoo9",
   "message": "I was thinking it’s probably bad that I can’t pinpoint one but then I realized I’m a male \u0026amp; just need to man up about it I guess.",
   "created_utc": 1704567440,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmdd74",
   "message": "That time when I got to sleep in",
   "created_utc": 1704568404,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmer7k",
   "message": "N/A",
   "created_utc": 1704568897,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmfma9",
   "message": "When I was 16 my first boyfriend and I kissed in the rain. It's been over a decade but that still makes me smile.",
   "created_utc": 1704569208,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmm9gv",
   "message": "In high school my girlfriend and I broke up two months before prom. I had already bought tickets we had the same friends group it was somewhat mutual (well I broke up with her) so we decided to still go as friends. \n\nIt was actually really fun at first we laughed drank danced it was great. Then a slow dance song came up that was “our song” and her face just dropped. She immediately bursts into tears on the dance floor and storms out of the prom. Everyone looks at me (it was a small school) like “what the fuck?” And I’m just so embarrassed standing there in shock.\n\nThen the absolute most beautiful girl in our class- who somehow went to prom solo with her friends- comes up and asks me to dance.\n\nI know it was of sympathy at first but we danced had a great time spent the rest of the prom together and ended up going home together. \n\nShe was an exchange student and left shortly after to go back to college in her home country so we didn’t see each other after except for like graduation and didn’t hook up again or date or anything but that one night was fucking incredible like out of a movie and I’ll remember until the day I die.",
   "created_utc": 1704571592,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmogqe",
   "message": "I met this cute and interesting girl on Tinder, we chatted the whole night until morning. Two days later went for our first date in a cozy bar and talked for hours, I was a bit nervous but the mood and setting was romantic and I had the butterflies. We were talking about some countries that we had visited (kind of basic stuff haha) and after she had listed hers I asked where she would like to go next. She answered ”To your place.” and I won’t forget the feeling I got from she saying that. I think it was the best date I ever had, sadly the thing lasted just a few months bc my life was a little mess back then and I can see now that I was also kinda afraid of commitment. I wish I handled things differently.",
   "created_utc": 1704572393,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgmqumx",
   "message": "I had an ultrasound done on my testicles to check for a hernia. Umm.. it felt good. It lasted about 20 mins I was a couple minutes away from \"losing it\". The lights were dim she was looked me in the eyes a time or two. I had no idea if she'd know whether or not I came just by looking at her screen so I used all my might kept it in.",
   "created_utc": 1704573261,
   "score": 3,
   "submission_id": "1900kcg"
  },
  {
   "comment_id": "kgn5e5q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1900kcg"
  }
 ]
}