{
 "submission_id": "1903vls",
 "title": "My boss won't stop talking about how \"my faith guides by work\" and other religious things at work, nearly every time we have a meeting - Is it in bad taste to profess your religious beliefs to your subordinates?",
 "selftext": "",
 "created_utc": 1704559043,
 "permalink": "/r/AskReddit/comments/1903vls/my_boss_wont_stop_talking_about_how_my_faith/",
 "score": 12,
 "url": "https://www.reddit.com/r/AskReddit/comments/1903vls/my_boss_wont_stop_talking_about_how_my_faith/",
 "comments": [
  {
   "comment_id": "kglniba",
   "message": "Yes, most people would consider it in bad taste for a boss to impose their religious beliefs on subordinates. \n\nAs an atheist, I would probably just try to ignore it. But it would annoy me, for sure.",
   "created_utc": 1704559139,
   "score": 26,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglniww",
   "message": "Unless it's a religious organization...very bad taste. I would start documenting every time he does it so that if it escalates you'll be able to demonstrate a pattern of behavior later.",
   "created_utc": 1704559146,
   "score": 15,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgm4rke",
   "message": "It's not just bad taste, it's probably against company policy, unless the boss is the owner. Report this jerk!",
   "created_utc": 1704565333,
   "score": 7,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglo2em",
   "message": "Time to find a new organization if this is the company's overall mentality. If not, document document document and take it to HR. \n\nThis isn't how you do business or lead.",
   "created_utc": 1704559344,
   "score": 5,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglnlgh",
   "message": "Yes. You're definitely going to have subordinates that are either not religious or of a different religion. At best, they'll be annoyed or indifferent; at worst, they'll be offended.",
   "created_utc": 1704559172,
   "score": 2,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglq6i3",
   "message": "I worked at a church office that was less proselytizing. Your boss has no reason to emphasize his religious beliefs or should be applying his faith in a business setting. But it’s a slippery slope as far as how you navigate dealing with this behavior in a professional setting because technically he’s not doing anything overtly wrong. but it does sound a bit odd for a place that sells printers….",
   "created_utc": 1704560113,
   "score": 2,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglq1ul",
   "message": "Say you are muslim and yell allahu akbar depending on the praying time. Got me a private praying room I use for napping twice a day on company time.",
   "created_utc": 1704560065,
   "score": 3,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglr31l",
   "message": "They sound like someone who is easy to manipulate. If you put some thought into it you could probably use their faith to benefit yourself.",
   "created_utc": 1704560444,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglocw4",
   "message": "Yes it is wrong to do that but he's the boss and there's not much you can do. I just don't listen when they start preaching.",
   "created_utc": 1704559451,
   "score": 0,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglp6h0",
   "message": "Absolutely bad taste, but it's also not illegal, so depending on the sway your boss holds I'd be careful about making too much of a stir about it unless you're willing to potentially lose your job.",
   "created_utc": 1704559752,
   "score": 0,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgmsml4",
   "message": "Extremely bad taste. Someone told me this and I love it.\n\n\"Religion is like your genitalia.  Nor everyone is interested and is best taken out in private\"\n\nKeep your religion to yourself and we will get in splendidly.",
   "created_utc": 1704573908,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgloubf",
   "message": "Tell your boss that when you’re done your shift that you’ll sacrifice a goat in the Great Hall of Lucifer tonight in his honor.",
   "created_utc": 1704559628,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kglqyht",
   "message": "If he's not trying to convert you or something, I'd just leave it alone.",
   "created_utc": 1704560397,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgm69zz",
   "message": "\\*\\*UPDATE\\*\\*   \n\n\n\"guides \\*my work\"",
   "created_utc": 1704565870,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgm6ohp",
   "message": "Outside of family, discussions of religion, finances, and politics is inappropriate. These topics are sensually unsettling and require exhausting levels of empathy to progress. Your boss knows this, so their desire to have you apply effort to this topic is a waste of company resources.",
   "created_utc": 1704566014,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgmdj3i",
   "message": "If you're in the US, I recommend reviewing the companies personnel policies.  This may be expressly prohibited.  If you object to the conduct, I think you may be able to get him to stop it on the grounds that continuing the practice constitutes harassment.",
   "created_utc": 1704568463,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgmiqg6",
   "message": "If he really “won’t stop talking about it” then yeah, he should knock it off. With that said, your faith doesn’t have to be a secret in the workplace and there are healthy ways that someone’s faith could guide their work, giving them inspiration to not freak out on rude customers for example. I don’t think that would be wrong to share in passing. But if he is always harping on about it or if he is expecting other people to have any particular views on religion in the office then that is quite uncool.",
   "created_utc": 1704570320,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgmiz8q",
   "message": "Keep a logbook of incidents then give it to hr.",
   "created_utc": 1704570408,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgmqv7r",
   "message": "As a neo Pagan, this would be a problem.for me, especially coming from a man. I'd probably get myself written up pretty quickly for asking him \"exactly what does your faith offer women?\"",
   "created_utc": 1704573266,
   "score": 1,
   "submission_id": "1903vls"
  },
  {
   "comment_id": "kgn09ve",
   "message": "“As I am guided by science, I have found…”\n\n“I developed these features that can increase our productivity by 35% by dwelling on the meaninglessness of life and the nature of an uncaring universe.”",
   "created_utc": 1704576703,
   "score": 1,
   "submission_id": "1903vls"
  }
 ]
}