{
 "submission_id": "19032u2",
 "title": "What is your opinion, does bodycount matter in relationships?",
 "selftext": "",
 "created_utc": 1704556901,
 "permalink": "/r/AskReddit/comments/19032u2/what_is_your_opinion_does_bodycount_matter_in/",
 "score": 8,
 "url": "https://www.reddit.com/r/AskReddit/comments/19032u2/what_is_your_opinion_does_bodycount_matter_in/",
 "comments": [
  {
   "comment_id": "kgli63b",
   "message": "Im more interested in kill count",
   "created_utc": 1704557139,
   "score": 14,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgli6qn",
   "message": "It tells you what a person might think about and approach sex, relationships and making life choices. Yes, it matters somewhat.",
   "created_utc": 1704557146,
   "score": 14,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglozti",
   "message": "It depends, there are factors that play into it as well. Age, where you live, who the bodies are",
   "created_utc": 1704559685,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglpm3c",
   "message": "Depends on what said person thinks of sex.\n\nIf it was a man with a remarkably high body count I would wonder if this man is really compatible with a monogamic long-term relationship where he only gets to fuck 1 person in years, and I would also wonder about his degree of emotional responsibility: did he break many hearts in the process? How does he feel about it? Does he see women as pieces of meat? Is he able to care?\n\nIf it's a woman, I would also have concerns: does this woman disassociate sex from love? (I've had many experiences where the girl starts having unplanned feelings, it's a hormonal thing, can't fool biology) does this woman use her body to get something in return i.e. can't live without a man in her life? Emotional dependency? If she was a prostitute, is she really ok with having sex if she doesn't get anything material in return?\n\nIt's not an automatic red flag, but a warning to really seek to understand how the person thinks and feels.",
   "created_utc": 1704559908,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglqegu",
   "message": "Absolutely. If they've killed more than half a dozen people, I'm out.",
   "created_utc": 1704560194,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgli2t0",
   "message": "I think it does yes. I don’t want to date a woman who gives her body easily to other people. Would feel the same way if I were a woman dating a guy.",
   "created_utc": 1704557104,
   "score": 8,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglik0m",
   "message": "In my personal opinion, it does in some ways and doesn’t in others. To me, sex is at the top of human intimacy, so it has a lot of value to me. I’d rather be with someone that has actively tried in 30 relationships than just hooked up with 15 people.",
   "created_utc": 1704557287,
   "score": 5,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglkkjw",
   "message": "As long as you’re both clear about what you want from the relationship and trust each other, then no it doesn’t matter, IMO. I have a friend who slept with over 200 women before meeting the right person and settling. They’ve been happily married for 5 years and have 2 kids now.",
   "created_utc": 1704558052,
   "score": 4,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglkoqz",
   "message": "Not in my relationship it doesn’t. Never been discussed and probably never will be. We prefer not to consciously think about and discuss people we’ve been with, it’s just us now",
   "created_utc": 1704558095,
   "score": 4,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglizm9",
   "message": "It's something interesting to talk about while laying in bed snuggling.",
   "created_utc": 1704557453,
   "score": 2,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglhygr",
   "message": "I’d be a hypocrite if I said a high body count was an issue.",
   "created_utc": 1704557058,
   "score": 4,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglhwwi",
   "message": "nope. so long as it stay the same the whole time we're together, not at all.",
   "created_utc": 1704557042,
   "score": 3,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgliivj",
   "message": "of course it does, if not, why do women call other women \"slut\" or \"whore\" when insulting them????",
   "created_utc": 1704557275,
   "score": 4,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglpm9m",
   "message": "Yes, as it shows how that person views sex and human relationships.\n\nI would never date a pornstar, no matter how hot she is or how compatible we may be. To have my woman be public property in that way is just not something i would be able to live with.",
   "created_utc": 1704559909,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglii3b",
   "message": "Not at all, it doesn't matter where the appetite comes from, as long as you go home for dinner (words of wisdom from my mom).",
   "created_utc": 1704557267,
   "score": 2,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglo5qr",
   "message": "Definitely. Who wants a woman who's been with 20 guys? You think you're special? - just your turn - she'll move on when she gets bored or finds a better offer.",
   "created_utc": 1704559379,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgli8k7",
   "message": "It shouldn't be if there is open communication and honesty. Let the past remain where it should be...in the past. \nAnd tbh, a higher body count does show experience, that can only be a positive thing.",
   "created_utc": 1704557165,
   "score": 2,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgliy6n",
   "message": "If it does, you've probably been lied to.",
   "created_utc": 1704557438,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgli11d",
   "message": "if is a concerning amount it should bother you if it's below 10 then it's good",
   "created_utc": 1704557086,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgljuhc",
   "message": "If you were a CEO looking for new workers, would you rather hire a 20-year old who has had more than 60 different jobs in the past? Or would you rather hire a 20-year-old who has never had a job before? And you have to choose one of them.\n\nThat’s why body count matters.",
   "created_utc": 1704557779,
   "score": 253,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgls69x",
   "message": "Yes, I personally don’t want to be with someone who thinks of sex as something casual and not purely an intimate act. It devalues actual relationships and is also a sign that someone has commitment and impulsivity issues. \n\nI also have strong opinions on hook up culture and don’t harshly judge friends, strangers etc for being part of it but I won’t be with anyone who’s contributed towards it.",
   "created_utc": 1704560842,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglt04n",
   "message": "Yes for me it does. Sex is the most private thing you can Share with another human being. I Don't have casual hook ups for that very reason. I want that Connection to be special. My future wife shouldnt be another one. She will be special. I am not a virgin. Had 2 relationships. So my body count is 2. But both women were special and the next one will be too.\n\nWont be a casual hook up.\nI also don't expect a virgin but someone who has the same values as me. Someone who slept around a lot is not a bad human being. But those are people I amnNot attracted to...because of different values.",
   "created_utc": 1704561144,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgltfho",
   "message": "It’s not the end-all, be-all, but it’s been shown that those with higher body counts are less-likely to be able to have successful, long lasting relationships. It shouldn’t necessarily be the sole reason for rejection, but something to be wary of.",
   "created_utc": 1704561298,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgltv6h",
   "message": "To me it does. Humans are humans. Having 50+ sexual partners will definitely have an impact on you one way or another.",
   "created_utc": 1704561457,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglsnq6",
   "message": "Yes. But not \\*my\\* body count. Only hers.\n\nYes, I am hypocritical about this in the extreme. \n\nIf I aim for a long term relationship with her then, while my body count is not up for discussion, I want hers to be single digit, as close to zero as possible, the best would be 1 to 3. Not zero. Zero would make me #1 and she'll always look for a comparison and I can't have that as it'll mess with the relationship. 1 to 3 means she has enough to compare - time for me to enter her life and hopefully \"seal the deal\" and be enough. \n\nNo, this is not up for discussion.",
   "created_utc": 1704561019,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglq33b",
   "message": "Base values that do not align are always a problem in a relationship. You can't be with someone who does not want kids if you definitely want some. Body count might not be so severe but it can still be a deal breaker for someone having monogamous values for example.",
   "created_utc": 1704560078,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kglry7i",
   "message": "I see a lot of people on here saying it matters for women but no one actually saying it matters for men. It’s a shitty double standard.",
   "created_utc": 1704560760,
   "score": 1,
   "submission_id": "19032u2"
  },
  {
   "comment_id": "kgltzx3",
   "message": "It matters, but it doesn't break a relationship either.",
   "created_utc": 1704561505,
   "score": 1,
   "submission_id": "19032u2"
  }
 ]
}