{
 "submission_id": "190hq98",
 "title": "What are some terrifying human body facts?",
 "selftext": "",
 "created_utc": 1704595870,
 "permalink": "/r/AskReddit/comments/190hq98/what_are_some_terrifying_human_body_facts/",
 "score": 122,
 "url": "https://www.reddit.com/r/AskReddit/comments/190hq98/what_are_some_terrifying_human_body_facts/",
 "comments": [
  {
   "comment_id": "kgp7l9c",
   "message": "idk why but i find it kinda freaky that the heart never stops pumping. like from the moment were born to the moment we die, its just a constant movement",
   "created_utc": 1704609710,
   "score": 234,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp7jr6",
   "message": "[removed]",
   "created_utc": 1704609684,
   "score": 212,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp0u4m",
   "message": "You can have a stroke and not even know it unless you have a brain scan…lots of little mini strokes you don’t even know about til BOOM one kills you",
   "created_utc": 1704605827,
   "score": 161,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgoetjn",
   "message": "You can get an aneurysm at any time no matter how healthy you are.",
   "created_utc": 1704595916,
   "score": 31,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp537i",
   "message": "Locked-in syndrome is a thing. The affected person is fully aware and unable to move anything except their eyes… unless they get total locked-in syndrome, which paralyzes the eyes too.",
   "created_utc": 1704608205,
   "score": 170,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpa3mq",
   "message": "Your body will dull the pain until you get somewhere safe at which point all hell breaks loose and you finally realize you’re severely hurt.",
   "created_utc": 1704611296,
   "score": 167,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgofz02",
   "message": "Tumors can have hair and teeth. I think I've worked for a couple of them...",
   "created_utc": 1704596388,
   "score": 57,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp3syw",
   "message": "All our bodies are fighting off blood cancer all the time\n\n[Immune system kills spontaneous blood cancer cells every day](https://www.medicalnewstoday.com/articles/272092)",
   "created_utc": 1704607459,
   "score": 142,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgoweaa",
   "message": "It’s possible to vomit feces. Bowel obstruction, ileus.",
   "created_utc": 1704603583,
   "score": 184,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgowgzl",
   "message": "If you are unlucky enough you could lose you ability to fall asleep... at all. I think it's called \"fatal insomnia\". It starts as regular insomnia that gets worse and worse untill sleep medication doesn't do anything anymore. You never sleep again. There's no cure. All you could do is wait for one of the slowest deaths ever.",
   "created_utc": 1704603619,
   "score": 140,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpb0iw",
   "message": "there's shit inside of all of us",
   "created_utc": 1704611905,
   "score": 213,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp6p6n",
   "message": "You can experience such a traumatic brain injury (physical trauma, stroke, illness) to the point where you are still capable of consciousness, but lose the ability to distinguish faces - including those of your loved ones. The condition is known as “prosopagnosia.”\n\nhttps://www.ncbi.nlm.nih.gov/books/NBK559324/",
   "created_utc": 1704609172,
   "score": 255,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp7j1u",
   "message": "[removed]",
   "created_utc": 1704609672,
   "score": 251,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpcl17",
   "message": "Bell’s Palsy. Totally random, rare condition where your nerve dies and one half of your face is paralyzed. Happened to me overnight! Thought I was having a stroke.\n\nMost recover in a few months, but some people never do.",
   "created_utc": 1704612965,
   "score": 35,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp7lg3",
   "message": "[removed]",
   "created_utc": 1704609713,
   "score": 72,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpozmy",
   "message": "Bodies will move as they’re coming out of rigor. I’ve been bumped by a few (I’m a coroner). Bodies can also make sounds as the remaining air/ gas leaves… 2am in the morgue and I thought I was in COD zombies",
   "created_utc": 1704621921,
   "score": 110,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp06ya",
   "message": "The mouth is by far the dirtiest part of anyone’s body. Even more than the anus.",
   "created_utc": 1704605488,
   "score": 174,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpb5cv",
   "message": "Anesthesia awareness is a very real possibility.  You can be aware and in pain during surgery but unable to move.  It’s also possible that you may not remember it happening until you start having flashbacks and nightmares about it.",
   "created_utc": 1704611993,
   "score": 170,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp17yg",
   "message": "You can get vitiligo at anytime. Am in my early stages and I can't do anything about it. Just watching my skin lose color.",
   "created_utc": 1704606029,
   "score": 22,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp8s3r",
   "message": "Pancreatic cancer could be growing for decades before suddenly shows itself with painless jaundice. From that point could have less than a year to live",
   "created_utc": 1704610450,
   "score": 220,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpcqds",
   "message": "Your internal organs have nerve endings and can feel extreme amounts of heat. You can also burn internally from fire affecting an external part of you. Your internal body heat raises and it feels like searing hot pains in your organs while not being able to breathe. Your bones even feel it. Oh and another thing bone hurts when you try to scrape it.",
   "created_utc": 1704613065,
   "score": 41,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpdco2",
   "message": "After a minor injury, like a sports injury, sprained ankle, or small bone fracture. It is possible to develop acute compartiment syndrome. \nMuscles are surrounded by tissue (fasci). When swelling occurs, intracompartimental pressure rises, because fasci do not stretch. Blood can no longer reach the tissue, so no oxygen supply. No oxygen means the death of tissue. Necrosis can occur in as little as 3 hours. This can result in amputation of the limb or death.",
   "created_utc": 1704613491,
   "score": 144,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp2nz7",
   "message": "Although rare, it’s possible to contract a brain eating amoeba (scientifically known as Naegleria Fowleri) from inhaling untreated tap water (i.e from your shower). Death after infection occurs 97% of the time.",
   "created_utc": 1704606815,
   "score": 186,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp32ps",
   "message": "Your muscles are FAR more powerful than you think. There is just a governor of sorts that prevents you from going full strength, because your muscles would break your bones.\n\nThere are certain nerve agents that can turn this governor off and literally kill people with bone-breaking muscle contractions.",
   "created_utc": 1704607043,
   "score": 60,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgoz1hy",
   "message": "prions. just prions man. google them or don’t just prions.",
   "created_utc": 1704604891,
   "score": 233,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgougrj",
   "message": "If your achilles tendon ruptures/snaps, it sounds like a gunshot and is incredibly painful D:",
   "created_utc": 1704602660,
   "score": 247,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpciax",
   "message": "I’m a few threads in and I’m having a stoned panic attack because I’m reading these and VERY aware of my ribs. Commenting to come back tomorrow",
   "created_utc": 1704612914,
   "score": 18,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgq199b",
   "message": "I will never forget that one patient with\nfull blown postoperative delirium.\nSounds plain enough doesn't it?\nA little confused after being put under, a bit woozy....\n\nShe screamed \nand screamed \nand screamed...\n\nImagine that short scream in a horror movie before someone gets killed, the panic and fear of imminent death. \n\nBut\nfor\n2 days\n\n48h of the most bloodcurdling screams.\n\nI was told they couldn't give her something because they feared it would only lengthen the time to pass her delirium.\n\nYou could hear her from across the hospital, in every room. While you work, while you tend to patients, while you eat and at the bus stop you take to and from work...\n\nAnd then she just stopped and couldn't remember a thing from those 2 days.\n\nIt's been more then ten years and i can still \"feel\" those screams.",
   "created_utc": 1704630577,
   "score": 135,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpqh8g",
   "message": "Getting hit in the head and temporarily loosing your memory is not some cartoon trope. I had a teenage employee that got a head injury protecting a friend in a fight, and missed a week of work. \n\nWhen he got back, he said it was like living in a dream world when you can't use long-term memory. You have to be constantly supervised when you don't KNOW your name, your family, or anything about anybody, period, all while nursing an injured skull. Everyone is a stranger, but some are familiar.\n\nIt was even stranger to him how it suddenly switched back on after three days, just sitting on the couch while watching TV. In an instant, he just knew again why he was hurt, the fight that took place in a park, the rock his head hit when he was pushed off his feet. Must have been the most profound moment of realization for him.",
   "created_utc": 1704623028,
   "score": 8,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpjlvn",
   "message": "Your brain plays so many tricks on you it's terrifying.\n\nFrom colours that don't exist, to the huge blind spots in your eyes to the simple fact you see the world on a time delay..",
   "created_utc": 1704617922,
   "score": 2,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpdrk2",
   "message": "That fetal cells will wander out of the uterus and congregate in other organs. They might migrate back into the uterus in subsequent pregnancies. Read a piece about it this weekend.",
   "created_utc": 1704613781,
   "score": 254,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpa1fw",
   "message": "Leaving this here for my fellow hypochondriacs warning them to turn back now.",
   "created_utc": 1704611257,
   "score": 32,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpd0z5",
   "message": "before opening this thread i thought it was gonna be shit like \"your eyes are always seeing, even when you have them closed, they're still seeing, it's just too dark\", not shit that's turn me into a hypochondriac",
   "created_utc": 1704613268,
   "score": 18,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp4ule",
   "message": "Thrombocytopenia\\~\\~ It is extremely low platelet count.\n\n What causes it? A million things!\n\n What are the symptoms? Tiny purple spots on bruising and you feel tired.\n\nWhat does it mean when you have it? You can bleed to death internally from bumping against the counter. My doctor told me I could litterly bleed to death from a papercut.\n\nBut I'm feeling MUCH better now!",
   "created_utc": 1704608064,
   "score": 182,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpfy9j",
   "message": "Your immune system can get rid of your bones. Oh, and your red blood cells (including haemoglobin). Why does your immune system do this? It feels like it. \n\n\nI have multiple autoimmune diseases and about 4 years ago my immune system just decided we didn't need bones so now I have severe arthritis and osteoporosis, basically just for the lols... Thanks immune system.",
   "created_utc": 1704615311,
   "score": 155,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgogmup",
   "message": "[Cancer is a disease in which some of the body’s cells grow uncontrollably and spread to other parts of the body.](https://www.cancer.gov/about-cancer/understanding/what-is-cancer) [Cancer survival rates](https://www.nuffieldtrust.org.uk/resource/cancer-survival-rates) are the thing that will scare you. I am in there. Never google your own condition.",
   "created_utc": 1704596661,
   "score": 125,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpaqpz",
   "message": "I regret reading all this but atleast I know I can die anytime.",
   "created_utc": 1704611718,
   "score": 95,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpkymf",
   "message": "You can fracture your neck and dont notice it, until you bend your head back and puncture the brain which resolves in sudden death.",
   "created_utc": 1704618915,
   "score": 88,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp82yp",
   "message": "All of your bones are wet.",
   "created_utc": 1704610013,
   "score": 86,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpb9rp",
   "message": "If you laid somebody's large and small intestines perfectly straight on the floor, they would die.",
   "created_utc": 1704612071,
   "score": 77,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp8hxg",
   "message": "A thing I didn't know until it happened this last summer right after I turned 30:\n\nYou can just develop epilepsy. \n\nAnd the type of seizure and where it happens in your brain affects what happens during the seizure. And not all seizures are the \"go unconscious and shake\" kind. You can be aware during them! It was already mentioned in another comment, but SUDEP (sudden unexpected death in epilepsy) is where you just go into a seizure and never wake up. And people who have seizures in their sleep are most at risk.",
   "created_utc": 1704610272,
   "score": 169,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgorjdm",
   "message": "We all have mites living in our eyelashes - they remove dead skin.",
   "created_utc": 1704601309,
   "score": 184,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgojs8v",
   "message": "The number of bacteria on your body is about the same as your own body cells.",
   "created_utc": 1704597971,
   "score": 42,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgokbat",
   "message": "Your immune system doesn't know that your eyes exist. If they ever found out they would destroy them. This is called \"immune privilege.\"",
   "created_utc": 1704598197,
   "score": 228,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp4fae",
   "message": "Nightmares can induce seizures.",
   "created_utc": 1704607815,
   "score": 36,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpoy9g",
   "message": "Our brain filters out a lot of what we see along with just straight making shit up based on extrapolation",
   "created_utc": 1704621892,
   "score": 67,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgph7m5",
   "message": "Most bodies aren't textbook perfect. Some people can have super thick skulls or extra kidneys and you'd never know until you open them up.",
   "created_utc": 1704616203,
   "score": 125,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp9pby",
   "message": "I think if I am not wrong, that your body has more bones when you're born than when you're an adult. It's like a built-in jigsaw puzzle.",
   "created_utc": 1704611042,
   "score": 62,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp5ji0",
   "message": "Only because I recently had two patients diagnosed with these Syndromes. Both require immediate medical care. Both are treatable but can cause long term complications. \n\nGuillian-Barre Syndrome. It's rare, but basically your immune system attacks your nerves, paralyzing your entire body. Usually after a viral infection, such as the flu or COVID, although the exact cause is unknown. \n\nStevens-Johnson Syndrome. Also rare but it's a skin and mucus disorder. Often a reaction to medication or infection. Basically it causes your skin to break out in a painful rash and blisters. Can cause your skin to necropsy.\n\nEdit:typo",
   "created_utc": 1704608471,
   "score": 173,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgperqz",
   "message": "How resilient yet fragile it is.\n\nHumans can survive getting shot in the head, or die from a common cold.",
   "created_utc": 1704614483,
   "score": 176,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp21x6",
   "message": "The spinal cord is scarily easy to access once you get through the skin/fat/muscles of the back. Just pop off the lamina and boom—direct access to the dural sac holding the spinal cord. \n\nThankfully, the fat and muscles take quite a bit of work to get through.",
   "created_utc": 1704606479,
   "score": 23,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpi9zi",
   "message": "You can get an autoimmune disease at any time for no reason you can identify. Your immune system can just decide some parts of you are the enemy and now you live inside a civil war forever.",
   "created_utc": 1704616958,
   "score": 89,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpmwtk",
   "message": "Blood will corrode stainless steel, it will not harm human flesh. Ointment will seep through our skin fast but not water. Its hard to do anything without a thumb. Its harder to eat with an inflamed Iris, focusing is extremely painful.",
   "created_utc": 1704620352,
   "score": 48,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgof6y0",
   "message": "Stabbing a person feels exactly like thrusting a spoon into a carton of ice cream.",
   "created_utc": 1704596066,
   "score": 199,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpbnna",
   "message": "**THERE ARE SKELETONS IN YOUR BODY RIGHT THIS MOMENT**",
   "created_utc": 1704612330,
   "score": 0,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpca2j",
   "message": "There is a rare skin disease called nevus comedonicus. It comprises of groups of pits filled with black keratinous plugs resembling blackheads, with inflammatory acne lesions developing later. Lesions may develop any time from birth to middle age, but are usually present at birth or develop before the age of 10 years. . \n\nAs far as I know you can't really squeeze them out but if you do, it hurts and it will re grow in a short period or time. It also left tiny holes on the first layers of your skin.\n\n\n[Nevus comedonicus ](https://m.weibo.cn/status/Nhziz8sG7?jumpfrom=weibocom#\u0026amp;gid=1\u0026amp;pid=4)",
   "created_utc": 1704612757,
   "score": 124,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgp97lq",
   "message": "Milk lines can cause one to lactate from places other than nipples",
   "created_utc": 1704610723,
   "score": 39,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgoih04",
   "message": "You can set a fingernail on fire lighting a candle. Did this today, and it burned fairly quickly but did not smell as bad as burnt hair or flesh. (No nail enamel, either).",
   "created_utc": 1704597420,
   "score": 220,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpfhhi",
   "message": "You can have a pituitary gland tumor (adenoma) that appears one day, causes you to lactate, and it can disappear on its own OR they have to remove it through a surgery up your nose",
   "created_utc": 1704614982,
   "score": 40,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgpnfto",
   "message": "Hematopoesis, the process of building blood cells, is a particularly interesting one. 2.4 million red blood cells are made each second. They survive for 120 days. The total amount is upheld. But have you thought about how exact that production needs to be? After all, both too many and too few will kill you or make you very ill. Give thanks to your bone marrow that does such an extremely exact job for you.",
   "created_utc": 1704620750,
   "score": 35,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgprpa1",
   "message": "You can just become disabled. No reason or cause. One day I'm a normal office worker and the next thing I know, I can't even want more than a dozen feet without severe pain.\n\nAfter several years, I'm back on my feet but will never be fully whole again.",
   "created_utc": 1704623928,
   "score": 35,
   "submission_id": "190hq98"
  },
  {
   "comment_id": "kgoto2s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "190hq98"
  }
 ]
}