{
 "submission_id": "191gs84",
 "title": "What do you miss from your childhood?",
 "selftext": "",
 "created_utc": 1704703809,
 "permalink": "/r/AskReddit/comments/191gs84/what_do_you_miss_from_your_childhood/",
 "score": 28,
 "url": "https://www.reddit.com/r/AskReddit/comments/191gs84/what_do_you_miss_from_your_childhood/",
 "comments": [
  {
   "comment_id": "kgvcapz",
   "message": "Not having to worry about not having a job",
   "created_utc": 1704703933,
   "score": 25,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvchwp",
   "message": "How much easier it was to make friends",
   "created_utc": 1704704076,
   "score": 19,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvd4sm",
   "message": "How magical everything was.  Looking forward to an event or a purchase and the feeling lasted. Now not so much.  My younger self would have loved a 3d Printer.  Now I hardly use it and when I do I spend more time working on it.  Which again my younger self would have loved.",
   "created_utc": 1704704511,
   "score": 12,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvdocs",
   "message": "Having no responsibility. You wake up, spend the day whatever the way you want, go to bed full and happy.",
   "created_utc": 1704704884,
   "score": 13,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvdv42",
   "message": "The thing i miss the most is sense of discovery that came with being a child, where every new experience was an adventure and learning was driven by curiosity rather than necessity. The thrill of riding a bike without training wheels for the first time, the pride in tying my own shoes, and the satisfaction of building the tallest Lego tower are all cherished memories.",
   "created_utc": 1704705012,
   "score": 8,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvcnbo",
   "message": "Going outside and playing with my friends. Occasionally the thrill of sneaking outside the house to meet a girl.",
   "created_utc": 1704704176,
   "score": 6,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvc9g9",
   "message": "Not having to worry about going to jail after doing stupid shit",
   "created_utc": 1704703906,
   "score": 5,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvg3de",
   "message": "I miss the way Summer used to feel like an eternity. It stretched out before you and you could not even conceive of it being over. When you went back to school you'd be a little bit taller, and all your friends would too. They'd all look just a little different too, and have so many stories, but that all seemed so far off, like it would never happen, because summer lasts forever.",
   "created_utc": 1704706571,
   "score": 6,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvcmzr",
   "message": "The lack of responsibility.",
   "created_utc": 1704704168,
   "score": 4,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvhoqn",
   "message": "What do I miss most from my childhood? What do I miss the least? I make no apology for once again writing about WW2. Why? Because the war years were also my childhood years. I was 6 when when Britain declared war on Nazi Germany and 13 when the war was finally over in the Far East.\r  \n\r  \nThe things I miss most are many. Firstly, I suppose, the spirit of camaraderie that existed in those fraught years, then the way in which people calmly went about their duties despite the daily and, later, the nightly bombing raids. The determination of the whole nation not to be beaten, and the way the women buckled down to running the family home and resources, with their menfolk away, in some cases, for five years.\r  \n\r  \nAs for what I miss the least, obviously it has to be the constant disruption of normal life caused by what seemed to be incessant air raids. The strict rationing of so many things, particularly, sweets! The necessity to sleep in our damp, dank and dark Anderson shelter in the garden for night after night, listening to the ground defences, the ack-ack and the pom-poms, and the whine of the falling bombs.\r  \n\r  \nStanding outside our shelter one night with my father, his too large tin hat perched precariously on my head and seeing the whole near horizon lit with a rosy red flickering glow. “What’s that, Daddy?” I asked. He responded sadly, “It’s London - burning!” That was a sight I will never forget. I will never forget either seeing our little, very old cottage partially destroyed when emerging from the shelter one morning.\r  \n\r  \nI do not miss the look on my father’s face, when he would come home knowing, through his job in the Admiralty (he being too old to fight), that another Arctic or Atlantic convoy had sustained heavy losses, due to German Uboat action. Neither do I miss the obvious anxiety of my parents regarding so many of my cousins and uncles in the Armed Forces. I do not miss my mother’s tears when she learned that one of her brothers had been badly wounded at El Alamein and would never recover fully from his head wound. He lived, but was mentally affected. More tears I do not miss, are when a much loved cousin went down with his merchant ship, “The Empress of Britain”.\r  \n\r  \nGetting away from the war, I miss very much the inherent courtesy, honesty and caring for others that came naturally to so many people. Nowadays it seems, to somewhat cynical me, that what prevails is the sorry attitude of “everyone for h/herself”. Possibly though, my feelings are coloured by being brought up by Victorians and also because I’m old and can, thank goodness, remember a gentler, less frenetic age.\r  \n\r  \nThank you, Bruce Bowers, for the A2A.",
   "created_utc": 1704707668,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvdct5",
   "message": "The toys, and holy hell I was fit from running everywhere",
   "created_utc": 1704704663,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvfirq",
   "message": "The simplicity of it. I watched a live performance of the Halo 3 soundtrack and sobbed. All because it reminded me of a simpler time.",
   "created_utc": 1704706163,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvflya",
   "message": "One thing I miss seeing is caterpillar nests in the trees. \nI miss how everything seemed back in the late 90s and early 2000s.",
   "created_utc": 1704706229,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvkga5",
   "message": "Going to Grandma's farm for the summer. Being free from stress. No worries about bills and everyday expenses.",
   "created_utc": 1704709536,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvkipl",
   "message": "I miss sleeping earlier and waking up smelling the bread of breakfast and watching cartoon",
   "created_utc": 1704709583,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvkwvf",
   "message": "Taste. With age, I get less and less satisfaction from food, to the point I don't care at all given the food is at least somewhat healthy and provides enough calories. \n\nSome say \"They don't make ice cream / burgers / whatever like they used to in my childhood\", but the sad truth is that your taste changed.",
   "created_utc": 1704709842,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvmusg",
   "message": "Being happy and not realizing how much my parents neglected me. Looking back, it's pretty obvious that they didn't love me and didn't want kids.",
   "created_utc": 1704711114,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvr6i9",
   "message": "Watching cartoons on spacetoon.",
   "created_utc": 1704713907,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvsdvn",
   "message": "Having a mind unspoiled by pornviewing and the mental disorders it brings about",
   "created_utc": 1704714659,
   "score": 3,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvf0k6",
   "message": "My parents was actually bearable it was when I was 19 actually dating and doing my own thing they became unreasonable and kinda abusive and verbal to me",
   "created_utc": 1704705813,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvfja2",
   "message": "(26F)Talking with people and not having to look at phones and take pictures of everything and just going up and knocking on my friends doors instead of texting from the road that I'm there.",
   "created_utc": 1704706173,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvga8k",
   "message": "*Christmas.*",
   "created_utc": 1704706700,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvgex9",
   "message": "Chicken with lime butter. \n\nAnd going on crazy excursions with my father where I didn’t know if I was going to live or die. (He was a drunk) it was an exhilarating experience.",
   "created_utc": 1704706793,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvh3p5",
   "message": "Feeling secure and confident, not knowing what anxiety is. I had a great childhood but rough teenage years which left me super insecure and mentally unstable. I wish I could go back to the time when I didn't worry about everything all the time.",
   "created_utc": 1704707267,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvh9tn",
   "message": "Going to the corner shops with 50p or £1 if we were lucky and going home with a huge bag of sweets and maybe a drink",
   "created_utc": 1704707383,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvo93f",
   "message": "The fun activities and sports.",
   "created_utc": 1704712000,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvqj1b",
   "message": "I miss the hope I had for my future. idk the future seemed like it would be so much better than what it ended up being....makes me sad",
   "created_utc": 1704713490,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvr4lr",
   "message": "Not worrying about bills, social media, returning text messages, my job, or the time (the adults tell you what's happening and when).",
   "created_utc": 1704713875,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvrbkq",
   "message": "Having summer break, spring break, winter break and all holidays off.",
   "created_utc": 1704713996,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvtwid",
   "message": "playng all the time whitout getting tired",
   "created_utc": 1704715593,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvu0bs",
   "message": "I look back rather fondly on the times my mom used to carry me from the car to my bedroom whenever we went back to home late from somewhere.",
   "created_utc": 1704715657,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwrjx6",
   "message": "Sleep!!!",
   "created_utc": 1704729730,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgxlts7",
   "message": "Getting up in the morning and going outside to play with my friends, and really not a care in the world.  My parents never had lots of money, but I remember there was always plenty of food to eat.  Life was carefree and good.",
   "created_utc": 1704739974,
   "score": 2,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvd024",
   "message": "Doing stupid things and not worrying about it ending up on social media",
   "created_utc": 1704704419,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvd1x0",
   "message": "No worries in the world. Not thinking about pointless shit",
   "created_utc": 1704704455,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvdurp",
   "message": "Guilt-free sadism.",
   "created_utc": 1704705005,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgve06m",
   "message": "Scholastic Book Fairs",
   "created_utc": 1704705111,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgveidq",
   "message": "Potential.",
   "created_utc": 1704705458,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvesl0",
   "message": "Being happy and be able to do nothing with no consequences. I miss those things a lot",
   "created_utc": 1704705658,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvfgr5",
   "message": "Not having to worry about getting locked up for doing dumb things",
   "created_utc": 1704706129,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvgh26",
   "message": "Tire Swings",
   "created_utc": 1704706832,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvgkfh",
   "message": "Pokemon.",
   "created_utc": 1704706899,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvgmji",
   "message": "The enthusiasm. I'm old and jaded now.",
   "created_utc": 1704706938,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvgq9h",
   "message": "Not feeling like Dave from the book the lost boy.",
   "created_utc": 1704707009,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvh67e",
   "message": "Playing doctor with uncle Joe.",
   "created_utc": 1704707315,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvh9re",
   "message": "My dad. Been gone 34 years. I’d give anything for a few minutes with him.",
   "created_utc": 1704707382,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvj0nm",
   "message": "The time that I once had.",
   "created_utc": 1704708579,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvk0tv",
   "message": "Boredom",
   "created_utc": 1704709247,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvk0ze",
   "message": "the cultural diversity and the weirdness",
   "created_utc": 1704709250,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvnlj7",
   "message": "Being excited , having a drive to do things and feeling my emotions",
   "created_utc": 1704711585,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvoa3a",
   "message": "Playing with my friends and don't think many things that can make me stress",
   "created_utc": 1704712017,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvr6qp",
   "message": "Being able to sit anywhere I wanted without people judging, ESPECIALLY in stores.",
   "created_utc": 1704713911,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvstf1",
   "message": "Not knowing how fucked up the world is and how shitty adult life is",
   "created_utc": 1704714931,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvsvi6",
   "message": "Actually nothing.",
   "created_utc": 1704714967,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvt91y",
   "message": "My innocence.",
   "created_utc": 1704715200,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvu4l2",
   "message": "What I miss from my childhood, was how much less of the internet there was. It was the 1990s, and the internet, was not exactly \"in it's infancy\", but it was certainly nowhere near what it is now.\n\nEspecially the lack of social media being mainstream. There were message boards, IRC and other methods for people to communicate over the internet, like \"chat rooms\" (I still love the movie The Net, even though one could say it's incredibly dated by today's standards, well so is Hackers, but both are still entertaining pieces of history involving computers and the internet, emphasis on \"entertaining\"), but because not too many people had or used the internet, \"social media\" was not even a phrase anybody knew or used.\n\nThat's what I miss the most. How disconnected from everybody else, everybody was. Many people were quite more private and NOT so sharing about personal shit that should never be shared with the public, etc.",
   "created_utc": 1704715728,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvu931",
   "message": "Hope that my mother would get her shit together.",
   "created_utc": 1704715804,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvw6sf",
   "message": "When YouTube wasn't like it is nowadays, when an ad was 5 seconds at most AND skippable with only ONE ad, then also when people could swear as much as they wanted without getting demonetized",
   "created_utc": 1704716897,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgvxp5t",
   "message": "Being able to eat whatever I want without getting acne.",
   "created_utc": 1704717667,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgw1249",
   "message": "the enjoyment of the everything",
   "created_utc": 1704719287,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgw5l47",
   "message": "My Grandparents.",
   "created_utc": 1704721279,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgw5mq2",
   "message": "analogue television  \n(today's digital television is so damn sensitive to signal quality)",
   "created_utc": 1704721298,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwaue3",
   "message": "Skylanders",
   "created_utc": 1704723401,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwfcnj",
   "message": "Yeah, I don't remember if it's because my family has shrunk/drifted apart, but it seemed like every week we were at somebody's house (or they were at ours)",
   "created_utc": 1704725183,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwh0sr",
   "message": "Optimism and n64.",
   "created_utc": 1704725829,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwrcxx",
   "message": "No bills or job",
   "created_utc": 1704729659,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwwi16",
   "message": "1. my old 3ds\n\n2. technology that used to have clear and fun colorful plastic",
   "created_utc": 1704731473,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgwzbwb",
   "message": "Playing DS games with my friends on the bus, watching cartoons at 6 am, having no responsibilities, and my dad.",
   "created_utc": 1704732450,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgxd2kb",
   "message": "Not much, I feel like a much better person these days.",
   "created_utc": 1704737062,
   "score": 1,
   "submission_id": "191gs84"
  },
  {
   "comment_id": "kgy7zd6",
   "message": "Not having to stress about bills, every day expenses, tuition, every little thing could go possibly go wrong financially and sink me into debt",
   "created_utc": 1704747264,
   "score": 1,
   "submission_id": "191gs84"
  }
 ]
}