{
 "submission_id": "191le46",
 "title": "What's the strangest thing you've caught someone doing in public without them realizing?",
 "selftext": "",
 "created_utc": 1704721026,
 "permalink": "/r/AskReddit/comments/191le46/whats_the_strangest_thing_youve_caught_someone/",
 "score": 143,
 "url": "https://www.reddit.com/r/AskReddit/comments/191le46/whats_the_strangest_thing_youve_caught_someone/",
 "comments": [
  {
   "comment_id": "kgwmlsy",
   "message": "I used to take the public bus to college. I once saw a guy crying on the bus. After a while I asked if he was ok, he wiped his tears away and told me he was practicing for when he got home and was gonna have a fight with his wife. I said just said ok and left him to it. He continued to practice crying 😆",
   "created_utc": 1704727929,
   "score": 42,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw8y5c",
   "message": "Someone was on a corner street and was wearing what I can only describe as clothing from Game of Thrones. He stood there for 2 hours holding a sign that said \"WINTER IS COMING\". I dunno what he was doing, but it was literally summer and it was 90 degrees outside",
   "created_utc": 1704722663,
   "score": 37,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwjetm",
   "message": "Caught someone full-on practicing interpretive dance moves while waiting for the bus. Arms flailing, spins happening – the whole routine. They were in the zone, headphones on, completely oblivious to the public audience. It was like stumbling upon a guerrilla street performance in the wild. Commuting just got a lot more entertaining that day.",
   "created_utc": 1704726735,
   "score": 62,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw9o1s",
   "message": "Had a co-worker that was working at a customer site. He had a creepy little crush on one of the women that worked there but it was apparently innocent enough that no one really cared. Until one day the woman came back from lunch and saw him pick up the cushion from her chair and sniff it. He was asked to leave.",
   "created_utc": 1704722943,
   "score": 20,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw964x",
   "message": "I heard what sounded like a \"wet\" fart and then the person stuck their hand into their pants and checked if they had poop on their fingers X(",
   "created_utc": 1704722751,
   "score": 18,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwcj3n",
   "message": "A dude called his dick out of his pants in class touched it(it was soft and it was only for a few seconds, so I’m guessing it was just itchy) and put it back in within maybe a period of three seconds. That dude was my crush and I’m still friends with him today. He was maybe 15 at the time and now he’s 18 and he still doesn’t know that I know. I still kind of like him even though it took me a few weeks to see him the same again.",
   "created_utc": 1704724051,
   "score": 14,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwxjaf",
   "message": "I was at a water park in Minneapolis, walking down a corridor, when a middle-aged woman passed me in the opposite direction. Her husband was asking her to hurry up and she responded, \"Hang on, my titty is falling out.\" As she tucked it back in, we made eye contact, and she burst out laughing. She apologized and I assured her no apology was necessary.",
   "created_utc": 1704731831,
   "score": 13,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwadkr",
   "message": "A kid ahead of me in line for Space Mountain was licking the hand rail  as he walked along.",
   "created_utc": 1704723219,
   "score": 10,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwa7w4",
   "message": "Woman cleaning her vagina with the hand sanitizer at the front of my work.",
   "created_utc": 1704723156,
   "score": 9,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwj91d",
   "message": "A half naked guy got at the university campus and started to chase the dean while doing karate moves.\n\nWhen the security came he tried to fight them back with his martial art skills and escaped.\n\nLater a friend told me he saw the same guy the previous day, practicing his moves naked under the rain.",
   "created_utc": 1704726675,
   "score": 10,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwf6nw",
   "message": "I walked in on an acquaintance at a party beating his meat to one of the statues in the garden, i just turned around and tried to drink away that memory",
   "created_utc": 1704725120,
   "score": 7,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw7knk",
   "message": "I used to hang around the city drug users to feed them and bring a bit of humanity. So saw a lot of stuff. But mostly creative ways to do drugs and relive themselves. One guy had gotten a big old doll head and mad a bong out of it. Was quite disturbing.",
   "created_utc": 1704722104,
   "score": 11,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw89li",
   "message": "We have a community drunkard masturbator way back 2019 in front of a local lingerie outlet.  \n\n\nDied during the pandemic.",
   "created_utc": 1704722388,
   "score": 5,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw9lfb",
   "message": "When I was around 10 years old I was getting curious about sex so I decided to look it up in the dictionary. Wouldn’t you know it my ultra conservative mother walks in the room so I try to play it off like I was looking up the Heida Native American tribe. She called me out for being in the S’s but I doubled down and pretended i was possibly dyslexic. What a tangled web I wove.",
   "created_utc": 1704722914,
   "score": 13,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw9my5",
   "message": "Picking and then eating their boogers. \n\nI can sympathize with picking your nose and trying to be discreet. BUT don't fucking eat it afterwards.",
   "created_utc": 1704722931,
   "score": 4,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw9rb2",
   "message": "Arguing with myself (well, not myself - the actual person just wasn't there, so I was standing in) in the mirror. With animated facial expressions and gestures. Lips moving, but with no sound. I now reserve these hypothetical arguments for the shower. When I am home alone.",
   "created_utc": 1704722976,
   "score": 4,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwaemk",
   "message": "Saw a lady eating Vegemite and strawberry jam today",
   "created_utc": 1704723230,
   "score": 4,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw9j98",
   "message": "Running in on all fours up the stairs in underwear. Didn’t realize my best friend had already come over, and I ran into him at dick level.\n\nEdit: Fuck r/AwardSpeechEdits because y’all took my medal virginity 😏\n\nBut in all sincerity I freaked out when I saw I got silvers so thanks for liking my embarrassing story",
   "created_utc": 1704722890,
   "score": 9,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw9wty",
   "message": "I was out on the town in a short dress \u0026amp; heels with my friends in college, it started to rain so we sheltered ourselves from the rain at the top of a long alley. After a while I heard weird noises coming from behind me. It was an old guy with his pants fully around his ankles masturbating 🤢",
   "created_utc": 1704723037,
   "score": 5,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgxcxtd",
   "message": "was on a trail that connected the community centre to the main street in town. got about half way and felt like someone was watching me so I looked around a made eye contact with a guy taking a shit in a bush. I picked up my pace and kept going. I guess when you gotta go you gotta go",
   "created_utc": 1704737018,
   "score": 4,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwi1kp",
   "message": "I saw a guy masturbating in his car in traffic.",
   "created_utc": 1704726223,
   "score": 2,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwi7pk",
   "message": "A grown woman sucking her thumb while driving",
   "created_utc": 1704726285,
   "score": 2,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgx02gu",
   "message": "Some lady in walmart was walking around in a sheer shirt (she looked like one of **those** women....) and had no bra on so all you saw was flab and big areolas and she was just walking around touching everything....and herself kinda ew ew ew ew!",
   "created_utc": 1704732700,
   "score": 2,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgx3ivy",
   "message": "Went to a chinese restaurant for lunch one day, and pulled around to the parking lot in the back. 2 parking spots to my left (with the one in between being empty), I saw what appeared to be a man rummaging around on the passenger side of his car. Upon closer inspection, he and a female companion were standing outside of the car and he had her bent over the seat. Turns out this relatively busy parking spot at midday was their idea of a good spot for some rough sex.\n\nTo add to all this, they had music playing, so they didn't hear me pull in. They didn't hear me and my girlfriend get out of my car either. Finally when I closed my car door, he let out a little yelp, and without ever turning around to see me, he ran to the drivers side. They both hopped in and left.",
   "created_utc": 1704733878,
   "score": 2,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwb1iv",
   "message": "Someone dropped their kids at the pool in the middle of the mall when no one was around except me. I was walking down the aisle and caught her right in the middle of it...",
   "created_utc": 1704723478,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw5ay2",
   "message": "Karens being Karens",
   "created_utc": 1704721160,
   "score": 0,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwx3fg",
   "message": "Commiting terrorism.",
   "created_utc": 1704731680,
   "score": 0,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgw8pfu",
   "message": "Guy fixing his crotch",
   "created_utc": 1704722570,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgwm3k1",
   "message": "Fishing trashbags out of the dumpster to take pictures of turkey pans to report people to the HOA.",
   "created_utc": 1704727741,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgxi408",
   "message": "Saw someone scratch his head, then stick his baby finger in his ear, spin it , sneeze, then took his finger to “scoop out” snot from his nose then eat it….",
   "created_utc": 1704738746,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgxnpj9",
   "message": "Their ass crack showing",
   "created_utc": 1704740594,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgy4huc",
   "message": "I was out with my buddy one time and we walked into a public restroom. He went up to the urinal, stripped his shirt over his head and then started pulling his pants down. Like, down. Not just open to pee. I said dude what are you doing? He sorta snapped out of it and was like \"oops autopilot\" and put his clothes back on",
   "created_utc": 1704746128,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgy8kvi",
   "message": "I see people doing ____ all the time in public! Walking their dog, grabbing lunch. Its uhhhh bizzare.",
   "created_utc": 1704747461,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgy8x4g",
   "message": "This happened yesterday, but I heard a mom say “If you weren’t my son, I’d probably marry you”\n\nwhich is absolutely fucked up",
   "created_utc": 1704747574,
   "score": 1,
   "submission_id": "191le46"
  },
  {
   "comment_id": "kgychn6",
   "message": "One time I was at the gym and resting between sets and this hot guy about 10 feet in front of me was doing pull-up.  His pants slid down and showed his ass for a second.  He quickly dropped down and pulled up his pants.  I looked away just as he glanced around to see if anyone saw.",
   "created_utc": 1704748755,
   "score": 1,
   "submission_id": "191le46"
  }
 ]
}