{
 "submission_id": "191n29g",
 "title": "What's a quote that is easily misinterpreted?",
 "selftext": "",
 "created_utc": 1704725909,
 "permalink": "/r/AskReddit/comments/191n29g/whats_a_quote_that_is_easily_misinterpreted/",
 "score": 164,
 "url": "https://www.reddit.com/r/AskReddit/comments/191n29g/whats_a_quote_that_is_easily_misinterpreted/",
 "comments": [
  {
   "comment_id": "kgwusol",
   "message": "\"Money is the root of all evil.\" It's often misquoted; the original is \"For the love of money is the root of all evil.\" The misinterpretation might make you think any money is bad, but it's really about greed causing problems.",
   "created_utc": 1704730881,
   "score": 99,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwhh0u",
   "message": "\"the customer is always right\" means if they want their steak extra well done and covered in slices of american cheese, you serve it to them. not that you do whatever they say.",
   "created_utc": 1704726003,
   "score": 79,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwocdy",
   "message": "\"The exception proves the rule.\"  What this means is that if you acknowledge the existence of an exception to a rule, you are implicitly acknowledging the existence of the rule itself.  If I put up a sign saying \"No parking on Tuesdays\" then I am acknowledging that parking is generally allowed on other days.",
   "created_utc": 1704728574,
   "score": 30,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgws2za",
   "message": "“Let them eat cake.” Firstly, Maria Antionette didn’t say it. Secondly, the original is “let them eat brioche” and the point is if the bakery is out of cheaper bread (baguette) they should be compelled to sell brioche at the same price. Which would be a very good policy to help the poor.",
   "created_utc": 1704729920,
   "score": 17,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwr4n4",
   "message": "\"Thou shalt not take thy Lord's name in vain\" \n\nit doesn't mean not to swear like \"jesus christ!\" it means do not use your \"religion\" to push a personal agenda.  in other words, almost all US Christians get this one wrong.",
   "created_utc": 1704729577,
   "score": 26,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwwtbt",
   "message": "No woman no cry",
   "created_utc": 1704731582,
   "score": 6,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwx1gc",
   "message": "\r  \n\"Blood is thicker than water.\" People often use it to emphasize family bonds, but the full phrase is \"The blood of the covenant is thicker than the water of the womb.\" Originally, it meant sworn relationships are more meaningful than family ties.",
   "created_utc": 1704731661,
   "score": 36,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwq4op",
   "message": "*It's all downhill from here.*  Pretty sure it means everything is easier from this point, and not that the situation deteriorates from this point.",
   "created_utc": 1704729220,
   "score": 5,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwxek2",
   "message": "\"The definition of insanity is doing the same thing over and over and expecting different results.\" - hate this one, it's not the definition of insanity, Einstein said this about quantum physics where quantum entanglement was random and he didn't like it, and he was wrong on that one, and you can expect different results from doing the same thing, and he also probably didn't say it lol",
   "created_utc": 1704731786,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwj8bf",
   "message": "“Every dog has its day” is a saying that means everyone gets what they deserve but it’s said in a positive manner. Too many people use it more to say “you’ll pay for that”",
   "created_utc": 1704726668,
   "score": 3,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwu9sa",
   "message": "Actions speak louder than words.",
   "created_utc": 1704730698,
   "score": 2,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwwcho",
   "message": "Not misinterpreted, but misstated. It's **Once More Unto the Breach**. Not 'into'.",
   "created_utc": 1704731419,
   "score": 2,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwwct7",
   "message": "\"Curiosity killed the cat\" is used to deter people from being curious, but the full quote means the opposite. It says \"Curiosity killed the cat, and satisfaction brought it back.\"",
   "created_utc": 1704731422,
   "score": 3,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx0589",
   "message": "\"A stitch in time saves 9.\" I have never understood what the heck that is supposed to mean.",
   "created_utc": 1704732726,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx1zsb",
   "message": "As Denny Crain said in Boston Legal:  \"Hope springs a kernel.\"",
   "created_utc": 1704733351,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx3wkk",
   "message": "\"To thine own self be true\" is generally used to justify a rather selfish approach, yet the full quote actually means the opposite:\n\nThis above all: to thine own self be true,\nAnd it must follow, as the night the day,\nThou canst not then be false to any man.\n\nTo *really* be true to oneself means to treat others properly, as evidence of one's own good character.",
   "created_utc": 1704734009,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwhthd",
   "message": "The early bird catches the worm.\r  \n\r  \nPeople toss it around to say it's good to be on time and kickstart your day early. But if you think about it too literally, it's like saying being an early riser is the best way to success. Sometimes, the best things comes when you least expect it.",
   "created_utc": 1704726137,
   "score": 4,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwqepj",
   "message": "Blessed are the cheesemakers, it’s the original quote but people think it’s blessed are the peacemakers\n\nIt’s sad to see how watered down the word of our Lord has become, so much was lost through translation",
   "created_utc": 1704729320,
   "score": 2,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwk7xn",
   "message": "\"Blood is thicker than water.\" Most people think it means that the relationships you have with people you share your DNA with are stronger than that of friends. The entire quote is \"The blood of the covenant is thicker than the water of the womb.\" Meaning the exact opposite.",
   "created_utc": 1704727036,
   "score": 5,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwo12p",
   "message": "\"The exception that proves the rule\" is a saying that is wildly misunderstood. People take it to mean that any exceptional or not ordinary event or statementis somehow validated when they say that phrase. It's not. The phrase is simply meant to point out, and emphasise, the fact that whatever was said or happened was an exception to a commonly established and well known rule, which makes it weird, not right.",
   "created_utc": 1704728460,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx5pjz",
   "message": "That “survival of the fittest” is about being physically stronger. It is in actuality about traits that are advantageous to surviving changes in the environment. Sometimes a trait that is maladaptive in one set of circumstances can be an adaptive in another. In several mass extinctions it was the little critters that lived in the shadows that survived and not the mightiest creatures that walked the land.",
   "created_utc": 1704734617,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx2gm0",
   "message": "“A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.”\n\nNOT a constitutional scholar, but a plain reading, (which is what our unelected politicians on Supreme Court state they are adhering to), seems to provide rights for gun ownership to active, or reserve duty military … not anyone who wants one.",
   "created_utc": 1704733514,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwwxmu",
   "message": "\"The early bird catches the worm.\" While it encourages promptness, it can be misinterpreted to missing out on opportunities. Success is multifaceted, and timing is just one factor.",
   "created_utc": 1704731624,
   "score": 0,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwujjr",
   "message": "[deleted]",
   "created_utc": 1704730795,
   "score": 254,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwx6oa",
   "message": "Blood is thicker than water.. its actually the opposite of what people interpret it as",
   "created_utc": 1704731710,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwrggz",
   "message": "\u0026gt;A bird in the hand is worth two in the bush\n\nI don't know about you but I prefer birds to be free to fly in a bush or wherever than shitting in my hand",
   "created_utc": 1704729695,
   "score": 253,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwwb3c",
   "message": "“The blood of the covenant is thicker than the water of the womb.”",
   "created_utc": 1704731405,
   "score": 252,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwquzi",
   "message": "Here in Germany, there is a principle about ownership, namely \"Eigentum verpflichtet\" = ownership oblige. It's only means, that with something you own, the country (= citizen) has a direct or indirect profit of it. A lot of people doesn't get it and think, this principle means something different (e.g. the owner cannot have profit from that, that isn't reasonable in their eyes). It's sometimes mind boggeling.",
   "created_utc": 1704729480,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgwy7f7",
   "message": "Adorno‘s “es gibt kein richtiges Leben im Falschen“ (there’s no correct way of life within a flawed world). I’ve seen people use it to justify the most horrible things.",
   "created_utc": 1704732065,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx2tzq",
   "message": "\"Consistency is the hobgoblin of little minds.\" Leaving out the adjective \"foolish\" changes the meaning significantly. \n\nEmerson's full quote is \"A foolish consistency is the hobgoblin of little minds, adored by little statesmen and philosophers and divines.\"",
   "created_utc": 1704733640,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx5wtc",
   "message": "\"Hell is other people\" doesn't mean that people are the worst like many people claim.\n\nFrom the author (Sartre):\n\n\"Hell is other people\" has always been misunderstood. It has been thought that what I meant by that was that our relations with other people are always poisoned, that they are invariably hellish relations. But what I really mean is something totally different. I mean that if relations with someone else are twisted, vitiated, then that other person can only be hell. Why? Because … when we think about ourselves, when we try to know ourselves … we use the knowledge of us which other people already have. We judge ourselves with the means other people have and have given us for judging ourselves.\"",
   "created_utc": 1704734685,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx601l",
   "message": "“The proof is in the pudding”. No, it’s “The proof of the pudding is in the eating”. Very different.",
   "created_utc": 1704734715,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx6a4a",
   "message": "It's not . . . \n\n\"Luke, I am your father!\"\n\nIt's . . .\n\n\"No, I am your father!\"",
   "created_utc": 1704734809,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx6cku",
   "message": "In French there is an awesome quote from a wonderful, clever guy named Desproges. He was a humorist who wrote a lot of interesting, deep and thoughtful sketches. His quote has got to be the most minsunderstood quote I know of, even I missused it at first. The quote is \"We can laugh about everything, but not with everyone\". When I was an edgy teen who loved dark humor I used it to criticize the people who felt offended by jokes I found funny. At some point I discovered the context of this quote. Desproges said it one day about the leader of the most right wing political party we had in France at the time, Jean-Marie Le Pen. This quote isn't a critique of people being too sensitive, on the contrary it explains that you should always be mindful of who you're laughing at and who you're laughing with. Realizing that was a real turning point in my perception of humor in general and its deeper meaning.",
   "created_utc": 1704734832,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx6yqz",
   "message": "This thread is a bunch of quotes Reddit thinks are misinterpreted but really aren't by normal people in real life",
   "created_utc": 1704735039,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx73ft",
   "message": "“Psych a Mike” it really is\n“Psych your mind” lol gets me every time \n\n(I just found out I was saying it incorrectly 😂)",
   "created_utc": 1704735082,
   "score": 1,
   "submission_id": "191n29g"
  },
  {
   "comment_id": "kgx7gdp",
   "message": "Lifting yourself by the boot straps.  Ppl use it un-ironically to convey the sens of working hard. But the expression was created to illustrate an impossibility, because it's it physically impossible to lift oneself by its own bootstraps",
   "created_utc": 1704735203,
   "score": 1,
   "submission_id": "191n29g"
  }
 ]
}