{
 "submission_id": "191o238",
 "title": "What are some weird, vivid dreams that you remember having?",
 "selftext": "",
 "created_utc": 1704728608,
 "permalink": "/r/AskReddit/comments/191o238/what_are_some_weird_vivid_dreams_that_you/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/191o238/what_are_some_weird_vivid_dreams_that_you/",
 "comments": [
  {
   "comment_id": "kgwq7my",
   "message": "I once had a dream where I was literally bouncing of the walls lol",
   "created_utc": 1704729250,
   "score": 16,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwql19",
   "message": "When I was a kid I was obsessed with the idea of knowing I was in a dream whilst dreaming. \n\nWhen I was 6 I did it. Didn’t last long, probably 15 seconds of dream time before I woke up. From there it became a more frequent occurrence. \n\nEventually it got to the point I had to  remind myself not to get too excited, otherwise I’d wake up. \n\nIn my younger years I shifted my dreams into what you might expect. Flying, space, underwater, stuff like that. \n\nOddly enough, I found that being able to run on all fours and leaping hundreds of feet was the most satisfying. I think it was due to the physical feeling of just pulling yourself into motion. Hard to explain. \n\nI would also have to start to fight my mind at times. For instance, if I was flying and in my dream subconscious thought, “what if I fell” those thoughts could take over. To the point it would often wake me up from concentrating too hard. \n\nWhen I got older and would realize I was dreaming, I just started having all my “personal” fantasies full-filled. Often waking up from, “the moment”.  \n\nYounger me really set up older me and I’ll forever be grateful for the years of fine tuning. 10/10 would recommend trying.",
   "created_utc": 1704729381,
   "score": 5,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwotjx",
   "message": "Be chased by multiple helicopters",
   "created_utc": 1704728750,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwou3g",
   "message": "I always have dreams where I am in some random street or just anywhere at all. Maybe a week, 2 weeks, 3 weeks later I’ll be in that exact place that I’ve dream of before. I always get creeped out and I feel some sort of nostalgia.",
   "created_utc": 1704728756,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwoxv1",
   "message": "I have a recurring dream of being in a cluttered basement, and eventually I weave through the stacks and piles and find lower levels, knowing there is something critically important to know or find at the bottom. \n\nI'll get to the bottom, usually complete chaos at that point and find a clean, well lit door and know, \"That's it!\" And that realization will wake me up every time.\n\nI've had this dream 5 or 6 times now in the past year.",
   "created_utc": 1704728793,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwoyol",
   "message": "Giant spider on the roof of my room over my bed that dropped down and ate me.\n\nRealistic as hell, could have swore I felt the fangs piercing my chest until I woke up. Weird part is... I have no problem with spiders, they're not on my list of fears. Never had another dream like it before or since, but it was over a decade ago and I remember those freakish red/black eyes like it was yesterday...",
   "created_utc": 1704728801,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwpogu",
   "message": "Was in the middle of moving, and I distinctly remember a certain box in the middle of my bedroom. In my dream, my dad, who passed in 1994, was there putting something into the box. He then closes the flaps, looks at me, smiles and then I woke up. The box was still where it was in the dream, but I just remember having a very overwhelming peaceful feeling come over me.",
   "created_utc": 1704729058,
   "score": 2,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwq2cd",
   "message": "Had normal day, woke up, done my ordinary stuff for that day, had conversations with multiple people. When woke up none of that happened and had to do all things i’ve done in dream all over again…",
   "created_utc": 1704729196,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwr8hr",
   "message": "I was in a waiting room with my girlfriend and a couple with a baby I didn’t recognize. I tried sneaking out a silent fart but it was audible. The couple assumed it was their baby with the flatulence and said “oh it’s so cute when they toot” and I smiled and agreed with them. Even in the dream I remember the look my gf gave me.",
   "created_utc": 1704729615,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgwwlys",
   "message": "Getting pulled into an intergalactic gladiator arena where you were given some kind of special power and pitted against each other to fight to the death",
   "created_utc": 1704731511,
   "score": 1,
   "submission_id": "191o238"
  },
  {
   "comment_id": "kgx1pwn",
   "message": "I was playing in a massive game of airsoft inside the Gaylord Texan resort and was coming up a curved ramp/walkway when I tagged an opponent with a few rounds. Instead of tapping out, he kept coming towards us and then peppered my 6 year old in the face with a shotgun blast of airsoft pellets at point blank range. I lunged to punch him in the face and was suddenly awake in my bed next to my terrified wife who had just been punched in the face and would soon have a black eye.\n\nApparently it’s called REM sleep behavior disorder (RBD) and it’s an early [sign of developing a Parkinsonian syndrome](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4371408/). Weird, huh.",
   "created_utc": 1704733258,
   "score": 1,
   "submission_id": "191o238"
  }
 ]
}