{
 "submission_id": "191vm9z",
 "title": "What costs way more than people realize?",
 "selftext": "",
 "created_utc": 1704746984,
 "permalink": "/r/AskReddit/comments/191vm9z/what_costs_way_more_than_people_realize/",
 "score": 154,
 "url": "https://www.reddit.com/r/AskReddit/comments/191vm9z/what_costs_way_more_than_people_realize/",
 "comments": [
  {
   "comment_id": "kgy7gk3",
   "message": "Not taking care of your teeth",
   "created_utc": 1704747093,
   "score": 56,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy7rvn",
   "message": "Pets \n\nGotta get their shots, gotta get them spayed or neutered\n\nPet ownership is not just all love and cuddles",
   "created_utc": 1704747196,
   "score": 112,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgylibu",
   "message": "Home renovations. Even things that seem small and easy",
   "created_utc": 1704751766,
   "score": 137,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy7mnb",
   "message": "Cars. Between buying them, insurance, gas and unexpected fixes, they are bottomless money pits.",
   "created_utc": 1704747148,
   "score": 232,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyca4n",
   "message": "Being poor",
   "created_utc": 1704748686,
   "score": 216,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyiu6t",
   "message": "smoking. I'm trying to quit, and some packs are as much as 24 bucks for 25 here in ontario. My preferred brands are like 13 at certain stores which is considered good these days.\n\napparently in Australia they can be like 50 bucks a pack, but I can't confirm that personally.",
   "created_utc": 1704750861,
   "score": 242,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgylp0d",
   "message": "Vet surgery bills, changing all 4 tires",
   "created_utc": 1704751830,
   "score": 75,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy859e",
   "message": "Unprotected sex",
   "created_utc": 1704747318,
   "score": 157,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyg2ns",
   "message": "Home ownership.  Taxes, insurance, maintenance, repairs, the eventual updates and all the gadgets you need to do the maintenance like lawnmowers, tools etc.",
   "created_utc": 1704749946,
   "score": 65,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy7r6a",
   "message": "Getting a comforter dry cleaned. They want 40-50 dollars when it cost 100 to buy it.",
   "created_utc": 1704747189,
   "score": 123,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyrl2p",
   "message": "A DUI",
   "created_utc": 1704753864,
   "score": 248,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgzfenr",
   "message": "Dogs. Not in how much they cost individually, but all the ancillary costs people don't associate with them. You need a vehicle that can accommodate your pet. If you rent your house, you need one that accepts pets (so far fewer options) and pay an extra deposit. \n\nThe time they cost, too. You lose a half hour in the morning if you need to walk the dog, and say goodbye to sleeping in if your dog doesn't want you to. You must go home right after work, unless you're a piece of shit who doesn't care about the poor thing... it's just a lot.\n\nI loved my dog, but life would have been a lot easier if I had waited to get one when I was more stable. \n\nI think a lot of people would be doing better if they didn't get dogs before they were in a good place to have a dog.",
   "created_utc": 1704762628,
   "score": 49,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy8rr2",
   "message": "Having kids.  From what I hear the things you need to buy for them are endless",
   "created_utc": 1704747525,
   "score": 112,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgynz9f",
   "message": "Pets.\n\nThere are a lot of people who truly do not deserve the right to own an animal. Also, there are a lot of idiots who own pets.",
   "created_utc": 1704752617,
   "score": 134,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyw642",
   "message": "Lying, having kids, quality olive oil, doing things half-arsed, buying new cars, pet dogs, drinking alcohol, forgetting your wife’s birthday, a poor diet, sitting on your arse all day, lack of exercise, buying cheap paint, not investing time in friends and family, not investing in a pension, cheap clothes, palm oil, truffles, Shumukh perfume, blue diamonds, failing to service your car, not installing a carbon monoxide monitor in your home, travelling abroad without insurance, fish and chips in Kerridge’s (Harrods, London), free software, using Google products, signing up for Facebook, using your real email address online, eating meat, postponing that visit to the doctor, avoiding paying taxes, buying more shitty products on Amazon, coming out,  religious faith, leaving a religious faith, over-sharing on Reddit :-)",
   "created_utc": 1704755498,
   "score": 139,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyqah0",
   "message": "Being too dedicated to your job and not enjoying life and family.",
   "created_utc": 1704753415,
   "score": 231,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy7oe6",
   "message": "Shipping. People have gotten this idea it should be free!!",
   "created_utc": 1704747164,
   "score": 94,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgymnt1",
   "message": "Childcare (in the US), especially in a major metropolitan area. It's not uncommon for infant/toddler childcare to cost upwards of $4000/month",
   "created_utc": 1704752161,
   "score": 250,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyln4m",
   "message": "Wedding",
   "created_utc": 1704751813,
   "score": 30,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyifpl",
   "message": "Time. Goes by fast \u0026amp; can never get it back.",
   "created_utc": 1704750727,
   "score": 201,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy7u5j",
   "message": "alcohol. \n\ndamage to your wallet, your organs, your emotional wellbeing, your relationships with others, etc etc.",
   "created_utc": 1704747217,
   "score": 121,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgzg1pd",
   "message": "Owning a pool. All my friends think I'm lucky to have 1, but between running the pump without solar, attempting to heat the pool, chemicals, cleanings, maintenance,  etc it adds up to a lot of expenses per year. Pools vary, but mine is at least 5k per year for everything. Probably use it for 3/12 months too lol",
   "created_utc": 1704762863,
   "score": 23,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyrmkl",
   "message": "Adoption. Absolutely worth it but it was at least 3x more than I anticipated.",
   "created_utc": 1704753878,
   "score": 65,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyaot6",
   "message": "Alcohol. Once I stopped drinking (well, as much as I was before) I saved some serious $$$.",
   "created_utc": 1704748157,
   "score": 19,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyp785",
   "message": "Vanlife\n\nBetween the payment if you have to finance, lot fees (nightly or monthly), maintenance, food and essentials (can't buy in bulk due to lack of space), possibly gym membership for showers or using truck stop showers... It adds up.",
   "created_utc": 1704753038,
   "score": 43,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy9det",
   "message": "Home ownership and raising a family.\n\nMortgage payments, property taxes, property insurance, maintenance/repairs in addition to the cost of health insurance for your family, food, clothing, cars, education costs, hobbies or extracurricular activities, vacations, and lots of *unforeseen expenses* caused by your children.",
   "created_utc": 1704747724,
   "score": 125,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgysx5u",
   "message": "A shitty diet.",
   "created_utc": 1704754331,
   "score": 14,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyoc4a",
   "message": "Being poor.",
   "created_utc": 1704752740,
   "score": 30,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyn7e2",
   "message": "Realtors.  Why are we paying on average $30,000 to someone to take photos of a house and list something on Zillow?  I know we are forced to pay them otherwise the other realtors won't show your house but that's a ton of money for what you get.   Also closing fees, the bank is going to make $100,000 off your mortgage, why are you also paying fees?",
   "created_utc": 1704752350,
   "score": 145,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgz71p5",
   "message": "Pets…a large emergency vet bill shouldn’t make or break your decision to keep them alive.",
   "created_utc": 1704759544,
   "score": 13,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgycmjo",
   "message": "Loyalty",
   "created_utc": 1704748800,
   "score": 33,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgz7jc7",
   "message": "Credit card interest, especially when you carry a balance over a long time.",
   "created_utc": 1704759729,
   "score": 33,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgzdtdo",
   "message": "Lakefront properties in Midwestern United States.\n\nHow many times have I heard people say, oh we are going to retire at a nice little cabin on a lake and enjoy sunsets.\n\nIn my head I say really? Do you have 500-700k for such a property?  Usually not.",
   "created_utc": 1704762041,
   "score": 39,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy9kmx",
   "message": "Anything that flys, floats, or fucks. \nRent it don't buy it.",
   "created_utc": 1704747791,
   "score": 39,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgybqtg",
   "message": "Subscriptions and takeout",
   "created_utc": 1704748510,
   "score": 26,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyeb3w",
   "message": "Printer ink",
   "created_utc": 1704749355,
   "score": 19,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgzd4ad",
   "message": "Not using a condom. 18 years of child support vs 18 cent condoms.",
   "created_utc": 1704761785,
   "score": 22,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyptrn",
   "message": "Chronic pain and diabetes",
   "created_utc": 1704753255,
   "score": 9,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgysrdq",
   "message": "Basic medicine cabinet stuff. People getting their first place don’t realize that stocking your bathroom with toothpaste, deodorant, shaving supplies, mouthwash, paper cups, toilet paper, shampoo and soap, bandaids, pain relievers, cough medicine, a thermometer, plus specifics like anti-itch stuff, pain relief sprays, stomach meds, nail care supplies, hair care supplies, brushes and combs, etc. plus cleaning supplies, not to mention towels, face cloths or whatever else you need to clean and dry your body costs a freaking fortune.\n\nWhen the young people I’m close to get their first place I give them a basic medicine cabinet care basket with some necessities plus a gift card to buy additional supplies.",
   "created_utc": 1704754274,
   "score": 9,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgzyplw",
   "message": "Youth sports.  Our kid asked to play hockey when he was 4.  It’s a slow burn, you start with hand me down equipment and just paying house fees (so maybe $500) and a day or two a week at the rink to what I’ve calculated about $15-20K a year and a significant amount of our free time. Now at just 10 years old it runs nearly $6K just to be on the team.  We drive 3 hours for each practice during the week (so fuel, food, and a reliable newish car) and stay in hotels Friday through Sunday nearly every weekend from September until March.  Then there are summer tournaments, 3v3 tournaments, pond tournaments, position camps, power skating camps, equipment, etc.  each of those can run a few hundred to a few thousand dollars each.  Next year will be worse for us because he will be in some European summer tournaments that we can’t afford.  This is our fault as parents to let this spiral so it’s tough to tell a driven kid that you can no longer afford to let them play on the team they’ve worked their ass off to make.  You begin to see how many top athletes in some sports come from families that are wealthy.\n\nBaseball isn’t as bad, but it can get pricey of you let it get out of control as well.  I’ve heard dance and cheer are $$$, but I have limited experience there.\n\nWe’d have college and a down payment on a house covered for him by now if it wasn’t for sports.",
   "created_utc": 1704769743,
   "score": 9,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyo1e8",
   "message": "Your own time",
   "created_utc": 1704752637,
   "score": 9,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgzr441",
   "message": "Elder care!  Especially if there’s a dementia diagnosis!",
   "created_utc": 1704766875,
   "score": 8,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy8ogh",
   "message": "Children",
   "created_utc": 1704747493,
   "score": 15,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyo1s7",
   "message": "Maintaining a car in the US. Insurance, repairs, emission tests, oil changes, gas...it adds up!",
   "created_utc": 1704752641,
   "score": 16,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgy7awy",
   "message": "Living on earth",
   "created_utc": 1704747042,
   "score": 41,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyr8vn",
   "message": "100% cotton bedding. Microfiber is a fraction of the costs but I do not want to sleep on hot plastic that grabs every single dog hair like Velcro. We only buy cotton sheets and they are always $40-60 more.",
   "created_utc": 1704753745,
   "score": 6,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgz7qma",
   "message": "Idk I’m poor, so… everything?",
   "created_utc": 1704759805,
   "score": 8,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kh06zj2",
   "message": "Patio furniture is egregiously expensive",
   "created_utc": 1704772924,
   "score": 8,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kgyn70c",
   "message": "Debt",
   "created_utc": 1704752346,
   "score": 6,
   "submission_id": "191vm9z"
  },
  {
   "comment_id": "kh0kmw9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "191vm9z"
  }
 ]
}