{
 "submission_id": "191vzof",
 "title": "How can you stop dwelling too much on embarrassing or awkward situations?",
 "selftext": "",
 "created_utc": 1704747881,
 "permalink": "/r/AskReddit/comments/191vzof/how_can_you_stop_dwelling_too_much_on/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/191vzof/how_can_you_stop_dwelling_too_much_on/",
 "comments": [
  {
   "comment_id": "kgya0qq",
   "message": "Mentally file it under \"Shit Happens\" and try to laugh it off.",
   "created_utc": 1704747937,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgyat24",
   "message": "Try not to spend too much time just sitting and thinking of these things. If you want to sit in silence try doing something (meditate, read, play a game, watch tv). \n\nGo for a walk to clear your head. Think about what’s literally going on around you not things that have happened in the past. Think about some future goals you have, or plans you have coming up. Keep it moving forward. \n\nThoughts become your habits, so when it does happen just try to stop, don’t feel guilty about it, and when you snap out of it try to redirect",
   "created_utc": 1704748197,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgyb1ef",
   "message": "By realizing that life is weird and you fit in perfectly. Works for me",
   "created_utc": 1704748274,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgyb2b2",
   "message": "Realize that probably no one gives a shit, theyre too busy with their own lives",
   "created_utc": 1704748283,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgyc5fv",
   "message": "I find talking to myself out loud in a private place, helps clear thoughts like this from my mind. Repeating confirming statements to myself such as, “I can’t change change it now”, “it’s done” and “move on”.",
   "created_utc": 1704748642,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgycjpo",
   "message": "You create enough of them and it gets hard to keep track of all the embarrassment. \nKidding aside, we all do and say stupid shit. Realizing the shit is stupid is how we learn to stop doing them.",
   "created_utc": 1704748774,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgyc9l6",
   "message": "I can't 😭 help",
   "created_utc": 1704748681,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgyd332",
   "message": "Find something else to focus your mind on. Read a book, get lost in a new show",
   "created_utc": 1704748952,
   "score": 1,
   "submission_id": "191vzof"
  },
  {
   "comment_id": "kgydf5y",
   "message": "You think about the fact that everyone has embarrassing moments. You think about how most of the people who society thinks is cool today were more than likely weirdo theatre kids or insecure geeky kids and suddenly I realize I’ve probably had much less embarrassing moments and become grateful that I have irrelevancy in my life that it fades away in at most a day or two  \n\nOr you realize you are the geeky kid and those embarrassing moments make you stronger and it gets easier for things to roll off your back. \n\nEither way 🤦🏾‍♀️ Nothing is ever that serious.\n\nETA: the other option is to realize that a lot of people are idiots and you also don’t gaf what they would think of you anyway.",
   "created_utc": 1704749061,
   "score": 1,
   "submission_id": "191vzof"
  }
 ]
}