{
 "submission_id": "19246au",
 "title": "Former addicts what was your \"ah ha\" moment that lead to recovery?",
 "selftext": "",
 "created_utc": 1704769110,
 "permalink": "/r/AskReddit/comments/19246au/former_addicts_what_was_your_ah_ha_moment_that/",
 "score": 34,
 "url": "https://www.reddit.com/r/AskReddit/comments/19246au/former_addicts_what_was_your_ah_ha_moment_that/",
 "comments": [
  {
   "comment_id": "kgzzfmn",
   "message": "For me, there was no incredibly profound moment of awakening. I was never arrested, never assaulted, never homeless, never watched anyone die, nothing. I just woke up one day with my then-girlfriend, and we realized that we had nothing left to sell, no more accounts to overdraft, no more money-making schemes, and it was over. I think she was the one who suggested that it was probably time we get on methadone, and that's exactly what we did. She's married now, happy, gave birth to a son a few years ago. I'm married now as well, happy, applying to law school in a couple of months and thinking about children in the not-so-distant future. Life's good.",
   "created_utc": 1704770023,
   "score": 126,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0fi4h",
   "message": "My brother got a call. It was his best friends parents telling him his best friend since elementary had died of a heroin overdose. I could hear my brother wailing from the basement and ran down to check on him. That day I told myself that I'd never let a stupid and selfish decision to get high cause my brother pain worse than that with my passing. I never bought dope again. The next day I went to my doc at the methadone clinic and asked how quickly he'd detox me. 200short days later and I was methadone free. My brother and I have always been close but I lost his trust for a long time and it took even longer to get it back. I'm married now with a beautiful and smart 5 year old daughter. My brother lives next door. We see each other regularly. He's the reason I'm alive today.",
   "created_utc": 1704776763,
   "score": 105,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh01yp4",
   "message": "I finally hit rock bottom - hospitalized, did some really stupid shit.  Got sober when I realized that every single bad thing I had done was when I was drunk.  When I truly had that realization - and really believed it and understood it - I just didn’t drink anymore.  I know it sounds simplistic to say this but for some reason that is what did it for me.",
   "created_utc": 1704770994,
   "score": 46,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kgzxro7",
   "message": "Could never imagine quitting forever….but made a deal with myself to take a break to get my life together then start using again when everything was calmed down….a couple of months go by and I realize I was happier than I had been in a long time….18 years later, still going strong",
   "created_utc": 1704769383,
   "score": 131,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0no10",
   "message": "After a stint in rehab and 9 months later I’m driving a girl to score with her daughter in the back seat the whole time thinking what the hell am I doing, then my dad calls asking where I am “ I say work” he says “no I’m here”. The situation I was in  and his voice just crushed me, met him at the detox center, called a rehab and got a bed, been 12 years.",
   "created_utc": 1704781206,
   "score": 98,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0bgj4",
   "message": "After realizing alcohol was going to kill me with liver failure or I would take my own life. Really when I started waking up in the middle of the night to pound the bottle to go back to sleep. I used to call it unconscious-ing myself. It has taken me many rehabs and relapses. 13 months clean and sober today.",
   "created_utc": 1704774836,
   "score": 14,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh120tf",
   "message": "My coke dealer sent me a message that he was worried about me when I bought too much once - led to a near OD. Imagine your addiction getting so bad that a coke dealer didn’t want to sell you coke.",
   "created_utc": 1704791192,
   "score": 80,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0hsom",
   "message": "My thing was smoking weed as a college kid about 10 years ago and my psychiatrist said I was addicted and I said I wasn’t and he told me “you won’t stop smoking cause you’re addicted” \n\nThen that day I stopped cold turkey for an entire year then never really picked it back up. Just to show that smug asshole that I wasn’t addicted. \n\nThen plot twist: I ended up working as a therapist with clients in recovery",
   "created_utc": 1704777924,
   "score": 154,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0b53r",
   "message": "I was homeless in LA, had been raped, kidnapped, beaten, i had lost everything but the clothes on my back. I was ready to die, not get clean. \nMy final moment was when i was riding the bus at night.. got off and two men followed me. I knew what was gonna happen. They punched me in the back of my head and tried to rape me, i got away and ran to someones house and banged on the door. The cops came and locked me in a psychiatric unit, for 60 days. \nI have been sober ever since. Sorry its so dark, lol.",
   "created_utc": 1704774691,
   "score": 217,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh08cqr",
   "message": "Was hooked on pills for a little over three years. Wife told me if I didn't stop that she would leave with our kids. Stopped that day, went through horrible withdraws for about a week, but I made it. 12 years clean now.",
   "created_utc": 1704773468,
   "score": 198,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh062mo",
   "message": "An email titled \"your sperm works\". \nAlmost 10yrs later im a fulltime single Dad of 2kids.\nNever look back.",
   "created_utc": 1704772572,
   "score": 63,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0btmh",
   "message": "I just got so tired, bored and frustrated of being constantly broke, tired, anxious, braindead and uninspired. There was no ‘Eureka moment’ but more of a slow, painful realization that things were bad, and had been very bad for a very long time.",
   "created_utc": 1704774999,
   "score": 114,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0hfkg",
   "message": "I had to surrender my dog to go back to treatment the last time. I had hurt myself and those I loved a lot, and was in and out of treatment for years. I got a year sober and had knee surgery and relapsed from the painkillers. Went on a very long run that again resulted in me bouncing in and out of treatment. The last time I couldn’t find somewhere to take my dog with me, no family or friends, I couldn’t afford to board her for over a month, I made sure I brought her to a no kill but fuck if that is not the shittiest thing I’ve ever done. I never would have adopted a pup in my soberity if I knew and now 5 years sober later I haven’t forgiven myself to get another dog.",
   "created_utc": 1704777737,
   "score": 45,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0k837",
   "message": "Honestly, I was just tired. I had been through years of burning bridges with people, selfishness, self pity, anger, and plenty of consequences. Nothing happened on my last day drinking, I just woke up the next day tired of living the way I had been for so long and knew I had to do something different. Went to a meeting the next day and haven’t had to drink since, one day at a time, for 3,222 days in a row. Live a pretty good life now.",
   "created_utc": 1704779230,
   "score": 41,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0idst",
   "message": "the man i was seeing broke my nose. i decided i was done drinking because i was so blackout i couldn’t defend myself. 2 weeks later, found out i was pregnant. protection order was dropped and i moved back home. i’m 21 weeks now and i don’t think ill go back to drinking once my baby is here.",
   "created_utc": 1704778237,
   "score": 87,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kgzzymc",
   "message": "It didn’t end up being a moment for me. I stopped drinking and eventually I fell in love with how my brain worked. Sobriety is like cocaine when you’re used to being drowsy all the time.",
   "created_utc": 1704770226,
   "score": 133,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0bkur",
   "message": "I saw someone else with my same addiction, and realized how sad it actually was. It wasn’t an instant recovery for me, but my eyes were at least opened to how damaging addiction is to yourself and others",
   "created_utc": 1704774891,
   "score": 37,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0c1rm",
   "message": "When I realized that if I needed emergency care or surgery, there was no way I'd be given enough pain medication to overcome my tolerance.",
   "created_utc": 1704775103,
   "score": 48,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh08p5n",
   "message": "Pregnancy.",
   "created_utc": 1704773611,
   "score": 18,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kgzz61m",
   "message": "I’ve been addicted to a few different things. The first was an RC opiate. My addiction led to the end of my 3 year long relationship. My life continued to spiral and I told myself “this doesn’t have to be the very last time you do this drug, but you have to take a break to get your shit together”. I loved doing that drug but being able to think “I can do it again when I’m in a better place” instead of “I can never do it again” helped me a lot. I did end up doing it again but only a couple times and that initial break helped me a lot. \n\nLater on, I was addicted to meth. My ex girlfriend (the relationship mentioned above) wanted to meet up. To get some closure I guess. When we met up, she asked if I was sober. I was honest and said I wasn’t. She said that when I got clean, she would like to be there to support me. One month later, I quit meth, and exactly one month after that, I had a celebration dinner for 30 days clean with my friend group. I invited my ex. She declined. But I’m still appreciative that the initial offer gave me the motivation to quit, even if she didn’t follow through.\n\nWhile I was addicted to meth, I also got addicted to heroin. Eventually I found myself hating heroin and just not enjoying it at all, it was a chore to stay functional and made me miserable. I got off it by seeing a psychiatrist and getting a script for suboxone. I owe my life to that, I wouldn’t have been able to get off it without that.",
   "created_utc": 1704769922,
   "score": 57,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0gals",
   "message": "I had a dream death walked into my room and told I was going to die if I didn’t stop, except I felt awake. \n\nI’d been feeling off so that was that. One beer the next day and an AA meeting. Once I read the promises I became obsessed I wanted them so bad.",
   "created_utc": 1704777158,
   "score": 17,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh054wy",
   "message": "It was when I'd run out of everything I could sell, quit my job and decided to live in a caravan. \nAnother time I was living in a caravan, same deal, run out of everything and moved in to a house.\nUnfortunately there have been a few times I've had to  move and restart a life. Goes well and builds up for around 2 years then wash rinse repeat.",
   "created_utc": 1704772198,
   "score": 17,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh17c46",
   "message": "I was trying to kill myself with alcohol, so I finally decided that I either needed to end myself straight up instead of going the long way about it or just quit drinking and give life one last proper go and do it sober. A month tomorrow will be 2 years sober.",
   "created_utc": 1704795282,
   "score": 14,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0qjxb",
   "message": "Pretext to the moment: Summer 2008 after living with my parents for a few years, struggling with heroin addiction on and off, and the ability to consistently function as a contributing member of society, I got laid off from a job, and spent most days 'finding money', getting high, and then playing World of Warcraft until 5am, rinse and repeat.  My parents woke me up one morning in late August, brought me into the kitchen and displayed a cache of needles, pipes, torches, pills, cookers, and other assorted addiction ephemera that their latest search of my bedroom had revealed.  'Last straw, you need to go or we are calling the police'.  The only thing that honestly got me to leave was the $100 I had stolen from a friend the day before, which was sitting in my pocket and ready to be delivered to my drug dealer in exchange for another taste of momentary joy.\n\nI went to detox for a week, a few days later. From there, I begged to go home but was flat out refused.  Instead, I went to further treatment where I almost instantly befriended a kid whose commitment to recovery was even shakier than mine.  Within a few days, we hatched a scheme, got a package dropped off, and got lit in the bathroom of our treatment program, in a way that was immediately noticeable to everyone else.  'Random surprise urine' mysteriously appeared for us the next morning.  I was out of there before breakfast was finished.\n\nContext - I ended up finding a place to stay after a week on the street/living out of my car/staying on people's couches.  This kid I knew had an extra bedroom he rented to me on a week to week basis.  I was getting a steady unemployment check, so most of that went to pay rent.  I spent most days while living there hustling money for dope by stealing and returning blocks of cheese from the local chain of grocery stores which would honor returns for items under 20$.  I'd drive around, steal cheese, return said cheese, rinse and repeat until I got up to 40$ - then I would swing by the spot and cop a bag.  \n\nThe kid I was staying with, Eric, used dope also, but was more of a polysubstance user, dope some days, meth and G other days, he didn't have a steady heroin habit exactly, and he started to get annoyed with the lifestyle I was clearly living in active addiction.  Day-to-day hustle and survival.  I couldn't think more than a day or two into the future, and had no longterm plan for myself nor any interest in trying to figure out one.  He told me I should start figuring out where else to go, called me a bad influence on him (he wasn't wrong, but he wasn't really the best influence on himself more than anything).  \n\nWe had a big fight and I stayed at another friend's house that night.  I got a text from Eric asking me if I could cop him a bag.  I gave him a hard time for the fact that he had literally just said I was a bad influence and I should find somewhere else to live, but now was asking me to get him dope.  I told him to fuck off.\n\nThe next night, October 3, 2008, I come home.  I didn't have a key (not like it's any mystery why he was resistant to giving me one....) so usually I just knocked on the window and he'd let me in.  HIs AC was on, as were the lights, so I assumed he was in his room, but after knocking a few times, no one answered.  I go around back, break into my own bedroom (which was the saddest place I've laid my head in all of my life - a mattress on the floor, piles of clothes mixed in between dirty, somewhat clean, and maybe clean?, a coffee tin for cigarettes, a laptop, a few books, and a wall charger for the two burner cell phones I had.  The walls were dirty and the floor was begging for some kind of rug.  It looked like a drug addict lived in there - which I suppose was true... \n\nI go to Eric's room and bang on the door \"WTF dude, why didn't you let me in?\" I assumed he was just being a dick over the argument the day before.  As I banged, his door started to open, and this smell suddenly fills my nostrils.  It was like pungent bad cheese, mixed with purified air from the AC.  Whatever glitchy techno playlist his winamp was dutifully chugging through was on on the computer, lights were on, web browser was open, but Eric wasn't there.\n\nI was confused, it appeared like he'd just up and left but didn't shut his stuff down.  I thought that perhaps he'd gone to the store or was out with a friend, so I started to close the door only to notice his feet.\n\nEric was laying face down under his desk.  His body was stiff, like a wet log.  It took me a few seconds to flip him onto his back.  I could tell he was dead immediately - his face was still his face, but something was gone -it's whatever we see in other humans to know that they're alive and participating in the world.  There was nothing, just an empty stare and a gray hue that seemed to have slightly tinted every part of him.  The dried vomit at his mouth was also hard to ignore.\n\nI became quite upset.  It was a moment where you mind just starts independently yelling at yourself stuff like \"OH FUCK OH FUCK OH FUCK THIS CAN'T BE HAPPENING BUT THIS IS REALLY HAPPENING\".\n\nI had to charge my burner phones in order to call 911, and they kept dying as they had barely enough charge to turn on even though they were plugged in.  It took like 10 minutes for me to actually reach EMS and communicate that there was someone who was potentially dead in my apartment. \n\nI remember hearing the sirens as they started to come - it was distant at first, indistinguishable from the 1000s of times I've heard sirens in my life time.  Slowly, and then quickly, they got closer.  Soon they were undeniably the sirens I had summoned, and they were parked outside.  Within moments this still sepulchre of this young man's attempt at making a home which had now become the last home he'd ever occupy, was filled with the chaos of strangers - paramedics quickly confirming that he was indeed deceased, police who noted that this appeared to be drug related, and also appeared to note that my life appeared to be drug related, and various people who came in and out to do different things.  I was mostly checked out, trying to make it through a moment at a time.  \n\nThe Sgt asked me if I had contact info for next of kin.  I knew he had parents, that they lived in florida, and that he was supposedly \"clean\" which is why he'd moved back here after cleaning up and living with them over the past few years.  I didn't even know their first name.  I called a few friends, delivered awful news  because I had to explain why I need  information like this at 1am on a Sunday morning, and finally got the number.\n\nIt was that phone-call that I sat in the room and listened to - that was the ah-ha moment.  It was hearing one side of a conversation, but being able to sense how that person on the other side is reacting based on how the person on your end seems to respond to the replies from the stranger on the other end.\n\n\"I hate to inform you of this, but your son has died, likely from a heroin overdose.\".  What I assume her reply to this news - news that meant every hope and dream she'd ever held for her baby boy, every moment of silly happiness, every school acceptance letter, every prize in art ( he was a dope artist) all of it.... all of those things and so many more, family parties, first dates, prom pictures, graduation, - her reply to the new news probably sounded like this:  'Oh.....(sigh).... okay....thanks for letting us know.\"\n\nIt was that moment, because that would have been my mom.  That's what would happen to me on the night I died from an overdose, because that was what the end result of the path I was walking would be.  \n\nThere's a second part to this story - the following week, I was told I couldn't get into detox despite them having beds open, becauser my Mass Health had been turned off.  Why?  Well, I was mailed something (which I never received due to homelessness) that I needed to fill out in order to recertify.  I hadn't been a long term medicaid recipient, so this was uncharted territory for me.  A quick phone call later and I was asked the 3 or 4 questions they needed, and informed that my insurance would be turned on....! (in 4 weeks, on November 1st).  This meant that I had a month to go before I could go to detox, in a state funded bed that used state funded insurance to further fund, but for some reason had to wait for the fist of next month to become active. and usable.\n\nThose weeks that went by were honestly felt with this creepring fear that I would die before making it to the end of the month.  I was able to crash with a friend for most of it, but stayed in my car for some of it, or just wandered until it was time to go grocery farming for cheese dollars, rinse and repeat.\n\nIf Eric hadn't died, I wouldn't have recovered at that time, maybe not ever.  I don't know if I'd have recovered before fentnayl hit, killing most of the people I've known to use street opioids.  I don't know if I\"d have recovered and been able to apply to go to grad school for a dual degree in social work and public health, working individually with drug users but also wanting to help work with the system as a whole.  All of that, and so much more of the last 15 years is thanks to him.\n\nEric's death can never, and will never, be in vain.  I have made sure of that.  I try to honor him every day through the work I do, and the advocacy I do on behalf of people like us.  I even had the pleasure, and honor, of talking with his mom a few years back, and helping her to understand some of the things that happened.  She told me I was the last person they had a record of him talking to, but that my declining to get him heroin was the reason they didn't turn my info over to police.  \n\nI have had some other pretty big eye openers, but that one takes the cake.",
   "created_utc": 1704782997,
   "score": 56,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0di32",
   "message": "Not me, but my brother had stolen from every family member, gotten the police called on him, was cut out of family events, etc. What finally did it was when our cousin (who still hang out with him) OD’d while brother was in jail. He woke up and a couple of our uncles sprang for rehab so the same (OD death) wouldn’t happen to him. He figured it out, got sober and has 3 great kids and a nice wife now.",
   "created_utc": 1704775793,
   "score": 14,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh11q5r",
   "message": "I looked at myself in the mirror after a 4 day binge. My eyes looked like someone with a terminal illness. I figured I'd have about a year left if that and my daughter was around 4 yrs old at the time. She would have been the one to find me. I wasn't going out like that. I started therapy that week (this was in 2004), and it took time, but I will have 17 years of pretty awesome living this April. Yay me!!!",
   "created_utc": 1704790966,
   "score": 16,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh02x8j",
   "message": "Thought I needed it to feel fulfilled but couldn’t think of a single moment where it actually made me feel good about myself",
   "created_utc": 1704771359,
   "score": 27,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0atnp",
   "message": "Jaaaiiillll",
   "created_utc": 1704774546,
   "score": 14,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0kxft",
   "message": "I just realized the lifestyle wasn't sustainable and I'd forever be miserable if I didn't slow my roll.\n\nedit: and withdrawal has been the only motivator I need to never relapse. Worst experience of my life.",
   "created_utc": 1704779621,
   "score": 12,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0l780",
   "message": "I kept vomiting mucus, refusing to accept that alcohol had done serious damage to my stomach. One day a switch just flipped and I knew I had to stop",
   "created_utc": 1704779775,
   "score": 13,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh05bhv",
   "message": "Covid hit, and I panicked at the idea of closures. Went to 6-7 different liquor stores in one night to make sure I wouldn’t run out.",
   "created_utc": 1704772269,
   "score": 29,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0ejah",
   "message": "My best friend called my mom and told on me. My mom, who I have immense respect and love for, knowing what I was doing with drugs was the wake up I needed.",
   "created_utc": 1704776291,
   "score": 26,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh03gu3",
   "message": "Losing everything….everythin",
   "created_utc": 1704771565,
   "score": 10,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0mg2m",
   "message": "I was done being an addict. I was going to be a 30 year old living on the streets with no future. All the dreams I had for my future were shattered because of my fentanyl addiction. I don’t have another relapse in me. I don’t want to be six feet under pushing daisies. I actually want to live life and be genuinely happy.",
   "created_utc": 1704780486,
   "score": 11,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0g0pi",
   "message": "Was addicted to Percocet’s first I dabbled in Xanax and lean also but once the Percocet’s stopped getting me as high as I wanted I started to take fentanyl and that’s when my life got taken away from me I couldn’t go a single day without snorting fentanyl 2-3 times a day it ruined my life and almost every relationship I had my gf broke up with me I lost a lot of my real friends and started hanging out with bad people in bad areas because that’s where the drugs were I ended up ODing one night and died for 5 minutes luckily someone called 911 and the paramedics were able to revive me after that I never took another pill and am completely sober from alcohol and weed as well i turned my life over to my lord and savior Jesus Christ and I’ve realized my life is so much better without those drugs in the moment you never think things will get better and you take those drugs to numb the pain you feel but there is so much more to life and I’m glad jesus has helped me realize that",
   "created_utc": 1704777019,
   "score": 33,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0hbdb",
   "message": "Cocaine induced pulmonary embolism definitely helped me never touch cocaine again. \n\nFunny about that.",
   "created_utc": 1704777677,
   "score": 10,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0rqo9",
   "message": "I’m a shopaholic.\n\nMy turning point was when all my cards were finally maxed and my time was completely taken up with maintaining the stuff in my world.",
   "created_utc": 1704783768,
   "score": 10,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh09fv0",
   "message": "I found out I was gonna be a dad and didn’t want to be that kind of dad",
   "created_utc": 1704773929,
   "score": 18,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0fsuq",
   "message": "I had a really bad panic attack smoking some weed and thought I was dying. I looked at my dogs concerned little face and thought to myself, \"What would happen to him if I die right here?\" I quit cold turkey the next day.",
   "created_utc": 1704776910,
   "score": 19,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0hnsp",
   "message": "Missed yet another morning meeting at work and my boss sat me down and said if it happens again they're not going to have a choice but to fire me.  Went out to my car in the parking lot and cried, and realized I had a serious problem on my hands.",
   "created_utc": 1704777854,
   "score": 18,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0ux7v",
   "message": "I was laying in bed one morning after a long night of partying, and drugs. My heart was racing, I couldn't catch my breath, I was sweating and all I wanted was for that feeling to pass. I had ruined relationships, ruined opportunities. but nothing came close to the feeling of disappointing my mom if I had to be taken to the hospital. \n\nTo add to that, I have a very reactive mastiff and I had spent a whole year without her while I moved across the country and settled down. When I got her back I knew she needed my undivided attention, and needed me to be the best version of myself. Since I've had her with me, I've been sober and its another example of how my dog has saved my life every day for the past 8 years.",
   "created_utc": 1704785937,
   "score": 8,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0yk2f",
   "message": "There was no ah-ha moment. It was years of homelessness and years of deterioration that beat me into submission. I had created this feedback loop of dopamine using needles and masturbation, and I burnt myself out.\n\nDid meth for years and years and years and my body was ruined, my relationships were all ruined, my social standing in my little town was all ruined, everything  was just ruined.\n\nI would wash myself in ice cold water and dishsoap and spend every minute frantically trying to get more drugs only to fuckin’ do it all over again every day. I got tired. I hated it, I hated my life and I finally put in the work and now I’m going on like 7 years (not counting the relapses, which would put me at like 4 years) \n\nI got a great job, a great house, we go to restaurants when we are lazy to cook, etc. Life is good and it’s a blessing and I will never go back to that life",
   "created_utc": 1704788563,
   "score": 8,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1ar49",
   "message": "Being an addict is almost impossible to describe - which is why former addicts make the best people to talk to - they've done it themselves.\n\nWhen people say \"How could they steal from their parents?!\", the decision to steal something almost isn't a decision, it's really strange unless you've experienced it yourself.\n\nLots of addicts say things like \"I'll always be an addict\" even if they've been clean for years. And it's true - one slip and you'll be right back at square 0.",
   "created_utc": 1704797832,
   "score": 9,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0f6px",
   "message": "I came to 2 important realizations while I was high on mushrooms. The first is that every excuse we make for others is really just a lie we are telling to ourselves, and the second is that every action we take is a choice",
   "created_utc": 1704776610,
   "score": 15,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0hgm0",
   "message": "I picked up from a different person because I couldn't get in touch with my usual person. \n\nI did a line and within 5 mins it didn't feel like it normally did (I was very lucky that my usual guy was the direct source). I flushed the not normal bag down the toilet and haven't tried it since. I dont want to die over a short high, and consider myself lucky I never tried something that lasts longer that could have potentially killed me.\n\nI was addicted to \"snow\"",
   "created_utc": 1704777751,
   "score": 16,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0rjqs",
   "message": "Jail for 20 hrs was enough for me I was already sick and tired of it so that did it 7 years ago this April",
   "created_utc": 1704783638,
   "score": 7,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0wr1h",
   "message": "For someone close to me, they were caught stealing money out of their toddlers piggy bank. What a low point.",
   "created_utc": 1704787245,
   "score": 8,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0be7d",
   "message": "Prison",
   "created_utc": 1704774806,
   "score": 12,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0l0yg",
   "message": "Getting pregnant and becoming a mom. Saved my life !",
   "created_utc": 1704779676,
   "score": 6,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0wusv",
   "message": "looking my kids in the face telling them I couldnt afford fun stuff for them when I so obviously was using all our money on fun stuff for me. Couldnt take the guilt.",
   "created_utc": 1704787320,
   "score": 6,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh069da",
   "message": "When I wanted to stop and didn’t wanna do it everyday but I realized I couldn’t. \nThat was a rough realization.",
   "created_utc": 1704772644,
   "score": 9,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0rwgc",
   "message": "We just got tired. 20 ish years of the life was enough. Miss it occasionally but vacations, records and spoiling my daughter is just more worthwhile.",
   "created_utc": 1704783875,
   "score": 5,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0wt0q",
   "message": "Got a DUI. Two nights in a freezing cell was more than enough for me",
   "created_utc": 1704787283,
   "score": 4,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0n5v4",
   "message": "I knew I was drinking to cope with emotional pain and abuse for years and years. I finally got myself away from the things causing me pain and picked a date (5-6 months out) that I would stop drinking. I stopped just fine and will be a year without booze on Jan 16th.\n\nI hope one day I can casually enjoy drinking again like I used to, but I’m in no rush and still have plenty of work to do on myself.\n\nI never did AA meetings. I don’t get why people want to sit around in a circle dwelling in the past about how they all messed up their lives. Would rather move on and look towards the future.",
   "created_utc": 1704780909,
   "score": 13,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0pve3",
   "message": "Alcoholic, I technically had 2 \"Ah ha\" moments. I've been to rehab twice, of my own doing. I joke that the first time it didnt stick, but if it hadnt been for the first time I wouldn't of really had the capacity to realize it. Anyway...\n\nThe first time, TLDR dog needed to be put down. Family were at the vet with the dog, it was being done. They called to let me know if I wanted to come say my goodbyes. It was like 11am on a Saturday and I was already about 1/2 way through a handle of vodka I opened Friday night. I was coherent enough to get the phone call, realize what was going on. I went to get my keys but stopped myself. And had to lie to them and say I couldn't make it because 'I wasnt feeling good'. It didnt even really like click she had been put down until I came out of the binge/black out and saw all the texts. And like the absolute shame and feeling that I didnt get the chance to say goodbye / be there her (the dog). For some reason that just really really hit me. I'd missed a shit ton of other \"major\" events through the years. But for some reason that like hurt hurt. Or maybe more so, shame?\n\nSecond time there really wasn't a trigger for it. What started as one beer at a BBQ or group thing/event gradually became a shot or two a night, and eventually I was back to 500ml bottle of vodka and change (on a work night), and on weekends I was drinking a handle and change. It just like clicked that I'd convinced myself it was okay and that normal people dont drink this much daily. Like it was literally this \"Aww fuck wait, how did this happen.\" Kinda thought that had crept in and then I couldnt get it out of my head and then thought it all the way through. And I just was like \"fuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuccccccccccccccccccck\".",
   "created_utc": 1704782564,
   "score": 10,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0rzk3",
   "message": "I got locked up doing dumb shit finally got my shit together for a year and half fucked up again and started doing that vs again and got locked up again. Then I finally finished probation and thought because I was done I can go back n do that shit again big mistake. Now I been clean for like 2years and fuck them dam drugs brother. Was never worth it drugs don't discriminate they'll get your ass",
   "created_utc": 1704783932,
   "score": 4,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0sm7u",
   "message": "I wouldn’t say I had a “ah ha” moment per say but technically it would be when I woke up in a m___ house looked around at everyone sleeping on the floor and realized this isn’t how I wanted to live my life and that I wanted to do better then my bio dad did when he was at my age. Called my mother that morning… went home with her… locked myself in my room and detoxed alone for a while. Not the safest or smartest way to do it. \n\nI am now extremely cautious about everything that was a former addiction and I’ve learned better ways so I can help others to recovery when they reach out for help.",
   "created_utc": 1704784351,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0xdwl",
   "message": "Delirium tremens",
   "created_utc": 1704787703,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1964t",
   "message": "I had a really bad issue with alcohol for about a year because it was my only escape from my shitty abusive relationships. I came to awakening when I found out I was pregnant. I knew that I had to stop right then for a few reasons. \n\n1.) I didn’t want to hurt my baby\n2.) I’d never find my way out of that relationship if I didn’t and my kid needed at least one good parent. \n3.) I remembered every time I ever felt shitty because of my dads actions or lack of, because he was also an alcoholic. \n\nIt was really hard, but not drinking anymore gave me clarity on a lot of things. Eventually my ex and I moved in with my mom, I had the baby and I finally got the courage and support to kick my ex to the curb. I started working and even though I still struggled mentally I was doing a lot better overall.",
   "created_utc": 1704796664,
   "score": 5,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1zgoo",
   "message": "I just realized I wasn’t giving anyone my best self, as corny as that sounds. I have a lot to offer, and was cutting it down for alcohol in the evenings.",
   "created_utc": 1704810689,
   "score": 5,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0od4j",
   "message": "Consequences. Relationships damaged or destroyed, legal realities, watching friends acquaintances and family members die. \n\nRealizing I had no grip on moderation with an obsessive and compulsive need to get intoxicated. \n\nI’ll always be an addict, its symptoms will however change over time.",
   "created_utc": 1704781630,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0tjm4",
   "message": "Well, there I was, realizing I spent more time trying to find the TV remote in a pizza box than I did on any meaningful life pursuits. It hit me – my \"ah ha\" moment wasn't a spiritual awakening; it was the absurdity of choosing between cheesy residue on the remote or flipping channels with greasy fingers. I decided I needed a detox from both the substances and the questionable lifestyle choices. Recovery became my way of breaking up with bad habits and embracing a cleaner, crumb-free existence.",
   "created_utc": 1704784979,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0uq2n",
   "message": "When I was sober I remembered how bad I felt when I was high",
   "created_utc": 1704785800,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh18170",
   "message": "Spite and rock bottom.",
   "created_utc": 1704795800,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1pel5",
   "message": "The increase of police arrests, bruises, blackouts and visits to the emergency room.",
   "created_utc": 1704806349,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1qobm",
   "message": "My deceased Mom had been coming to my Dad in his dreams, telling him he needed to confront me. He did, we don't have the kind of relationship where that conversation comes easily, so it really hit me hard. I haven't felt the urge to drink since. I was a daily drinker for 11 years, towards the end I was up to a 24 pack a day. I know this says addicts, but I love sharing my experience as a loser drunk. \n\nI have been sober since 10.22.2017.",
   "created_utc": 1704806936,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1vvbo",
   "message": "I fell asleep drunk in bed next to my daughter and next morning my wife found a bottle of easy to open Percocet under the covers. Shear luck my wife found them and not my young daughter. I knew I needed help then but it still took some time now 16 years sober from everything except cigarettes.",
   "created_utc": 1704809212,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1xomp",
   "message": "Woke up in a psych ward after a particularly bad blackout on benzos. After that I got clean and never touched them again, benzos are scary shit",
   "created_utc": 1704809970,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh27udq",
   "message": "No “ah ha” moment for me. I knew I was an addict deep down. It took years of guilt, shame, circles of repeated behaviour and mistakes, loss of relationships, financial ruin, job interference, lying, manipulation, hospitalisation, using and drinking even when I didn’t want to. There were times I would be crying my eyes out because I didn’t want to drink, while gulping down beer. I got sick of my own shit basically and headed to a meeting",
   "created_utc": 1704813863,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh28jfm",
   "message": "I felt like my family was reaching their tipping point, and beyond that just deserved a better life than what I was subjecting them too. I had previously been homeless and as a low-functioning alcoholic I knew that without my families help I would certainly be homeless again and die a homeless drunk on the streets. Also my health was starting to take a turn for the worse and I developed a big hard gut. I was in rehab for the second time in 2 months, back to back stints basically. I saw a possibility for a better life for myself and I took it. Never looked back. Fuck drinking.",
   "created_utc": 1704814114,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh2x3xy",
   "message": "It was binge eating disorder, not a substance addiction but probably when I had started eating clay and raw flour and water paste because my parents locked away the snacks",
   "created_utc": 1704822450,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh30v5p",
   "message": "My niece was born, that's honestly all it took. I wanted to be around to see her grow up and knew if I continued with the path I was on that probably wasn't going to happen, I got clean on 9/21/20, so a little over 3 years now.",
   "created_utc": 1704823673,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh39iwu",
   "message": "I was waking up every morning at 4am in an absolute panic. I could barely leave the house and no combination of alcohol or drugs would fix it anymore. No choice but to get sober.",
   "created_utc": 1704826500,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0xxic",
   "message": "[deleted]",
   "created_utc": 1704788101,
   "score": 5,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh15rpk",
   "message": "I woke up in my rapist bed. Had flashes of the night before with her on top of me, no memory of how I got there. Her daughter woke me up, calling me her mom’s boyfriend name saying good bye on her way to school. \nI was shit face drunk/hung over, had been living at the bottom of a bottle for almost two years. \nGot dressed and sat in my car for two hours realizing this was rock bottom and I need to change.",
   "created_utc": 1704794088,
   "score": 4,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0vdny",
   "message": "Blowing half my savings.  \n\nHaving a confrontation with the people I was trying to impress and realizing I would never do enough, have enough, or be enough for them.  \n\nFinding friendship and fulfillment elsewhere",
   "created_utc": 1704786259,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh11hwa",
   "message": "I take a medication that if I consume alcohol with I might die",
   "created_utc": 1704790792,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh13jk7",
   "message": "I was on my way to becoming alcohol dependent for happiness, or to feel anything at all. My aha moment was the day after I went out drinking and I completely blacked out the night. The friend that I was with recounted my night and it was quite messy and shameful. I never want to experience anything like that again. I've also have had friends recount to me times that I've been drunk and cried in front of them during times where it wasn't really appropriate. Now I rarely drink. Only for special occasions and not enough to get drunk.",
   "created_utc": 1704792372,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh13kre",
   "message": "The craving only lasts a few minutes. So if you suppress it for these few minutes, you're good to go.",
   "created_utc": 1704792397,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1httx",
   "message": "So interesting to see the number of people who had an “ah ha” moment vs people who didn’t and just stopped for whatever other reason.",
   "created_utc": 1704802387,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1qvkm",
   "message": "The moment I realized some people are allergic to peanuts, I am allergic to alcohol and cocaine",
   "created_utc": 1704807028,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1r5v3",
   "message": "Addicted to smoking weed… the ah ha moments that led me to quitting??? \n\nI noticed it became harder to fall asleep because I developed a wheeze. I was coughing every day. Almost every minute. Activities I love like playing basketball wasn’t the same as I was gasping for air every 5-10 seconds. \n\nThe kicker that woke me up to change my lifestyle was I literally felt in my chest, my left lung beginning to lean/sag and almost became elastic feeling when filling with air. \n\nI haven’t smoked in 7-8 months, left it behind in 2023. Damn near all of my symptoms are gone. No wheeze, no need for an inhaler. I sleep better, I perform better when cardio is involved… \n\nIdk, Im 24 and was already feeling the effects of years of bad habits. Im still in a stage where I can heal real well. Didn’t want to keep the shitty habits until my 40’s and all of sudden I’m dealing with major life threatening issues. \n\nI hope others see the dangers of smoking even if they can’t feel it yet. Thankfully I quit and it’s not something I think or crave over… got it out my habits and it’s been a good decision.",
   "created_utc": 1704807159,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1r9ug",
   "message": "Figured out I'm allergic to alcohol. Whenever I drank, I broke out in handcuffs.",
   "created_utc": 1704807211,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1sxnh",
   "message": "I had snuck my last few bags of heroin/fentanyl into detox. I went to detox cause I couldn't get clean on my own living five minutes from Kensington and I was on the verge of losing my fiance at the time and cat. The first couple days in I was still getting high. On day two it was time for me to take my first dose of subutex taper. I took it. Don't know why. I just did. It was all part of the divine plan I suppose. But i went into precipitated withdrawal like I'd never experienced. And I had a realization. I don't have to keep doing this to myself. When I started to feel normal again it was like an exorcism had taken place. All the staff said it was the craziest turnaround they had ever seen. My fiance barely recognized my voice over the phone. Been clean since going on two years now. Married with a beautiful 8 month old.",
   "created_utc": 1704807950,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1vx4i",
   "message": "I couldn’t imagine myself quitting pot , but then a friend of mine introduced me to meth and I got hooked on it , I wasted some years being high and because of that my academic performance were getting worse.One day my parents found me high and I still remember it clearly I could see my mom crying seeing me in such a state. That was the moment I realized I need to get myself back together because honestly I can’t see my mum crying and well here I am after 11 years sober enjoying my life :) , I completed my bachelor and then I did my master degree and now I’m working in a gaming studio. Honestly life is going good :) and hopefully it will get better as well",
   "created_utc": 1704809232,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh2abav",
   "message": "Woke up after a bender, realized that none of this shit is going to change unless I do something about it and that my dad was going to die soon whether I liked it or not, so I had better make sure that there was only one funeral and not a funeral and a hospital or two funerals.",
   "created_utc": 1704814746,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh2c0u1",
   "message": "A really close friend said \"Hey, what you're doing seems a lot like stuff an addicted person does.\"",
   "created_utc": 1704815348,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh2epet",
   "message": "Not one moment but a series of moments throughout a relationship with somebody—he was sober when we met and things were good, I drank way less to be present with him and I liked that. Then he picked up drinking again and things went downhill from there.\n\n\nIn the last few months before we broke up, he'd drink until he blacked out and said or did really upsetting things. Some of the things he said were so targeted towards my personal wounds, that's when I knew we had to break up. We were also pretty broke and he'd spend most of his money on alcohol and then borrow money from me to get by/drink more. Then in the months between the breakup and him moving out, drinking caused even worse problems that I don't know how to talk about.\n\n\nFor a while after he was gone, I drank more. But every time I got drunk I thought of my ex, and I knew if I kept going I would become like him. After that, alcohol lost most of its hold on me. I still drink, rarely, and I have to be careful because once I've had one I want two. But I mostly don't drink. For all the ways that relationship hurt, and as much as I hope he finds recovery someday, I'm grateful that witnessing his behavior up close helped set me free.",
   "created_utc": 1704816280,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh2nbu2",
   "message": "Pregnancy",
   "created_utc": 1704819238,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh2o1rg",
   "message": "my husband \u0026amp; i had gotten a settlement from a motorcycle accident we were in \u0026amp; within a month, it was gone, he got arrested \u0026amp; we lost custody of our oldest kid. 6 1/2 years later, we’re still together, have custody of our oldest again, have an 18 month old \u0026amp; he works in an adult treatment center for addiction.",
   "created_utc": 1704819475,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh36ir2",
   "message": "My 10yo old daughter saw me hungover for the 100th time and looked at me with the expression of an adult and asked \"are you ok?\" for the first time I can recall, I replied \"no. i drank too much last night and I don't feel well.\" and that was that. I never drank again. I will never forgive myself for all the times they felt unsafe as a result of my drinking and promised from that point forward they could always, always trust me to to be 100% present for them.",
   "created_utc": 1704825525,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh37741",
   "message": "Had a nasty coke habit in my 20s. Witnessed a few friends OD and that slowed me down a bit but when I saw my brother die from a heroin overdose that did it for me I was scared straight",
   "created_utc": 1704825744,
   "score": 2,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0cbg0",
   "message": "Moved to a town that has drug buses blocking every entrance every weekend, can't afford to loose my license",
   "created_utc": 1704775229,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0n5ey",
   "message": "Poop knife",
   "created_utc": 1704780902,
   "score": 3,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0lyh3",
   "message": "There are no former addicts. If you're an addict you are an addict for life. To deny this is only fooling yourself. There are non practicing addicts which includes myself. There was no \"ah ha\" moment. My heart attack pretty much decided the course of my life from that moment on...",
   "created_utc": 1704780205,
   "score": 255,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1zwnd",
   "message": "The only substance I've ever been addicted to was nicotine.",
   "created_utc": 1704810868,
   "score": 0,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0nzr2",
   "message": "I was so hurt by the world in 2020-2022 that I cried so much until I had enough of crying about the fake stuff like stock option trading and the girl I lost my virginity to in 2020. They were all fake and their only motive was to hurt me and make me look bad and crazy so they didn't have to take the blame on anything that happened in my life.. lols",
   "created_utc": 1704781402,
   "score": 254,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0qtmc",
   "message": "Ah ha! I am severely addicted to Nany. Sad she is gone, at least I have preserved her ghlomerulus. Help me.",
   "created_utc": 1704783169,
   "score": 255,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh147y3",
   "message": "im gonna catch another sti from grandpa if i do this one more time",
   "created_utc": 1704792899,
   "score": 255,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0zrqy",
   "message": "When I realized that no one likes a pussy",
   "created_utc": 1704789477,
   "score": 251,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0xj7r",
   "message": "I was permanently banned",
   "created_utc": 1704787809,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh0yqqg",
   "message": "It's so difficult",
   "created_utc": 1704788703,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh171gr",
   "message": "12 years addicted to heroin... 18 clean. The point was when I was charged with battery and pregnant and almost went to jail..",
   "created_utc": 1704795058,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1b8xw",
   "message": "Realized I gained over 30+ pounds and was in a very unhappy place mentally and physically. Knew I had to drop the weight and the drugs only contributed it. Currently lost all the weight that I gained!",
   "created_utc": 1704798185,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh1zhxd",
   "message": "Lost a bet of pro wrestling and realized that my life is no longer manageable.  \n\nSummerslam 1996.",
   "created_utc": 1704810703,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh3fc0j",
   "message": "Ah ha - I lost my apartment in the West Village and I'm sleeping in my parents suburban basement",
   "created_utc": 1704828400,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh3pcuj",
   "message": "I was addicted to coffee to a point of drinking \\~6 litres a day. \n\nI'd wake up and be totally normal, drink 2 small cups for breakfast, when I got to college/uni I'd have two half-litre cups with me, one ½-liter mug and one thermus, I'd fill them both with just black coffee and when I was done with the mug, the thermus was drinking-temp. I'd refill both once before lunch. During lunch I'd have a small cup from the canteen, and then back to school - another two refills until school ended. \n\nWhen I got home, I'd make 1-2 litres of coffee to drink after dinner, which I normally drank at around 9pm to 11pm. \n\none day I woke up with a massive headache, shaking and barely able to keep my balance. \n\nWent cold turkey, and after around 3 days, I didn't really have that need for coffee anymore, and I started again, but this time at a moderate level, so now I drink around 2-3 normal-sized cups a day",
   "created_utc": 1704831696,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh43usr",
   "message": "One day I was just getting high and my dad walked in and said, “I called this place and they said you’re next on the list. It can be 2 days or 2 weeks. You wanna go?”  I’ve never gone to detox/treatment before, so I said “sure”. Went to detox then went to treatment about 1.5 hours away from home and just stayed out here after. Was always planning on moving back, but ended up getting a great job and got married. Coming up on 5 years now.",
   "created_utc": 1704836443,
   "score": 1,
   "submission_id": "19246au"
  },
  {
   "comment_id": "kh44q0g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "19246au"
  }
 ]
}