{
 "submission_id": "1924d39",
 "title": "What are rich people problems like?",
 "selftext": "",
 "created_utc": 1704769601,
 "permalink": "/r/AskReddit/comments/1924d39/what_are_rich_people_problems_like/",
 "score": 5,
 "url": "https://www.reddit.com/r/AskReddit/comments/1924d39/what_are_rich_people_problems_like/",
 "comments": [
  {
   "comment_id": "kgzzuc7",
   "message": "No one values you. Every relationship you have is transactional. Wealth demands an uncanny amount of attention, energy and resources to manage. In any given day more people are trying to contact you than there are minutes in the day. You don’t own the money, the assets or resources; they own you.",
   "created_utc": 1704770179,
   "score": 28,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh00yrm",
   "message": "The rich have problems too, sometimes of the same nature and sometimes of a different nature as less wealthy people. Rich people can suffer from depression or get sick from the same illnesses as everyone else.",
   "created_utc": 1704770613,
   "score": 8,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kgzz7pp",
   "message": "The tax man and litigation can be real headaches for anyone regardless of income.",
   "created_utc": 1704769940,
   "score": 7,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kgzzef6",
   "message": "My aunt and uncle are rich, and when they retired they sold their house and bought a giant RV with the plans on traveling around North America for a few years before finally settling somewhere they liked.\n\nThey had a ton of problems not having a fixed mailing address and basically being vagrants. For years we received mail for them because my parents let them put our address down for certain non legal/governmental things.",
   "created_utc": 1704770011,
   "score": 4,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kgzzsud",
   "message": "They're similar to middle-class and poor people problems, but they can throw money at many of them to make them go away.",
   "created_utc": 1704770163,
   "score": 5,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh01cuz",
   "message": "They often involve parental disapproval, emotional immaturity, fear of intimacy and self loathing, but with good orthodontics and Hugo Boss.",
   "created_utc": 1704770763,
   "score": 4,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh08hbl",
   "message": "A lot of people answer these posts from a position of pain and resentment. I get it. I’ve lived on cheese and crackers before. I’ve worked in call centers and restaurants and not been able to pay bills, everything hanging on by a thread. 20 years later I am in a much better position. Not super rich but I feel wealthy and very fortunate. A lot of my friends have a similar story, they worked their way through law school or med school and took on a shitload of debt. Nearing 50 years old, you have recently or nearly paid off your debt and have savings, investments, and some retirement. From that perspective, you’re not worrying about putting food on the table but there are problems that cause a lot of stress. Here are a few:\n- not losing all of your retirement in bad investments\n- damaged reputation and potential exclusion from friends and professional groups for no fault of your own. For example, losing your job from layoffs, people always wonder if you fucked up\n- feeling like you constantly have to work or you might lose your job but also feeling guilty that you don’t spend time with your family and friends\n- worrying about your kids for all the normal reasons\n- feeling a sense of responsibility to help other family members, friends and acquaintances figure out their problems and getting frustrated when you go above and beyond to help someone the way you wish you had been helped and they throw it away\n- and realizing that if you’re not happy in life, a lot of that is on your own shoulders, there is no one else to blame",
   "created_utc": 1704773521,
   "score": 4,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kgzyi1z",
   "message": "Don't mind me, I'm monitoring the answers to this question so that I can trade with people.",
   "created_utc": 1704769660,
   "score": 3,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh01fzr",
   "message": "Just watch an episode of Real Housewives of anywhere and you'll know.",
   "created_utc": 1704770797,
   "score": 3,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh01cnd",
   "message": "Fear of Guillotines needs to increase 1000%",
   "created_utc": 1704770761,
   "score": 5,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh039nh",
   "message": "No seats left in first class",
   "created_utc": 1704771489,
   "score": 4,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh021dh",
   "message": "At mid-levels of riches (think a few million), the problem is mostly how to secure it against going away (insurance, trusts). At larger levels, living becomes problematic - you need special everything, because the social aspect of being richer than the people you interact with makes everything harder. At extreme levels of wealth, you get the problem of how your money is impacting the world. You should really do something meaningful with it, but what that could be and how to go about doing so is a question that's not easy to answer.",
   "created_utc": 1704771022,
   "score": 2,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0402f",
   "message": "how to make sure your kids won't squander the wealth.",
   "created_utc": 1704771769,
   "score": 2,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0cc51",
   "message": "Probably bitch and complain about their drug problems or their stupid ass kids",
   "created_utc": 1704775238,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kgzzgo9",
   "message": "Deciding to travel for a year, to delay taking over the company from daddy",
   "created_utc": 1704770034,
   "score": 3,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh03wix",
   "message": "Threy always want more and more, never ending satisfaction",
   "created_utc": 1704771731,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kgzyrp9",
   "message": "fake problems",
   "created_utc": 1704769766,
   "score": 0,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh034o9",
   "message": "They don’t really deal with thinks until they are catastrophic. They throw money at little problems and they are put off until they become way out of control.\n\nEspecially addiction. Lots of money buys lots of drugs, and no one cares that you miss work or need to do laundry or grocery shopping. So you just get really addicted without any consequences.\n\nYou have family/relationship problems. They feel better if you are relaxed on vacation. So instead of working on them you just take a vacation and forget them. Nothing gets fixed until you are ready to blow everything up.\n\nYou have zero life skills and no way to make income. But who gives a fuck? You just chill. Then suddenly you don’t have an assistant to do those things and you don’t even know where to start learning.",
   "created_utc": 1704771438,
   "score": 0,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh03ic0",
   "message": "Relatives trying to steal ur hard work, especially if coming from a poor background. Emphasis on the rags to riches people, they have it the worst. Their whole social group changes (except for very few authentic friends), relatives feel as though they can just take your newfound wealth, etc. Rich born rich understand how to tackle these problems because their parents taught them, rags to riches people don’t.",
   "created_utc": 1704771582,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh04kzr",
   "message": "Elon Musk and Vladimir Putin are likely the two of the richest people on earth. They both have problems that are well documented. These problems are largely self-inflicted, but I would not want to trade places with either of them.",
   "created_utc": 1704771990,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh057yq",
   "message": "Horrible because you have to find a reason to continue living beyond meeting your basic needs.",
   "created_utc": 1704772231,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh071ec",
   "message": "Dealing with poor people being jelly",
   "created_utc": 1704772944,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh07dri",
   "message": "Where to invest and where to find tax loopholes",
   "created_utc": 1704773080,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh088t2",
   "message": "It's common for wealthy parents to throw money at their kids instead of being there for them and supporting them emotionally. Then, when the kids grow up, they are emotionally immature from not being supported as a child, and do the same thing to their own children",
   "created_utc": 1704773423,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh094jk",
   "message": "Probably taxes",
   "created_utc": 1704773794,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh096pt",
   "message": "Sadness, depression \u0026amp; loneliness is universal among us all. No matter what you think money will not change your insides.",
   "created_utc": 1704773819,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh09u25",
   "message": "Life gets boring",
   "created_utc": 1704774100,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0aewz",
   "message": "Rich is a very relative term.  I'm from a very lower middle class family. 4 kids and the dollars were always stretched.  That more than anything drove me to save and invest.  My family were also very hard workers and I took that from them.  But most of the real problems in life (health, depression, relationships with your friends are family) aren't that different. Motivation can also become a problem if you find yourself sitting in cash some times.  Money doesn't buy happiness. But it definitely allows one to focus on things more than week to week financial survival. You get into situations though in which a relative doesn't understand how you can take your kids skiing for a week in Colorado but you can't \"loan\" them $3K because they are behind on their bills.",
   "created_utc": 1704774358,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0d8or",
   "message": "Drugs and excesses.",
   "created_utc": 1704775667,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0epe5",
   "message": "I’m no billionaire, but would probably qualify as rich to most people. I’ve always struggled with severe depression, and growing up middle class, I had this little bit of hope that maybe my depression would be less bad if I became rich one day. \n\nNow, I’m a rich adult and still have severe depression. I go on incredible vacations and have taken long periods of time off of work and eat wonderful meals and drive cool cars and spend tons of money out of pocket for experimental depression treatments. And I still want to die most of the time. \n\nIt’s devastating to know that no matter how great my life is, I’ll still have this broken miserable brain. At least when I was middle class, there was hope that I could be less sad, if only my life circumstances changed. Now I know better.",
   "created_utc": 1704776375,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0f1qh",
   "message": "They wonder why they’re rich but not happy. Or they’re happy. Rich people! They’re just like us! I was a nanny for a well known huge white collar criminal’s family. Guliani put him in prison.",
   "created_utc": 1704776542,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0gmta",
   "message": "Petty and conflated",
   "created_utc": 1704777330,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0hbp1",
   "message": "My husband is a mover. A regular client had forgotten about a multimillion dollar condo she had. So when she got rid of it, she threw out a bunch of stuff. including brand new 100$ feather pillows, 90$ bottles of shampoo, her entire spice cabinet and much more BRAND new high quality items. He brought it all home and we donated what we didn't want/need. But it's insane the stuff rich people will just toss in the dump instead of just donating.",
   "created_utc": 1704777682,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0hev9",
   "message": "Perspective. I grew up very poor and I’m not necessarily rich now but I’m very comfortable. Some problems like self loathing, depression or anxiety don’t go away no matter how much money you have. I constantly need to remind myself to be grateful for all that I have instead of resentful for what I don’t.",
   "created_utc": 1704777727,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0idfy",
   "message": "I was driving through Bel Air today during rush hour. Traffic was backed up on Sunset Blvd because of, well, it's rush hour LA, and there are traffic lights and more cars than can fit on the road, blah, blah. \n\nThere was a black Bentley convertible that just couldn't wait, so they drove up the middle emergency lane to bypass traffic. Just so happens, I was at the front of the light, so they pulled up next to me. And, of course, I refused to let them in when the light turned, so they got back in line a few cars behind me.\n\nThey changed into the right lane and passed me at some point. At the next light, I see a car ahead of me pull out and zoom up the middle emergency lane again. Yup, unmistakable Bentley tail lights.\n\nI can only imagine the anxiety they must've felt.",
   "created_utc": 1704778232,
   "score": 1,
   "submission_id": "1924d39"
  },
  {
   "comment_id": "kh0ik80",
   "message": "If you’re new money, your friends and family will resent you. Even if you bring them into business dealings, pay for vacations, give them luxury gifts. There will always be resentment.",
   "created_utc": 1704778332,
   "score": 1,
   "submission_id": "1924d39"
  }
 ]
}