{
 "submission_id": "1925e0u",
 "title": "Those that did a DNA test, what's the most bizarre/shocking thing you have discovered?",
 "selftext": "",
 "created_utc": 1704772613,
 "permalink": "/r/AskReddit/comments/1925e0u/those_that_did_a_dna_test_whats_the_most/",
 "score": 58,
 "url": "https://www.reddit.com/r/AskReddit/comments/1925e0u/those_that_did_a_dna_test_whats_the_most/",
 "comments": [
  {
   "comment_id": "kh0ngrg",
   "message": "My very snobby prim and proper family member (by marriage only) found out her grandmother was actually a prostitute who went on the run after killing her husband.\n\nHer crimes tallied up to:\n\nProstituting in 4 countries where it was illegal\n3 separate counts of bigamy\n2 of murder\nMultiple thefts\nMultiple assaults\n\nFamily member tried hiding the results lol",
   "created_utc": 1704781089,
   "score": 132,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0n5tk",
   "message": "My friend found out he decended from Nazis that fled to Argentina. He was told he was Argentinian his whole life... turns out that was somewhat accurate.",
   "created_utc": 1704780909,
   "score": 103,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh08mgo",
   "message": "Just head over to /r/23andme and search by top.  The most screwed up one I saw on there was a dude and his girlfriend of two took it.  Turned out the were half sibling, and both were from the same sperm donor.  Proof and everything was in the post.  The girl immediately broke it off after finding out. The dude was in limbo wanting to make it work.",
   "created_utc": 1704773581,
   "score": 225,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0lpiz",
   "message": "I guess I could pretend that I was shocked to find out my dad is not my biological father.\n\nI didn't think he wasn't, but I knew there was a possibility considering my mom's... social habits. Turns out my father is my dad's best friend and the kid I played with as a toddler was my half brother. Both are dead, as is my mom, so my dad and I just don't acknowledge it and carry on as usual.",
   "created_utc": 1704780064,
   "score": 38,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0oomb",
   "message": "ETA: I can’t believe how this blew up! I’m trying to respond to everyone’s questions, but here are a few bits:\n\n-Grandpa and this woman were in LUV.  My cousin hasd boxes of artifacts from their relationship. They went to family weddings together, socialized publicly, etc. \n\n-apparently in these days, parents had to give permission for a girl to marry a foreigner. (Don’t know if this was a legal thing, or a societal pressure thing.). But the bottom line was that her parents wouldn’t give permission. He still sent money and photos and stuff, and so they decided to tell him the baby had died in hopes that he would stop trying. It worked. \n\n-Grandpa went on and got married and had 3 kids, then split and got married again, this time to my grandma. But my whole life, he got SO emotional when talking about NL. More so than Italy or Germany, where he was also stationed. I always throught that this was because he was part of the liberation of holland, so he felt more connected to the people there. (I was kind of right!)\n\n-my Dutch cousin and his family are AMAZING. They invited my partner and I to NL last year, and the best way I can phrase is is “we met as strangers, and we left as family”. We still talk all the time. His 8 year old daughter loves to make fun of my Canadian accent when I try to speak Dutch, and I love that. \n\n-\n2nd edit: just a fun story. When I visited NL, I was lucky enough to go to my cousin’s anniversary party and meet a couple hundred wonderful locals. They kept excitedly calling us the “Kennedys”, and my partner and I were sooo confused, but flattered. (We thought maybe it was slang for North Americans? We had no idea!)\nFast forward a couple of days, and we went to the cemetery for Canadian soldiers and saw the sign….. Canadese is Dutch for Canadians. 🤣\n\n\n\n\n\n\n\n\nGrandpa fathered a baby in the Netherlands at the end of WW2. Her parents didn’t want her coming back to Canada with him, so they told him the baby died of pneumonia around age 3. \n\nI didn’t find out until grandpa had been dead for about 15 years. Found grandpa’s name on another family tree and sent a “hi! And you are?” message. Immediately got back “we’ve been looking for you all for years” message. \n\nFast forward a few years, and my dutch cousin has some to visit us in Canada, and I have been to the Netherlands to meet a huge family I never knew about. It’s wild. \n\nI",
   "created_utc": 1704781829,
   "score": 173,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0p5fn",
   "message": "I was contacted by my FULL OLDER BROTHER two years ago. \n\nMy parents gave him up, got married a year later, then had me and my siblings. Mother took the secret to the grave. \n\nI thought I was the oldest all my life - named after my dad. Now I find out I had an older brother all along!",
   "created_utc": 1704782114,
   "score": 157,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0qb5a",
   "message": "I told my grandma I did 23 and me. She promptly freaked out and sat my dad and I down and said that she did not birth him, but also did not adopt him. A doctor at the hospital she worked at gave him to her, and she had to keep it a secret or multiple people would've lost their jobs. I'm not sure what I believe at this point.",
   "created_utc": 1704782842,
   "score": 28,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0khut",
   "message": "Turns out my father is not my bio father. Apparently my mom’s cousin is my bio father. So my second cousin is now my half-brother/second cousin and my sister is now my half-sister/second cousin. Both my bio parents are considered my first cousins once removed as well. \n\nMy dad has known since I was two years old but still chose to raise me. I just found out last year. It was a big family secret that kind of split the family which is especially unfortunate because a lot of people did not know about this situation which means they did not know why the family split. My half-brother still does not know about me.\n\nWe also learned that both my grandfathers are not my great-grandfathers bio sons. They still share a dad, but it turns out my great-grandfather met and married my great-grandmother while she was pregnant and decided to raise the two boys as his own. He unfortunately passed away two years ago and it was a complete secret from everyone. \n\nNow there are multiple generations in my family all figuring out how to go about having new siblings and new bio parents.",
   "created_utc": 1704779381,
   "score": 29,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0oo7c",
   "message": "Sadly, I learned that I am, in fact, actually related to my dumpster fire of a family. I'd always secretly hoped I was adopted...",
   "created_utc": 1704781821,
   "score": 86,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0tzqo",
   "message": "Found out I had an aunt on my dad’s side who was given up cause she was conceived during an affair. Her adoptive parents lived in the same town, and she went to school with my dad but didn’t know he was her half brother. She was also in my mom’s friend group, so that when I saw her and asked my mom if she knew her she was like, yeah, I’ll call her right now...  \n\nIt was wild. My grandma denies it all too…",
   "created_utc": 1704785290,
   "score": 228,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0obqy",
   "message": "That I'm actually Jewish and my last name isn't German. My grandparents changed it to sound more German for.....reasons. My dad didn't even know. The second he found out he started connecting with distant relatives and pulled it all together. Even found some documents with our real last name.",
   "created_utc": 1704781606,
   "score": 251,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0ygb1",
   "message": "My best friend found out a few years ago, in her late forties, that she has two half sisters from a different mother. Her sisters knew she existed, and even her first name, but didn’t know anything else about her. Her sisters are just like her. Same eyes, smile, and hair. Same shoe size. Same great sense of humor, deep compassion, and strong intellect. The physical resemblance is shocking enough, but it was hearing all three of them laugh in the exact same way that tripped me out the most.",
   "created_utc": 1704788487,
   "score": 179,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0e7hr",
   "message": "My great uncle fathered a child while fighting in the Vietnam War. The kid was one of the operation babylift kids and grew up in Ohio. My dad found him on 23andme, started talking, and he eventually flew out for a little family reunion. Great guy with an amazing life story.",
   "created_utc": 1704776130,
   "score": 221,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0pb76",
   "message": "I was adopted and my kids got me 23andMe for mother's Day a few years back. I found out that my bio mother had seven babies and gave them all up for adoption. And that her father had gone to prison for moonshining, learned how to counterfeit while he was in prison, got out and started doing that and got busted and went back to prison. Actually my bio mother's side of the family is pretty wild and crazy in a lot of ways.",
   "created_utc": 1704782211,
   "score": 79,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0p0fi",
   "message": "Not me, but my great-aunt.\n\nGrowing up, her siblings joked that their neighbor was her real father because she looked different from them. That turned out to be true.\n\nTo add to that, her sister (my grandmother) had a son with the neighbor's son, so my great-aunt is my uncle's aunt on both sides.",
   "created_utc": 1704782030,
   "score": 199,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0x625",
   "message": "My father raped teenage girls that he taught.\n\nI found out that I had siblings and nieces/nephews.\n\nAlso found out why other kids Moms would throw me out of the house once they knew my full name.\n\nFound out that some of my teachers were his victims.\n\nAnd more keeps coming.",
   "created_utc": 1704787547,
   "score": 192,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0u6mw",
   "message": "Found out I'm donor conceived, at 31. So far I have 13 half siblings.",
   "created_utc": 1704785423,
   "score": 134,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0nmgr",
   "message": "Ok, found out wife’s great grandfather married his sister.  Changed last name to avoid detection, moved\n , all that.",
   "created_utc": 1704781181,
   "score": 33,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh06ry8",
   "message": "I have a half brother living somewhere in the USA who is 30 or so years older than me",
   "created_utc": 1704772842,
   "score": 90,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0oeyr",
   "message": "Confirmed a longstanding family rumor that my great-grandmother on my mother's side had a shotgun marriage in order to hide her fondness for spicy Italian sausage.",
   "created_utc": 1704781662,
   "score": 219,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0t1m1",
   "message": "I found out I was a descendant of 41 skeletons found in a burial cave (the Lichtenstein Hole) in Germany dating back 2500 years.  Apparently they were either Frisians or Visigoths.  They found another descendant less than 5kms from the cave.  The descendants of Cheddar Man in the UK have an even older lineage.  Seems I always come second.",
   "created_utc": 1704784644,
   "score": 173,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0ulqq",
   "message": "I found out about my Russian ancestry\n\nApparently in 1918 my great-great grandparents fled Russia as they were owners and owned a big ass goat farm. They were somehow related to the Royal family AFAIK. Then they fled to bulgaria.",
   "created_utc": 1704785718,
   "score": 72,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0kqd6",
   "message": "I have the genetics of an elite power athlete\n\nEdit: the phenotype does not match the genotype",
   "created_utc": 1704779511,
   "score": 163,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0vmfn",
   "message": "Husbands ex wife “had a hunch” their daughter (8at time) looked like a highschool friend. On a “whim “she pulled a hair while the girl slept and tested it over winter break. My husband isn’t the father. I had my suspicions but it didn’t change anything he’s always been her dad. The mom had the bio dad write a threatening letter saying we better give the girl to him ( a total stranger to her )  \n\nWe ignored and waited for a letter from a court… never came. He has zero interest it turns out. Mom knew all along and is a piece of human shit.",
   "created_utc": 1704786432,
   "score": 167,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0kz7g",
   "message": "That my Mom's Dad (my Grandpa) wasn't her bio Dad. She had no idea either and found out at 74 that the man who raised her wasn't her biogical Father.",
   "created_utc": 1704779648,
   "score": 150,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0njv6",
   "message": "My cousin is an IP lawyer and says to never put your DNA on any record.",
   "created_utc": 1704781140,
   "score": 96,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0t62k",
   "message": "We had a woman in our family tree that we were always told was indigenous Canadian. She was too far back to reap any benefits like scholarships or whatnot, but it was very common knowledge that she existed.\n\nMy mom got into genealogy a few years back and did a 23 and me or something and it came back with NO native blood. She did some deep research to find out who this woman was and discovered that she was a drinker and a smoker and generally not well liked. Calling her indigenous was in fact a slur with no factual backing. Iirc, she was actually French.",
   "created_utc": 1704784729,
   "score": 229,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0nv7m",
   "message": "Uncle-Brother",
   "created_utc": 1704781325,
   "score": 182,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0tcfh",
   "message": "My cousin did 23 and me hoping for something exotic to share with people, to stand out and be interesting\n\n99% ashkenazi Jewish, 1% Eastern European. He complained on Facebook about it. L’fuckin’Cheim",
   "created_utc": 1704784846,
   "score": 141,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh12nmx",
   "message": "[deleted]",
   "created_utc": 1704791681,
   "score": 137,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0w4x3",
   "message": "A certain genetic disease runs in my family, and it’s basically a coin flip at birth whether or not it progresses into something fatal as you grow from baby to child. If caught early enough it can be treated, and we have learned (as a family) through a lot of death what the symptoms look like. Basically if anyone under 6 in my family starts having pneumonia symptoms, we immediately test them for this family disease. If they test positive for it, the issues with the heart and lungs can be fixed through surgery. It’s always fatal if it progresses, but treatable if caught early enough.\n\nMy uncle fathered a son while deployed in Japan. He had no idea, and we didn’t as well. 45 ish years he did a 23 and me test and connected with my grandma. He only ended up reaching out to us (my mom cause grandma was pretty lost to dementia at this point) because his son was hospitalized with a strange form of pneumonia that wasn’t improving. My mom immediately gave him all the information on the disease, treatment plan, and diagnosis. His son made a full recovery, and he was grateful to my mom. But he doesn’t want anything to do with my family, and is understandable pretty bitter towards my uncle.\n\nEDIT: took a while cause I had to talk to a few family members but the disease is called pleuropulmonary blastoma. It’s genetic (and recessive fortunately) and I could be a carrier but I won’t know unless I get tested for it specifically or have a child that has this cancer. Probably unlikely because non of my siblings, nieces or nephews have the disease.\n\nhttps://www.cancer.gov/types/lung/patient/child-pleuropulmonary-blastoma-treatment-pdq#:~:text=Pleuropulmonary%20blastoma%20is%20a%20type,the%20risk%20of%20pleuropulmonary%20blastoma",
   "created_utc": 1704786796,
   "score": 57,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0ojf2",
   "message": "All my genes are from well north of the 50th. I'm so melanin-deficient I was born in a snowbank to an ancestral line of polar bears. If archeologists are ever looking for Neanderthals, they might be my more tropical cousins.",
   "created_utc": 1704781739,
   "score": 169,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0ooxj",
   "message": "Lots of neanderthal DNA",
   "created_utc": 1704781834,
   "score": 83,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0rbyv",
   "message": "I’m Chinese. My parents are Chinese. Their parents were all Chinese. I was surprised to find out that I am indeed, 100% Chinese.",
   "created_utc": 1704783497,
   "score": 47,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0qqlf",
   "message": "Found out I had an older brother that we never knew about, including my dad!",
   "created_utc": 1704783114,
   "score": 79,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh15hu5",
   "message": "Turns out I have a lot of Neanderthal DNA. My little sister laughed at me, until the fact that we share the same parents began sink in, lol.",
   "created_utc": 1704793878,
   "score": 67,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1bajj",
   "message": "My wife discovered her late mother was secretly selling babies to the highest bidding families. She has multiple brothers and sisters throughout the country.",
   "created_utc": 1704798218,
   "score": 30,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh208aj",
   "message": "The rumours my grandmother heard about us having royal blood in the family were true..\n\nStill poor as fuck but bow down to me peasants",
   "created_utc": 1704810995,
   "score": 30,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0ser5",
   "message": "I'm a half sibling. Brother and I took one and it showed that we only shared dna from our mother. So the man who raised me for 19 years of my life until they divorced, wasn't even my biological father. I was 29 when I found out. Nothing changed between my siblings and I.\n\nI did confront my mom about it one time. She basically said she was young and fucking around.",
   "created_utc": 1704784213,
   "score": 110,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0npuu",
   "message": "I’m 24% Tai/Thai. \n\nI’m supposed to be 90% Vietnamese, 10% Chinese. I got 65% Vietnamese, 24% Tai, 11% Southern Han. No one can account for the Thai ancestry. If it were simply admixture, I don’t think it’d be so high, and it doesn’t show up on my maternal cousin’s results, which means it’s coming from my father. I think his mother may have been Thai, and she may not have even known.",
   "created_utc": 1704781236,
   "score": 152,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0rdw1",
   "message": "I did genetic testing for health because I have autoimmune issues. The most surprising and unexpected but totally makes sense result I got was the revelation that I have reduced enzyme that’s key to metabolizing acetaminophen, so basically Tylenol never seemed to work for me and now I know why.",
   "created_utc": 1704783531,
   "score": 56,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0t8on",
   "message": "I was always told as a child, (adopted),  my bio father was an attorney. Flash forward after I’m tested. Tons of cousins all sending messages as to who I am.  Track down a lady who “knew” my bio mom, she named the father, who was a lawyer, couldn’t remember the mother’s name. 🤔🤔.  Flash forward and my DNA has no relations of his family which are in the base.  Turns out, bio mom was having sex with at least 2 people, and told this guy he was my father. He in turn paid her off to save his family as he was married.  Poor dude went to his grave with what he thought was a terrible secret that was not.  I guess I’ll never know who she or my actual bio dad is. 🤷🏼‍♂️🤷🏼‍♂️",
   "created_utc": 1704784777,
   "score": 53,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0ae8s",
   "message": "There was a long post of many interesting results just the other day. Can’t remember if it was on this sub or 23andme.",
   "created_utc": 1704774350,
   "score": 119,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh13tfo",
   "message": "It told me that I have a high tolerance for pain and that I'm a fast caffeine metabolizer.   \n\nThat explained why I can drink a lot of coffee and take a nap 30 minutes later.  I was always shocked that some people can't have caffeine later in the day if they want to have a good night's sleep.\n\nIf I've had the same injury or medical procedure as you and you are having a lot of pain, I figured you were just whiny or malingering to get attention.\n\nSometimes, DNA tests are the best way to add a little empathy to your soul.",
   "created_utc": 1704792584,
   "score": 25,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1elt8",
   "message": "My dad was estranged from his family as a teenager and didn't reconnect with his mom till he was about 30. Whenever I would ask about his dad to anyone in my new-to-me family (I was about 11 when I met them) I would be given the cold shoulder. My grandmother and bio-grandfather were only married for about 1.5 years and there are no photos of him, no history of him and no one in the family seemed to know much. My grandmother remarried when my dad was about two and my grandmother illegally gave my dad the new husband's last name and hair raised him that way. \n\nFast forward to adulthood, sending my spit to 23 and me and Ancestry and getting some distant relative DNA results to my dad's dad's side of things and researching my bio-grandfather's real name from the marriage certificate to my grandmother in 1957. My grandmother  was definitely pregnant when she got married. I reached out to some biological relatives via the sites and once I mentioned who my potential bio grandfather is I get blocked. It's happened more than once and I can't seem to get past this road block of trying to find anything more. Doesn't seem like a big deal, I just wanna know what the big mystery is. My dad was in and out of jail, had issues with drug abuse and was also treated as the \"worthless\" kid from a young age. I wonder if that is also because of who his bio dad is? Families are weird.",
   "created_utc": 1704800430,
   "score": 29,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0qu1j",
   "message": "Not bizarre per se, but my parents are off the boat Italian (my mom is from Sicily, my dad Calabrian). Both are in their 70s and tend to be a bit…unaccepting of those unlike them. To prove a point that all people are alike, I had tests done for myself and each of them hoping to enlighten. I figured my mom being from Sicily would be a hodge podge of Northern African/Mediterranean goodness.\n\nNope, between my parents blend of DNA, I’m 95% Italian, with the remaining 5% being split between Malta and Cyprus.",
   "created_utc": 1704783177,
   "score": 73,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0znoq",
   "message": "This just happened recently, and it was actually discovered years after the test was taken. My boyfriend had a DNA test taken years ago to find out his family history. Did it, and then moved on, thinking nothing else of it.  \n\nA few months ago, someone had messaged him on the DNA website, but he wasn’t aware of it until a week or so later when he was reading his email and saw they had tried messaging him again. They were asking my boyfriend if he has a brother, then described his brother and asked if they were at so-and-so during a certain month many years ago, which he was and the description lined up.  \n\nMy brother thought it was weird and kind of fishy at first. He checked their profile, they have a 27% match with him. They ended up talking a bit more. Turns out it was the mother of the girl who took the DNA test. She was trying to find her ten-year-old daughter’s father, my boyfriend’s brother. My boyfriend was finally able to show me the messages and asked me what he thinks he should do with the information, how he should tell his brother about this.  \n\nI wanted to do some investigating first and ended up looking up the mom’s name on Facebook and found a match; something I’m not really proud of, but I had to make sure this *somehow* wasn’t some kind of joke before we told his brother about it. The daughter in the pictures looks *exactly* like my boyfriend’s brother. So much so that you just know, without a doubt, that’s his brother’s daughter.  \n\nAnyway. Long story short. The day we wanted to tell his brother, we asked him what he wanted to eat for dinner. He went and showered before we went to go pick up the food. While we were out, he decided he also wanted a shake from his favorite spot. Which was perfect because we were trying to make sure he was in as good of a mood as possible.  \n\nWe got home, ate. He said he wanted to watch an episode of a show he’s been watching, while we ate our shakes. So we got the show ready to start. Sat him down and told him we have some big news before we start the show. We gently gave him the news, and told him we’re supportive of whatever he decides to do with this information. We won’t be judgmental no matter what he chooses to do. We let him go through his feelings but stayed with him and asked if he needed anything, like some water or a shot of alcohol lol.  \n\nHe ended up meeting his daughter a couple of days later. He’s already so in love with her. He’s just sad he’s missed so many years of her life. He really needed something like this in his life. She’s a sweetheart. I’m so glad they’re already getting along well and it’s good to see how happy she’s making him. *He did end up doing a paternity test to be one hundred percent sure she’s his daughter.*",
   "created_utc": 1704789393,
   "score": 47,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0saae",
   "message": "My high school best friend is my first cousin. His grandma gave my dad up for adoption when she was young. The very cool thing is that I had actually met his (my?) grandma before she died, and I’ll always treasure that.",
   "created_utc": 1704784128,
   "score": 68,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0pzdv",
   "message": "Not my story but saw one on here awhile ago. This woman’s dad dies and he used to always bragged about his Italian heritage. Eventually her sister does a test and is 0% Italian. Op takes one and is 0% as well. They confront the mother assuming she had an affair, the mother is clueless and the sisters don’t believe her and go no contact. Eventually the aunt(dads sister) hears about and reveals that after the Italian grandma died, the aunt found out that she kidnapped dad as a baby.",
   "created_utc": 1704782635,
   "score": 61,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0xv3s",
   "message": "I have the gene that makes you hate cilantro.\n\nI fucking love cilantro.",
   "created_utc": 1704788053,
   "score": 24,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0yq5g",
   "message": "Not me, but my wife:\n\nFollowing her grandfather’s death a few years back, someone decided to get some tests done and put together a detailed family tree. Turns out grandpa had a whole other family and son that no one knew about. Apparently he had met his original (previously unknown) wife and fathered a son just before going off to serve in the war (WW2). Whilst he was away he met another woman and ended up marrying her too, resulting in my wife’s father and his two sisters, and never went home to the first family. \n\nFollowing this discovery, the two families made contact and met. Apparently the original son is nearly a doppelgänger for my FIL.",
   "created_utc": 1704788691,
   "score": 21,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1cul0",
   "message": "I found my birth mother and half brother. I didn't realize I could sort my blood relatives by closest match. When I did, there they were, at the top of my list. I am in my 50s and was adopted as an infant. We are planning to meet in-person, later this month.",
   "created_utc": 1704799280,
   "score": 20,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1lhvb",
   "message": "I found out that the man who I was told is my dad was, in fact, my dad, despite him telling me the paternity test he ordered said I wasn't his kid. \n\nHe has blocked me since I discovered this.",
   "created_utc": 1704804405,
   "score": 18,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0apt2",
   "message": "Not for me but my dog. Turns out my corgi that has a long tail isn’t a corgi at all but just a fucked up looking husky.\n\nhttps://imgur.com/a/1Za5O1i\n\nEdit: for everyone asking “how did I not know this isn’t a corgi,” my fiancé was told when she rescued him that he was a corgi mix and all the vets we’ve had have always listed him as a corgi mix.",
   "created_utc": 1704774498,
   "score": 194,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1bats",
   "message": "I haven't done my DNA test yet but my mom did hers and found out Charles Manson was our slightly distant cousin. My grandma was not happy.",
   "created_utc": 1704798223,
   "score": 19,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1hp5b",
   "message": "My dad - Didn't know what he looked or even his name (Im a one night stand baby). He didn't know I existed. I basically wrote off on ever knowing him. Nearly fell out of my chair when he popped up on my DNA relatives report 35 years later.",
   "created_utc": 1704802311,
   "score": 20,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0oap8",
   "message": "My wife's mother knew nothing about her birth family (as she was adopted), but when my wife put her own DNA profile into Ancestry she quickly found that she had an aunt who looks just like her mother in St Louis.",
   "created_utc": 1704781588,
   "score": 17,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0sd7z",
   "message": "Despite being european with families we know very well up to my great great great grand parents, My sister and I learnt that we were 1/16th mongol. So one of our great great grandparent was mongol.\n\nSo as we know everyone on my mother's side, we asked my father, and he said \"oh yeah, one of my great granddad had a mongolian wife. I never told you ? He was a soldier and he met her on the job\"\n\nBut I don't think the french fought a war in mongolia \\~200 years ago... I mean Napoleon stopped way before that. So HOW?\n\nHe doesn't know, nobody knows, he just remember what his dad told him.\n\nAnd as he's the only last guy alive from his side of the family, we'll surely never know what happened, there are a lot of possibilities, but cultural exchanges in the 1800's weren't as common as now , and mongolia wasn't a french colony so it's still weird.",
   "created_utc": 1704784184,
   "score": 51,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0n8dm",
   "message": "Most shocking is that free DNA tests sells your data to insurance companies so they can supercharge you for your potential incoming cancer.",
   "created_utc": 1704780950,
   "score": 150,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1wgp5",
   "message": "My closest family friend is actually my first cousin. We were basically raised together like siblings. My grandfather passed away in 2009. When I was going through his stuff about 4 years ago , I found a photo of him taken in 1945. He would have been 17 at the time. I couldn't believe my eyes. He and my friend had looked almost identical at that age. It was uncanny. When I showed my friend the photo, he suggested we get a DNA test. He had apparently suspected for years, but his parents refused to tell him anything. We found out that in 1967, my grandfather had an affair with a woman who lived less than 10 miles away from him and had a daughter with her. The woman died during childbirth, and since he didn't want to admit to the affair, he arranged to have his daughter adopted by a close friend who had been unable to have kids with his wife. She ended up becoming best friends with his youngest legitimate daughter, who was the same age. He told them both the truth when they turned 18. Her son and I are the same age and have known each other pretty much since birth, but I never would have thought that were related. \n\n\nTL;DR: My grandfather had an affair, and DNA proved that my best friend is really my cousin",
   "created_utc": 1704809462,
   "score": 16,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0hcq8",
   "message": "Nothing really interesting, but I bet if I win a big lotto, I’ll be hearing from a lot of my third and forth cousins.",
   "created_utc": 1704777697,
   "score": 106,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh1g57o",
   "message": "A friend of mine took one of these a few years ago. He grew up thinking his father was the man his mother was married to that passed when he was young. The husband spent time in prison for arson among other crimes. His supposed father passed when he was young and his mother passed about ten years ago. \n\nHe took the test a few years back and found that he shared 50% of his DNA with a guy who lived nearby and was actually a retired cop. Turns out during one of the times her husband was in jail, his mom hooked up with a guy at a wedding and got pregnant with my friend. He met the guy and they share a strong resemblance and even some mannerisms. That was so crazy to me. \n\nSide note: I always wanted to do one of these so I got one and was telling my dad about how interesting they are and I mentioned the above story to him. He started thinking I was trying to prove he wasn’t my real father. So dumb.",
   "created_utc": 1704801392,
   "score": 18,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0xh1z",
   "message": "I have a daughter! She was conceived during a “one night stand” and given up for adoption at birth. She, the mother, and I have not met, but I am planning a meeting this year. (I live overseas, so it’s difficult to arrange the meeting.) I also have 2 grandchildren. 😎",
   "created_utc": 1704787767,
   "score": 69,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0lfgx",
   "message": "We did a test on my husband’s father; he was adopted at birth and we didn’t know anything about his birth parents. Wouldn’t you know, we find out my husband has a half-sister out there. She had also done a dna test and her results matched up online with his. (My FIL had an affair with a family friend back in the late 80s and she got pregnant, broke it off with him, and raised the child with her husband as their own)",
   "created_utc": 1704779905,
   "score": 53,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0npke",
   "message": "I was secretly hoping that we'd have someone who was on Maury appear in this thread.",
   "created_utc": 1704781232,
   "score": 54,
   "submission_id": "1925e0u"
  },
  {
   "comment_id": "kh0wft9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1925e0u"
  }
 ]
}