{
 "submission_id": "192rq8x",
 "title": "What was the most absurd way a relationship or friendship ended for you?",
 "selftext": "",
 "created_utc": 1704839409,
 "permalink": "/r/AskReddit/comments/192rq8x/what_was_the_most_absurd_way_a_relationship_or/",
 "score": 7,
 "url": "https://www.reddit.com/r/AskReddit/comments/192rq8x/what_was_the_most_absurd_way_a_relationship_or/",
 "comments": [
  {
   "comment_id": "kh4d94e",
   "message": "My ex ran me over with a car",
   "created_utc": 1704839599,
   "score": 4,
   "submission_id": "192rq8x"
  },
  {
   "comment_id": "kh4f7xj",
   "message": "A relationship with a gf from college ended after is discovered that her “husband” was a lie — she’d said she married a teacher from high school and there was a bunch of drama around it. Our friend group never met him and in retrospect it was obviously suss but we were young and dumb. I found about it when I talked to her mom on the phone about something else and I mentioned her “husband”, “Michael” in passing. Her mom had no idea what I was talking about \u0026amp; said “Michael? She used to have a crush on a teacher named Michael, but that was a long time ago.” I mentioned it to the friend \u0026amp; she stopped talking to me and that was that.",
   "created_utc": 1704840284,
   "score": 2,
   "submission_id": "192rq8x"
  },
  {
   "comment_id": "kh4ehxw",
   "message": "Friendship of 17 years ended because he made shit that got him into trouble with police, he tried to get me into trouble instead by telling I gave him the idea and said he should do it. Didn't helped him and I just blocked him everywhere the same day I found out. Luckily he lived far away and just was in the city when he did it, so I had no trouble seeing him ever again since.",
   "created_utc": 1704840030,
   "score": 1,
   "submission_id": "192rq8x"
  },
  {
   "comment_id": "kh4jdsu",
   "message": "Set to the tune of Yakety Sax. So many doors and hallways and shenanigans, and even a tricycle. That was the third strangest Thursday of my life.",
   "created_utc": 1704841763,
   "score": 1,
   "submission_id": "192rq8x"
  }
 ]
}