{
 "submission_id": "192r3gl",
 "title": "Trump argues he can’t be prosecuted for stuff because he was president. Then how can he plan on indicting Biden if Trump gets back in?",
 "selftext": "",
 "created_utc": 1704837891,
 "permalink": "/r/AskReddit/comments/192r3gl/trump_argues_he_cant_be_prosecuted_for_stuff/",
 "score": 103,
 "url": "https://www.reddit.com/r/AskReddit/comments/192r3gl/trump_argues_he_cant_be_prosecuted_for_stuff/",
 "comments": [
  {
   "comment_id": "kh4ey4i",
   "message": "According to Trump's rules:\n\n1. Biden invites Trump to the Whitehouse for a pardon.\n2. Biden shoots trump in the head.\n3. Biden immediately resigns, pre-empting an impeachment and conviction.\n4. Kamala Harris immediately becomes President.\n5. Biden cannot be prosecuted because of 'absolute immunity' and no impeachment.",
   "created_utc": 1704840187,
   "score": 28,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh48ipv",
   "message": "Trump doesn’t use logic, nor does he understand how laws work. It’s all smoke \u0026amp; mirrors. And will eventually lead no where \u0026amp; to nothing.",
   "created_utc": 1704837988,
   "score": 57,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4d5sv",
   "message": "Your assuming Trump actually means any of the things he says. Trump really just thinks he is a special elite person and as such should be able to do whatever he wants without consequences because consequences are for lesser people. Its not a lack of logic its a worldview in which he is just better than you and everyone else and as such is above the law and he thinks this way because for most of his life its been true and he has been allowed to do whatever he wants without consequences.",
   "created_utc": 1704839567,
   "score": 79,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4bosx",
   "message": "The same way he planned to get Mexico to pay for a wall",
   "created_utc": 1704839060,
   "score": 153,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4d076",
   "message": "The judge asked if he would be immune if he ordered Seal Team 6 to assassinate a political opponent. \n\nHis lawyers said yes, he would be immune.\n\nSo Biden can make a call now to Seal Team 6.\n\n(Note: This post is sarcasm, don’t send the feds after me)",
   "created_utc": 1704839512,
   "score": 177,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4e2mf",
   "message": "That's easy: there's no consistency, logic, or reason to anything he says, and neither he nor his followers give one single shit about hypocrisy in any form.",
   "created_utc": 1704839883,
   "score": 95,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4oh48",
   "message": "Therein lies the fascism.",
   "created_utc": 1704843606,
   "score": 36,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4obvg",
   "message": "Trumpets using this logic means that Biden could have Trump eliminated and face no consequences.  \n\nHow utterly fucking stupid are these idiots?",
   "created_utc": 1704843552,
   "score": 12,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4gp9f",
   "message": "Because it's not about actually prosecuting Biden, it's a about demonizing him to Trump's followers, and by extension, demonizing people who support Biden.\n\nTrump's followers don't think about what he says, and don't know the laws, so as long as Trump says Biden has broken laws and that he needs to face justice, then as far as they know, that's what's going on. \n\nIt also helps take attention away from Trumps legal issues. If Biden _also_ committed crimes, then Trump isn't really that bad right? On top of that, Trump can use the fact that he doesn't actually have a case against Biden to his advantage, as it allows him to tell his followers \"look at the corrupt government, screwing me over at every turn for bogus, made up, charges but then covering for Biden and refusing to prosecute him for crimes against the American people!\"\n\nIt's fucking terrifying, because it appears to be working.",
   "created_utc": 1704840799,
   "score": 27,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4pwfl",
   "message": "It’s called fascism",
   "created_utc": 1704844131,
   "score": 10,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4n6mv",
   "message": "There is no logic to it. There is no reasoning behind it.\n\nThey're saying whatever they want, to rile people up. Period. That's it.",
   "created_utc": 1704843140,
   "score": 28,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4o4cm",
   "message": "Because he's a fucking moron.",
   "created_utc": 1704843477,
   "score": 9,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4oqo0",
   "message": "Actually making sense and living in reality is not something anyone voting for him is concerned with. They are zombies frothing at the mouth focused on a mostly fake culture war where they are victims of horrible strawmen",
   "created_utc": 1704843703,
   "score": 10,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4py8o",
   "message": "Because he knows his idiot followers suffer from severe cognitive dissonance, and are capable of an amazing Simone-Byles level of mental gymnastics. And they will throw a giant toddler tantrum in some government building if he doesn’t get his way.",
   "created_utc": 1704844149,
   "score": 9,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4tjvr",
   "message": "Different rules apply because Biden is a Democrat.  \n\nKinda like how Mitch McConnell said they confirm a new SCOTUS judge for Obama because it was an election year, but then were magically able to do so for Trump in an election year.  Republicans are allowed to make it all up as they go along.",
   "created_utc": 1704845490,
   "score": 9,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ok42",
   "message": "Because he’s a monumental idiot?",
   "created_utc": 1704843637,
   "score": 9,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4t1xz",
   "message": "MAGAts aren't know for their logic.\n\nToday Trump said he hopes the economy would crash this year. But, if it crashes, that means it's a good economy now. But Trump and Republicans say it's currently the worst economy ever. So how could it crash?",
   "created_utc": 1704845303,
   "score": 7,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ebbz",
   "message": "He'll just move on to some other bullshit that riles his base up.",
   "created_utc": 1704839966,
   "score": 11,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ai14",
   "message": "I don't think Wanna-Be dictators like Trump worry so much about the rules/logic, they only worry about clinging onto power. Annoying how many stupid people follow that maniac.",
   "created_utc": 1704838659,
   "score": 22,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4naf0",
   "message": "trumps logic committed suicide by age 12. it couldn't take anymore being attached that that shitbag",
   "created_utc": 1704843177,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4op12",
   "message": "Trump is saying he should have total immunity from prosecution.\n\nAlso, he is saying he did nothing wrong.\n\nSo I hope that's clear.",
   "created_utc": 1704843687,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4tns2",
   "message": "Trump is the kid that kept changing the rules of the game so that he’d always have an overwhelming advantage. He’s NEVER gonna let anyone else play by the rules he sets for himself.",
   "created_utc": 1704845530,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ts31",
   "message": "The same way Mitch McConnell blocked Obama’s supreme court appointee but let trump appoint two.",
   "created_utc": 1704845574,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4kr89",
   "message": "Rules for thee…",
   "created_utc": 1704842265,
   "score": 8,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4qw8r",
   "message": "hell, biden could decide to send a hit team to take trump out and call presidential immunity.  I think trump's argument is incredibly weak on so many levels",
   "created_utc": 1704844496,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4rd7a",
   "message": "I guarantee: if the SC (or any US court) is corrupt enough to accept Trump's argument that he's immune from all criminal prosecution, they're also corrupt enough to immediately overturn their own precedent as soon as Biden's accused of made-up crimes like \"mismanaging the border.\"",
   "created_utc": 1704844670,
   "score": 4,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh50a2o",
   "message": "Good question. Also, consider this: if Trump wins his case, why can’t Biden just get the CIA to knock him off?  No problem. No prosecution. \n\nBe careful what you wish for.",
   "created_utc": 1704848003,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh49rhb",
   "message": "TLDR: Laws for thee, but not for me.",
   "created_utc": 1704838408,
   "score": 13,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4hdmw",
   "message": "Conservatives don’t have values or principles they they have identity.  You can’t expect intellectual consistency from people who don’t think.",
   "created_utc": 1704841039,
   "score": 12,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4n7lo",
   "message": "Because he believes rules are for other people, not him.",
   "created_utc": 1704843150,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ngu6",
   "message": "Because Trump's brain is increasingly mush. He insists everyone use the title like he's still there. Like it's some deterministic natural job he's currently on exile from.\n\nHe's tried constant \"I used to be president\" privilege arguments as well, all losers. \n\nThis is really an argument that Biden could simply have him and his cohorts executed outside of law.",
   "created_utc": 1704843243,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ntxo",
   "message": "GTFO with your logic!\n\nHow dare you!",
   "created_utc": 1704843372,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4p4xb",
   "message": "Your first mistake is assuming there is any logic at play whatsoever.",
   "created_utc": 1704843851,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4pj3r",
   "message": "Easy: indictment for thee, but not for me.",
   "created_utc": 1704843995,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4pu1j",
   "message": "Lets not do this on this sub. Go back to asking sex stuff",
   "created_utc": 1704844107,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4qmeq",
   "message": "Logic doesn't apply to conservatives.",
   "created_utc": 1704844395,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4rbvs",
   "message": "Your mistake is applying logic to Republican motives.",
   "created_utc": 1704844656,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4uwa3",
   "message": "I take that as seriously as \"Lock Her Up.\" He didn't even try to do that.",
   "created_utc": 1704845989,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4xogx",
   "message": "Scenarios:\n\n1) Christie backs out if Nikki Guarantees him Vice President giving her a clearer path to win in the primaries...Nikki wins primaries...Trump will meanwhile behind closed doors demand that Nikki pardon him and shut down any investigations into him if she wins the election or he won't have his supporters back her.\n\n2) Trump wins primaries but is convicted before the general election...Nikki steps in as Republican's General Election choice...Nikki picks either Christie or Desantis as Vice...Trump will meanwhile behind closed doors demand that Nikki pardon him and shut down any investigations into him if she wins the election or he won't have his supporters back her.\n\nEither way Trump runs the Republican show by proxy.",
   "created_utc": 1704847020,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4xskl",
   "message": "He's also arguing (through his lawyers) that ballot-removal initiatives (for him) are \"disenfranchising voters\", which is what he attempted on Jan. 6. It's a pretty jaw-dropping bit of gall. He's a hypocrite who spews whatever pops into his head.",
   "created_utc": 1704847061,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4yf13",
   "message": "If Trump somehow succeeded in pushing this nonsense idea that presidents can't be prosecuted, he would absolutely do a complete 180 on it as soon as Biden became the subject of investigation. He's basically an overgrown child who thinks he gets to write the rules as he goes, but this isn't the case and none of this is going to work.",
   "created_utc": 1704847295,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4yie4",
   "message": "If you expect consistent logic or linear reasoning from republicans, oh boy do I have a bridge to sell you....",
   "created_utc": 1704847330,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ylt9",
   "message": "Sophism. Nonsense arguments intended to delay and confuse. Nothing more,  nothing less.",
   "created_utc": 1704847366,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4zhea",
   "message": "It doesn't matter what he says. It doesn't matter that nothing he says makes sense. None of his voters give a shit. There's no ideology behind it, no reason. Picking apart his words is a waste of time because his words are meaningless and nobody cares. You cannot reason with the people voting for him.\n\nThe only chance you have is to show up in numbers on election day to make sure he doesn't enter office.",
   "created_utc": 1704847701,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh506qz",
   "message": "Trump will claim the election was stolen, and thus invalid, negating the immunity granted by the presidency\n\nClassic dictator mumbo jumbo",
   "created_utc": 1704847968,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh52ujz",
   "message": "Bro we have got to stop entertaining these absolute bullshit hypotheticals.\n\n**Conservatives. Don’t. Care.**\n\nEverything is a means to an end with them. They don’t care about hypocrisy because they have no shame. **THEY LARGELY SUPPORT THE SERIAL LIAR FROM THE APPRENTICE, WHO HAS PUBLICLY STATED HE WISHES HE COULD FUCK HIS OWN DAUGHTER, TO BE PRESIDENT OF THE UNITED STATES OF AMERICA.** We are way past shame.",
   "created_utc": 1704848982,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4jh1f",
   "message": "Fascists lie on purpose to sow chaos and appeal to emotion",
   "created_utc": 1704841796,
   "score": 10,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4dg2q",
   "message": "Because as always,  conservatives use the law to attack people that they don't like and protect themselves.",
   "created_utc": 1704839667,
   "score": 18,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4r1f7",
   "message": "The official motto for the Reps should be: *\"Rules for thee but not for me\"*",
   "created_utc": 1704844549,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4r7je",
   "message": "If you think silly things like precedent and hypocrisy matter, I've got supreme court rulings and history of dictators to show you",
   "created_utc": 1704844612,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4rhs2",
   "message": "Laws for thee, not for me.  \n\nFascism 101.",
   "created_utc": 1704844717,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4rhxf",
   "message": "1. He doesn’t plan to do that, he’s just running his mouth\n\n2. Even if he does plan to do that, trump doesn’t care about consistency or logic. He just says what he wants to happen.",
   "created_utc": 1704844719,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4rls2",
   "message": "Oh, that's easy. Because everything that comes out of his mouth is insincere.",
   "created_utc": 1704844759,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4s5oe",
   "message": "Consistency isn't really a concern of fascists.",
   "created_utc": 1704844966,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4sud8",
   "message": "Its almost as if Trump and most of his followers are hypocrites",
   "created_utc": 1704845225,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4sutt",
   "message": "He's flailing, throwing every and everything at the wall hoping something will stick.\n\nEven he's not keeping track of what he's saying from one minute to the next.",
   "created_utc": 1704845229,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4thzh",
   "message": "*Because Trump does not care about the Rule of Law.*\n\nIt's literally as simple as that. The law is only a tool of convenience to him. If he can use it, great. If others can use it against him, bad. If the law won't work to his advantage, ignore it and do whatever you want anyways.",
   "created_utc": 1704845470,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4udhu",
   "message": "Conservatism consists of exactly one proposition, to wit: There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.",
   "created_utc": 1704845797,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4w8mt",
   "message": "Because he's a wet-brained orangutuan wearing people clothes.",
   "created_utc": 1704846486,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4w962",
   "message": "There is no logic, only rage and argumentation. Obviously, if Trump were correct in his assertion (about this, immunity for assassination, disregarding the constitution, whatever) then it would obviously be true for Biden. More, I recently heard some GOP folks plan to remove Biden from their state ballots because they claim Biden's handling of the southern border amounts to insurrection. Ok, but if this is all it takes to take such an action, then Trump needs to *be also excluded* from state ballots because during his administration undocumented aliens also crossed the southern border. Problem solved.",
   "created_utc": 1704846491,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4weo4",
   "message": "lets be honest, conservatives only care about one thing. staying in power so they can maintain control over everyone's life.\n\nthey don't care if the election was stolen or not. they don't care about what sort of person trump is. they think he and the stolen election narrative will help them maintain the control they so desperately want. and the GOP will promise(and deliver if they can)this control because they think its the key to the party maintaining power which is good for their pockets.\n\nthe average conservative wants to use the government as a tool to enforce their puritanical religious beliefs on those who don't want any part of their antiquated bullshit. they can not be compromised with because they think their myths comes from the highest authority in the universe. they are religious extremists and should be treated as such. they want the ability to control your every action and they will go to any lengths to get it including violence.",
   "created_utc": 1704846548,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4wqct",
   "message": "Rules for thee, not for me 🤷‍♀️",
   "created_utc": 1704846667,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4x3ok",
   "message": "Do you think Trump has the mental capacity to see the problems with his own idiotic comments?",
   "created_utc": 1704846805,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ywo1",
   "message": "A trump argument only exists till the next trump argument. They don't have to be realistic.",
   "created_utc": 1704847482,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh503lf",
   "message": "Stop bringing rational thinking to an irrational thinker",
   "created_utc": 1704847935,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh51oqb",
   "message": "He'll change the rules because that's the only way Republicans can win at anything.\n\nVote like your democracy depends on it. It does.",
   "created_utc": 1704848539,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh554n7",
   "message": "Because rules only apply to Democrats. When a Republican is caught breaking the law, they're defended by other Republicans in any way possible whether it's legal or not. For example they voted to acquit in his impeachment trials not because they believed he'd done nothing wrong, but simply because he's a Republican. When a Democrat is caught breaking the law, other Democrats will not hold back consequences simply because of party affiliation. For example, look at Al Franken, who was pushed to resign despite being popular among his constituents, because of the *simple appearance* of improper behavior, without even an investigation.\n\nAs a result, it doesn't matter what legal precedent is set here. They'll say \"well you can't prosecute Trump because he was president\", then they'll turn around and prosecute Biden. They won't even explain themselves, they'll just do it. They know it's absurd. They don't care because who will stop them?\n\nAnother example, they didn't even vote on Obamas supreme court nominee because \"it's too close to the end of his term\", which isn't a rule at all; then voted in Trumps nominee in the last month (or two?) of his term. No explanation, just \"Well we can. So fuck you, we're gonna\".\n\nThat's how they'll do it. They just will, because fuck you.",
   "created_utc": 1704849850,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh558dj",
   "message": "He’s blustering/threatening. Either he is immune or what’s good for the goose is good for the gander. It’s absurd, but he’s basically just saying “if I can be prosecuted so can he.”",
   "created_utc": 1704849890,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh55c7p",
   "message": "I guess if he blanket pardoned himself that is true for federal crimes.",
   "created_utc": 1704849931,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh55l5y",
   "message": "Because Trump is a dumb pile of human garbage who doesn't think rules apply to him.",
   "created_utc": 1704850027,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4o4hg",
   "message": "It's almost as if he's a fucking idiot.",
   "created_utc": 1704843478,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4h5qu",
   "message": "Oh please, classic Republicanism. You can't prosecute Republican presidents. Democratic presidents who are leaving office can't appoint Supreme Court judges.",
   "created_utc": 1704840961,
   "score": 7,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4jp8o",
   "message": "Because fascism fundamentally works on a “rules for thee, not for me” basis. \n\nIt’s not about logic, it’s about naked power.",
   "created_utc": 1704841878,
   "score": 6,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4h1xw",
   "message": "Conservatism isn't troubled by hypocrisy. It's a feature. It *thrives* on it.  It seeks to create a separate set of rules for the in-group and the out-group by whatever means are most expedient at the time.",
   "created_utc": 1704840924,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4iu9y",
   "message": "Because he's a moron.",
   "created_utc": 1704841565,
   "score": 4,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh48kmd",
   "message": "He can’t lol. Just trying to cover his own a$$ and feed red meat to the base.",
   "created_utc": 1704838006,
   "score": 4,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4l592",
   "message": "Because Trump knows his voters are either too dumb to understand the contradiction or just don’t care about the contradiction.",
   "created_utc": 1704842406,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4hyfj",
   "message": "He doesn't, it's just things he says to get his goons all excited to vote for him. Remember the lock her up campaign?",
   "created_utc": 1704841244,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4ifvq",
   "message": "Because Trump has a dictator mindset.",
   "created_utc": 1704841421,
   "score": 5,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4bas0",
   "message": "This guy is just trying to stay out of jail.  He isn't thinking long-term here.",
   "created_utc": 1704838928,
   "score": 4,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4g221",
   "message": "Details... I don't believe he can  think that far ahead.",
   "created_utc": 1704840577,
   "score": 4,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4hnas",
   "message": "If that's true, Biden should just have Trump thrown in a cell in Guantanamo Bay. What's he gonna do about it?",
   "created_utc": 1704841134,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4lowx",
   "message": "Too much logic, MAGA heads explode.",
   "created_utc": 1704842600,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4vsg6",
   "message": "Trump wants to be dictator for life and throw out the Constitution if he wins the Republican nomination and wins the general election in 2024.That makes him the most dangerous psychopath in our country and a genuine reason for every person who is eligible to vote and who finds Trump's ideas abhorrent to get out and get registered to vote and vote against him. 2020, we had almost 160 million people vote in our election, of which 74 million voted for Trump, but who lost out to Biden because 82 million voted for Biden, who also won the electoral college.\n\nReportedly, our country has some 235 million people registered to vote, so that meant 75 million people didn't vote. Course, that number probably included people who had long since died or haven't voted in so long, yet their states haven't bothered to purge them from the rolls. Southern states of course, are purging Democratic voters, and not necessarily because they were dead or hadn't voted in a long time, but just wanting to make sure their side won.\n\nTrump is a criminal, make no mistake about that. He's a career criminal and the Republicans are taking their cues from him and following his leads. He's arguing in his criminal court cases now that he has lifetime presidential immunity, that he can do what he wants and the government can't prosecute him. This gives you some idea of what he will be like if he wins a second term. He will commit crimes and give everyone the middle finger, saying he can't be prosecuted. He belongs in prison, in their mental ward and locked up until he leaves this world.",
   "created_utc": 1704846319,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4gxum",
   "message": "All of this is to set up a narrative for when this court strikes down his immunity he can claim that activist liberal judges are retaliating against him for doing his job as President. That's what all this is. He knows he's going to lose, he's going to Lose in the SCOTUS, and he's going to be convicted. He's going to use this all to push the idea these are left wing political tactics to attack him, bias judges, etc.\n\nHis hope and prayer is that he gets elected and sworn in before a sentence is handed down and therefore he's unable to be sent to prison while a sitting president. It's WHY Jack Smith wants his cases fast tracked. He wants a conviction and sentence carried out prior to the electing and definitely before inauguration day.\n\nEven better is if someone like Nikki Haley can knock him off in the primary. Then he loses his pulpit while being tried on multiple fronts.",
   "created_utc": 1704840884,
   "score": 3,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4km4z",
   "message": "“Biden isn’t a real president.” See, it’s easy.",
   "created_utc": 1704842213,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4kw36",
   "message": "at this point he is trying anything to avoid getting his stupid orange azz locked up like he deserves",
   "created_utc": 1704842313,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4l2ob",
   "message": "He does not think outside of his initial thought whatsoever. By his same logic, the next election shouldn’t matter if Kamala Harris can just choose not to certify the election and keep Biden in office.",
   "created_utc": 1704842380,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4kqa1",
   "message": "OP is an idiot for using logic or thinking that Trump thinks logically.",
   "created_utc": 1704842255,
   "score": 2,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4o30i",
   "message": "If a court is friendly enough to Trump to rule that he can't be charged for things he did while President then the court is going to be friendly enough to him to allow him to indict Biden for what the fuck ever",
   "created_utc": 1704843464,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4hjj5",
   "message": "Trump doesn’t give a shit about anyone or anything but Trump. Like a mob boss, the only use he has for the law is how he can twist and warp it to his advantage. He is easily the most corrupt and biggest piece of shit in American history.",
   "created_utc": 1704841097,
   "score": 1,
   "submission_id": "192r3gl"
  },
  {
   "comment_id": "kh4iim0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "192r3gl"
  }
 ]
}