{
 "submission_id": "157k4ov",
 "title": "[CW] Smash 'Em Up Sunday: Satire",
 "selftext": "#**Welcome back to Smash ‘Em Up Sunday!**\n\n\u0026amp;nbsp;\n\n##SEUSfire\n\n\u0026amp;nbsp;\n\nOn Sunday morning at 9:30 AM Eastern in our Discord server’s voice chat, come hang out and listen to the stories that have been submitted be read. I’d love to have you there! You can be a reader and/or a listener. Plus if you wrote we can offer crit in-chat if you like!\n\n\u0026amp;nbsp;\n\n##Last Week\n\n\u0026amp;nbsp;\n\n####Community Choice\n\n\u0026amp;nbsp;\n\n1.  /u/katpoker666 - “[Princess Bubbletart](https://www.reddit.com/r/WritingPrompts/comments/15200vp/cw_smash_em_up_sunday_tragicomedy/jt34vjg/)” \n\n2.  /u/wordsonthewind - “[Yoshiko](https://www.reddit.com/r/WritingPrompts/comments/15200vp/cw_smash_em_up_sunday_tragicomedy/jt3srcf/)”  \n\n3.  /u/gdbessemer - “[The Perils of an Accidental Time Traveler](https://www.reddit.com/r/WritingPrompts/comments/15200vp/cw_smash_em_up_sunday_tragicomedy/jt1ugl9/)”  \n\n\n\n\n\u0026amp;nbsp;\n\n\n####Cody’s Choice\n\n\n\u0026amp;nbsp;\n\n* /u/ZachTheLitchKing - “[Teamwork would be the Dreamwork](https://www.reddit.com/r/WritingPrompts/comments/15200vp/cw_smash_em_up_sunday_tragicomedy/jscm5hk/)”\n\n* /u/ShittyNameCreator - “[Untitled](https://www.reddit.com/r/WritingPrompts/comments/15200vp/cw_smash_em_up_sunday_tragicomedy/jsiwoqm/)”\n\n* /u/MaxStickies - “[Conflict on the Pier](https://www.reddit.com/r/WritingPrompts/comments/15200vp/cw_smash_em_up_sunday_tragicomedy/jsroyv5/)”\n\n\n\n\n\n\n\n\u0026amp;nbsp;\n\n##This Week’s Challenge\n\n\u0026amp;nbsp;\n\nThis month I’m going to be exercising some different writing muscles than usual. Throughout July I’ll be pushing you to practice comedy. Of course you can ignore this part of the prompt and do whatever you like as long as you fulfill 2 constraints. That said, I do hope you’ll take the challenge to try different forms every week.\n\n\u0026amp;nbsp;\n\nWeek Four we are going to tackle what is prolly the hardest and most feared type of comedy, because it isn’t always funny: satire. Satire is a way of using comedy to make commentary on real issues. Although it often veers into the political it can be targeted at other area of literature, philosophy, and human nature. *Lord of the Flies* for instance is a satire on the genre of “boys-have-a-fun-adventure-on-a-desert-island” that was popular at the time. *Fight Club* is a satire about consumerism and the lie of The American Dream. *Rollerball* is a satire gazing into sport as a placation of the masses, consolidation of power, and changing rules to always come out ahead. It is also criminally underrated. Go read the short story and if you want to watch a movie that is 70s scifi cheese and maybe a bit too long, go watch the 1975 movie (2002 version somehow missed the message and made…something else). The point is that through exaggeration, irony, a bit of humor, and a few other literary techniques, you can make a memorable statement. \n\n\n\u0026amp;nbsp;\n\n###How to Contribute\n\n\u0026amp;nbsp;\n\nWrite a story or poem, **no more than 800 words** in the comments using **at least two** things from the three categories below.  The more you use, the more points you get.  Because yes!  There are points! You have until [11:59 PM EDT 22 July 2023](https://www.timeanddate.com/countdown/to?msg=SEUS%25Deadline\u0026amp;p0=250\u0026amp;ud=1\u0026amp;year=2023\u0026amp;month=07\u0026amp;day=22\u0026amp;hour=23\u0026amp;min=59sec=59fromtheme=generic) to submit a response.\n\nAfter you are done writing please be sure to take some time to read through the stories before the next SEUS is posted and tell me which stories you liked the best. You can give me just a number one, or a top 5 and I’ll enter them in with appropriate weighting. Feel free to DM me on Reddit or Discord!\n\n\u0026amp;nbsp;\n\nCategory | Points\n---|---\nWord List | 1 Point\nSentence Block | 2 Points\nDefining Features | 3 Points\n\n\u0026amp;nbsp;\n\n\n####**Word List**\n---\n\n* Critique\n\n* Absurd\n\n* Mash\n\n* Proposal\n\n\u0026amp;nbsp;\n\n####**Sentence Block**\n---\n\n* Make people laugh; then make them think.\n\n* It is focused bitterness.\n\n\u0026amp;nbsp;\n\n####**Defining Features**\n---\n\n* Genre: Satire (worth 6 points)\n \n\u0026amp;nbsp;\n\n##What’s happening at /r/WritingPrompts?\n\n\u0026amp;nbsp;\n\n*  [**Nominate**](https://www.reddit.com/message/compose?to=%2Fr%2FWritingPrompts) your favourite WP authors or commenters for Spotlight and Hall of Fame! We count on your nominations to make our selections.\n\n* Come hang out at [**The Writing Prompts Discord**](https://discord.gg/writingprompts)! I apologize in advance if I kinda fanboy when you join. I love my SEUS participants \u0026lt;3 Heck you might influence a future month’s choices!\n\n* Want to help the community run smoothly? Try [**applying**](https://redd.it/pwiee5) for a mod position. Everytime you ban someone, the number tattoo on your arm increases by one!\n\n\u0026amp;nbsp;\n\n---\n###I hope to see you all again next week!\n---",
 "created_utc": 1690131896,
 "permalink": "/r/WritingPrompts/comments/157k4ov/cw_smash_em_up_sunday_satire/",
 "score": 15,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/157k4ov/cw_smash_em_up_sunday_satire/",
 "comments": [
  {
   "comment_id": "jt54goy",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690131896,
   "score": 1,
   "submission_id": "157k4ov"
  },
  {
   "comment_id": "jt6ftan",
   "message": "##Don't Separate the Art from the Artist\n\nEthan Kurt could’ve been the biggest rock star of a generation. His lyrics were sharp critiques on society mixed with innovative and daring arrangements. His live performances got rave reviews; electrifying, captivating, and massive were words to describe his stage presence. His charisma extended far beyond the stage. During interviews, he was charming and humorous. He had one setback. \n\nHis life was boring.\n\nThe problem first arose when he was trying to get a record deal. His first agent almost didn’t sign him.\n\n“So tell me about your upbringing?” one asked.\n\n“My dad was a car salesman while my mom was a nurse. We weren’t rich, but we were never destitute,” Ethan replied.\n\n“Hmm, you were working class until your father had a terrible accident,” the agent said.\n\n“What are you talking about?” \n\n“He got mashed by two semis,” the agent said.\n\n“I don’t even think anyone could survive that.”\n\n“And he almost didn’t. He’s now suffering from injuries that never healed.”\n\n“Oh my god, what is wrong with you? He’s just fine. He drove me here,” Ethan said.\n\n“Interesting.” The agent picked up the phone. Ethan quickly grabbed it and shoved it down.\n\n“You are not hurting my father.”\n\n“Alright fine, screw the dark past. We’ll say that you’re depressed and cope with an addiction to-” The agent scratched his chin. “Eh, we’ll figure out your addiction later.”\n\n“Depression and addiction are serious topics. How can you be so flippant about it?”\n\n“This is the music business. You need to have an x-factor. You want to know what that is. It is focused bitterness. There has to be something compelling about you,” the agent explained.\n\n“Aren’t my songs compelling enough?” Ethan asked. The agent laughed.\n\n“You know what. You’re a sweet kid. How about this? I’ll make you a proposal. I’ll help you get signed in exchange. You need to acquire an edge.” Ethan accepted this deal on the spot.\n\nThe agent was right. Multiple record labels rejected him. They all said that he was more talented than anyone they ever saw, but he was too bland to sign. After all, no one wants to see a biopic about someone who lived a perfectly happy life.\n\nHis parents advised him to change his sound to make up-lifting and humorous  music. Surely, that would be more accepting of an average person. His lyrics could keep their philosophical edge as well. After all, make people laugh, then make people think. That turned out to be a mistake. Industry executives expect joyful people to be hiding even darker secrets. Ethan thought this was absurd.\n\nEventually, he stumbled on the path to success. He wrote a song criticizing the music industry. That song got him a three album deal, and the label planned an elaborate rollout. There is nothing the music industry loves more than a song that rebels against it.\n\nWhen the song was released, Ethan’s chance at stardom fell apart. He dared to be grateful for his success on the red carpet. He expressed gratitude for his fans and his family. The worst part was his sincerity. What kind of sick person would do that?\n\nBefore the album was released, he was called into an emergency meeting with record executives. They told him that fame was getting to him. He was about to have a breakdown and turn to reckless behaviors. A stint in the county jail was already booked for the night. Afterward, he would have to complete six months of community service.\n\nEthan asked what crime he had committed? The label said that this was merely a sales tactic. After all, everyone loved a bad boy. Their predictions turned out to be correct, and Ethan’s album went triple platinum.\n\nSuccess came with disillusionment. Ethan realized he had to leave this toxic environment.  His agent was excited by this prospect as it made Ethan exciting. Ethan replied this wasn’t a stunt because he couldn’t participate in an industry that glamorized failure and despair. His agent had a pre planned response.\n\n“Oh that’s it. Just say that you're satirizing the tortured artist trope.”\n\n“By playing it completely straight and suffering?” Ethan asked.\n\n“Exactly it’s an ironic meta commentary or whatever jargon makes it sound intelligent.”\n\nEthan quit the next day. He returned to his hometown the next day and became a high school music teacher. The rest of his years were spent encouraging the passions of teens. Eventually, he met a nice woman and started a family. His time as a star became a fun fact and icebreaker at parties. A part of him wished that he was a star or at least richer, but he didn’t care. He was happy.\n\n---\n\nr/AstroRideWrites",
   "created_utc": 1690151832,
   "score": 6,
   "submission_id": "157k4ov"
  },
  {
   "comment_id": "jt6jtdl",
   "message": "# A Profitable Proposal\n\nThe Board of Directors laughed out loud at the absurdity of Henry’s proposal. It was a positive sign. Make people laugh; then make them think.\n\nThe loudest laugh came from the head of the board: a pale, rounded bald man whose red bowtie completed his “Humpty Dumpty” image. He practically screamed with laughter as he asked, “So a little drip of oxytocin will turn our employees into robots? Where do I sign up?”\n\n“Robots? No. Tell me, what did your packer robots do when the roof collapsed in the C5 warehouse? Did they throw their bodies over the packages to shield them? Did they keep working to clear the rubble, even as their own robotic arms twitched and sparked on the floor? Your employees won’t work like robots. They’ll work like *mothers*.”\n\nHenry could see the spark in Humpty Dumpty’s eyes. He was picturing the possibilities now. \n\nBut the short black woman to his left was frowning. “Let’s assume for a second that our employees would actually consent to let us manipulate their hormones and increase their cancer risk just so we can save a few bucks on damaged packages.”\n\n“Millions. Millions of dollars in savings.”\n\nShe glared at his interruption. “At what cost? Your own data shows that the injections interfere with normal oxytocin production. What if they can’t bond with their children anymore? I’m not even talking about the personal tragedies here. We could derail our entire society.”\n\nA few of the board members shifted uncomfortably at the prospect of societal collapse.\n\nOh, how Henry hated diversity hires. Why did they always stand in the way of progress? It is focused bitterness that fuels their critiques. He needed to quickly disarm her.\n\n“Perhaps an experiment will show this best.” Henry produced a bowl of cold mash and slid it before the woman. “If you will, Mrs…”\n\n“*Doctor* Phillips.”\n\n“Of course. *Doctor*. May I ask, how do you feel about this bowl of mash?” \n\nShe looked at him like he was a simpleton. “Cold potatoes? I’ll pass.”\n\nHe walked behind her as they spoke. “I see. And if I could just –” *Jab!* He thrust the syringe into her arm and pressed the plunger into the barrel. He danced away just in time to avoid her reach.\n\nThe board members jumped from their chairs and shouted at him. “What is the meaning of this?! That’s assault!” Only Humpty Dumpty stayed in his chair.\n\nHenry backed away with his hands up in a defensive posture. “Sorry, sorry. No harm meant. I’ll let myself out. I’ll even compensate Doctor Phillips here. That is, if she’ll just return that bowl of mash.”\n\nOne by one, the board members turned toward Doctor Phillips. She slid the bowl towards her, hugging it to her chest. Eyes wide, she muttered. “This? But, it needs me.”\n\nHenry took a small step forward, holding eye contact with the head of the board. “Of course, warehouse workers won’t let you just inject them at the start of their shift. People hate needles! But a one-time implant? They’ll do that for a dollar raise.”\n\nHumpty Dumpty smiled from ear to ear. “It seems we’re going to have a good quarter after all.”\n\n\\---\n\nWC: 532",
   "created_utc": 1690153681,
   "score": 5,
   "submission_id": "157k4ov"
  },
  {
   "comment_id": "jtbh84a",
   "message": "\u0026lt;Fantasy\u0026gt;\n\n***When the ta'buls turn***\n\nYork stood atop a hill, the train rolling away into the distant sunset.  The little scabby goblin rubbed his hands together and grinned.  It had all gone *perfectly* to plan and he could hear his crew coming up the hill behind him now.\n\nThe rather absurd mish-mash team had been the first to accept his proposal.  York had approached numerous individuals for this but all had issues working with others.  So he expanded his search to find *groups* instead.  Pre-established teams.  This one was rather eccentric but had come with great recommendations for their success.\n\nThe hammer-wielding dwarf and brightly robed elf bowed deeply while the two humans - one wearing a terrifying amount of iron armor and the other with a bow slung over one shoulder - just nodded their heads.\n\n\"We *Nytes* of the *Fohr'lohn Bwent* have completed our quest,\" the elf said, \"All went precisely as you orchestrated.\"\n\n\"Well *duh*,\" York muttered, \"Did you get the box?\"  The whole purpose of the heist was to liberate a box of jewels from the train.  Shiny, sparkly gems that he could add to his collection.\n\n\"Aye, we did,\" the dwarf said, pulling the box out from behind his back.  How he carried the large box so easily and without York noticing was fascinating, but the goblin wanted to affirm the acquisition.  As he went for the box, the dwarf lifted it out of his reach.\n\n\"Verily, your scheme was considered with the utmost care and precision.  However, it is this quartet's decision that your own contribution to the execution was not such that it merits proper recompense,\" the elf said.\n\nYork stared up at him for a few seconds in silent contemplation before asking, \"What does that even mean?\"\n\n\"Look it,\" the armored human said, stepping closer.  York, the dwarf, and the elf all stepped back as he shuffled up.  Iron in any form was *painfully* dangerous to fae-kind, and this human draped in it was about fifty feet closer than any of them wanted to be.  \"You gave us this plan here, right?  Good plan.  Not really a genius one, but hey, no one else was hiring, right?\"\n\n\"Right...\"\n\n\"Now your part in it all was to be a distraction.  Well, we don't think you distracted all that good, yanno?\"\n\n\"No?\" York was confused by the accusation, \"I kept the guards' attention by telling them jokes.\"\n\n\"Right! But them jokes only last so long, yanno?  Gotta make'em laugh but also make'em think.\"\n\nThe elf cut in, \"Allow me, *Sy'l Benster*.  Once their humor had died down, the *pet'ua* set forth on their patrols, eyeing every *cahrt* and *krayt* with the utmost care.\"\n\n\"They very nearly spotted us,\" the human with the bow said, \"If not for *Nylveno's* charms of secrecy and concealment, we would not have had the opportunity to trap the *pet'ua* in an ambush.\"\n\nYork was having a hard time following along.  He'd known the group was odd, but they seemed to be speaking gibberish.  But he continued to nod his head and rub his chin as though everything they said made sense.\n\n\"Slimey *banstah'dar'dos* were tougher to take down 'n a Troll with *klehr'vos*,\" the dwarf joked.\n\n\"Right you are, *Grom'elon*,\" the elf chuckled, \"They even wielded enchanted *shwarnda*, which-\"\n\n\"Pardon, need to clarify, what is a 'shwarnda'?\" York asked.\n\n\"You know, *shwarnda*?\" the human said, drawing a sword, \"Long, pointy, stab wit' it.\"\n\n\"Oh, I see,\" York did not like even more metal being shown like that, \"Sword.\"\n\n\"*Shwarnda* is the more traditional vocabulary,\" the elf sneered, \"But after that-\"\n\n\"Look I understand that it was rough.  All jobs go off the rails at some point,\" York's patience was wearing then, \"But you could have-\"\n\n\"And now you dare to critique our methods!?\" the elf asked, putting a hand up to his chest while eyes went wide, \"The audacity!\"\n\n\"Comin' from a lil *bobglin* no less,\" the dwarf muttered.  York had no idea what a 'bobglin' was but he felt insulted at the way it was said; not in a jovial or even a mocking tone, but in focused bitterness.\n\n\"In *short*,\" the armored human said with a grin, pulling a single coin out of the box that the dwarf was holding up, \"We decided that this was what your contribution was worth.\"  He flicked it from his thumb to land at York's feet.\n\nThe party of four strange people walked away, laughing and chatting in their strange dialect, leaving York with the single silver coin.  On the one hand, if the robbery were investigated now he did not have to worry about lying low.  On the other hand, York did *not* like being the one who got swindled.\n\n\"Is this what it's like when I rob people?\" he muttered to himself, \"Wow... this feeling sucks.\"\n\n\\----------------  \nWC: 800/800  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing  \nFollow my Summer Challenge progress [Here](https://www.reddit.com/r/TomesOfTheLitchKing/comments/14c22dj/ot_summer_challenge/)\n\nNotes:  \n- This was my attempt at satirizing the fantasy trope of making up too many words",
   "created_utc": 1690242842,
   "score": 1,
   "submission_id": "157k4ov"
  }
 ]
}