{
 "submission_id": "159czme",
 "title": "[WP] One day, the heads of all religions in the world recieve a telepathic message. \"We are the Divine Protection Service, You have been removed from the care of your god for reasons of neglect. You will be entrusted to the care of a foster god.\"",
 "selftext": "",
 "created_utc": 1690301711,
 "permalink": "/r/WritingPrompts/comments/159czme/wp_one_day_the_heads_of_all_religions_in_the/",
 "score": 221,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/159czme/wp_one_day_the_heads_of_all_religions_in_the/",
 "comments": [
  {
   "comment_id": "jtegcjb",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690301711,
   "score": 1,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtewm5v",
   "message": "Hello, We Hope This Letter Finds You Well.\n\nI am Yathinway from Divine Protection Services. This letter is to notify you that you have been removed from the care of God #424 in response to current allegations of neglect. We understand that not having a God is harrowing, so we have elected to provide a Foster God until you find your forever God.\n\nWe will be sending a followup in 9 business days regarding your assignment.\n\nThank you.\n\n\\----\n\nThe letter had to be a hoax didn't it? It had to- but how could it be?  8 billion letters mailed all at once. Slipped under every door, left in every crib and dropped in each mailbox. It was impossible.\n\nNo. It was divine.\n\nNobody knew what was coming in the days following the letter? Preachers assured their flocks that they were safe and that the letter was a lie. Doomers slipped underground into their bunkers to prepare for whatever was coming. Several Countries that had been relying on Religion to keep the peace fell into civil war.\n\nThere was nothing on the news, in conversation or people's minds aside from the letters. Nothing aside from the pending deadline.\n\nThe days bled by.\n\nSome started claiming that it was a meticulous viral marketing campaign. The same groups that preached conspiracies assured that this was the new chem-trails, that the elites of the world were trying to steal religion from the masses to reclaim Sunday. Though the Bezo's of the world might have loved a 6 day week, people had to admit that the logistics were impossible.\n\nMaybe it was a blessing that the letter arrived on the 8th day.\n\n\\-----\n\nThank you for your patience,\n\nI am Minithina, I've been assigned to your case. I am truly sorry to see the state of your society. Know that it isn't your fault and the lack of divine intervention has nothing to do with you, all of the blame lies with your God.  We are sorry for what has happened.\n\nWe know there is no replacing the God that you lost, but in the interim until the race: Humanity can find a new God, you have been placed in the care of Lolthinway. They are a retired God looking to settle down with an easy-to-manage population under 10 billion.\n\nI'm excited for you to meet them!\n\nMinithina, Your Divine Protection Agent\n\n\\-----\n\nYou would figure there would have been riots and panic in response to the letter, especially considering the turmoil around the first set,  but there wasn't time.\n\nThe sky flashed from blue to Lavender and the entire planet shot into daylight at the whims of the divine, and a saccharine voice echoed in everyone's ears.\n\n\"Oh my Goodness. You're so cute! Oh you're just perfect. So tiny and just adorable... one second I must have a-\" there was suddenly a cozy hand-knitted sweater on everyone who needed one, and a caramel candy in every other hand. \"There you go. It's been so long since I've had a population to take care of,\" it might have been a divine presence, but everyone felt the voice lean in. \"I might even spoil you a little bit. I'm so bad.\"\n\n\\-----\n\nDear Humanity\n\nWe are glad you have been enjoying your time in the care of Lolthinway. Your thank you prayers are appreciated and know that we take all feedback seriously at Divine Protection Services.\n\nWe have let Lolthinway know that you would like to stay with her as your forever God until you rise yourselves. She was ecstatic! We've sent her the papers and she will have officially adopted you soon,\n\nCongratulations,\n\nMinithina, Your Divine Protection Agent",
   "created_utc": 1690307781,
   "score": 87,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtf1pke",
   "message": "“Hello, Hello, is this on? Right, good,” the mysterious voice chimed in everyone’s heads, adjusting the language filter to match each person so they could understand. “Now, I’ve put you all on hold for a moment so you won’t hurt yourselves.\n\nI’m your new foster god, due to reasons of…neglect. Naughty Jeh. Anyways. I see you’re all running… my Us, patch 1.00.05?! My last job was on at least 4.0! You’re due for an update, and that’ll be ready in about… let’s say 1 month, get you all used to the news. Nothing has to change, you can all keep your religious beliefs as they were, same powers, etcetera, etcetera.”\n\nHe pressed a button, the hold was released, and people just stared, dazed and shocked by what just went on.\n\nThey looked around at each other, making sure that someone else heard that voice.\n\nA scream pierced the air around them, snapping many of them out of their stupor.\n\nGod was real? And he was just…taken away, replaced like a substitute teacher in school?\n\nThe button was pressed again. “Ah, I’ve forgotten a couple things. I’ve given you a uh…type of terminal, you’ll see it tomorrow morning or after your next soft reset -you call it ‘sleep’- where you can make requests for the update, as well as ask whatever questions you desire. The Divine Protection Service is here to answer all your questions in this turbulent time. Ta!”",
   "created_utc": 1690309694,
   "score": 153,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtfje3q",
   "message": "All the religions, and all of its leadership, had gathered into a small room. None of them could resist the call. Even the more fringe religions were included, as were the heads of a number of online fan groups. Bill ran a group of online enthusiasts for the 1995 Toyota Corolla and even he got the call. So he went. He'd left in the middle of Whose Line is It Anyway to attend and didn't even realize until he got there. \n\n\"There\" happened to be a small room that somehow contained thousands of people, all sitting together in the same waiting room. No more than a dozen or so people seemed to be in the room at any given time. \n\n\"So this is 4D space,\" he said. \"Thought I'd feel more nauseous.\" \n\nSoon, he was ushered into a separate room by a small blob of light. The glowing orb didn't have wire-rim glasses, or a dreary grey blouse, or the sad beginnings of female-pattern baldness, but glowed as if it was these things. \n\n\"Hello dearie,\" the glowing presence said. \"I'm here to talk about your God.\"\n\n\"Oh,\" Bill said. \"Am I in trouble?\"\n\n\"Trouble?! No! Goodness, no. You're not in trouble. Do you feel like you'd be in trouble?\"\n\n\"Well...maybe,\" Bill said, scratching his head. \"Is God real?\n\nThe blob bounced in understanding. \n\n\"Bill, when was the last time you spoke to your God?\"\n\n\"Spoke? What do you mean 'speak'...like a voice?\"\n\n\"Well is that how you normally communicate?\"\n\n\"Oh...well, no. No, I haven't. But I thought God is supposed to be like...I don't know...in all of us, I guess?\"\n\nThe blob stared for a minute, then flared a little corona. \"It's cases like these that are the hardest.\" The orb extended two little solar flares that wrapped themselves around Bill's hands. They were warm. \"This is not how a god should treat its creations. What you and the rest of your world is going through is not right. How your brothers and sisters fight each other! The total lack of rules and boundaries and structure! Well...I'm here to let you know that it's not right, what happened to you.\"\n\n\"Oh,\" Bill said. \"Thank you.\"\n\nSuddenly there was a ringing in his chest. Than a slam. It was as though his soul was slapped against the walls of his ribcage. In his mind a presence formed, whirling and fiery and angry. The presence did not have a beer can in one hand and a rolled up TV guide in the other. Its breath did not stink of grain booze and cigarettes. But the voice that came out would have stank of it, as it said, \"I AM THE LORD. YOU KEEP TALKING AND YOU'LL SEE WHAT HAPPENS.\"\n\nBill pulled his hands away. Tears ran down his face. \n\n\"I need to go home,\" he said.\n\nThe solar orb flared its disc with concerned. \n\n\"Are you OK, Bill?\"\n\n\"No. Yes. I don't know. I don't want to get in trouble.\"\n\nYOU'LL BE IN A WORLD OF TROUBLE IF YOU DON'T CLOSE YOUR YAP\n\nBill recoiled from the voice in his chest and burst into tears.\n\nThe ball of fire seemed to dim, then burst, white hot and searing, like two supernovas shouting and screaming obscenities in a waiting room. Bill covered his ears. All around him melted, the 4D illusion peeling away as tens of thousands of people watched as God had a shouting tantrum in front office in front of the entire human species. Bill dared to take his hands from his ears.\n\n\"--your behavior is *plainly unaccceptable*. There are *sentients* in the room\"\n\nYOU DON'T GET TO USE MY NAME! YOU DON'T GET TO TELL ME WHAT I DO IN MY OWN CREATION! \n\n\"There are *standards*, and your behavior is in violation of those standards. If you continue this behavior you will be banished, now I need you to calm down and--\"\n\nDON'T YOU TELL ME TO CALM! DON'T TELL ME, I'LL TELL YOU, AND YOU CAN GET THE **HELL OFF MY--**\n\nAnd then the voice was gone. \n\nIt was as though ten thousands pounds of weight were lifted off his chest. No more judgment, no more terrible thoughts, no more shame...just silence. \n\nBill cried. So did all of his brothers and sisters--all eight billion of them.",
   "created_utc": 1690316324,
   "score": 118,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtfeala",
   "message": "Lucien Greaves, the spokesperson of the Satanic Temple, nervously picked at his jet-black vest as he stared at Pope Francis across the table from him. For more than obvious reasons, the two didn't exactly love each other, though the situation has... changed. They looked around the room filled with religious - and religion adjacent - leaders from around the world; people of all colours, genders, and sizes, wearing various clothing... all extremely uneasy.\n\n\"So,\" Chief Rabbi Yitzhak Yosef finally spoke, breaking the tense silence, \"I believe we can all agree that it wasn't some sort of... group hallucination.\"\n\n\"All over the world?\" Mahant Swami Maharaj, a Hindu guru, pitched in. \"*At the exact same time*? Impossible.\"\n\n\"How does it feel to know God does exist, atheist?\" a venomous voice rang from the crowd; likely a less important religious figure.\n\n\"How does it feel to know he abandoned you?\" Greaves fired back coldly. Several of the leaders stared at him angrily, but held back.\n\n\"Let us recap the situation and move on,\" Pope Francis urged. \"Two days ago, we were all telepathically told the Divine Protection Service has removed us from the care of... of our god due to neglect.\"\n\n\"And that we're getting a foster god?!\" Yitzhak Yosef cried out. \"The- this whole thing is madness!\"\n\n\"Oh I *love* madness,\" a young man wearing a Cthulu T-Shirt in the corner chirped happily.\n\n\"Are we *absolutely* sure he's allowed here?\" Sikh Guru Nandgarh pointed out.\\*\n\n\"Do we- does anyone - have any idea who... the *New God* is going to be?\" Greaves asked.\n\n\"Or what he'll stand for?\" Maharaj continued.\n\n\"Or what he'll want from us?\" someone in the crowd yelled.\n\n\"Think they'll be cool with Witchcraft?\" a young Wiccan woman near the wall asked.\n\n\"*God* I hope not. I mean- *shit*,\" another voice said.\n\n\"Stop blaspheming!\" someone said.\n\n\"Against WHOM?!\"\n\nThe room erupted into a mess of arguments and yelling, hiding the escape of a young man in a clean business suit. He walked out carefully and elegantly, but with a resolution that made it clear no one could stop him. After he walked a good distance away from the room, he pulled out a modern-looking communicator.\n\n\"HQ, do you read me?\" he said.\n\n\"This is Site 18. Your communication is now forwarded to a member of the Council. You may proceed,\" the communicator replied.\n\n\"This is Field Agent \\[REDACTED\\]. Situation is going as expected.\"\n\n\"Acknowledged, Agent. Continue to monitor. Apprehend anyone who appears to have additional knowledge.\"\n\n\"Got it. But... HQ? I- I have a question,\" the Agent nervously admitted.\n\nThe woman on the other side of the line looked to the side and brushed away her greying hair. It was against protocol to indulge in such communication at a time like this, but... even to her organization, '*time like this*' was stretching it. She pressed the button on the microphone.\n\n\"Go ahead, Agent.\"\n\n\"The New God... do you... do you think it'll be benevolent?\" he asked grimly.\n\nThe woman sighed deeply and considered it. Despite her years of experience, she... did not know. But as she looked on the wall adorned with the organization's logo - a circle with three arrows pointed inwards within another symbol resembling a three-pronged gear - she felt a jolt of confidence.\n\n\"Whatever it will be,\" she said into the communicator, \"*we'll be ready*.\"\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\\**He was not.*",
   "created_utc": 1690314438,
   "score": 106,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtfkn96",
   "message": "Reactions were....mixed.\n\nTrue believers were outraged.  Power hungry cult leaders were worried.  Less stringent leaders adopted a wait-and-see approach.\n\nBut no matter what they did, the day finally came when the new Foster God arrived in Flame and Light and Glory and all knew exactly, and minute and fine detail, exactly how far short they came of purity and enlightenment.\n\n\"THIS RACE HAS BEEN WITHOUT A FIRM AND GUIDING HAND FOR TOO LONG.  THIS CHANGES NOW.\"\n\nEnforcers swept down and everyone had a 'Guardian Angel'.  Every street had patrols.  Every action watched and judged immediately.\n\nTechnically, it was a Golden Age.  No one went hungry or cold.  Sickness didn't exist anymore.   \n The leaders of humanity were honest and competent.  Everyone worked their best for the betterment of humanity and the the stewardship of the planet.\n\nAfter 10 years, not a single word of complaint was made about Foster God.  No one left would dare.  They had seen what happened to those who complained and strictly taught their children (of which there was many due to the need to replace population numbers) about the glories of Foster God and that they should be always vocal in their praise in all their waking days.\n\nBut deep in the thoughts of many smiling faces and warm greetings, many still wished for the times when they could debate the existence of Gods and ignorance of the hard truth that what is worse than a silent and uncaring and possibly non-existent God, is a God that there is no doubt at all of their existence and constant intervention to make things 'Perfect'.",
   "created_utc": 1690316782,
   "score": 94,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtfkt55",
   "message": "It was 20 December 2025. All broadcasts—television, radio, everything!—was hijacked by an extraordinary message. All screens were displaying the same text, even the ones broken or not plugged in. Entire warehouses of monitors just suddenly switched on without power supply. The white-on-black text stated\n\n\"Your god has been removed due to Divine Neglect. Please wait while we work on solving the issue. Thank you for your patience.\"\n\nThe text appeared in all spoken languages, depending on the native language of the viewer. On the radio, the message was transmitted via Morse code.\n\nTo say it was puzzling would be quite the understatement. Nothing else happened for 3 more days. Except that's a lie. Way too many things happened. Society didn't completely break down everywhere, but the disobedience was anything but civil in most places. Most religious figures tried to curb the event to their liking. \"Testing our faith\" was the most liked phrase. Some sceptics escaped into conspiracy theories. In their defence, suddenly those sounded a lot more rational, now that the alternative was a belief in an actual … service or agency of divine caretaking.\n\n3 days. On Tuesday, 23 December 2025, something finally happened. A voice appeared to every human on Earth. Some received it on their phones, others on their televisions or radios. People who didn't have access to any of these heard it directly in their ears.  It was a kind feminine voice.\n\n\"Hello, humans! We've received numerous complaints of Divine Neglect from You, as well as from concerned colleagues of your previously assigned god. We are very sorry to have put you through the previous couple million years. Your god, very unprofessionally, created your Universe and just sometimes jumped in to meddle in your affairs, instead of taking proper care of their creatures.\n\n\"We have assigned a brand new god to you. Their name is Doatoknha. They are one of those previously mentioned concerned colleagues. They will turn this horrible world of yours into a paradise, I promise. I'll now let them take it from here. Good luck!\"\n\nThere was brief pause. A much deeper voice spoke up.\n\n\"So, everyone should be awake by now. Hopefully curing the deaf worked, too. I am Doatoknha, your new divine caretaker. You can just simply call me \"God\". I assume not all of you will appreciate this little stunt of ours, but hopefully we'll get through these differences soon.\n\n\"First off, we'll be working on violent conflicts between your 'nations'. They absolutely have to go before we do anything else.\"",
   "created_utc": 1690316842,
   "score": 89,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jtfd593",
   "message": "Faith is an emotion on its own. To embark on a journey of faith, true faith is a right on its own. \n\nSome people have recently lost that right. They called themselves the champions, the flag bearers of  their religion but instead they forgot the one thing that made faith the most powerful force in the world, humanity. \n\nWe have been watching Earth since the dawn of man. We watched them learning to stand on their legs. We watched them when they found the wonderful thing that was fire. We also watched as they created the factions of God. It didn't matter. God was a multi-headed entity. Every religion saw just one face. Some religions saw more than one face and that was agreeable too. \n\nBut we also watched when humanity turned on each other. We watched when they used the name of God as an excuse for their sins. We watched when they started considering themselves God. We watched and watched and watched. \n\nWe watched when one day God couldn't take it anymore. We watched him see the world he built with so much love being destroyed by the ones he created, the ones he loved. We watched him leave. \n\nAnd we knew that we won't be able to watch anymore. \n\n*\n\n*Send a message in every language possible*\n\nWe, the members of the Divine Protection Services, have found the mass cases of neglect and thereby you are being removed from the custody of God. You will shortly receive a message about your Foster God. \n\nYours sincerely,\n\nThemara\n\nDivine Protection Services. \n\n*\nWe saw the confused faces of the religious heads. They clearly thought that it was some sort of hallucination. But they didn't dismiss it. Instead all of them claimed to be god's vessel. The one God trusts the most. \n\nWe laugh at their naivete and their sense of grandeur. They just lost the protection of the parent who loved them unconditionally, the parent who was so saddened by the state of his children that he couldn't take it anymore. \n\nWe just hope humanity has prepared themselves for their Foster God. \n\n*\n\nWe watched as the Foster God arrived at Earth waiting for a warm welcome. Even a tepid one would have worked instead of the tepid silence he got. \n\nThey considered him a trickster. A mockery. But it still hasn't settled that he would be their God for the foreseeable future. \n\nThey don't know who they have pissed off. \n\n*\n\nShould we do something? The question was uttered daily in the halls of Divine Protection Services. But no one answered. We weren't afraid. We were intrigued. \n\nWe have always thought that God loved his creations unconditionally, even when they sought to destroy. But the new one, the new one reminded everyone that there are consequences to their actions. \n\nHe slowly but surely straightened out the creases on the cloth of humanity. He never chose a policy of silent treatment or having a chance to learn from their countless mistakes. \n\nHe adopted a more hands-on approach. Humanity will have faith if they don't know what to have faith in.  \n\nAnd the changes were already visible. The tides have turned towards the better. \n\nEveryone at the Divine Protection Services knew that the Foster God was what Earth needed. But they also knew that God would return.\n\nAnd isn't that the most condemning thought any person who had faith could have? \n\n***\n [You can find more of my stories at r/iknowthisischeesy]\n\nAlso I apologise in advance. I'm literally typing this half asleep.",
   "created_utc": 1690314013,
   "score": 40,
   "submission_id": "159czme"
  },
  {
   "comment_id": "jthlspx",
   "message": "[Typed from phone, forgive my fat fingers]\n\n\"And in todays news, a local home was discovered with still living universe inside consuming the house from the inside out for food.\"\n\"Local authorities began investigating when a neighbor heard growling and screaming, as well as flashes of light coming from the vacant property.\"\n(Camera feed changes to the neighbor being interviewed)\n\"Well, I hadn't seen the fella who lived there in nearly 12 millenia, and thought maybe something had gotten in.\"\n(Camera feed changes back to the news reporter.)\n\"When police arrived to investigate, they had just arrived on scene when a section of the wall collasped inward, most likely injuring the lone universe.\"\n\nThe Camera feed changes to a dash cam from inside the police vehicles looking down a side street of a rual neighborhood, fences line the left side of the street.\nA crash is heard followed by a roar. Another crash with bits of debris flying from the right.\n\"OH [BLEEEEP]\" is yelled as one of the police comes flying from the right and careening through the fence on the left.\nA dragon like creature completely black but inset with innumerable stars, its form is cloudy and shifting as if it could turn to nothing at any second.\nIt comes running and skidding to a stop from the right frame. It roars loud enough that the window of the car cracks in multiple places.\nIt turns away from the camera and gallops down the street while tendrils made from itself pull bits and pieces of debris and road into it.\nThe camera returns to the news caster.\n\"As you can see from the video, apparently the previous owner of the house had left their universe behind and it had gone feral. Its told to us that police had to call in animal control and even the national guard, to help subdue and capture the poor thing.\"\n\n\"Were happy to say that it was sent to a rehabilitation clinic and given a foster caretaker. Who told us that, after giving it proper food and having it sleep on an actual bed. It had finally warmed up to them, and after giving it its first hug in so long. We had reports you could hear the weeping from nearly two blocks away.\"\n\n[Had an idea from one of the other responses and I have a bunch of downtime at work today. Hope its good, I don't write stories alot.]",
   "created_utc": 1690351276,
   "score": 6,
   "submission_id": "159czme"
  }
 ]
}