{
 "submission_id": "159vwgl",
 "title": "[WP] If vampires don't sleep like humans, then they might finish their schoolwork overnight. If motivated, they can transfer scrambled paper notes into a notebook with focus. As a human roommate, you're more scared of their study habits/pace than the off-chance that they'll bite you in your sleep.",
 "selftext": "",
 "created_utc": 1690347167,
 "permalink": "/r/WritingPrompts/comments/159vwgl/wp_if_vampires_dont_sleep_like_humans_then_they/",
 "score": 138,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/159vwgl/wp_if_vampires_dont_sleep_like_humans_then_they/",
 "comments": [
  {
   "comment_id": "jthfifk",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690347168,
   "score": 1,
   "submission_id": "159vwgl"
  },
  {
   "comment_id": "jthprb4",
   "message": "“Lyle, I need to ask you a question.” Tyler stood at the end of the Lyle’s bed. The vampire inviting himself into his roommates’ bedroom. After all, a vampire only had to be invited inside a home. Once inside, they were free to wander wherever they pleased.\n\nLyle stirred, rubbing the drool from his lip as he turned, glancing at Lyle. Seeing his pale roommate looming over his bed, Lyle panicked, throwing a pillow at his head as he shouted a bunch of tired curses. Mixing the words up as he flailed on his mattress.\n\n“Fucbast!”\n\n“Fucbast? I’m not sure what that is. Anyway, I have a question regarding Egypt.” Lyle climbed onto the bed, laying on the blanket next to him, showing Lyle his notes. “Who was the mother of Thutmose the third?”\n\n“What?”\n\n“The mother of Thutmose the third. Is it Hatshepsut?” Lyle asked, shoving the notes in his roommate’s sleepy face.\n\nLyle squinted at the alarm clock by his bed, checking the time. He groaned, seeing how early it was, realizing how tired he was going to be for his classes tomorrow. Taking the notes, Lyle read over them, giving his brain a moment to wake up.\n\n“It’s 2am. Couldn’t you have waited a little longer to ask me this?”\n\n“As you said, it’s 2am. That’s the morning. I thought I would let you sleep in a little. You know I work best during these hours. So, what’s the answer?”\n\n“2am doesn’t count as the morning. No sane person is getting up at 2am unless it’s for work.”\n\n“Do you wish to debate the time, or would you rather help me and go back to bed?” Tyler asked. The question made the web covered cogs in Lyles’ brain turn. Eventually, he realized that this would be the quickest way of getting rid of the vampire.\n\n“Fine.” He huffed, turning on his star-shaped lamp. He grabbed his glasses from the bedside table and checked over his notes again. This time giving them a proper look over. After a minute of reading them, he pointed out the answer. “It’s not Hatshepsut. His mother was Iset. Hatshepsut halted his rise to be the pharaoh, though. Couldn’t you have googled that? Did you really need me to help you?”\n\n“I needed to make sure. People lie on the internet. I prefer asking you, since I can tell when you’re lying. Your skin gets cold when you lie.” Tyler patted Lyle on the head as he got off the bed. “Thank you for your help. I’ll let you sleep now, as I might need your help later.”\n\n“Wait, why are you even studying Ancient Egypt? Aren’t you trying to be a journalist?”\n\n \n\n“I am. I was allowed to choose a topic to research, so I chose ancient Egypt. It’s a fascinating period, wouldn’t you agree?”\n\n \n\n“Why wouldn’t you choose the 1900s? Or something like that. Weren’t you alive back then?”\n\n \n\n“I was. I just thought it was boring to write about a time I lived through. What is life if not a journey of learning and discovery?” Tyler said, gripping his chest in that typical dramatic vampire fashion. He looked over to Lyle, making sure his roommate saw how much passion he put into his words.\n\n \n\n“Easy for you to say. Some of us only have one life to live and now I’ve wasted a good ten minutes of it talking to you.”\n\n \n\n“Wasted? You were only planning to sleep through this period. If anything, I gave you an experience that was far more beneficial than sleep.”\n\n \n\n“Goodnight Tyler.” Lyle didn’t give him the satisfaction of a proper response, turning off his lamp as he pressed his head against the pillow. He heard the door open and close as the vampire left, hoping he could finally get some rest. As soon as he shut his eyes, he heard a scratching in the ceiling.\n\n \n\n“GET OUT OF THE ROOF! Study at a desk like a normal person.”\n\n \n\n“Being in the attic helps me think.” After Tyler said that, Lyle could hear him pacing around the attic, marching back and forth throughout the space. Tyler covered his ears with his pillow, wishing he was rooming with anyone other than the vampire. He would have taken a ghost at this point. Possession couldn’t be any worse than this.\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)",
   "created_utc": 1690354159,
   "score": 30,
   "submission_id": "159vwgl"
  }
 ]
}