{
 "submission_id": "15axjk5",
 "title": "[WP] Recession impacted MI6 is cutting costs, and the lavish lifestyle of James Bond. This is how 007 fights evil on a budget.",
 "selftext": "",
 "created_utc": 1690451505,
 "permalink": "/r/WritingPrompts/comments/15axjk5/wp_recession_impacted_mi6_is_cutting_costs_and/",
 "score": 66,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15axjk5/wp_recession_impacted_mi6_is_cutting_costs_and/",
 "comments": [
  {
   "comment_id": "jtn60u3",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690451505,
   "score": 1,
   "submission_id": "15axjk5"
  },
  {
   "comment_id": "jtni44p",
   "message": "\"Ah James, do come this way. Budget cuts affect us all, but we still have a few tricks up our sleeves.\"\n\nQ leans heavily on his cane as he limps towards an automatic door, then stops abruptly as it opens much slower than he anticipated, causing the spy following him to stop suddenly in turn. \n\n\"Sorry old boy, I've asked maintenance for weeks to fix this bloody door but they keep saying there's no money for the parts until next quarter.\"\n\nSide by side they walk steadily into a room lit by two buzzing fluorescent lights, and a third that flickers unpredictably and distractingly. In front of them sits a car beneath what appears to be a moth-eaten pair of curtains, with a Nissan badge partly visible through one of the larger holes. \n\n\"Do you mind doing the honours?\" asks the older man, gesturing vaguely towards the car, and Bond steps forward to reveal his new wheels. \n\nHe grips the edge of the paisley fabric and pulls firmly, causing a ripping sound as half the cover slips down the windscreen and is left holding a strip of grubby material attached at one end to the car. He drops it with disdain, and makes to wipe his hands on his crisp grey suit before stopping himself and brushing them against each other at arms length instead. \n\nHe looks skeptically at Q, who briefly looks sheepish before launching into his introduction. \n\n\"What we have here James, is the 2015 Nissan Leaf twenty-two kilowatt-hour in metallic red. Zero to sixty in eleven-and-a-half seconds and a top speed of eighty nine miles per hour. Range of up to eighty miles, if the weather's good. What do you think?\"\n\n\"Well it's, er… not quite what I'm used to…\"\n\n\"Precisely James! And that's what makes it so perfect for undercover work.\"\n\nBond scratches his jaw while peeling the old curtains off the windscreen, throwing enough onto the roof to open the driver's door. He settles into the grubby and stained velour seat, and grips the filthy wheel gingerly. \n\nLooking up at Q hopefully, he asks, \"Any, er, extras?\"\n\nQ grins, \"I was hoping you'd ask that. If you'd like to switch on the ignition with the button, just there by your left knee, you'll see that we've upgraded the entertainment system and installed a reversing camera. There, you should be able to see reasonably clearly now if you have to back up anywhere.\"\n\n\"Oh yes, and the bluetooth doesn't seem to be working any more, so I've had our chaps source a replacement unit, which we've hardwired into the aux socket. But whatever you do, don't unplug it.\"\n\n\"Explosives? Rockets?\" Asks Bond hopefully.\n\n\"No, it just forgets all paired devices whenever it loses power.…\"\n\n\"Right. Um, I just need to pop out for a moment, I think I left my pen in M's office. I'll just ask Moneypenny if she can pop in and grab it for me. I'll just be a couple of minutes.\"\n\nBond walks briskly back the way he came in, pausing awkwardly at the painfully slow automatic door. He pushes it apart with both hands and it makes a sad buzz then stops completely. Bond squeezes sideways through the gap, then his footsteps echo from the corridor beyond, all the way past M's office and into the distance. \n\nHe doesn't return…",
   "created_utc": 1690459251,
   "score": 23,
   "submission_id": "15axjk5"
  },
  {
   "comment_id": "jtoy6t9",
   "message": "\"Ahhh! I expected you to come for me\" said a mysterious fancy looking fellow sitting in a dark room while petting a black cat. Bond paused but was unsurprised that he was spotted. \n\nHe took off his camo coat and placed it on the sofa. Bond pulls out a flip phone. The mustached mystery man sarcastically asked \"what's that some kind of taser phone?\" The villain chuckled. Bond typed some kind of code and spoke on the phone. \"This might take a few minutes\" he stated. \"See Mr. Bond, I don't play no games, unless I'm the one who's making terms of the game, Ha ha ha\" Mr. Mustache menacingly spoke. \n\n\"It'll take a couple minutes, I'm here for something you don't expect\" Bond says with coldness. \"And what is that?\" The mustache man responded. \"You've been running the banks of London, making it big in the city\" Bond stated. \"I assure you Mr. Bond, I do business cleanly. That is profoundly the truth\" the mustache man says with a slight shake in his voice. \"The organization has deemed you quite influential\" Bond says. \"A man like me with this wealth and power, why of course\" the mustache man confidently voiced. \n\n\"And the organization has deemed you worthy\" Bond exclaimed. \"Worthy of what? I don't have time for your silly games Bond! Tell me what you want!\" The mustached man is losing patience. \"Well here's the thing, the organization needs funds. You can help\" Bond hesitatingly admits. \"HAHAH, bankruptcy waving in the corner eh? The villain expresses  delight in Bonds pleading. \" Right, like your adventures in Malaysia? Must have been fun to film those movies of yours\" Bond says with a smirk. The mustachioed fellow lost his grin immediately. \"Oh your game just got real Mr. Bond, okay I'll play\" he spoke with anger, he finally felt threatened.\n\n \"20 million in a week\" Bond confidently demanded. \"Fifteen--\", Bond interrupted. \"--30 million, by the end of the week. You know what happens if you don't deliver\". The doorbell rings. \"Delivery for Mr. Kenington\" the delivery man says through the door. Mr. Kenington went to get the door. \"That would be 7 pounds sir\" Kenington takes the pizza inside. \"How nice of you, I got pretty hungry when on my way here, you're so thoughtful Kenington\" Bond says as he swipes the pizza from his hands. \"Until we meet again Mr. Kenington, I'll tell Q about your willingness to help\" bond exclaimed sarcastically. \"Erm, you mind calling me a taxi? That was the last call on my plan...\" Kenington stares at bond in disbelief.",
   "created_utc": 1690480146,
   "score": 2,
   "submission_id": "15axjk5"
  }
 ]
}