{
 "submission_id": "15aygo9",
 "title": "[WP] \"Those aren't mountains, those are TEETH!\", one of the astronauts exclaimed.",
 "selftext": "",
 "created_utc": 1690454502,
 "permalink": "/r/WritingPrompts/comments/15aygo9/wp_those_arent_mountains_those_are_teeth_one_of/",
 "score": 75,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15aygo9/wp_those_arent_mountains_those_are_teeth_one_of/",
 "comments": [
  {
   "comment_id": "jtna5vh",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690454502,
   "score": 1,
   "submission_id": "15aygo9"
  },
  {
   "comment_id": "jtp55m0",
   "message": "I gave Gevitu a side-eye, as we approached the mountain range. The big fella was clawing at his flight harness with all four arms, all six eyes wide with panic. Fortunately, I'd locked it before we took off. I wasn't gonna make that mistake again.\n\n\"I know it's hard to believe,\" I said, gently. \"But we're going to be fine. Those are just mountains. Big rocks, basically.\"\n\nGev tried gnawing through the harness next, continuing to rave between bites. \"Those aren't mountains, Max! Those are TEETH! We dwell within the Great Beast's open maw, protected by the Mother, but if we disobey her by leaving the valley, it will close its jaws and crush us! All of my people will die, please!\"\n\nThat wasn't the weirdest cosmology I'd heard from a species with PPSS. Once I worked a planet where they didn't come down from the trees because they literally thought the ground was lava. Like kids playing a game, except the game was created by an alien parasite to retard the development of its host species.\n\nAs we passed the peaks and began climbing higher into the atmosphere of Korathru I, Gevitu, the first Korathru astronaut, thrashed, and screamed,and wailed in despair. Then, as the altimeter rapidly counted up, and teal green sky gave way to the blackness of space, he began to calm.\n\n\"Wh-what?\" \n\n\"We're outside the boundary of the parasite's electromagnetic field, now. That's why you feel less anxious all of a sudden,\" I said. \"But hold that thought. I want to show you something first.\"\n\nAfter attaining a slightly higher orbit, I turned the ship so the viewport faced Korathru below.\n\n\"By the Mother...what is that, Max? It's beautiful.\"\n\n\"That's your world, Gev,\" I explained. \n\n\"But where is the Beast?\" He squinted at the blue-green orb below. \n\n\"There's no Beast, Gev. Like I told you, those were mountains. This is it, your entire planet, as seen from above.\" I activated a screen, and pulled up the video feed from one of the drones I'd left behind in Gev's village. \"And here's what the little machines are seeing right now -- remember, like I showed you before?\"\n\nOn the screen, the tall, four-armed folk went about their business as usual, sorting and preparing gathered plants, or dressing wild game brought back by their hunters. And importantly, no one was getting eaten by the planet.\n\n\"I don't understand,\" he said, looking from the screen to the stunning view of the planet. \"When my people  commune with the Great Mother, she always warns us that...\"\n\n\"...that leaving the valley will be the end of your people.\" I finished for him. \"And yet, here we are.\"\n\nI pressed a button on the console, and switched the viewport to a subsurface scan of the planet, focused on the valley. There, deep within Korathru's crust was a writhing mass of tendrils branching into countless segments woven through the temperate rainforest valley where Gev's people lived. \n\nGev narrowed his many eyes in disgust. \"What is that?\"\n\n\"We call it a Parasitic Psychic Superorganism, one of a few we've found throughout the galaxy.\" I explained, then added. \"Your people call it The Great Mother.\"\n\n\"I-impossible!\"\n\nNot surprising. His people's traditional image of the parasite, inspired by the emotions it projected into their minds, was a female of their species with an exaggeratedly gravid abdomen, and engorged milk-ducts. I soldiered on with my explanation. \n\n\"You know the furry tree-leech things you showed me? Those tiny little animals that make you feel calm and relaxed, and numb your skin with their saliva, so they can latch on and suck out your blood? Well, imagine one of those, instead of making you feel calm, made you feel afraid. If you went to the cookfire to get a stick to burn it off, it would make you afraid of the fire, afraid you'd be burnt up if you even got near it. If you went to get some fotha roots to poison it, it would make you afraid of those, too. After a while, if the tree leeches did this to everyone in the village, you might all start to think that you'd die if you dug up a fotha root or kindled a fire.\"\n\nGev's eyes widened, as his mind began to see the paralels. Gev's people were simple hunter-gatherers, but they weren't stupid -- especially without a parasite influencing their minds. \n\n\"On the other hand, if you left the tree leech alone, and let it keep feeding on you? Then it might just let you go about your business. It might even let you feel extra calm and safe, as long as you were doing only what it wanted.\" I concluded.\n\n\"But...but why would the Mother do such a thing, Max?\" Gev pleaded.\n\n\"We don't know if the parasite is actually intelligent itself, or if it's just an instinctive response, but it only seems to target intelligent lifeforms. Maybe it's just scared -- intelligent lifeforms like your people and mine are capable of discovering it, and stopping it from feeding on our planets' ecosystem. Intelligence leads to rapid change and transformation, and these things have a strong incentive to keep things the way they are. \" \n\n\"What...what do we do?\" Gevitru asked, looking from the \nscan to the planet in horror.\n\nI smiled. \"Don't worry. My people can help -- a little. It's best if you accomplish these things on your own. But the solution is simpler than you might think -- though not necessarily *easy.*\" I pointed to the scan. \"The parasite needs you to believe that everything good that exists is beneath your feet. No matter how brutal and short your lives have to be, its okay because it's 'natural'. You're just one of many animals, and you shouldn't think of yourselves as more. The world you walk on is your mother, and she is divinity.\"\n\n\"That...that is very like the Mother's teachings.\" he admitted, grimly.\n\n\"So to counteract it's influence, you do what my people did, long ago, most of us at least. It's what let us build all these machines I've showed you, let us live longer and healthier, and journey to other worlds.\"\n\nI turned the ship away from the planet, adjusted the light filters on the viewport, and suddenly out view was filled with endless glittering stars.\n\n\"When you are looking for answers, for meaning, for your destiny, for God...\" I said, gently, as Gev gazed in awe at the universe spread out before us. \"Don't look down -- look *up.\"*",
   "created_utc": 1690482789,
   "score": 13,
   "submission_id": "15aygo9"
  },
  {
   "comment_id": "jtq2ge7",
   "message": "Lyra often wondered how many of history’s great explorers were simply the product of scientific innovation and good timing. Would Neil Armstrong still have leapt into history without Apollo 11? She thought he would. However, she knew that she would. Lyra knew that she would have a legacy that would rival the explorers that had gone before her. She would continue the journey Neil had started a century ago. Lyra didn’t need FTL travel to be great, but it revealed endless opportunities in a now much smaller universe.\r  \n\r  \n“Scientists and mathematicians meticulously plan out a ship’s route weeks in advance. Without that, we’re just making educated guesses, and they’re not even that educated,” Scottie sighed, already exasperated from having this argument before. “It’s not like traveling in a straight line. Using a quantum drive is more like creating a rip in the universe and traveling in its underbelly. It’s unpredictable.” Even now, Lyra knew she was winning the argument. She was wearing Scottie down, and eventually, she would win the battle of attrition.\r  \n\r  \nShe braced for planetfall. It took a few attempts, but their small ship had eventually emerged in a system with three terrestrial planets. Scottie had quickly replaced the fear and frustration that was plain on his face with awe at the sight of the fourth planet in the alien system. Life. From their onboard sensors, life was everywhere on this planet. Lyra picked the simplest place to land, a small valley encircled by a mountain range, and after an agonizing wait, the outer airlock opened and Lyra almost ran outside. She decided that she would make up her inspiring speech later. This discovery was hers, and she would savor it. History could wait.\r  \n\r  \nAfter a period of wonder and outright gawking at the local flora and fauna, Scottie and Lyra decided to go back to their ship to gather more readings. Apart from a distinct lack of large animals or plants, the planet seemed to have a thriving ecosystem. “Maybe life just developed on a small scale here,” Scottie reasoned. “This valley is protected on all sides by the mountains. Perhaps size just wasn’t necessary.” Lyra ignored Scottie’s rambling; her mind was focused on the find of the century. A slight shifting of the ground underneath her brought her back to their current situation. “I would expect seismic activity,” Scottie said after a brief silence. “It’s practically a must for complex life, although the ground here is odd.” He continued: “Its coloring suggests a high calcium content. You can even see it on the surface of the mountain range. Maybe this is a dried-up seabed?” Scottie surmised.\r  \n\r  \nThe ground shifted once more, and fear had returned to Scottie’s face. “I don’t think those are mountain ranges, Lyra,” Scottie’s voice had reached a higher pitch. “Those are teeth! It might explain why there is a lack of larger lifeforms in this valley; a large concentration of mass must trigger the trap.” Abject terror had reached his voice. The ship moved into view and the two explorers started to run. The ground shifted but Lyra stayed on her feet and reached the ramp leading to the ship, only stopping to turn around when she was already on board. A stony outcropping had tripped Scottie and taken the wind out of him; Lyra was terrified of being consumed by this country-sized predator and mentally rationalized leaving Scottie behind. He was too far away to be saved.\r  \n\r  \nThe journey back to Earth was going to be difficult; she would have to plan the ship’s route by herself without Scottie’s help. She knew Scottie couldn’t be saved; no one would blame her, but would that be her legacy? She began to spin a story, one where she would be the obvious hero, valiantly trying to save her fellow crewmate in the face of his bravado. Lyra would be remembered as a hero if not an explorer.",
   "created_utc": 1690495347,
   "score": 1,
   "submission_id": "15aygo9"
  },
  {
   "comment_id": "jtq8ftq",
   "message": "And thus they were teeth. I felt odd as we descended, not because we looked upon a range of pearly white monoliths, but because of how unfazed I was by the revelation. There was a general panic on the ship and someone screamed at me to pull us back up. But I had no reason to. I was always meant to come here. I don't know why. I just feel it. So the crew had to begin to make peace with it. \n\nThe lower we were the more of the mountains we saw. You never think of how strange a human tooth is once you see it with such clarity. And these were human teeth, that much I knew for sure. Someone activated the escape pod. Though the place where they stabbed the earth, the roots... they felt so *alien.* Too elegant for such an organ... are teeth an organ? I heard another escape pod leave. Oh, the roots were so smooth, so perfectly curved and the sandy barren earth beneath felt like it begged to be pierced, like it willingly made way for these colossi that sought to penetrate it. The earth wasn't earth.\n\nWho did they belong to? Who's orifice was I violating? Someone was sobbing in the back. Someone appealed to me, begged me to change course, I think, but I do not know, because they spoke in strange tongues and they weren't human, not like the Teeth were. Was I human? Our presence felt alien, unwanted. Someone's blood stained my hands.\n\nI screamed and wailed and nothing came out and I landed and the ground, the flesh, it made way for me, it embraced my ship and it let me exit, it let me out and though I forgot my helmet I soon realised it wasn't necessary, since only humans need oxygen. The walk was long, the towers, the assembly - they didn't let me land closer and so I walked and walked and dirt became pink and stone became flesh, the dunes moved and they weren't dunes but tongues, the soil beneath my limbs became or perhaps always was slippery, coated in grease, translucent grease that covered everything my eyes touched upon. I was walking and then I was at the base and I touched the root and the root touched me and its' perfect curvature fit into my hand-thing down to the last atom and I was free. I saw cavities and they were small but expanding, patient little deaths slowly consuming my beautiful marble pillars and before I knew it, there was hardly any mountains left, the rot corroded everything I ever found beautiful.\n\nI put my hand into my mouth but there was nothing to take hold of.",
   "created_utc": 1690497744,
   "score": 1,
   "submission_id": "15aygo9"
  }
 ]
}