{
 "submission_id": "15b8dji",
 "title": "[WP] \"In a world of boundless magic, every spell weaves its cost, for power never comes without a price.\"",
 "selftext": "",
 "created_utc": 1690479976,
 "permalink": "/r/WritingPrompts/comments/15b8dji/wp_in_a_world_of_boundless_magic_every_spell/",
 "score": 24,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15b8dji/wp_in_a_world_of_boundless_magic_every_spell/",
 "comments": [
  {
   "comment_id": "jtoxq8q",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690479976,
   "score": 1,
   "submission_id": "15b8dji"
  },
  {
   "comment_id": "jtpgmz2",
   "message": "Asper weaved an elaborate tapestry of invisible magic in the air, desperate to destroy his enemies. Each swipe of his arms was a beat of his heart lost — he could feel his life, slipping away from him as he cast the death spell that was the only hope of survival for him and his companions.\n\n*First Axiom of Sorcery; what you take, will be taken back from you.* \n\nThe wind crackled violently with static electricity. Around him, the grass quickly withered and died as he frantically drew power from everything around him, reducing everything he touched with his mind to little more than empty, mindless husks, vessels without substance, ships without captains or crew. \n\n*Remember the First Axiom well, for it is a warning. Beware the danger of Sorcery.*\n\nThe soldiers storming Asper stopped in their tracks, as the first of their ranks fell in a pile of ash and charred flesh, having been drained of mana by Asper's increasingly more aggressive grasps at magic. His own life was burning up like lit gunpowder; he had very little time left. He only hoped it was enough to save his friends. Save... *him*. \n\n*Second Axiom of Sorcery; trust bestowed is returned in power.* \n\nHaving drained the very soil beneath his feet, Asper reached deeper, draining ants and worms as he grasped for power. A mortal scream escaped his lips. He felt the magic tapestry begin to reach completion. \n\n*Remember the Second Axiom well, for it is a promise. Know well the power of Sorcery.* \n\nFrom behind him, Asper's friends were talking. *He* was talking. He was saying that Asper would destroy himself. He was suggesting that they give power to Asper — as though their limited mana would be enough to keep a sorcerer as powerful as Asper alive while overreaching. No, it was a stupid idea. And yet, it was coming from *him*. And Asper couldn't help but wish for survival. \n\n*Third Axiom of Sorcery; never take a life, save for the absolute necessity to save your own.*\n\nAsper felt his skin burning, his life slipping away. But it would be enough. The spell was going to work. Nothing else mattered. His friends were safe. \n\n*Remember the Third Axiom well, for it is a commandment. Obey the will of Sorcery.* \n\nAs the body of Asper Reich fell to the ground, withered, drained and destroyed, ten thousand lifeless corpses of his enemies followed him. The band of five — four now, with Asper's death — was left alone, standing amidst a sea of dead soldiers. Ottin started crying. \n\n*Knowledge of the Three Axioms is knowledge of the only law which matters.* \n\nThe weeping man fell to his knees, next to his lover's charred remains. The Azure Sorcerer was dead. \n\n*Deliverance from the Three Axioms is the only wealth which matters.*\n\nScreams of grief sounded in the vast, empty field. \n\n*Obedience to the Three Axioms is the only holiness which matters.*\n\nEventually, even those ceased. \n\n*Disobedience means punishment.* \n\nAnd the field was empty. \n\n*Punishment means Death.* \n\nAnd Ottin's heart was empty too.",
   "created_utc": 1690487129,
   "score": 10,
   "submission_id": "15b8dji"
  }
 ]
}