{
 "submission_id": "15b85op",
 "title": "[WP] The text on the treaty was unambiguous: the ambassador to the Galactic Senate *must* arrive in the oldest vessel still in service. As head of United Earth Fleet Command, you stand on Berth One in Charlestown Naval Yard and wonder how you're going to make this happen",
 "selftext": "",
 "created_utc": 1690479463,
 "permalink": "/r/WritingPrompts/comments/15b85op/wp_the_text_on_the_treaty_was_unambiguous_the/",
 "score": 66,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15b85op/wp_the_text_on_the_treaty_was_unambiguous_the/",
 "comments": [
  {
   "comment_id": "jtowc69",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690479463,
   "score": 1,
   "submission_id": "15b85op"
  },
  {
   "comment_id": "jtq95dk",
   "message": "No one said the ship has to arrive by its own means, and if there is anything our space program has taught us, it's that a well planned orbital trajectory beats any propulsion method.\n\nYou see, when the Treaty was ratified, the fastest means of propulsion we had were mere sub-relativistic fusion thrusters. They're pretty archaic by today's standards, as they are constrained to orbital mechanics and classical kinetics while in operation.\n\nThey're also pretty frugal in terms of exotic matter and energy consumption, so they can pretty much be bolted onto anything. Though, even if we convince them it's supposed to look like that, the old lady is gonna get torn apart before it leaves the atmosphere anyway.\n\nNow, we lucked out on this one. Apparently it is tradition to hold the next Galactic Senate hearing in the newcomer species's native solar system. Meaning right now, we have an Official Azatoth-class Outpost Station, well, \"stationed\" around Jupiter.\n\nThe one tricky thing is that the ship has to receive as few modifications as possible, and no carrier ship is to be allowed in the orbital vicinity of the station.\n\n\n“Oh yeah, the old lunar railgun trick worked wonders, we're pretty much already there! But like, how did you say we were supposed to _brake_ already?”",
   "created_utc": 1690498039,
   "score": 1,
   "submission_id": "15b85op"
  },
  {
   "comment_id": "jtqek1z",
   "message": "\"Ahoy, mother fuckers.\"\n\nDesmond Fleck was a bastard. Every person, human or otherwise, who had the displeasure of meeting him knew that statement as fact. Ambassador Fleck was awarded his prestigious position on a technicality. It was an embarrassing bureaucratic loophole that was quickly closed after his appointment, but the damage was done.\n\nEarth's first ambassador to the Galactic Senate would be an asshole.\n\nRee was a Senate ambassador from a small collection of arid worlds in an outer spiral arm of the milky way. He knew Fleck from a parlor game on a space station that went sideways. He was in the room when the now ambassador had stabbed a Grelican royal guard in the groin before soiling himself and falling into a trash shoot. \n\nNow here was that same man, jettisoning himself from a vessel clearly not designed for space travel. The misshapen hunk of steel hurtled uncontrolled past the Senate station. \"Ambassador Fleck, divert course of your... Uh, vessel, immediately!\" Ree could hear the control room chatter. The channel was open. \"Going to be hard to do that from outside the ship, control,\" he responded. \"Also it doesn't have thrusters.\"\n\n\"And it's about to explode.\"\n\nA blinding flash stung the seven eyes of Ree. When his vision recovered, his mandible flung open in shock. A wormhole had opened, and sucked the wreckage of the new ambassadors 'ship' into it. Another, less severe pulse of light erupted from the maw of that great tunnel through space. As quickly as it had appeared, the wormhole was gone. A knocking sound broke his state of shock, and Ree turned to see Desmond Fleck pointing down to the airlock controls. \n\nHe was smiling.\n\n\"Hey, I recognize those eyes. You were there for that game of stabs and shits on Figoro Prime Station. Any Grelicans get in my face, I'm pulling you over to tell them I won fair and square.\"\n\nRee blinked all seven of those eyes, considered ejecting Fleck back into space, then signed, and let him in. \n\n\"Ahoy back at you, mother fucker.\"",
   "created_utc": 1690500298,
   "score": 1,
   "submission_id": "15b85op"
  }
 ]
}