{
 "submission_id": "15bc0en",
 "title": "[WP] \"What's the word for that infestation of tiny creatures over there?\" \"Those are children, and that's a school.\"",
 "selftext": "",
 "created_utc": 1690488520,
 "permalink": "/r/WritingPrompts/comments/15bc0en/wp_whats_the_word_for_that_infestation_of_tiny/",
 "score": 11,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bc0en/wp_whats_the_word_for_that_infestation_of_tiny/",
 "comments": [
  {
   "comment_id": "jtpkd1j",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690488520,
   "score": 1,
   "submission_id": "15bc0en"
  },
  {
   "comment_id": "jtpzmt7",
   "message": "{[*PREVIOUS STORY*](https://www.reddit.com/r/WritingPrompts/comments/15ah7pt/comment/jtkuvhi/?utm_source=share\u0026amp;utm_medium=web2x\u0026amp;context=3)*}*\n\n# Nahagira\n\nI roll my eyes at the human. \"I knew those were children, I didn't know that was a school... I meant the building *behind* it!\"\n\nThe human, Mason, looks around the side of the school building... not necessary if he bothered to look up *properly*... I swear, humans are no further along in evolution than the 'great apes' they look down upon... \"Oh! *That* building! It's a laboratory, and they're not infested, the microorganisms are grown clinically for research. Plus, it would be an *infection*, not an *infestation*.\"\n\n\"What's the difference?\" I shake my head. \"Nevermind. Look, I'm trying to learn about how your world functions. My kind cannot rule efficiently if we don't know important details.\"\n\n\"I was ok with being enslaved by an alien race, but I don't want to be a fucking tour guide\" Mason snaps.\n\nSighing heavily, my head shakes. \"We're not enslaving your kind. We wish to bring humanity together and help it prosper. If you lot didn't have so many wars, you could have unlocked so much more! If you lot stopped being petty because of what you look like or what you say is and isn't real, you could have found *us* first!\"\n\n\"If I'm not enslaved, then can I go back home?\" Mason tilts his head slightly.\n\n\"Why did you even accept the job when it was offered? Go.\" He bolts away from me as I try to grasp what just happened... humans are strange creatures indeed...\n\n\"Nahagira.\" I turn to see Orbolaro. \"Boss, another human that threatened to fight us. He's been processed and is in our hands.\"\n\nMy hand quickly but gently grabs the hand of the human so I can scan his chip. His name reads 'Steven'. \"Steven, did you truly mean to fight against us when the planet already surrendered?\"\n\nMy gaze falls on him as he gulps. \"I- I- it sounded too good to be true... world peace has been promised so many times...\"\n\nI move my hand from his hand to his shoulder. \"No need to be afraid. Speak your mind.\"\n\nHe eyes me suspiciously for a moment. \"Forcing humanity into a surrender, yet promising to unite the planet? That sounds like an oxymoron to me.\"\n\nMy arm moves to my side, my body turning as I cross my arms. \"Thank you for being honest. Our emperor wishes to hold no illusion of our intention. Yes, we're on a mission to conquer the galaxy and beyond, but we're not dictators. We unite, not dominate. We bring peace, not misery and cruelty. We offer help and guidance, planets choose to trust us. First it's the leaders, then if the leaders agree we try being in charge for a while. If we're not wanted, we leave.\"\n\nI wait for the inevitable objection. \"What can I do to help?\"\n\nMy body whips round in shock. \"What?\"\n\n\"It can't have been easy for you to admit your true intentions. I wasn't sure when I was first told you all wanted to help... now I see it's a mutually beneficial arrangement. You get a share of the resources, and we become better for your guidance. So what can I do to help?\" Steven rattles his chains on his wrists, simply for precaution more than anything.\n\nI smile. \"I'm currently trying to learn about how your world functions. I'd like to ask you a question...\" I point behind the school. \"What's the word for that infestation of tiny creatures over there?\" This is merely a test, I want to know that he'll try to actually *help*, not lecture.\n\nHe gives me a puzzled look. \"Those are children, and that's a school.\"\n\n\\*Facepalm\\*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThis story is the first in my new series, [Alien's Servant.](https://www.reddit.com/r/Crystal_Chronicles/comments/15aiaee/aliens_servant/?utm_source=share\u0026amp;utm_medium=web2x\u0026amp;context=3) Please check it out!",
   "created_utc": 1690494248,
   "score": 1,
   "submission_id": "15bc0en"
  }
 ]
}