{
 "submission_id": "15bcbhf",
 "title": "[PI] A princess locked in a tower is saved by someone other than a knight",
 "selftext": "Sylviana had spent months trapped within the tower.  Her father came from a long line of royals from a very traditional family, with really outdated customs, like locking your only daughter in a giant tower in the middle of a labyrinth to get a son in law.  While her father was doing this to get her a spouse, he may have put in too much effort with the help of the royal wizard.  The whole labyrinth was an old prison made from some old war, they fully renovated it, and filled it with puzzles traps, and spawn circles to summon monsters that would follow the orders imbued into the circle.  But the absolute cherry on top, was the dragon.  They took no expense getting the biggest, and meanest beast they could, and placed it right in the middle of the labyrinth, to guard the tower, and this was no ordinary dragon, this was an eastern dragon, long and thin like a snake, with antlers like a deer, and instead of breathing a singular element, this thing had powers over the forces of nature, from the storms above to the earth below their feet, and even the fire on the torches.  \nHer father was determined to have only the best, unfortunately the only few that managed to make it to the center never appeared to be anywhere close to being the best, since no one has ever managed to touch the dragon, cause not only was it powerful, it was fast, and it's movements were almost snake like, plus it could move through the air despite not having wings, making it even harder to hit.  \nWhile everything outside the tower was impressive, the inside wasn't much.  She was placed in the only room at the very top, inside was a bed, a washroom, and a magic cabinet.  The castle where she grew up had a matching cabinet, the staff at the castle would place food, clothes, soaps and other things in it, and it would send it to her here, then she could place her dirty clothes and dishes and such into it to send them back, though on some of her more angry days she might shred the dress with her bare hands and send it back.  \nSylviana wasn't very angry today, but she watched as smoke rose out in the distance from the labyrinth, her sealed windows beings the only thing letting her see outside.  She's attempted to find some way out of this room, but the wizard took no risk, sealing any and all ways out, plus a few extra things incase she had any idea.  Like the cabinet, it wouldn't send things back to the castle unless she was so far away from it, keeping her from just sending herself back.  \nShe watched as the setting sun illuminated the rising smoke as it started to thin, whoever set it off must've either ran away or made it through.  Getting up from the windowsill she made her way to the bed, tearing off the dress, and just flopping down and grabbed the blankets.  \nLooking up she read the faint glow of the spell that had been engraved into the tower.  *Whoever make it past the labyrinth, defeats the dragon, and makes it within the tower, shall be linked to the princess within.*  Sylviana dreaded the day someone could actually make it past the dragon, but by that day her might've already given up, if only he wasn't so stubborn.\n\nWinnie was flying over the forest, the enchanted compass pointing forward.  Apparently Morice had been right, there was an eastern dragon around here.  The question was why there would be one out here in the middle of the western side of the continent.  A sudden gust of wind hit her from behind and the broom shook as passed.  \nTightening her grip, she steadied it.  She was tired of the barrowed broom already and couldn't wait to get her own back from Moria.  \nAfter a little while, she saw a strange sight, below her in the night covered forest was the rumored lair of the dragon, a Labyrinth, the whole thing was without a roof, no cover from the elements, and sticking out in the middle of the whole thing was a tower.  She smiled as she looked down.  Surrounding the structure was many people, most were sleeping, others were drinking.   It was a sight to behold, a number of idiot men all geared up to charge in headfirst at first light, but from what she could tell everyone was there along, with no companions.  If you were going to take on a dragon, especially an eastern dragon, you'd want a group.  The thought alone of someone trying to take it one by themselves was nonsense alone.  \nAs she approached the top, she was almost knocked off her broom by a sudden surge of wind that whipped up from the labyrinth below her.  As she back away from the wind she realized what must've been happening.  The reason there was even an eastern dragon out here was because someone had probably put it there.  Her guess was very high up noble, possibly a royal trying to flaunt their power, or maybe they hid away some sort of secret treasure.  \nIt was perfect, Morice would get himself an eastern dragon, and Winnie could get whatever little something was being protected by the dragon.  \nAs she approached the top of the labyrinth again, this time she watched, focusing her eyes on the faint glow of the magic as it started up, but as the wind shot up, she snapped her fingers, and cut a flit in the wind, passing through it as she went.  \nNow past the wind barrier, she continued forward, flying past the whole thing.  Making it to the center, she lowered down to the ground and silently landed, looking at the sleeping beast before her.  While usually someone would need a group, like stated earlier, Winnie had a something those nights and royals outside didn't, magic.  \nReaching into the bag hanging from her shoulder, she extracted a bottle, and letting some magic flow into it, the glass surface glowed red, then winding back her arm she threw it at the beast, and as it made contact with the beast, it disappeared in a quick puff of smoke, and after it cleared, she walked up to the bottle now sitting where the dragon had been sleeping, and picking it up, she looked at the tiny little dragon inside, looking like a lizard now if she didn't already know what it was.  \nStashing the still sleeping dragon into the bag, she made her way to the door that had appeared at the base of the tower.  \nOpening it up and heading in, she found stairs, and going up, she made her way up, all the way to the top.  Opening the door, she looked inside, finding it pretty empty of valuable treasures of any sort.  Heading in, she found herself looking at a bed, and on the bed a girl her age sleeping there.  Confused she looked around, then noticed a glow from above, looking up she read the illuminated words above them. *Whoever make it past the labyrinth, defeats the dragon, and makes it within the tower, shall be linked to the princess within.*  \n\"Oh, I think I screwed up.\"  \nLooking at the princess on the bed, she slowly sat down beside her, then gently shook her shoulder, only for her to suddenly jerk awake, a leg shot up and nailed her in the shoulder, knocking her off the bed, as the princess fell off the other end, \"I promise I am not her on whatever nonsense your family put you up to with this tower, I was just here for the dragon, I didn't even know there was a princess at all in this kingdom, though that might be a little redundant.\"\n\nSylviana looked over the mattress at the girl, her age it seemed, and she had wavy red hair, like a deep red, \"Seriously, you're the one who made it in?  What are you, a demon?\"  \n\"Well, not technically.  My mothered conned a demon into granting her child since she wasn't interested in having children with a man, and I was born with demon blood.  I know witchcraft, which is how I got here so easily, I don't think whoever made this considered someone with magic trying to get in.\"  \n\"Yeah, the royal wizard has a tendency to forget that.  Alright so what now, are you dumping me on my father's doorstep?\"  \n\"No, cause not only would he probably mount my head on the wall, but if we want to go our seperate ways, we'll have to get rid of this.\"  \nShe pointed to the ceiling at the words on the ceiling, and then it sunk in.  Sylviana dreaded the day one of her dad's schemes shipped her off with some guy, but this was even better, cause if she was bonded to this witch, her father would be unable to marry her off to some random noble or knight if she was linked to her.  \n\"Okay, this might sound crazy, but could you take me with you to some far-off place where my father would be unable to find, before we attempt to break the link?\"  \n\"Well, I guess, but what if even after we go far enough that no one your father sends can find us, and we're unable to destroy the link, then what?\"  \n\"You're mystically obligated to be my fiancée and wed me.\"  \nShe sat on the mattress of the bed and thought, then after a minute shrugged, \"Well it's not like I'm in a position to argue, come along then.\"  \nThe girl pulled out a key from her bag, then going over to the door, stuck it into the key hole and unlocked the door, though opening it up, instead of the stairs going down, she was greeted by the site of what seemed to be a foyer.  \nAs she held the door open to her, \"I'm Winnie Winchester by the way.\"  \n\"Sylviana Angelgrace.\"  \n\"Oh, are you that royal family that are descendant pf angels?\"  \n\"Why yes.  You aren't worried about that, demoness?\"  \n\"Not at all, it's what your father is going to do if he finds out is what worries me.\"\n\nThe king sat upon his throne, going through the documents before him, when the door opened and in rushed the wizard, closing the gap from the far end of the room in just a few second, coming to a stop a few feet before the king, bowing, \"Your majesty, someone has finally conquered the labyrinth.\"  \n\"Finally, I was beginning to think our kingdom had run out of strong warrior and that I would have to ask for some from the next kingdom over, so when do they get here?\"  \n\"Well, that might be a problem...\"  \n\"Explain.\"  \n\"You see, whoever managed to do it seemed to have done it through use of magic.\"  \n\"Ah, so he's resourceful.\"  \n\"Right, but whoever made it to your daughter, isn't coming back here.  They seemed to have just appeared from nowhere, went in, got Sylviana, and vanished with her, no trace at all.  I've questioned everyone who was present at the time, but no one saw anyone with magic go in, and there was eye on all four entrances.\"  \nThe king was silent, and while he seemed puzzled, he remained calm, \"Try to locate whoever it is that found my daughter, they are bonded together, so the by decree they are engaged now.  Once located bring them here so I can meet my future son in law.  I've waited this long; I think I can wait a little longer.\"  \n\"As you wish your majesty.\"",
 "created_utc": 1690489237,
 "permalink": "/r/WritingPrompts/comments/15bcbhf/pi_a_princess_locked_in_a_tower_is_saved_by/",
 "score": 12,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bcbhf/pi_a_princess_locked_in_a_tower_is_saved_by/",
 "comments": [
  {
   "comment_id": "jtpma0g",
   "message": "**Welcome to the Post!** This is a [\\[PI\\] Prompt Inspired](https://www.reddit.com/r/WritingPrompts/wiki/how_to_tag_prompts#wiki_pi.3A_prompt_inspired) post which means it's a response to a prompt here on /r/WritingPrompts or /r/promptoftheday.  \n\n**Reminder**:\n\n\u0026gt;[Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback provided in the comments.\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690489237,
   "score": 1,
   "submission_id": "15bcbhf"
  }
 ]
}