{
 "submission_id": "15bdir4",
 "title": "[WP] People thought you were nuts for buying the scary-looking doll in the shop. The Bad News? It was haunted. The Good News? The spirit inside it is overjoyed with the fact that it finally has an appreciative owner.",
 "selftext": "",
 "created_utc": 1690491968,
 "permalink": "/r/WritingPrompts/comments/15bdir4/wp_people_thought_you_were_nuts_for_buying_the/",
 "score": 10,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bdir4/wp_people_thought_you_were_nuts_for_buying_the/",
 "comments": [
  {
   "comment_id": "jtptkwj",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690491969,
   "score": 1,
   "submission_id": "15bdir4"
  },
  {
   "comment_id": "jtq8qgx",
   "message": "*Tink... Tink Tink... Tink Tink Tink Tink Tink...*\n\nA slightly off-putting series of piano notes sounded. I looked up from my book, seeing a figure peering around the door frame to my living room. I blinked, and they vanished, leaving an empty doorway.\n\nI gave a small smile, looking back down. Mere moments later I heard creaking floorboards, and a light patter across the ground. It seemed to rush towards me, making me look up again. Once again, I saw a figure peering, this time from behind my sofa. A blink and it was gone, this time disappearing with an echoing giggle.\n\nI counted down in my head, returning to my book.\n\n**Five**. A chill breeze washed over the room, directed towards my seat.\n\n**Four**. The sunlight through the window seemed to fsrken for a second, making me squint.\n\n**Three**. Another patter of feet, this time across the ceiling above me.\n\n**Two**. The hairs on the back of my neck prickled, as if someone were staring at me.\n\n**One**. Another giggle, though it sounded like it was coming next to my ear.\n\nI looked up from my book again, seeing the doll before me. She was made of porcelain, her eyes almost too realistic. A crack ran horizontally across her face, crossing her lips to make it look like a giant smile. Her brown hair was matted, with the brown growing darker across the matt. Her white dress was ripped, with a stubborn red stain over her chest.\n\nShe stared up at me, holding perfectly still. I simply picked up my bookmark, sliding it into my book and closing it gently. \"Good afternoon Twilight.\"\n\nShe held her position for a moment more, before crossing her arms. Her little foot tapped impatiently, as she stared up with those big eyes of hers. Her mouth didn't move, yet I could hear her speaking clearly, each word echoed behind themselves in a gasping tone. \"You could at least pretend to be scared.\"\n\nI snorted, reaching down to pick her up. \"You've done the same thing every day for the past six months, it's grown a little old unfortunately.\"\n\nShe huffed, letting me brush some dust from her dress. \"It's hard to change. I've been like this for decades, and it always worked before.\"\n\nI gave a shrug. \"Sorry. Though, I did want to ask you something.\"\n\nTwilight pulled herself from my grip, standing on the arm of my chair. \"Oh? Do tell.\"\n\nMy hand raised to gesture at the calendar sitting on the table next to me. \"Well, next month is a certain celebration of all things dark and spooky. How do you feel about working with me to put on a haunted house for those trick or treaters who come here?\"\n\nThe crack on her face split open, pure blackness behind it. \"You mean scare the hell out of anyone who comes to the door? Oh, you spoil me.\"\n\nI grinned in response. \"I was hoping you would say that. Though naturally, no harm should befall them.\"\n\nShe nodded. \"Of course. Thank you Clive.\"\n\nI gently picked her up, giving a careful hug. She might look horrifying, and love giving people a fright, but she was far too adorable sometimes.",
   "created_utc": 1690497867,
   "score": 1,
   "submission_id": "15bdir4"
  }
 ]
}