{
 "submission_id": "15bek9p",
 "title": "[WP] During one of your nightly walks, you stumble across a man struggling to rig the underside of a bridge with explosives. He also spots you and the two of you just stare at each other awkwardly, as both of you clearly don't know how to handle the situation or what to do next.",
 "selftext": "",
 "created_utc": 1690494432,
 "permalink": "/r/WritingPrompts/comments/15bek9p/wp_during_one_of_your_nightly_walks_you_stumble/",
 "score": 12,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bek9p/wp_during_one_of_your_nightly_walks_you_stumble/",
 "comments": [
  {
   "comment_id": "jtq03m8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690494432,
   "score": 1,
   "submission_id": "15bek9p"
  },
  {
   "comment_id": "jtqlcgr",
   "message": "Minding my own business on my nightly stroll down the riverbed I see a flashlight shifting under the bridge that leads into the city. I assume it's an inspector, well, inspecting it. It's an old bridge to be fair, and we've had one across town collapse not two weeks ago.  As I close in I notice the man isn't donning a reflective vest. In fact, he's clad in all black with a ski mask on.\n\n\"Strange attire for an engineer.\" I call out to the man, who is clearly shocked by my presence.\n\nHe drops something from his hand, and turns his head to face me. \"I've got a gun, take one step closer and I'll blow your lungs out.\" he says, placing a hand on his waistband. His voice is shaky as he offers the threat.\n\n\"Now why would it come to that?\" I reply, cautiously stepping closer.\n\n\"Good god, get away!\" he shouts back.\n\n\"Well you've just threatened me with a firearm, sir. I'm afraid if I show my back to you you'll start blasting away.\"\n\n\"Swear to me you're not one of them.\" he says. The look in the eye suggests he will not hesitate to fire if I answer incorrectly.\n\n\"Do I look like a cop to you?\" I offer, slowly opening my coat to show him I'm unarmed.\n\nThe man lets out a sigh, throws up his hands in frustration, then beckons me closer.\n\n\"What's this business anyway?\" I ask.\n\n\"Know anything about explosives?\" he responds.\n\n\"A thing or two I picked up from books. Why do you ask?\"\n\n\"Well,\" he says, picking up the parcel he had dropped earlier. \"I'm looking to blow this one.\"\n\n\"What on earth for?\"\n\n\"Coppers drive this route every morning. Timed charges you see.\" He opens the package. I recognize the contents as plastic explosives.\n\n\"Ah, you must be one of those revolutionaries I've been hearing so much about.\" I say.\n\n\"You aren't a snitch, are you?\" he says, shooting me an accusing glance.\n\n\"I'm sympathetic to your cause, believe that much sir. Just more of watcher than a fighter. You understand.\" I say back.\n\nWe stand there a minute, as an awkward silence falls on the conversation.\n\nI break it.\n\n\"What's this about explosives anyway?\"\n\n\"You see, I can get the damned things to stay in place.\" he says. He shines his light to the various points where he's already placed some. \"I just can't get the timer hooked up properly. Got the time?\"\n\nI pull my sleeve up and check my watch. \"Quarter past three. May I suggest something?\"\n\n\"What's that?\" he asks.\n\n\"You're placing them directly on the support. You'd need ten times the power to blow it from there.\"\n\n\"What do you suggest?\"\n\nI begin doing my own inspection of the bridge. It's rather small and showing signs of age. Seems to my eye he'd be doing the good folk of this town a favor by getting rid of it regardless.\n\n\"Place them in the middle of the bridge, that's the weak point. You'll be needing a boat or barge to stand on unless you've brought a pair of stilts with you.\" I look down at his cache of explosives. \"By god, couldn't get anymore? That amount wouldn't blow up a bike tire let alone a bridge.\"\n\n\"Times are tough.\" he says dejectedly.\n\nI place my hand on his shoulder in an effort to comfort the poor lad.\n\n\"Tonight's not your night. I suggest you acquire what I've recommended and try again some other time. I'll be passing through here each night around now. If you need anymore help just keep an eye out for me.\"\n\n\"Thank you, sir.\" he says. He turns and begins to walk off the way I came.\n\n\"Forgetting something?\" I call out.\n\n\"What?\" he calls back.\n\nI gesture broadly at the mass of explosives he's left strapped to the underside of the bridge.\n\n\"Right, sir. Thank you again sir.\" he says, hurrying back towards me.\n\n\"Good night and godspeed you brave devil.\" I say to him as he scrambles to collect his items.\n\nI continue along the path, satisfied that my engineering degree did not go to complete waste.",
   "created_utc": 1690503250,
   "score": 1,
   "submission_id": "15bek9p"
  },
  {
   "comment_id": "jtq7y31",
   "message": "\"Some days you just can't get rid of a bomb,\" I noted with surreal calm, watching the old, scraggly man strap a collection of C4 bricks to the underside of the bridge. It crossed over the Hillevi River in Macklemore, Arizona, less than a mile away from my house, along the path of one of my favorite walking trails. \n\nHearing me, he turned and fixed my eyes with his: they shimmered like a fresh graphics card pulled from a Best Buy box, and I suddenly found a deep, tugging desire to leave and forget everything, strong like the compulsion to stop running when you're on a treadmill and start wondering if your legs will buckle and get your knees ground up by the belt because you never wear that damn safety clip. \n\nBut I fought it. See, I'm a writer. I do it for a living, and I love it. And these daily walks are coal in the engine of my train of thought. Without the coal, the train doesn't run, and without the train running, the books don't get written. I don't get paid. My family - my wife, my daughter - they don't eat. And my family eats, baby.\n\n\"Nah, fuck off, go blow up some other bridge,\" I commanded. \n\nHe blinked, surprised, and climbed down from his perch. I backed up. He stared at me harder, and his shimmering eyes reached anime-girl-looking-at-cute-school-gerbil levels of nonsensical shimmer, which was fucking terrifying in real life, I'll tell you what. \n\n\"You...you're not bowing to my commands. You should be bowing to my commands!\" the man shouted. His teeth flashed, his incisors longer than normal.\n\nCrazy guy with sharp teeth, or legit vampire? I didn't care. I whipped out my phone. \"Listen up, one call from me, and the fuzz will be on your ass. You'd better start talking.\"\n\nThe question of crazy or vampire was answered: with a hiss, he turned into a ton of bats, and flew off. I started to call the cops, and that's when the entire bridge went up in a huge ball of flame.\n\nSuffice it to say, the trail was destroyed, and I can't walk very well after the force of the blast threw me into the rocks beside the trail and crushed a few vertebrae in my lower back to powder.\n\nBut that's all right with me, it was all worth it: the train's got enough coal now to last a lifetime.",
   "created_utc": 1690497541,
   "score": 1,
   "submission_id": "15bek9p"
  }
 ]
}