{
 "submission_id": "15bek9p",
 "title": "[WP] During one of your nightly walks, you stumble across a man struggling to rig the underside of a bridge with explosives. He also spots you and the two of you just stare at each other awkwardly, as both of you clearly don't know how to handle the situation or what to do next.",
 "selftext": "",
 "created_utc": 1690494432,
 "permalink": "/r/WritingPrompts/comments/15bek9p/wp_during_one_of_your_nightly_walks_you_stumble/",
 "score": 7,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bek9p/wp_during_one_of_your_nightly_walks_you_stumble/",
 "comments": [
  {
   "comment_id": "jtq03m8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690494432,
   "score": 1,
   "submission_id": "15bek9p"
  },
  {
   "comment_id": "jtq7y31",
   "message": "\"Some days you just can't get rid of a bomb,\" I noted with surreal calm, watching the old, scraggly man strap a collection of C4 bricks to the underside of the bridge. It crossed over the Hillevi River in Macklemore, Arizona, less than a mile away from my house, along the path of one of my favorite walking trails. \n\nHearing me, he turned and fixed my eyes with his: they shimmered like a fresh graphics card pulled from a Best Buy box, and I suddenly found a deep, tugging desire to leave and forget everything, strong like the compulsion to stop running when you're on a treadmill and start wondering if your legs will buckle and get your knees ground up by the belt because you never wear that damn safety clip. \n\nBut I fought it. See, I'm a writer. I do it for a living, and I love it. And these daily walks are coal in the engine of my train of thought. Without the coal, the train doesn't run, and without the train running, the books don't get written. I don't get paid. My family - my wife, my daughter - they don't eat. And my family eats, baby.\n\n\"Nah, fuck off, go blow up some other bridge,\" I commanded. \n\nHe blinked, surprised, and climbed down from his perch. I backed up. He stared at me harder, and his shimmering eyes reached anime-girl-looking-at-cute-school-gerbil levels of nonsensical shimmer, which was fucking terrifying in real life, I'll tell you what. \n\n\"You...you're not bowing to my commands. You should be bowing to my commands!\" the man shouted. His teeth flashed, his incisors longer than normal.\n\nCrazy guy with sharp teeth, or legit vampire? I didn't care. I whipped out my phone. \"Listen up, one call from me, and the fuzz will be on your ass. You'd better start talking.\"\n\nThe question of crazy or vampire was answered: with a hiss, he turned into a ton of bats, and flew off. I started to call the cops, and that's when the entire bridge went up in a huge ball of flame.\n\nSuffice it to say, the trail was destroyed, and I can't walk very well after the force of the blast threw me into the rocks beside the trail and crushed a few vertebrae in my lower back to powder.\n\nBut that's all right with me, it was all worth it: the train's got enough coal now to last a lifetime.",
   "created_utc": 1690497541,
   "score": 1,
   "submission_id": "15bek9p"
  }
 ]
}