{
 "submission_id": "15889ez",
 "title": "Crazy drunk dude trying to kick in my neighbor's door just now. Cops took ages.",
 "selftext": "This drunk dude just went on a racist rant at my Chinese neighbor's house at Bayswater. Cops took nearly 30 minutes to get here and missed the house three times. By the fourth time I switch my porchlight on and off to get their attention. The kicker? Dude got away.",
 "created_utc": 1690198923,
 "permalink": "/r/melbourne/comments/15889ez/crazy_drunk_dude_trying_to_kick_in_my_neighbors/",
 "score": 218,
 "url": "https://www.reddit.com/r/melbourne/comments/15889ez/crazy_drunk_dude_trying_to_kick_in_my_neighbors/",
 "comments": [
  {
   "comment_id": "jtaqbuk",
   "message": "I had a drunk driver crash into my house and the cops took 3 days to get there. Half an hour is pretty damn good",
   "created_utc": 1690231697,
   "score": 130,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtb7fye",
   "message": "The poor neighbours, that’s pretty scary.",
   "created_utc": 1690238604,
   "score": 21,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbcbt7",
   "message": "Welcome to the police shortage 😂\n\nFor every 5 that quit, another 2 quit",
   "created_utc": 1690240702,
   "score": 33,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jt9lp86",
   "message": "Ex local here. \nMate, I don’t know how long you have been living there for but Bayswater is quite a busy place for Police, not to mention it doesn’t have its own Police Station, so they come from Boronia or Knox, and newsflash; Boronia coppers rarely ever attend jobs from Police Station, chances are when they got the call they are chasing some junkie at Bosnia or trying to arrest a wife beater somewhere your end. \n\nAs intimidating as it is to be exposed to angry drunk idiots, they are not high up on list of Police jobs which gets stacked 15 high on a single van sometimes.\n\nThat whole area all the way from Ringwood up to Boronia needs extra Police Stations but they can hardly find people to man the stations that exists now, hats off to coppers that go from one crazy job to another every bloody night ten fifteen times, copes abuse and harassment from public for being late and they still come to work the next day.\n \nNot many people would put up with this.",
   "created_utc": 1690215817,
   "score": 173,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtboc0s",
   "message": "What! The cops actually showed up?! Luxury!",
   "created_utc": 1690245997,
   "score": 5,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbig5x",
   "message": "I wouldn’t decry the police response times. They simply wouldn’t have the resources. Write to your local state MP for better funding instead of being annoyed at how they take",
   "created_utc": 1690243384,
   "score": 10,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtaxikb",
   "message": "Different area, but took 2 hours and 3 calls for us to have a similar situation dealt with. Turns out the 2 stations were passing the job to each other because no one had staff. It's absolutely pathetic, when people need help they can't get it.",
   "created_utc": 1690234503,
   "score": 8,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtaryza",
   "message": "30 minutes is good for the East and a town that doesn't have its own station. People have to remember that Police aren't FRV. We don't sit around waiting twddling our thumbs during the day and sleeping at night. There is always work coming through via multiple agencies and avenues.",
   "created_utc": 1690232322,
   "score": 19,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtaz9c2",
   "message": "I'm surprised they turned up at all.",
   "created_utc": 1690235196,
   "score": 7,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtaztkz",
   "message": "At least they came…lucky you",
   "created_utc": 1690235419,
   "score": 5,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbv4hp",
   "message": "I don't know why some dudes think it's a wise idea to get drunk and do stupid shit to others especially to their properties. Don't they know people are usually better equipped when they are at home? And being in a drunk state impairs their ability to manoeuver? \n\nI've got all the garden tools like axes/chainsaws/spades/mattocks in close reach while I'm home and well if you're drunk and want to burn down my place...I think my weapon is longer than yours. And come on, you can't even walk a straight line. \n\nBy this rate, I think that dude's gonna get himself killed one day.",
   "created_utc": 1690249101,
   "score": 2,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtb9xi8",
   "message": "Cops were probably too busy defending a neo nazi protest.",
   "created_utc": 1690239664,
   "score": 6,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbc9fm",
   "message": "Next time tell the cops you thought he had a weapon in his hand. They'll arrive quicker",
   "created_utc": 1690240673,
   "score": 3,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbmaes",
   "message": "Half an hour is fast.  I wouldn't have even expected them to come.\n\nThis is why we need stand your ground laws and castle doctrine.\n\nGive homeowners immunity from criminal persecution when they are faced with a home intruder.\n\nPolice force stretched thin and can't respond?  We understand.\n\nLet us take matters into our own hands and let us defend our own homes with whatever means necessary, including use of lethal firearms and weapons.  Just don't get in our way and don't punish us for defending our family and homes.",
   "created_utc": 1690245060,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtb6aca",
   "message": "If it was 2 years ago and you called the cops and told them the neighbours had guests I'm sure they would be  there in a jiffy.",
   "created_utc": 1690238106,
   "score": 254,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtb38xo",
   "message": "ACAB",
   "created_utc": 1690236822,
   "score": 250,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jt8kj5z",
   "message": "They react quicker if you say you thought you saw a gun",
   "created_utc": 1690199093,
   "score": 229,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jt9a1ss",
   "message": "That kinda stuff isn’t very common around Bayswater",
   "created_utc": 1690211198,
   "score": 252,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jt8oxfd",
   "message": "Go out on your porch and scream at the offenders. The more noise made, the most likely they are to leave.\n\nAlso tell cops on phone they have a weapon, that will get them out faster",
   "created_utc": 1690201601,
   "score": 223,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbo24s",
   "message": "I'm amazed they turned up at all.",
   "created_utc": 1690245867,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbu3nw",
   "message": "I worked in the area for a few years and it was full of uneducated racist folks. But Bayswater does have one of the best Thai restaurants in Melbourne.",
   "created_utc": 1690248633,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtbz96a",
   "message": "I thought bayzwater was posh.",
   "created_utc": 1690251082,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtc2ae0",
   "message": "To busy taking bribes bad news for the country",
   "created_utc": 1690252540,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtc3drw",
   "message": "Do you think the drunk guy new them or was it just random?",
   "created_utc": 1690253062,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtc4vfj",
   "message": "Next time say there are kids involved",
   "created_utc": 1690253812,
   "score": 1,
   "submission_id": "15889ez"
  },
  {
   "comment_id": "jtc546j",
   "message": "Voting has consequences!",
   "created_utc": 1690253938,
   "score": 1,
   "submission_id": "15889ez"
  }
 ]
}