{
 "submission_id": "158afel",
 "title": "Anti Nazi protest Saturday 29th July, 2pm, Sunshine West",
 "selftext": "",
 "created_utc": 1690204603,
 "permalink": "/r/melbourne/comments/158afel/anti_nazi_protest_saturday_29th_july_2pm_sunshine/",
 "score": 156,
 "url": "https://i.redd.it/v91ziw82ywdb1.jpg",
 "comments": [
  {
   "comment_id": "jt92mvd",
   "message": "Tempted to just go to IGA, grab a bag of popcorn and watch the chaos ensue.",
   "created_utc": 1690208123,
   "score": 59,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtbdv49",
   "message": "I loved it when the various dickhead patriot groups all met up on a saturday at a suburban hall that was closed on a weekend to protest something they thought was un-australian. There was just them and news crews. The news crews got some great footage of the patriot dickheads fighting amongst themselves",
   "created_utc": 1690241371,
   "score": 5,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtbkmgk",
   "message": "It’s depressing that “fuck nazis” is apparently a controversial position.",
   "created_utc": 1690244328,
   "score": 6,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jt9h7a0",
   "message": "Gee wiz I wonder how this is going to end 🤔",
   "created_utc": 1690214064,
   "score": 16,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtapvkd",
   "message": "It's ridiculous that we need to be rallying this shit but here we fucking are.",
   "created_utc": 1690231522,
   "score": 34,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jt9r9be",
   "message": "Brave, bold stand you’re taking there OP\n\nFinishing the job that actual soldiers started 80 years ago\n\nThe IGA Carpark is our Normandy",
   "created_utc": 1690217940,
   "score": 33,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtajnvr",
   "message": "The ‘don’t turn up’ crowds are wild. \n\nRemember when Nazi Germany was defeated by everyone staying home and ignoring them?\n\nYeah me neither.",
   "created_utc": 1690229162,
   "score": 26,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jt8v1xk",
   "message": "Everyone hates Nazis right?\n\nSo let's show them how much they're hated.\n\nMeeting at IGA carpark in Sunshine West.\n\nPhoto courtesy of carf.melbourne on Instagram.",
   "created_utc": 1690204704,
   "score": 37,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtb52db",
   "message": "Alright legit question. Is there truly a nazi problem in Sunshine? I live round there and all I see are druggos and the Asians / Africans just chilling",
   "created_utc": 1690237585,
   "score": 11,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtb9iog",
   "message": "Is there anything small we can do that's just irritating? Like sign up the boxing clubs email to annoying spam? Things like that?",
   "created_utc": 1690239488,
   "score": 3,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtaqyw3",
   "message": "Would there be a lot of Nazis there to protest against?\n\n\nIn sunshine?",
   "created_utc": 1690231940,
   "score": 10,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtbjyo2",
   "message": "What are you protesting though, there aren't any Nazis here.",
   "created_utc": 1690244041,
   "score": 1,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtbhlrq",
   "message": "…IGA Sunshine West? Protest at the gym itself. Face these fuckers.",
   "created_utc": 1690243009,
   "score": 1,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtb6fxz",
   "message": "This shit just gives those brain dead morons something to battle against and makes them feel stronger. Amusing that you think this weakens them or achieves anything.",
   "created_utc": 1690238173,
   "score": 252,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtb2lko",
   "message": "I'm sure the cops will enjoy wasting their time protecting a bunch of smelly weak commies from the equally pathetic Nazis.",
   "created_utc": 1690236551,
   "score": 245,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtbk8ym",
   "message": "I'm sure both sides will meet and have a civil discussion!",
   "created_utc": 1690244163,
   "score": 0,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jt8x2ox",
   "message": "Stop reposting this don’t you people learn that all you are doing is promoting them. Ffs you people are braindead.",
   "created_utc": 1690205654,
   "score": 210,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jtbnq01",
   "message": "White supremism comes from a feeling that white people are being conspired against, that they need to assert themselves above others - to create a sense of empowerment. \n\nOrganising counter rally to brawl with these people is only likely to bolster thier world view.\n\nI get that people want to \"fight against bad guys\" but the way you fight the ideology of white supremacy is by convincing people to see the world differently, not by throwing hands",
   "created_utc": 1690245708,
   "score": 1,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jt94jpn",
   "message": "Don’t give them the attention, promotion and a platform. \nLet the cops sort them out with their new powers and pepper spray. \n\nThese counter protest protestors only make things worse and just encourages them. \nThey are not worth your brainpower or acknowledgement",
   "created_utc": 1690208933,
   "score": 230,
   "submission_id": "158afel"
  },
  {
   "comment_id": "jt99uif",
   "message": "[https://www.youtube.com/watch?v=WkHrFn4Fx6Q](https://www.youtube.com/watch?v=WkHrFn4Fx6Q)  \n\n\nOh boy more skibidi types!  \n\n\nDo you need refreshments, music. Hows the weather going to be?  \n\n\nI mean at a certain point your going to have to start asking questions about who's feeding em and where the money is coming from to doing these things......Lawyers aren't cheap, those businesses have back ends. I'm sure ASIO resources could be better spent elsewhere. But they did say there is likely hood of a supremacist attack in the next year, don't know what the pure worthy people they are protecting are doing on that day....presumably living the dream Four'n'twenty N\\*\\*\\*'s wish they actually had.  \n\n\nFor me it was a pretty big moral downer as a chemist when I found out an unusually large number of them were on 6 figure salaries and also my neighbors.  \n\n\n https://www.theage.com.au/national/inside-racism-hq-how-home-grown-neo-nazis-are-plotting-a-white-revolution-20210812-p58i3x.html  \n\n\nMight be more effective to let everyone else know how well paid they are to do what they do  and just watch productivity tank across the state. I'm sure the reserve bank will tut some more.  \n\n\nSuddenly the financiers have to decide on the productivity loss or putting the fear in to the darkie unappreciated people asking for a raise.",
   "created_utc": 1690211116,
   "score": 236,
   "submission_id": "158afel"
  }
 ]
}