{
 "submission_id": "158r3e1",
 "title": "Dog attack outside school this morning",
 "selftext": "I’ve posted for advice in the past regarding an owner who leaves her dog unattended at the school during drop offs. The dog has always been calm and seems friendly but I’ve raised concerns with both the owner and the school because dogs, and kids, can both be unpredictable. Each time the owner would become aggressive with me and talks about how controlled and kind their dog is and that it would never hurt anyone. The school hasn’t really taken anything but token action.  \n\nWell this morning the dog attacked another dog out of nowhere. It was with the owner but she couldn’t control it, it pulled the leash out of her hands, ran across the street and mauled a much smaller dog. \n\nThat could have been a child. \n\nSo to anyone out there who thinks they know their dog, or anyone who is kinda nervous. Report that shit. If the school and the owner don’t take it seriously, call 000.",
 "created_utc": 1690242012,
 "permalink": "/r/melbourne/comments/158r3e1/dog_attack_outside_school_this_morning/",
 "score": 20,
 "url": "https://www.reddit.com/r/melbourne/comments/158r3e1/dog_attack_outside_school_this_morning/",
 "comments": [
  {
   "comment_id": "jtbfszc",
   "message": "The day that dog owners become legally criminally responsible for the behaviour of their dogs cannot come too soon.  Another child or elderly person mauling cannot be too far away unfortunately.",
   "created_utc": 1690242222,
   "score": 44,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbjl47",
   "message": "Leaving a dog unattended would be a Council matter, as would a dog attack. Take photos, report to council. The only time police would become involved is if the owner deliberately set their dog on another dog or person. Don’t waste emergency services resources by contacting emergency services for non-emergencies.",
   "created_utc": 1690243877,
   "score": 13,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbnb1u",
   "message": "Call the dangerous dog line on 136 186. My dog who was minding her own business was attacked last week by a vicious American Staffy who was off lead. They take it pretty seriously and have a no tolerance policy. I had the same thoughts especially since my kid likes to walk our dog the most.",
   "created_utc": 1690245518,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbn3y2",
   "message": "Just yesterday I was lamenting not having the opportunity to take my dog (8 year old female border collie) for school pick-up. They don't allow dogs inside. With all of the kids getting about there is no way I would leave her unattended. I can't trust the dog or a child to behave appropriately so I just don't do it. It wouldn't be fair on her or the kids. Plus, the toddler is enough of a handful.",
   "created_utc": 1690245430,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbjyqe",
   "message": "000 is not for this sort of thing, the local council is. \n\nThat said, yes, I agree - report it every time and insist on a record number",
   "created_utc": 1690244041,
   "score": 5,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbh5i9",
   "message": "You suggest 000 operators waste their time and attention on nervous people?",
   "created_utc": 1690242811,
   "score": 4,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbjfa4",
   "message": "Did you call police?",
   "created_utc": 1690243808,
   "score": 252,
   "submission_id": "158r3e1"
  }
 ]
}