{
 "submission_id": "15742xa",
 "title": "How to effectively and constructively communicate feedback \u0026amp; suggestions to other users and developers",
 "selftext": "***TL:DR: the bold stuff in this thread.***\n\nThis post / guide here is intended to provide a few suggestions on how to (as a player) more effectively and constructively communicate feedback, suggestions or complaints to developers and also when discussing with other players.\n\n*It is based* [on a quote of an actual Game Developer](https://imgur.com/YahD5Eh) *(will provide source later).*\n\n***Effectively and constructively communicating*** ***will*** *lead to more harmonious interactions, but also* ***increase the chances of ones feedback to be clearly understood and to result in a desired outcome.***\n\n**=======================================================**\n\n\u0026amp;#x200B;\n\n**Consider the following or a similar structure** when wanting to effectively communicate your feedback to the devs or other players:\n\n\u0026amp;#x200B;\n\n***A) \"I am a \\[X Type\\] of Player...\"***\n\n*E.g.*\n\n* *Casual Player (only play # hours per week /primarily enjoy to play for the social aspect)*\n* *Enthusiast*\n* *Hardcore Player (play to win / for achievement)*\n* *ingame World Explorer / Lore Enjoyer*\n* *I like to feel powerful*\n* *I like visuals and explosions*\n* *I like to explore and come up with new builds, etc.*\n\n=================\n\n***B) \"... and I did \\[this\\] ... \\[in this context\\]\"***\n\nwith further details if needed. E\\*.g.:\\*\n\n* *I did Content XYZ (PvP, / Boss Fight XYZ / fighting Monster XYZ / Chest Grinding, etc)*\n* *used specific Skills,*\n* *specific Situation in a specific context (e.g. ...during a Helltide)*\n\n*or also on topic regards:*\n\n* *Itemization in General*\n* *the Artstyle or Visuals*\n* *Class Design decisions*\n\n=================\n\n***C) \"... My Expectations for this were \\[...\\]\"***\n\n*Example:  \"... to kill a lot of Elites and Bosses to get enough Cinders to open the Chest and to have challenging but fair Fights...\"*\n\n=================\n\n***D) \"... but what happened was \\[...\\]\"***\n\n*Example \"... that I got frequently CC Chained by XYZ and died often due to it. And when I finally had enough Cinders, I got hit by another CC and got killed again while opening the Chest, loosing additional Cinders.\"*\n\n=================\n\n***E) \"... which made me feel \\[XYZ\\].\"***\n\n*Example: \"...overly frustrated and displeased, because it felt unfair. \"*\n\n=================\n\n***F) \"I think the reason for this might be because \\[XYZ\\]\"***\n\n*Examples:*\n\n* *... a bug*\n* *... some numbers are too high / too low*\n* *not enough CC Immunity*\n* *CC's not being teased enough*\n\n=================\n\n***G) \"Can you do \\[XYZ\\] to solve / change / adjust this? \"***\n\n*Optional – but preferably in a separate section*\n\n*As the saying goes \"players are good at finding problems, but bad at coming up with solutions\".*\n\n*This is the place where you can share your personal opinions (ask for specific buffs, nerfs, etc) on how you personally would like to see the thing changed or adjusted.*\n\n*It is important that this section is clearly separated, e.g. by putting it at the end, as it is the least useful for developers, as players may not have the full picture of what might be going on behind the scenes... and what was written before this will help other users to understand where you are coming from and why you advocate for a specific thing.*\n\n**=============================**\n\nFrom the development side, many different aspects have to be considered, not just one or a few.\n\nThere might be reasons for why a certain thing is the way it is that players may not be aware of and hence structuring feedback in such a way or a similar one can help the devs a lot ***to figure out what you the issue at the core is you are trying to communicate and where the issue are***.\n\nOther users will benefit fron this as well when they understand what the core issue is you are trying to communicate.\n\n**=============================**\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n**=======================================================**\n\n**Some additional things to keep in mind that may can help**\n\n*----\u0026gt;* ***There many are different Kinds of Players***\n\n*Casuals, Enthusiasts, Hardcore Players, World Explorers, Lore Enjoyers, (unusual) Build Explorers, Power Games, etc. That is fine. See \"Timmy, Johnny and Spike\".*\n\n*Suggested Resources:|* [Resource 1](https://mtg.fandom.com/wiki/Player_type) | [Resource 2](https://www.youtube.com/watch?v=m5zh85RfLBk\u0026amp;) | [Resource 3](https://www.youtube.com/shorts/CdQue6nCV10) | [Resource 4](https://www.purediablo.com/brother-laz-explains-whats-wrong-with-diablo-iiis-legendaries) |\n\n*----\u0026gt;* ***Casuals are not the Enemy***\n\n[Why Casuals are important](https://www.youtube.com/watch?v=lNHrPMV0yIE)\n\n*----\u0026gt;* ***Different kinds of players can enjoy the same game for different reasons***\n\n*That is also fine and not problem when different kinds of content do not interfear with each other. World of Warcraft Analogy: PvP Content for PvPers, Raids for Raiders, and the Overworld with Casual Content and Transmogs Rewards for Casuals and Raider and PvP'ers that need a break.*\n\n*Point is, that trying to fight / argue against \"the outgroup\" or trying to change their mind on a personal preference is pointless and will lead nowhere.*\n\n*----\u0026gt;* ***Most often there is no Black and White, but a Greyzone***\n\n*Assuming ill-intent by default is rarely constructive, also when trying to solve an issue.. Many miscommunications happen when people misunderstand the others perspective or what they were trying to achieve, and hence have to make assumptions about what the other person is actually trying to say or what they intended. Or it is not fully clear on what the exact issue is that is being addressed.*\n\n*----\u0026gt;* ***Remain friendly***\n\n*An attitude of \"wanting to win\" or \"to dominate\" is in general not constructive when discussing with others or providing feedback, as it in general diminishes the intended effect of a desired outcome / improvement of the issue.*\n\n*Plus, by not giving into the negativity of others, even when the others side started, makes ones own feedback appear more constructive.*\n\n*----\u0026gt;* ***Sometimes there are no solutions, only trade-offs and/or compromises.****... ... ...*\n\n*----\u0026gt;* ***Many issues do not stem from the devs, but rather from corporate / management, / things out of the devs hands or sphere of influence, etc***\n\n*You never know. Assume the devs are doing their best and the best they can.*\n\n*Some issues may not be caused or (easily) solvable by the developers, as the root of the issue (or an other issue that interferes with it) lies somewhere elsewhere.*\n\n*----\u0026gt;* ***Development takes time.***\n\n*... and effort.  Be patient.*\n\n======================\n\nI will update and add to this over time, so if you have additional suggestion to be included, plz post them below.\n\nThank you!",
 "created_utc": 1690083957,
 "permalink": "/r/diablo4/comments/15742xa/how_to_effectively_and_constructively_communicate/",
 "score": 79,
 "url": "https://www.reddit.com/r/diablo4/comments/15742xa/how_to_effectively_and_constructively_communicate/",
 "comments": [
  {
   "comment_id": "jt6bb1v",
   "message": "Meanwhile, in reality, constructive and polite feedback is completely ignored because the only impetus for change is player dissatisfaction so severe that it threatens to harm the bottom line. If they don’t think you’re mad enough to quit, why would they fix your issue? These are ostensibly busy people who are prioritizing their limited time and resources. They’re going to concentrate on putting out fires. So your best bet is to light one.\n\nThis obviously isn’t ideal. But it is the way things work. If a “reddit guide” were capable of completely inverting this perverse incentive structure, I’m pretty sure it would have happened already.",
   "created_utc": 1690149822,
   "score": 27,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jtbrwub",
   "message": "Respectfully, you can be as reasonable and elegant and eloquent as you want, the Diablo devs aren't listening.\n\nFor evidence, I give you Diablo 3, or [This Post](https://us.forums.blizzard.com/en/d4/t/pretty-good-effort-post-on-some-issues-facing-sorc/68778/299) made by a passionate player outlining problems with the sorcerer class.\n\nOP's feedback is just...erroneous. Blizzard has your money. They no longer care until it's expansion -time.",
   "created_utc": 1690247648,
   "score": 9,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt2xusp",
   "message": "tldr don't be an asshat?",
   "created_utc": 1690084643,
   "score": 20,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt9cry3",
   "message": "I am (a redditor) and I did (a reply to this post). My expectations for it were (comedy), and in practice it made me feel (like doing homework). I think that might be because (I properly completed the assignment).\n\nJokes aside, I love this post. Love seeing references to Timmy, Johnny, and Spike in the wild.\n\nI think my only actual pain point is this line:\n\n\u0026gt; You never know. Assume the devs are doing their best and the best they can.\n\nI agree with you on the face of it, and I am sure the devs *are* doing the best they can with the technology they inherited from prior devs and balancing fan expectations with the tasks and goals assigned to them from higher up, and we should *never* target them with vitriol.\n\nBut at a certain point you can end up feeling like you gave the devs all the patience in the world, and even defended them and asked the community to please have patience with their process, and in the end all you got for your patience was a game that feels like it's ripping you off (specifically referring to the console ui that too easily spends your premium bp without a pop-up, similar to one of the reasons fortnite had to pay 250mil in damages after the FTC investigated them: \"the company used dark patterns to trick players into making unwanted purchases\").\n\nWas it the devs fault? Probably not entirely. Was it the prior devs fault who built a lot of the tech being used by current devs? Probably not entirely. Was it the game director's fault? Probably not entirely. Was it management's fault? Probably not entirely. Was it Bobby Kotick's fault...?\n\nActually, fuck the rest of this analogy, it probably was Bobby Kotick's fault. That's the scapegoat I'm choosing and I'm sticking with it.\n\nFuck you Bobby.\n\nGet some rest Joe you deserve it.",
   "created_utc": 1690212306,
   "score": 6,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jtbnwyj",
   "message": "Your subreddit isn't filled with bile because people didn't explain themselves in a polite, detailed, and specific fashion.\n\nIt's because Blizzard burned a fun game to the ground and there's only ashes in the playground we paid money to play in.",
   "created_utc": 1690245799,
   "score": 11,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jtcwfj8",
   "message": "How about them actually having a real product instead of this unfinished piece of trash before selling it? Then we can talk about constructive feedback. Right now its like trying to talk to a robber about how you can ask him kindly not to rob you.",
   "created_utc": 1690271742,
   "score": 6,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jtcixsi",
   "message": "then after all of that, the solution blizzard will put in place is to nerf sorcerers again",
   "created_utc": 1690261705,
   "score": 2,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt4o83l",
   "message": "please just create a megathread for complains each patch cycle and remove that shit if posted. This would improve this place a lot",
   "created_utc": 1690125054,
   "score": 4,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt3zj4e",
   "message": "Does blizzard even come here and read this subreddit?",
   "created_utc": 1690112628,
   "score": 5,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt4wb3d",
   "message": "How about have an actual vision for the game we bought instead of crowd sourcing ideas for your incomplete product.",
   "created_utc": 1690128466,
   "score": 4,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt9lrck",
   "message": "If It’s critical we provide the feedback in this manner, it’s already a lost cause.  Also you’re insinuating that the issues have been the way we’ve shared feedback rather than the response to the feedback.  They knew what they were doing.  The question is what the fuk did they think was going to happen when they \u0026lt;fill in the blank from a very long list of assery \u0026gt;",
   "created_utc": 1690215839,
   "score": 1,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt51z82",
   "message": "The important question, I think, is \"where do we give feedback ?\"\n\nBlizzard probably don't care about Reddit.\n\nThey definitely don't care about their own forums (even the US version). They don't answer even the simplest question there.\n\nThey seem to care about twitter but that's just not a reliable way of giving feedback.\n\nWhat else do we have?",
   "created_utc": 1690130858,
   "score": 2,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt5f753",
   "message": "nah",
   "created_utc": 1690136389,
   "score": 1,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt5mqg3",
   "message": "Why? When we can whine and complain, I mean look at destiny after that change some players even made death threats to the devs. Everything worked out, no?\n\n/s",
   "created_utc": 1690139520,
   "score": 1,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt4ik4r",
   "message": "People just want to vent their frustration most of the time. If it provides them some sort of emotional relief, just let them and try to ignore the post.",
   "created_utc": 1690122625,
   "score": 255,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt92yu3",
   "message": "Please please make a mega thread for the whiners. I want a sub where I can discuss the other aspects of the game like the story or theory craft other builds. This isn't a proper forum for feedback anyways. \n\nThis sub is dying. I still check in once in a while but I had to unsubscribe because it was legitimately ruining my enjoyment of the game.",
   "created_utc": 1690208265,
   "score": 0,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt3x5vt",
   "message": "I applaud your enthusiasm but it's crystal-clear that Blizzard doesn't listen to any feedback that comes outside of their office.\n\nDiablo IV is the opposite of what players were looking for.\n\nSeason 1 is a mess.\n\nAre you seriously expecting them to read our feedback, at this point?\n\nBlizzard stopped caring about the fans. They focus on the average Joe who enjoys smashing some buttons while relaxing on the couch.\n\nFor every angry redditor there are thousands of silent players who don't even know or understand the patch notes and simply play whatever Blizzard throws at them.\n\nIn short, this entire post is useless.",
   "created_utc": 1690110998,
   "score": 249,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt2ze8t",
   "message": "Please provide me feedback on my phrasing based on your rules. Trying to get this right so the devs understand my frustration\n\n“Blizzard this game sucks harder than me if I were super flexible and could touch my lips to my… ugh you know what, never mind.”\n\nThanks friend.",
   "created_utc": 1690085579,
   "score": 249,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jt3f04m",
   "message": "This is a pointless thread and more of a mega one.\n\nIdiots are going to be idiots regardless. The same with those who come on reddit to do nothing but downvote, kids say the dumbest things, and talk shit for attention.\n\nAnd when it comes to actual feedback and you've play games for decades and been through all the good and bad. Everyone already has their own view on the company and can see how it's going.\n\nI'm a game developer myself for many years. And when you have experience in the industry and knowledge. It doesn't matter how you write things if the outcome is to extend gameplay in the easiest and laziest way possible, while trying to grasp at as much money as possible through things like FOMO.",
   "created_utc": 1690096539,
   "score": 247,
   "submission_id": "15742xa"
  },
  {
   "comment_id": "jtjg0o1",
   "message": "Not like Blizzard will care anyway LUL",
   "created_utc": 1690388128,
   "score": 1,
   "submission_id": "15742xa"
  }
 ]
}