{
 "submission_id": "15b2hbx",
 "title": "Stop listening to others and play what you enjoy playing",
 "selftext": "Maybe I'm growing old now, but I really like the game so far.\n\nI've been playing D4 casually, averaging 2-3h a day. Some bad events have happened in my life and I don't have the time, or the energy to play more at least for now, but what I realized is that I don't feel exhausted after I quit the game in comparison to Lost Ark and Path of Exile.  \n\n\nI believe people nowadays tend to get bored of newly released games quickly after release, simply because of **unrealistic expectations**, and also **bad influence from content creators** on YouTube and Twitch. \n\nIt's funny how you see videos with titles like \"D4 SAVED\", \"D4 IS ACTUALLY GOOD?\". etc, and immediately one week after you see the exact opposite. If you disagree with any of that, prepared to get bullied, and if you agree - get lots of likes.  \nIt's pretty much the same for every newly released popular game and I'm sure the same will happen after the release of PoE 2 for instance.\n\nSome people must start playing what they enjoy playing, construct their own opinion based on their personal views, simply because it's a game, not a job...at least for some of us.  \n\n\n\u0026amp;#x200B;",
 "created_utc": 1690465981,
 "permalink": "/r/diablo4/comments/15b2hbx/stop_listening_to_others_and_play_what_you_enjoy/",
 "score": 204,
 "url": "https://www.reddit.com/r/diablo4/comments/15b2hbx/stop_listening_to_others_and_play_what_you_enjoy/",
 "comments": [
  {
   "comment_id": "jto1hjq",
   "message": "I don’t care about all the other complaints. The only thing I’m mad about after all this time is still, to this day since launch, I get terrible bouts of insane rubber banding that make the game unplayable. It’s not my internet. My speed is fine. All of my other online games are fine (because I play those when I can’t play this). \n\nIf they stopped working on everything else and just fixed that I’d be happier than anything.",
   "created_utc": 1690468018,
   "score": 242,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtok3oe",
   "message": "Lmfao 2-3 hrs a day is casual. That isn’t casual",
   "created_utc": 1690475000,
   "score": 48,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jto1g1y",
   "message": "I think there is a portion of people who may have stopped playing D4 when they potentially *could have* enjoyed it because of hot takes on the internet, sure. \n\n\u0026amp;#x200B;\n\nThere is also completely fair criticisms that, for someone that comes back to reddit once every few years, feel completely organic and discoverable just by playing. \n\nEnjoyers of the genre that typically love ARPGs have very valid critiques and they are primarily driving really positive changes in the game, which thoses critiques are often the things that *a lot* people are very turned off by, and will complain about. Part of me feels, rightfully so - Blizz should have done better - keep in mind this game cost good money.",
   "created_utc": 1690468002,
   "score": 106,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jto6dzs",
   "message": "There is a non-trivial amount of irony in trying to tell people not to listen to people.",
   "created_utc": 1690469903,
   "score": 97,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoke7y",
   "message": "2-3 hrs a day isn't casually though",
   "created_utc": 1690475108,
   "score": 23,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoimt5",
   "message": "Oh good another of these posts.z Y’all need to stop being so affected by Reddit and just play the game.",
   "created_utc": 1690474461,
   "score": 70,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtokg4n",
   "message": "You can do the exact same post without downplaying or degrading other people opinions and it would be far more realistic. \n\nYou are preaching something while acting exactly the opposite.\n\nYour last phrase being the icing on the cake.",
   "created_utc": 1690475127,
   "score": 50,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtolbly",
   "message": "I don’t think it’s an **unrealistic expectation** to expect that a AAA game that cost at least $70 should have: \n\n*Working resistances.\n\n*More stash tabs that aren’t loaded for EVERYONE in your screen.\n\n*More than 1 reskinned “pinnacle boss” whose entire design is “lul it’s hard because every ability 1 shots you”.",
   "created_utc": 1690475448,
   "score": 130,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtobnj5",
   "message": "I have to be honest, I think this is a far too pigeon-holey argument.  I, for example, have been playing aRPGs for 20+ years.  It's a genre I enjoy.  I liked D3 for quite awhile and still like POE every few seasons.  I don't watch youtube videos (like, at all) and I actually had LOW expectations for this game.\n\nAnd I ended up not liking it.  I'm not bent out of shape about it and you won't find very much comment history on this subreddit from me because I simply moved on to Remnant 2 (a far better game, in my opinion).  I'm only here now because I've found the extreme opinions on this sub amusing and I'm bored at work.\n\nMy point being - to say the only options are liking the game or being letdown by unreasonable expectations or bad influence is just wrong.  The game has a ton of flaws to it.  Some people won't care about these and enjoy the game and that's fantastic.  The flaws caused others, such as me, to not find the game fun at all and we move on.",
   "created_utc": 1690471885,
   "score": 55,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoffxb",
   "message": "Differing opinions come from different players and opinions change over time.  To act like this community is all one person being a hypocrite is very silly.\n\nA lot of the people who use meta builds, like when I was playing I used meta builds, because my home brews weren't working and I wasn't having fun.  I tried!  And that's where 90% of the complaining is coming from.  There's simply a lack of viable build variety.",
   "created_utc": 1690473286,
   "score": 24,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtofgyc",
   "message": "You're absolutely right. I've been enjoying replaying the fable series. I'm disappointed at the state of the game, solo XP is awful and the overall difficulty spike just left me not wanting to play anymore. Hopefully the next patch we see improvement but until then I'm not interested.",
   "created_utc": 1690473296,
   "score": 23,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoomst",
   "message": "Yeah that’s why I stopped playing Diablo.  Stopped listening to the hype when it first came out… played it.  It sucked.  Uninstalled\n\nOn to Remnant 2",
   "created_utc": 1690476661,
   "score": 7,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoe3ej",
   "message": "Don’t tell me what to do",
   "created_utc": 1690472791,
   "score": 26,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtowfc6",
   "message": "2-4 hours a day is casual then wtf is 1-2 hours every 3 days",
   "created_utc": 1690479495,
   "score": 5,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtonmkj",
   "message": "Yeah, great. Have a fun time. But you're doing exactly what you're complaining about. This isn't a righteous call to live and let live; it's a backhanded exhortation to sit down and shut up. \n\nNo thanks.",
   "created_utc": 1690476293,
   "score": 16,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtote2i",
   "message": "\" I believe people nowadays tend to get bored of newly released games quickly after release, simply because of **unrealistic expectations**, and also **bad influence from content creators** on YouTube and Twitch. \"  \n\n\nTIL a complete, finished game that is fun to play, is an unrealistic expectation.  \n\n\nWhy people shill for billion dollar companies I'll never understand. What are you hoping to get here?",
   "created_utc": 1690478392,
   "score": 19,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtonkiq",
   "message": "The game is not bad, I'd say it's even quite okish for casual gameplay\n\nBUT the game could and can be indefinitely better, even for these casual players. \n\nWith all the nerfs and slowdowns aren't they killing the casual playerbase that doesn't have time to play a lot? \n\nFor me personally I don't play this season because it just looks boring as a mechanic to just have these gems and nothing more. For a big season 1 this is a total failure. \n\nAnd by saying we have the fun of our life and patting the devs on the back for stupid decisions, will make the game worse and worse and worse over time\n\nHave the fun, but also live in a reality that the devs hold back the potential to make the game even more fun for you, because a lot of mechanics are still broken like resistance, CC and the universe loading of all inventorys",
   "created_utc": 1690476273,
   "score": 11,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoquag",
   "message": "Can you all stop making these posts as well? Both sides make the same posts. \n\nThis game sucks!\n\nI love this game it’s great!\n\nWe get it guys. Just kith and stop telling everyone what is or isn’t fun.",
   "created_utc": 1690477466,
   "score": 11,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoq7qg",
   "message": "Nobody is being told here. Nobody is stopping because this reddit sub told them to.",
   "created_utc": 1690477236,
   "score": 4,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtourlz",
   "message": "2-3 hours a day isn't casual.",
   "created_utc": 1690478888,
   "score": 5,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp9ukf",
   "message": "At this point y’all just karma farming \n\nAlso: I’m not sure 2-3H a day is “causal”",
   "created_utc": 1690484556,
   "score": 5,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoienh",
   "message": "In other words, you're saying lower your standards lmao.",
   "created_utc": 1690474377,
   "score": 24,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoo7fa",
   "message": "\u0026gt; D4 casually, averaging 2-3h a day \n\nPeople on this sub always manage to kill me.",
   "created_utc": 1690476504,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp3fer",
   "message": "“Guys… please don’t leave! Please help justify this dogshit game that I find fun still… please!!!!!”",
   "created_utc": 1690482124,
   "score": 4,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtpk7hb",
   "message": "Muting this sub. So many whack posts “don’t tell me game is bad I ackshually enjoy it” holy shit you have low standards",
   "created_utc": 1690488461,
   "score": 4,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtodefi",
   "message": "\u0026gt;I've been playing D4 casually, averaging 2-3h a day\n\nThis is not casual play. Why do people think this is casual?",
   "created_utc": 1690472534,
   "score": 13,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtodung",
   "message": "diablo 4 endgame is bitching about diablo 4 endgame",
   "created_utc": 1690472701,
   "score": 8,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoh9a7",
   "message": "I agree, don't listen to others and play what you like. For me, that is not D4.",
   "created_utc": 1690473953,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoqsmp",
   "message": "Yea brother. I’m not having a good time anymore. Others aren’t either. That’s how bad times work.",
   "created_utc": 1690477449,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtow8n0",
   "message": "Right? Like just go play. Almost nothing is as bad as this subreddit is making it out to be.",
   "created_utc": 1690479428,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoeuji",
   "message": "A bit tone deaf to tell people not to listen to other people, but to listen to you instead.",
   "created_utc": 1690473070,
   "score": 7,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtotpne",
   "message": "I think the flaw of this post is the game people want to play is the thoughtout/ polished version of diablo 4 we probably won't get for 2-3 years, and it's 100% on blizzard. People have the right to be upset",
   "created_utc": 1690478509,
   "score": 5,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtocmt6",
   "message": "That’s great that you enjoy the game. Some people don’t, and they have every right to be vocal about it because that’s how games improve. There is zero doubt that D4 is still in beta test mode. They are still making drastic balances to the game and some things like resistances don’t even work. The campaign and graphics are nice, but this is a loot based ARPG with terrible itemization and the end game loop is as barebones as it gets. Indie companies with far less resources are brining fresh ideas to the ARPG space, and people who love the Diablo series have every right to expect more.\n\n\nTLDR: congrats on liking it. Don’t assume other people don’t like a class / spec / game because it’s the “bandwagon”, criticism is good.",
   "created_utc": 1690472248,
   "score": 6,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtohw5t",
   "message": "I think that the majority of complaints in this sub are valid. I also am having a lot of fun and can't wait for people to shut the fuck up about problems that won't be fixed immediately so I can discuss the damn game again. When d3 came out, I wasn't having fun, so I walked away until it was good. I didn't spend weeks angrily spewing hate about it on reddit. It's a waste of time.",
   "created_utc": 1690474187,
   "score": 9,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtodgb5",
   "message": "Hahaha ah yes another person demanding we play the game how they want. Thank you chief, don’t know what we would do without your guidance.",
   "created_utc": 1690472554,
   "score": 6,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtohrj3",
   "message": "What is with the hate for streamers as if its their fault the game is in the state its in shits baffling",
   "created_utc": 1690474139,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoiyc1",
   "message": "It is interesting how the perception changes if you frequent these subs or youtubers. I was at a party last weekend and found a group of people talking about Diablo and everyone seem to agree that this game was really, really good. It was refreshing compared to what I see here. \n\nEven when I made mention of the Sorceress being weak meme, the sorcerer in the group was like \"Huh? I'm level 80 with my sorc? what do you mean?\"",
   "created_utc": 1690474580,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtojipb",
   "message": "Exposure/money-sick \"content creators\" were a mistake.  \n\nOutrage = clicks.  Proven time and time again. \n\nThe game is fine.  It's not stellar, it's not the worst game in the world.  It's fine. \n\nAnd that is okay.  Everything doesn't have to be perfect.",
   "created_utc": 1690474788,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtommcj",
   "message": "You spend enough time on the sub to have complaints get under your skin and then 2 - 3 hours a day playing. In what world is that casual lmao. I'm glad you like it, but these posts are just as annoying. I really don't understand advocating for them to not improve the game but to each their own",
   "created_utc": 1690475928,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtop9ct",
   "message": "While I agree and got my portion of fun out of the game. Look at franchise like Pokemon. If community won't fight for higher standards devs will simply stop trying. D4 is unfinished game.\n\n What is more its long awaited installment in legendary series coming out in 2023 while looking and playing below expectations.\n There were actually 2 times I was impressed by map, once when I got into first \"Lovecraftian dungeon\" and 2nd when there was zoom out on that very long bridge with crumbled ancient civilization below. That is all. Ppl were memeing about cow lvl but lack of actual HELL in Diablo game hurts so much more. \n\nThere were so many jawdropping games lately with more to come that Diablo just hits like a scout girl instead of one of the Great Evils.\n\nNow with that said I was feeling sick looking at poor Devs stuttering and mumbling during last stream. You can't work like that, it's unhealthy and draining. I would rather seem them excited about everything, full of ideas and projects but no. \n\nI kinda rambling right now but for me it boils down to this.\n\nIf Devs want me to use their shop and they want me to get excited for live service game. They should Go work for it because game is like 7/10  average single player right now.",
   "created_utc": 1690476888,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoqvgl",
   "message": "I don’t watch content creators on YouTube. Most (not all) are pretty moronic or just post click bait with insane titles that don’t hold up.",
   "created_utc": 1690477478,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtor06b",
   "message": "I'm playing and enjoying a lot of the game, but ALSO complaining. Blizz has a habit of giving players really good stuff lumped in with really dumb/bad stuff. They move slow, but with enough complaints their games get better.",
   "created_utc": 1690477525,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtowofm",
   "message": "I'd like for it to be more of a game, but after 2-3 hours and very minimal progress, you start to realize you have to invest a lot more to obtain that feeling of smooth power like everything is finally clicking.\n\nI consider myself a pretty casual player these days. But the drip...drip...drip... way the drops work and progress is made is pretty exhausting.",
   "created_utc": 1690479590,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtox9zv",
   "message": "While there are some things I would change about the game, I have enjoyed playing it thus far.",
   "created_utc": 1690479810,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoxih2",
   "message": "I just love the fact that so many people that abuse this game say they have nothing to do, yet less than 1% of players have gotten a hardcore character to level 50.",
   "created_utc": 1690479897,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoxq5h",
   "message": "Streamers and influencers almost always have the worst takes. They are the clickbait of gaming.",
   "created_utc": 1690479975,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp0tjz",
   "message": "All I want is Diablo's success because it is a game that I grew up with (played all of the Diablo games, even Immortal) and I would like nothing more but for the franchise to keep going strong but Diablo 4 is NOT in a state where it should be for an $70 AAA game. Too many bugs and mechanics that should've been tested and fixed before launch and too many nerfs in the name of \"balance\" that makes some classes a hassle instead of being fun and versatile in its builds.\n\nI hate being the one adding to the negativity of the game but  after playing post-patch for a good while now and dying alot more in the game than before the nerfs, I could wholeheartedly say that Diablo 4 is NOT in a fun state right now and I'm sorry but the people that keep saying \"well I'm having fun,\" \"just keep playing and ignore the hate,\" etc. are not helping the game and are instead choosing to just completely ignore or even encourage some of these \"fixes\"",
   "created_utc": 1690481115,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp1chn",
   "message": "I agree as much as it doesn‘t matter how much you play or what level you are. Also, I do not play a meta-build I got from the Internet, but a homebrew that may be bad but I personally like playing and having fun with.",
   "created_utc": 1690481315,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp9sew",
   "message": "First playthrough was fun. Campaign was interesting. Late game was a drag and a repetitive bore. I knew right after the patch notes that nothing sigificant would change to make the grind more interesting so I uninstalled.\n\nI'm not mad, but I'm disappointed in that I feel this game fell extremely short of it's greater potential. \n\nAs per your title, I did just that. I picked up Remnant 2 and was immediately reminded what an enticing loot grind feels like. Remnant is respecting my time a lot more and events/boss battles are creative and engaging. \n\nI had a decent time with Diablo and I'm happy with my playthrough but I don't think I'll come back. I expect better from such a large game dev but like many games I've seen in the last 5 years, they lost their soul when the companies started trying to design the game around a monetization scheme and half baked implementation of replayability.",
   "created_utc": 1690484533,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtpgdab",
   "message": "People like OP are the reason blizzard keeps getting away with these games...stop excusing shit design/ unfinished $70 games. These developers need criticism and feedback to improve upon. Take the resistances in the game not working. They knew about this all the way back in the beta and have done nothing about it. All they did was nerf you and rush out a shitty season. Not to mention all the rubber banding, disconnects, terrible boss designs, 0 build diversity, 0 stash tabs, terrible loot drops, and much more. Look how fast they 180'd on the nerf patch when everyone collectively agreed it was bad. They will do the same if we all get on the same page and stop praising them for mediocrity. Come on gamers, get some backbone and keep blizzard in check.",
   "created_utc": 1690487029,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtptcvn",
   "message": "You have to accept  the irony of Telling people to stop Listening to others by making them listen to you though. no hate, just thought it worth  mentioning.",
   "created_utc": 1690491884,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtpteur",
   "message": "It's like you saw a few complaint posts and decided not to actually read any of the many *real* issues with the game and decided other people must be wrong because you're able to enjoy the game as a casual player.  \nYou're also being critical of players who play more than you \"not a job\", which is pretty insulting.  \n\nThe absolute bottom line is that when people get to 'end game', which can happen extremely fast or slow depending on time spent + efficiency, its non-existent. There are 2 things that you'll do at endgame:   \n1) Spam NM dungeons until eventually you can clear 100.  \n2) Attempt Uber Lilith.  \nAssuming you do both of these, which we've seen players already do in under 1 week of gameplay this season, what else is there to do?  \n[Exhibit A](https://www.youtube.com/watch?v=wRVCs5x1Uis), [Exhibit B](https://www.youtube.com/watch?v=ZajvkvVHDQ0)  \n\nD3 offered endless Greater Rift challenges with a leaderboard so you could really feel you progress even after you were full build with good gear. D4 offers nothing of the sort.",
   "created_utc": 1690491905,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtpybqv",
   "message": "Its still a \"fun\" game to kill monsters and kill time.\n\nThe issue is it should have been so much better",
   "created_utc": 1690493749,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtq2dpb",
   "message": "That's the reason I don't play D4, but Elden Ring 👌",
   "created_utc": 1690495316,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtq31z5",
   "message": "Yes, agreed. Play a different and likely much better game entirely 🤣.  \n\n\nIn all seriousness, I'm bored of the season and the game and I moved on. No hate or anything I'll come back when the game has more robust and complete features, that's all, no salt needed.",
   "created_utc": 1690495583,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtq6cmh",
   "message": "Waiting for baulders gate 3 and Poe and checking out ofthis dumpster fire of an ARPG until the devs get a clue and make a season that actually has content and an end game",
   "created_utc": 1690496890,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtq7gr8",
   "message": "How many times do I have to say this? 2-3 hours a day isn't casual at all. That's like telling the doctor you drink a fifth of vodka every night but it's not alcoholism because you know people who drink more.",
   "created_utc": 1690497344,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtq8umr",
   "message": "I NEVER comment in Reddit, I can't even remember the last time I have but this deserves a bump. JUST HAVE FUN, who cares about this optimal that optimal blah blah. If it takes you forever to trash the easiest of mobs but YOU'RE having FUN then who cares, you do you boo boo. This may be a bit of a tangent but it was fun. Off I go to kill things with my poorly put together Lightening Sorc, weeee!",
   "created_utc": 1690497916,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtq94a6",
   "message": "You probably haven't even played end game yet.\nLike the game all you want, it doesn't negate the criticisms.",
   "created_utc": 1690498027,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoakx2",
   "message": "Honestly these posts are way more annoying than the ones with criticism. Like you said, just go play the game if you like it",
   "created_utc": 1690471486,
   "score": 8,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtobg3n",
   "message": "Its not unrealistic expectations to expect the 4th iteration of a genre defining game to have atleast playable skill balance....like the earlier ones((in varying degrees all did it..even immortal)).But if you dont care about that and you enjoy what you got its all good too!",
   "created_utc": 1690471808,
   "score": 7,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoo7t8",
   "message": "This was the first game I didn’t buy because YOU KNEW this was going to happen. After that one kid spending 10k on one character in Diablo immortal i bet it absolutely pains them to make a game they can’t have tons of micro transactions in. \n \nPersonally all this controversy has been the chefs kiss to read and content that never stops giving.",
   "created_utc": 1690476508,
   "score": 4,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoqfd6",
   "message": "\"Play what u enjoy\" .. so it wont be diablo",
   "created_utc": 1690477313,
   "score": 4,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp1i9h",
   "message": "\u0026gt;play what you enjoy playing\n\ngreat advice, it's the exact reason I quit playing d4",
   "created_utc": 1690481376,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtp4eh8",
   "message": "“Don’t listen to others, listen to me”\n\nThanks for clearing everything up OP.",
   "created_utc": 1690482508,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtofenx",
   "message": "If I see one more person say they're having a blast I will kill myself",
   "created_utc": 1690473273,
   "score": 4,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jto3adj",
   "message": "How can i enjoy the game if literally everything in the game is designed to annoy me?\n\nThe clunky horse, the limited stash, the constant Vulnerable text, the dungeon backtracking, the dungeon affixes, being forced to constantly use basic attacks before you use your actual damaging skill, being forced to run nothing but Nightmare Dungeons.\n\nIt's not nitpicking or streamer propaganda if every single system in the game is annoying.\n\nYou people defending the game always try to spread positivity like nothing annoys you.\n\nLike you're type of person that can walk to a street and a homeless spits in your mouth and you keep on smiling, continueing to have a \"positive\" day.\n\nNot being annoyed and constantly positive isn't something \"brave\" you should be proud off. It just means you're repressing your feelings and botleing up your anger until you go postal on a unsuspecting victim.",
   "created_utc": 1690468716,
   "score": 7,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoglbt",
   "message": "You're right. I'm gonna go play Diablo 3",
   "created_utc": 1690473706,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoh7lq",
   "message": "That's why I've quit and go back to Poe, but I'm sure I'll be back in few seasons or around dlc",
   "created_utc": 1690473936,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtohmuh",
   "message": "\\\u0026gt; **unrealistic expectations**\n\nSorry for hoping they make a gems tab, a functionning horse and FUKIN FIX LAGS FOR WEEKS as they are a small indie company with 3 servers top",
   "created_utc": 1690474092,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtouocq",
   "message": "I love the amount of people calling this hypocritical and completely missing the point of the post lol.",
   "created_utc": 1690478855,
   "score": 2,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtnxzaz",
   "message": "Couldn't agree more.\n\nKids these days are just sheep, whatever social media say's MUST be true, and I must NOT think for myself. :P",
   "created_utc": 1690466626,
   "score": 255,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtogxmg",
   "message": "\"Don't listen to them, listen to me.\"",
   "created_utc": 1690473833,
   "score": 3,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtor1h3",
   "message": "Literally zero people have any value or effect when they try to talk or post about D4 when it comes to what I'll do for it. I have found naturally after reaching 60 in seasonal that I'd rather log onto D2R season 4 (kekw theres like 10 people playing it) doing mostly SSF or Wotlk Classic (gross idk why). But I'm having fun and don't feel like being on d4 right now. Oh well. I'm sure I'll go back in a month or maybe sooner who knows.",
   "created_utc": 1690477537,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtnybpu",
   "message": "D4 is fun and I'm having a blast. It's only because the people enjoying the game aren't on Reddit. You have people like me that are in bed and just about to sleep on Reddit who enjoy the game",
   "created_utc": 1690466766,
   "score": 255,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jto9w2b",
   "message": "Ah and in a week this guy will be one of those posts saying \"sorry no lifers you were right there is no endgame here\". Know why? Because there isnt.",
   "created_utc": 1690471230,
   "score": 0,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtohono",
   "message": "I see the shitposting here, and for the most part it appears as if someone is disliking the game in any way, they come here* to complain with likeminded people.  It also seems like they have more fun complaining here than, say, moving on to a different game/moving on with their life.  \n\nWhen I dislike/hate a game, I just stop playing it…maybe that makes me old.  \n\nHowever, I continue to play D4.",
   "created_utc": 1690474110,
   "score": 0,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoi040",
   "message": "\\\u0026gt;  I believe people nowadays tend to get bored of newly released games quickly after release, simply because of **unrealistic expectations**, and also **bad influence from content creators** on YouTube and Twitch.   \n\n\nI get massive downvotes everytime I tell people to stop parroting content creators who are creating content by making up drama.   \n\n\nGolf Clap for you sir. Good luck not getting spammed with downvotes",
   "created_utc": 1690474227,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtoilxs",
   "message": "I’m having a good time with it. The miserable people gonna miserable. Weird that they don’t just uninstall the game.",
   "created_utc": 1690474452,
   "score": 1,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtofh62",
   "message": "PoE fans are hardcore ARPG fanatics. The non-delusional ones realize their favorite game will never have mass appeal due to its complexity.\n\nLike, I love the Crusader Kings franchise, but I would never claim it's \"the best kingdom-building simulator\" for all people. I recognize it scratches the unique itches of the niche user preferences I happen to hold. For people outside my user persona, it's a fucking nightmare of a game to learn and not worth the effort.\n\nD4 does what no other modern ARPG has done since, well, D3: made itself accessible and fun for the casual gamer, reducing cognitive barrier of entry to near-zero. We can mock it for that, but it ain't easy to do. I totally ignore PoE zealots who try and convince the rest of us that the game is absolutely better in all ways.",
   "created_utc": 1690473299,
   "score": 0,
   "submission_id": "15b2hbx"
  },
  {
   "comment_id": "jtohh8d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b2hbx"
  }
 ]
}