{
 "submission_id": "15756ik",
 "title": "[Weekly Questions + FAQ Thread] for Frequently Asked- Limited-scope - and New Player Questions (incl. Seasons, Crossplay / Cross-save, System Requirements, Battle Pass, etc)",
 "selftext": "**Due to questions and comments regarding:**\n\n* [Seasons](https://www.reddit.com/r/diablo4/comments/14fzvlj/psa_faq_seasons_seasonal_and_nonseasonal/)\n* the **Battle Pass**\n* D4's **Monetization**\n* **Crossplay** and **Cross-save** *(playing / save-files across several platforms - PC, XBox, PS - including \"do I need separate / individual copies for each system?\")*\n* **System Requirements / Technical Questions**\n* **Limited-scope Questions** *(questions that only require short or simple responses and don't encourage quality discussion)*\n\n\u0026amp;#x200B;\n\n**...being asked very frequently on the subreddit, preferably post them in this thread** so they can be compiled in one spot, which makes it easier for the community to oversee and to respond to them.\n\n*This improves the readability of the subreddits front page and people's reddit feeds, makes it easier for the community to find and respond to such questions and increases the chances that you get a fitting response to your question.*\n\n\u0026amp;#x200B;\n\n***Technical Question (Hardware, Lag, Errors, Connection / Login Issues, Visual Glitches, etc)?*** *--\u0026gt;* [*\\[Weekly Technical Help Thread\\]*](https://www.reddit.com/r/diablo4/search?q=flair_name%3A%22Weekly%20Technical%20Help%22\u0026amp;restrict_sr=1\u0026amp;sort=new)\n\n\u0026amp;#x200B;\n\n***---\u0026gt; Please read the brief FAQ below before posting! \u0026lt;---***\n\n*Basic Information on D4 and some of the most frequently asked questions are quickly answered there!*\n\n\u0026amp;#x200B;\n\n**================================================================================**\n\n# Quick FAQ and Basic Information on D4\n\n* **Launch Date:** June 6th, 2023 (and June 2'nd for those that pre-purchase the Digital Deluxe or the Ultimate Edition)\n* **Collectors Edition:** does NOT INCLUDE the Game (neither a physical copy, nor a code), only physical collectible items! The game has to be bought separately.\n\n\u0026amp;#x200B;\n\n* **System Requirements:** See image --\u0026gt; [here](https://imgur.com/mMbC2G5) \u0026lt;-- for official information on D4's System Requirement.\n* **General Suggestions to make the game run better:** the game may run better for some people on lower settings. Remember that you can also choose to download lower texture pack, which reduces the amount of disk space you may need to have available.\n* **Ultrawide Screen Support?** Yes\n* **Offline Mode:** No Offline Mode. Online-only, including for Consoles (so unlike D3 on consoles, no offline mode for consoles with D4).\n* **Local Co-op / Couch Co-op / Console Co-op:** No couch co-op on PC. Yes on consoles, but only for up to 2 Players (same for all Home Consoles).\n* **Crossplay:** is available across all platforms.\n* **Is progress, cosmetics, etc shared between PC, Xbox, PS5, etc?** Your Progress, Cosmetics, etc are saved on your Battle.net account, so yes, they are shared between your PC, Xbox, PS, etc copies of the game you may have, provided you are logged in on the same Battle.net account.\n* **Do I need to buy a copy for each platform separately to play it?** Yes. In order to play the game on PC, you need a PC copy. To play it on console, you need a copy for the particular console.\n* **Controller Support for PC?** Yes\n* **WASD Movement Support for PC Keyboards?** No, but maybe later down the road in the future.\n\n\u0026amp;#x200B;\n\n* **Start of the 1st Season:** A few weeks after launch, but the exact time is unknown at the moment.\n* **How Dark is Diablo 4?** Yes.\n* **Cow Level:** there is no Cow Level.\n\n\u0026amp;#x200B;\n\n* **How do Seasons work in Diablo 4?** [Bullet Point List of how Seasons work in Diablo 4](https://www.reddit.com/r/diablo4/comments/14fzvlj/psa_faq_seasons_seasonal_and_nonseasonal/) \n\n\u0026amp;#x200B;\n\n* **Infos on the Battle Pass:** There is a Free Battle Pass and two Tiers of a Premium Battle Pass. Premium BP (Tier 1) cost 10$, gives access to unlock cosmetics only and Premium BP (Tier 2) costs 25$ and gives accelerated access to the cosmetic of the Tier 1 Premium BP + additional Cosmetics. The Free \u0026amp; the Premium BP's last for one season (one season lasts \\~3 months) and all of them will take \\~75 hours to complete.\n* **Is D4's Premium Battle Pass pay2win? Short Answer:** NO!\n* **Is D4's Premium Battle Pass pay2win? Long Answer:** The Premium Battle Pass does NOT give an XP Boost. There is an XP Boost in the FREE Battle Pass. Buying the Premium Battle Pass does NOT unlock or accelerate the pace at which you get the XP Boost of the Free Battle Pass. XP Boosts only apply to your OTHER seasonal Characters, AFTER one of them has fulfilled certain requirements, like reaching a certain Character Level (evtl. Max Character Level ?), so it will only make it faster to level seasonal Alts, not your seasonal Main Char. *(*[*based on currently publicly available information*](https://news.blizzard.com/en-us/diablo4/23816415/diablo-iv-quarterly-update-august-2022#Pass)*).*\n* **D4's ingame Shop:** only sells cosmetic via Premium Currency, but not power *(*[*based on currently publicly available information*](https://news.blizzard.com/en-us/diablo4/23816415/diablo-iv-quarterly-update-august-2022#Shop)*)*. Premium Currency can also be gained by playing the game.\n\n\u0026amp;#x200B;\n\n**\\[Gameplay\\] - Does D4 have...**\n\n* **... a Skill Tree?** Yes.\n* **... Skill Points?** Yes, D4 has Skill Points (these are shared by Active and Passive Skills)\n* **... Skill Runes like in D3?** No, but there are ways to modify Active Skills further (both via Items and via the Skill Tree)\n* **...a Paragon System?** Yes, but it is very different than Paragon from D3. Unlike D3's Paragon, D4's Paragon is NOT account-wide and you do NOT have unlimited Points for it (gained from Level 50 to 100 + via some other objectives). It is \"Paragon in Name-only\" so to speak.\n* **... Respecs?** Yes, but they cost Gold. You can respec individual Skill Points. Due to the Gold Costs for respecs increasing with Character Level, you can't respec High Level Characters too much each day.\n* **... Trading?** Yes, but only Normal, Magic and Rare Items (+ Gems, Gold \u0026amp; Elixirs) can be traded, but not Legendaries or Uniques. Rare Items can be enchanted further, but then can no longer be traded.\n* **... an Auction House like D3?** No Auction House in D4.\n* ... **Bald Occultist from the Trailer?** Check!\n* ... **Succubi?** Check!\n\n\u0026amp;#x200B;\n\n**================================================================================**\n\n\u0026amp;#x200B;\n\n***Technical Question (Hardware, Lag, Errors, Connection / Login Issues, Visual Glitches, etc)?*** *--\u0026gt;* [*\\[Weekly Technical Help Thread\\]*](https://www.reddit.com/r/diablo4/search?q=flair_name%3A%22Weekly%20Technical%20Help%22\u0026amp;restrict_sr=1\u0026amp;sort=new)\n\n***Question not answered?*** \\--\u0026gt; *Ask your question in the comments or join the* [*D4 subreddits discord*](https://discord.com/invite/Diablo4)*!*\n\n\u0026amp;#x200B;\n\n***Any further comments regarding these any of these topics?*** \\--\u0026gt; *Post them in the comments!*",
 "created_utc": 1690087510,
 "permalink": "/r/diablo4/comments/15756ik/weekly_questions_faq_thread_for_frequently_asked/",
 "score": 13,
 "url": "https://www.reddit.com/r/diablo4/comments/15756ik/weekly_questions_faq_thread_for_frequently_asked/",
 "comments": [
  {
   "comment_id": "jtr93s6",
   "message": "Once you unlock WT4, can uniques from that content level drop in any nightmare dungeon level, or is there a minimum nightmare dungeon level you have to run?\n\nAs note, I’d ask how sure you are. I asked this in a dedicated thread the other day and got three different answers, lol.",
   "created_utc": 1690514428,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtqze4m",
   "message": "What's the exact mechanic of Malignant Elite enemies?",
   "created_utc": 1690509666,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtqohhp",
   "message": "Is there a setting to enable item compare to be always on? it always resets to off whenever I restart.",
   "created_utc": 1690504685,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtqachh",
   "message": "https://preview.redd.it/oikkitqs7leb1.jpeg?width=783\u0026amp;format=pjpg\u0026amp;auto=webp\u0026amp;s=4acb7be894a289d72dde2916eea13b4e5a5ddc40\n\nWitch one should i use as dw ww baba and why? Have 800ilvl magus and same ilvl mace in my dw setup.",
   "created_utc": 1690498528,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtpb4yk",
   "message": "Is \"Damage reduction while injured\" patched out of the game? \n\nI'm level 50 now and have not seen a single piece with it on my druid.",
   "created_utc": 1690485053,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtp32ey",
   "message": "I've been struggling on my PS5 with some serious rubber banding issues for weeks now, every like 10-20 seconds or so the game freezes for a second, and I'm debating whether it's Diablo's servers or my own internet connection. How's the game feel for you guys?",
   "created_utc": 1690481980,
   "score": 3,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtowcwy",
   "message": "I can't find 'bathed in blood' skin and other new skin in shop list. I waited refresh time, but i still can't find these skin and my shop list empty for 3 days. just for me, or you guys same?",
   "created_utc": 1690479470,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jto17tj",
   "message": "I reached level 70 last night, so I think I’m a little bit off from where I want to attempt it, but does it seem like there’s any reason to farm T4 Varshan? Is he like an exceptional source for level 5 hearts or anything?",
   "created_utc": 1690467914,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtno3m5",
   "message": "Does the Barb heart that knocks down enemies work with Rapid Aspect if Rapid Aspect brings the attack speed above the threshold?",
   "created_utc": 1690462312,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtnjt0f",
   "message": "Is today's downtime for patch 1.1.1? If not, do we know what is it for and when the patch lands?\n\nFor future reference, today is the 27th of July",
   "created_utc": 1690460158,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtms068",
   "message": "Where should one go to level up when they just opened up a new world tier?   \n\n\nI remember having that problem when I broke WT3, where one is supposed to go at level 50 but seemingly the dungeons are now all min level 55. Same now that I'm in WT4, having barely made it through capstone and suddenly in WT4 all the dungeons are min level 75.  \n\n\nI get the feeling that there's missing content for levels 50-55 and 70-75.",
   "created_utc": 1690440493,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtmnbyy",
   "message": "Does anyone know the budget for Diablo 4? How much did Diablo 4 cost them to make?",
   "created_utc": 1690437105,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtmcsbs",
   "message": "How do I start farming sacred gear? I am level 45 and just got into WT3, but I couldn’t even complete a measly world event on my own (I got swarmed and didn’t realize everything was 55+)\n\nShould I go back and farm WT2 until I’m a higher level, or is there a way to slowly but surely earn gear at this level here? Level 45 HotA barb btw.",
   "created_utc": 1690430576,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtlakf7",
   "message": "I put an aspect on a helm and it completely changed its look, but when I salvage I don’t get the transmog option. Only way to get it again is put that same aspect on another helm - is there any way to get transmog of gear like this?",
   "created_utc": 1690413191,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtl6n93",
   "message": "Do you think we’ll get things like skins for Druid transformations? I’d pay money to have a bear in a tutu or werewolf with a top hat.",
   "created_utc": 1690411510,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtkpcd0",
   "message": "Now that the season has started, can I delete my Eternal Realm character with no fear of losing anything? I was playing the character before season 1 to get a feel for the game and unlock things, but I don't really have an interest in keeping him.",
   "created_utc": 1690404706,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtkjscs",
   "message": "How does boss level scaling work? If I'm having a problem getting past a boss, will it help to level up my character a bit before trying again, or does the boss level scale up as well?",
   "created_utc": 1690402675,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtka43r",
   "message": "Do instances of the shadow pool from corpse explosion (if you take the passive that turns it into one) stack their damage? Coming from PoE previously I expect the answer to be no.",
   "created_utc": 1690399147,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtjsp2n",
   "message": "Is there an online resource explaining glyphs and paragon? I understand paragon but I’m confused on leveling glyphs and obtaining new glyphs and what i should be looking for and how",
   "created_utc": 1690392769,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtjov5f",
   "message": "I just reached level 50 and completed the capstone dungeon.\n\nOut in the world, enemies are level 55. By my understanding of how they're doing WT3 now, will I be fighting nothing but level 55 enemies until I reach 60/61?",
   "created_utc": 1690391367,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtjo0t2",
   "message": "Hi guys,\n\nI’m on Xbox, is there a way to prioritise pick up of items over using the skill attached to A? I’m finding that as a necro as long as there are corpses on the ground next to the items it doesn’t let me pick them up straight away. \nI also think the new vicious heart mechanism that activates a skill every second might be causing further issues as I didn’t have this much of a problem when it was out of season..",
   "created_utc": 1690391056,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtjjqrg",
   "message": "If I complete the campaign in my seasonal character does that unlock it for my Eternal character (not yet finished)",
   "created_utc": 1690389499,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtje610",
   "message": "Does prudent heart prevent death?\n\nLet's say I have 50% health and got one shot to 0% death, do I die?\n\nIt's risky for me to test myself because I am playing hardcore. \n\nThanks!",
   "created_utc": 1690387444,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtj375u",
   "message": "New to Barb, and I’m wondering how/if I can get close to 100% CR on it? Ignoring the Whirlwind aspect cause I don’t want to play whirlwind.",
   "created_utc": 1690383338,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtj0mke",
   "message": " Is there an option to remake character for a new season like in D3? I wanted to use the same necromancer I made before the season but couldn't find the option to remake the character for the season in the character select screen, like in Diablo 3. Do I need to delete the character and make him again from scratch or am I missing something?",
   "created_utc": 1690382342,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtibkvi",
   "message": "Bought the ultimate edition but prefer to save the accelerated BP unlock. Is there a way to get the regular BP unlocked while not using my accelerated one?",
   "created_utc": 1690370485,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jti45es",
   "message": "How do I unlock sigil crafting? I'm LVL 53 in wt3. Completed upwards of 15-20 nm dungeons from tier 1 to 4. But still no quest to unlock it and greyed out at the vendor.",
   "created_utc": 1690365379,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jti2q2j",
   "message": "Anyone getting this bug as a Barb when using this combo of malignant hearts?\n\n  \nDevious Heart of Punishing Speed equipped along with the Vicious Heart of the Dark Dance.\n\nIt results in you knocking yourself over every 5 or so seconds when u have enough lift to meet the dark dance requirement, its on the forums as well.\n\n[https://us.forums.blizzard.com/en/d4/t/heart-combination-bug-barb/98009](https://us.forums.blizzard.com/en/d4/t/heart-combination-bug-barb/98009)",
   "created_utc": 1690364276,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jths15i",
   "message": "Is the Resource Drain affix bugged? Every time I make the mistake of trying to do a NM dungeon with it it'll say (drains 16% of resource) but when I'm in the dungeon I've legit gone from 100 spirit to 0 from a single attack from a single mob. I have no idea how this is supposed to even be a playable affix for the vast majority of builds.",
   "created_utc": 1690355873,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jth8ewq",
   "message": "Just finished the campaign, I'm at like level 43. Wondering what to do from here. Should I go around getting renown in all the areas before making my first seasonal character? Or just jump in and create a new seasonal character..?",
   "created_utc": 1690343155,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jth45v9",
   "message": "For Aspect of the Umbral, under what conditions does \"when you crowd control an enemy\" proc against multiple times against a single enemy? For example, if you slow an enemy, and then also immediately afterward you immobilize them, does it proc twice, or only when the opponent's slow expires? Would it work with slowing an enemy twice (via two different skills)? Etc.",
   "created_utc": 1690341031,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtgw8ac",
   "message": "I’d like to complete each seasonal tier and gain all the cosmetic rewards up to tier 90 without having to purchase in game currency, but I don’t have unlimited time.  I also haven’t completed the story yet on my seasonal character so I don’t really have a gauge for how much experience things like malignant tunnels give out.  Any information is appreciated!",
   "created_utc": 1690337041,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtgt919",
   "message": "(PC) I am having tons of crashes since the last update, I can barely play 5 minutes without it completely crashing or getting a disconnect error. I’ve checked my internet connection and service provider and that’s all good. So anyone else having similar issues?",
   "created_utc": 1690335642,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtghzo4",
   "message": "Is the horse glitched? I keep getting message can't do that while in town but am nowhere near a town",
   "created_utc": 1690330619,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtgf0o5",
   "message": "What does it mean when both the dungeon icon is blue (instead of the usual white) *and* it has a blue sidequest diamond icon on it?  Obviously there's a sidequest in it, but why is the dungeon icon blue too?",
   "created_utc": 1690329335,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtf7cy4",
   "message": "I can't do grim favors because all map icons except waypoints and dungeons have disappeared. No dungeons are highlighted for grim favors either. No vendor icons. No stash icon. Already tried log in/out, restart client. Can't do helltides too. They show on the map but aren't happening when I get there.",
   "created_utc": 1690311832,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtf4cvb",
   "message": "Anyone else actually able to play this game at the moment? I only got it recently and it’s a laggy mess. Frustrating and pointless to play in this state. Some of the worst connection problems I’ve experienced in a game.",
   "created_utc": 1690310699,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtf14ks",
   "message": "Can you actually reset a nightmare dung after fully completing it? Pretty sure I've seen it on some random twitch stream. Huh? is it possible?",
   "created_utc": 1690309478,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtf0uwq",
   "message": "Friend requests\n\nAnyone else's requests don't work? If I add someone, nothing appears on my screen, but before patch, I could see the message on the top left corner \" friend request sent to....\" . \nThough, if someone adds me everything works fine...",
   "created_utc": 1690309378,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtf05ae",
   "message": "Why do I have to sign into and create an account with and give my real name to this Microsoft edge or battle. net? I can’t play unless I do this?",
   "created_utc": 1690309111,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jteyaa8",
   "message": "Need Strong Shoulders my nephew deleted my seasonal realm necro and made a sorc. i remade my necro and need a carry through the capstones. Help Please",
   "created_utc": 1690308410,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtelpgr",
   "message": "I’m using the Flurry leveling build. Is it really not that viable to continue to use? I really enjoy it and don’t feel like I’m struggling all that much. I’m not worried about making it to 100 but I don’t see any builds that say end game unless it’s Pen Shot or TB. I’ll switch to TB if I have to but I thought I’d ask others opinions first. Thanks I’m advance.",
   "created_utc": 1690303720,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jte76co",
   "message": "**Really bad luck or bug? Only getting Lv1 Sigils... on 15 now**\n\nI'm  experiencing a weird issue in Season 1. I am currently Lv 58 and can  only get Lv1 Sigils to drop from Whisper caches... I've used 3 of those  to do Lv1 NM dungeons but only Lv1 Sigils dropped from those as well...  I've gotten 15 at this point all Lv 1...\n\nIn case you didn't know the quest to salvage/craft them doesnt pop up until you do a Lv 3/4 NM dungeon X-).\n\nIs this a bug or am I just extremely unlucky?",
   "created_utc": 1690298228,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jte2nx8",
   "message": "Level for T3 and T4?\n\nHi, \n\nat what level should I switch to torment 3 or torment 4? I'm currently playing a level 47 druid at torment 2. I did the T3 quest yesterday. \n\nWhat's the fastest way to level up right now? Dungeons and Trees?",
   "created_utc": 1690296482,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtdr40g",
   "message": "Is it possible to purchase the season pass without using the accelerated?",
   "created_utc": 1690291615,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtdfp8u",
   "message": "Are there any non-cosmetic seasonal awards that carry on after season 1?",
   "created_utc": 1690285895,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtd4zzu",
   "message": "Are world bosses worth doing if you already got the weekly bonus? For the XP? For the loot?",
   "created_utc": 1690278708,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtd09of",
   "message": "I've pretty much solo played so far but I'm looking to join a Clan shortly. My question is if I join a clan that is say based in NA but I'm in AUS, am I going to be looking at a higher ping when I group with them?",
   "created_utc": 1690274877,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtcxuk8",
   "message": "So when are we going to get to salvage aspects and use the currency to reroll the ones we wanna keep?",
   "created_utc": 1690272902,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtcrsds",
   "message": "Anyone know where to find this seasonal echo of Lilith?",
   "created_utc": 1690268073,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtcc6l7",
   "message": "Question: Is Fortify good? I'm fortified in the PvP zone and Sorc just melted me after a TP, Frost Nova, Ice Shard combo.",
   "created_utc": 1690257635,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtcajrx",
   "message": "Disclaimer - spoilers for seasons lore?\n\nI just got my first wrathful heart from killing and traping the priest and the seasonal npc just thanked me for helping him. I got no other seasonal quests on the map...\n\nDid I really just finished playing this season after:\n- reaching level 32 on my first druid, with only build reference being from a friend playing it in the preseason 'yeah, 2handed with pulvarizer and earth skills',\n- pulling two 'ok, sun is coming up, time for my 3h of sleep'' nighters and nothing more,\n- completing 2 seasonal chapters,\n- doing no side quests (to the point I don't have enought resources to craft lvl30 upgrade for health potions or to imprint a weapon),\n- not leaving world tier 1\n???\n\nThat's all in terms of content? The only thing left is to grind to lvl100? Please tell me there's something more",
   "created_utc": 1690256740,
   "score": 0,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtc64ik",
   "message": "Did they lower average ilvl of items?\n\nEsp. in Helltides? Hard to say for sure but seems like everything is a bit lower now/more likely to get sacred. Different as in, in the last few days.",
   "created_utc": 1690254458,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtc3989",
   "message": "me and my uncle are both using druid, but different builds (im landslide he is pulverize) when i check pulverized for me, it shows as costing 0 to cast while for my uncle its 38. i actually equipped it and used it, and it drained my HP to do the first cast, then 38 afterwards. what is causing the first one to be free?",
   "created_utc": 1690252999,
   "score": 0,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtbx289",
   "message": "Just unlocked WT3 \n\nIf I want to roll a new char on seasonal realm, should I be playing on WT3 from the beginning?",
   "created_utc": 1690250013,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtb9mhl",
   "message": "So I keep seeing you can reroll stats on equipment. I know how to extract aspects and apply them at the enchanter. What I don't know how to do is reroll other affix on say a yellow. Thats what it sounds like when im reading stuff, but maybe im misunderstanding.\n2nd question: gem tiers. You combine the lowest tier gems into a higher tier. Do you unlock the hier tiers or just get enough and you can do it right away? I ask because I should have had enough to go up another tier of gem, but it didn't look like an option\nThanks",
   "created_utc": 1690239533,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtaszcz",
   "message": "So I don't have renown from Lilith statues nor do I have any aspects in the Codex of Power for season 1. Am I missing something or is it supposed to be like that?",
   "created_utc": 1690232716,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jtac1oh",
   "message": "[deleted]",
   "created_utc": 1690226227,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jta83t6",
   "message": "I follow a guide where there is hurricane and landslide in the build. The main dmg is landslide.\n\nThats the build: https://app.mobalytics.gg/diablo-4/builds/druid/trample-slide?q_tab=skills\n\nI don't understand 1 thing. When I don't have landslide in the bar, I don't get the terramote crit dmg buff, so I assume I have to bind landslide in my skill bar. However, then their is no slot left for Hurricane and in the guide Hurricane has the enhancement/ used. So when I don't have Hurricane in the skill bar will the enhancment even triggered from Hurricane when Hurricane is rng triggerd by an earth skill?",
   "created_utc": 1690224706,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jta79ky",
   "message": " \n\nI see that both [Maxroll.gg](https://maxroll.gg/)  and Icy Veins pan the Flurry Rouge for NM Dungeons, but I rather enjoy  the playstyle.  How much worse off is this build?  Is it (in Season 0  terms) a build that will struggle significantly in say the NM60s or is  it more that the build doesn't scale to NM100?\n\nI  did a sorceress before Season 1, so I don't need to be the most  overpowered build on the planet.  But I don't want to end up with say  the durability of tissue paper again.\n\n(Note  that I'm asking about experience in Endgame Dungeons NM60+, not how  your flurry rogue is currently faring in WT3 or whatever.)",
   "created_utc": 1690224379,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt9pxek",
   "message": "Aight kinda losing my mind here. I've done 12 tier 1 nm dungeons and can't get a tier 2 sigil to drop. Am I missing something? I don't remember doing anything special in preseason to unlock higher tiers.",
   "created_utc": 1690217434,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt9pkar",
   "message": "I’m just wondering: does Druid gets better? I’m doing a pulverize build and even had to drop to WT1 so I don’t get smacked by bosses and even trash mobs. I’m lvl 28.",
   "created_utc": 1690217300,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt9ob6x",
   "message": "Maybe this has been talked about before, but why do the succubus have their wings on the back of their head?",
   "created_utc": 1690216818,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt98ya9",
   "message": "I got insatiable fury +3 to bear skills for my druid at level 51 wt3, after respecting to shred druid.  Should I stick it out or switch back to pulverize? I don't have aspect of direwolf yet and am finding it very energy hungry.  I have a +2 to shape-shifting on another chest.\n\nI can't find any high damage 1h, does the damage compare at high level? Why is 1h axe used for shred, faster attack speed?",
   "created_utc": 1690210747,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt93mvg",
   "message": "The barber heart is dumb, why does it stop everyone's damage on the target",
   "created_utc": 1690208548,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt8vxxx",
   "message": "Should I start a new class for the season? Played through the campaign as a rogue, about to beat the capstone to get tier 3 then I’ll move to the seasonal realm. Do you all pick a new class or continue with your first class for comfort purposes? I played D3 as a rogue, now 4 as a rogue, but do want to branch out at some point",
   "created_utc": 1690205122,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt8ukjd",
   "message": "Once your character goes to the eternal realm at the end of the season does she carry over all the gold she has and is it added on top of the gold you have on the eternal realm or does it just dissapear ?",
   "created_utc": 1690204471,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt8o2yj",
   "message": "So finished the seasonal quest line and noticed I never crafted the Wrathful Invoker. But now the workbenches where Cormond was outside some cities are gone and the one in Kyovashed doesn't have it. Anyone know how I can get it?",
   "created_utc": 1690201145,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt8mlrh",
   "message": "Had some random questions about PenShot Rogue.\n\n\\- I run poison imbue, was excited to see the new aspect that poisons every third Puncture but I'm just not finding it impactful. Are there any good synergies with it or am I just better off slotting a generic dmg aspect like Edgemasters?\n\n\\- With the nerf to Vulnerable, are bows now competitive with crossbows or still much weaker? All the cool Rogue uniques are bows, but none really seem viable.\n\n\\- Are there any specific dungeons to run to target farm the new Eaglehorn bow, or are helltides the most efficient way?\n\n\\- Is there a general guideline for the number of defense aspects you should slot vs. offense? Like, three defense and the rest offense? I'm currently running two defense, level 72 in WT4, and still have issues with survivability, but my damage ain't that hot either. \n\n\\- Is there a way I'm missing to remove aspects once you've imprinted them? I'm hoarding a bunch of aspects waiting for god-rolled Ancestral Rares that never come. In the meantime I'm afraid to experiment in case the result doesn't end up working out, or I get a better roll, or I get that aspect on a better item but in a different gear slot.",
   "created_utc": 1690200316,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt8b5q7",
   "message": "Is Aspect of Control broken? It's not supposed to look like [this](https://i.imgur.com/5WltHx0.png), it didn't give me any bonus damage, that's my base Damage vs Frozen (yes i'm not in town and yes i'm not mounting my horse)",
   "created_utc": 1690192512,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt835fd",
   "message": "My plan is to finish the battlepass (since I actived it by mistake) and then I'm done with the season. This means I won't finish the season journey and I was wondering if I will miss out in the future. Will the aspect you get for your codex during the season transfer to your codex on your eternal realm after the season? For those that are usually not in the codex / that you can't get by completing a dungeon.\n\nThanks!",
   "created_utc": 1690185958,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt80si8",
   "message": " I saw a video telling us you can use diablo's deluxe edition to claim any season battle pass, and I don't have to use it on season 1. I was wondering if that's true",
   "created_utc": 1690184025,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7wsqr",
   "message": "What does willpower do ?",
   "created_utc": 1690180862,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7shli",
   "message": "I can't figure out why random elites (maybe normal mobs, too) are losing half of their health instantly? Playing couch coop as rogue and sorcerer. Seems like ever since we got into wt3 elites will randomly just have half of their health bar lopped off. This isn't mid fight or after huge crits, it only seems to happen from 100% to 50% . It's like a lucky hit chance or something but I couldn't find it in either of our trees so I'm starting to think it's a bug. Y'all be seeing this? I kept saying it was happening and she wasn't catching it. Then we were in helltides and a commander came up out of one of the rain fire pits at full health and as we were running to fight him something happened and bam, 50%. We were lvl 49 in wt3 helltide so we rejoiced but I'm still curious why",
   "created_utc": 1690177656,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7o0s3",
   "message": "My friend and I are going to play together, looking for party play tips.\n\nI have heard about split farming dungeons. So if we are completely separate, and complete a dungeon, we both will get credit as long as we are partied?\n\nAre there any other similar party play tricks, or ways we can help each other?",
   "created_utc": 1690174610,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7nywm",
   "message": "Is there a website similar to PoEDB or PoE Wiki that shows the damage scaling of different skills? Currently trying to figure out how Death Blow scales with levels past 5.",
   "created_utc": 1690174577,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7gtv7",
   "message": "I want to start playing the season and would want to try a necromancer I was watching kripps hardorce videos and was thinking of giving his summoner build a try has anyone tried it and can tell me how does it feels",
   "created_utc": 1690170200,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7dvtr",
   "message": "Should I complete the season questline before I start leveling. If not, when is a good time to start completing the season quest line.",
   "created_utc": 1690168577,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt7cc18",
   "message": "Anyone else having problems with Shred attacking in the wrong direction? My third hit will sometimes spin 180 degrees from the target and miss completely.\n\nI think it has to do with the enhancement that makes hits 2 and 3 dash and being too close to the enemy, but haven't fully tested it yet.",
   "created_utc": 1690167757,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt786iq",
   "message": "Is there an assembled list anywhere of \"known issues\" and/or how they affect play? I see people talking about \"resistances not working\" all over the place but can't find any real concrete information... are they full on not working, are there other things like that? It's definitely felt like taking a resist potion early on absolutely DOES make a huge impact against certain damage types - I don't have tons of time to play, so when I'm not actually playing I mostly just see headlines and hot takes.",
   "created_utc": 1690165621,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt77u9j",
   "message": "3 stats on rare gear instead of 4 - bug or intentional?\n\nPreviously, I only saw gear with 3 stats dropping off super rares. However, since the new update, it appears all rares are now only dropping with 3 stats for me.\n\nIs this intentional as I don't recall reading it in the patch notes or any other communications? Or is it a bug?",
   "created_utc": 1690165439,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt75pa0",
   "message": "This season's thing is the hearts that are known to be seasonal only. And the aspects unlocked with chapters have the seasonal only tooltip.\n\nSo what is the point of doing the season? Just the battle pass cosmetics?\n\nD3 I understood with the seasonal set that was just a normal set they wanted to promote and the cosmetics, but D4 it looks like we only grind a build that will poof at the end of the season unless I'm terribly missing something",
   "created_utc": 1690164322,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt6z08g",
   "message": "Cosmetics bug - How do I fix this?\n\nCharacter Transmog stuck at a set. Set can't be changed. If other transmog applied, system will say it is saved, but after exiting the wardrobe, previous set it applied. Cannot save new set. Transmog from Eternal or Seasonal doesn't work. It will always revert to previous set. Restarting doesn't work either.  \n\n\nEdit - Can't overwrite my other cosmetic saves. Can't save it as a new save as well.",
   "created_utc": 1690160935,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt6lhmt",
   "message": "What's the easiest class to play solo after the nerfs?",
   "created_utc": 1690154460,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt6kt44",
   "message": "Strongholds\n\nIs anyone having issues with strong holds during season 1? I started a Barbarian have them to lvl 37 but the strongholds seem to be way harder then I remember when I leveled my necro. I'm on World Tier 2 and I know I could go down a their but I'd rather not. Thoughts?",
   "created_utc": 1690154146,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt6jou8",
   "message": "When looking at build guides they list too many active skills that need a place on the toolbar that won’t fit. I’m confused about what to replace with what. Am I reading these builds wrong or something?",
   "created_utc": 1690153622,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt6fdd2",
   "message": "Just started playing today. At first I assumed you had to reach 100% chill to freeze an enemy, but i just unlocked \"Deep Freeze\" ( [https://imgur.com/vFLI7y2](https://imgur.com/vFLI7y2) ).\n\nIt chills for 14%, every second, for 4 seconds.\n\n14% x 4 = 56%\n\nYet it seems to freeze every single time....\n\nAnyone know how this works?\n\nAlso do fire elemental skills counteract the chill/frozen effect from frost skills like in Divinity original sin? Or can you mix and match all elements without any downside?",
   "created_utc": 1690151632,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt61379",
   "message": "in the seasonal dungeons, there is a room with a door and an overlaid barrier. When you click on it, you get the message \" **you must progress the seasonal questline in order to interact with this object** \"\n\nWhat more do I have to do to have this unlock? What's behind it?\n\nI'm a L40 rogue, about 70% of the way through chapter 3 of the seasonal journey.\n\nTIA!",
   "created_utc": 1690145442,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt5vj0r",
   "message": "Aspect of Shared misery question -\n\nDoes \"Spread\" Count as YOUR status infliction / CC?\n\nIf I SPREAD a Sorcs' Immobilize - do I get a terramote?\n\nDo I get a chance to Proc Charged Bolt on Enchanted Sorc, when I SPREAD a Druids Stun?\n\nIf I SPREAD a Barbs knock down as a Rogue - do I get the Crit chance for the Knockdown?\n\nOr is Spread its own thing seperate from the two? \n\nCurrently have a fun 4 person set up - that is doing some weird builds, where IF Class A can do somehting very easily, then Class B skips that ailment/CC because they arent that good at it, and focus' on reaping the benefits, while creating conditions that are great for Class C.",
   "created_utc": 1690143144,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt5rao4",
   "message": "Premium battle pass question.\n\nI'll keep it simple;  \n\nCan I buy the regular season pass \u0026amp; use that instead and save my accelerated pass from the Ultimate edition for another season? \n\nMuch appreciated for any responses.",
   "created_utc": 1690141407,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt5quhq",
   "message": "Is it even possible to get rid of the little red notification icon on the season wardrobe?",
   "created_utc": 1690141225,
   "score": 1,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt5qqc2",
   "message": "Not sure where these issues fit:\n\nI have two eternal characters with two separate, persistent issues. My level 54 Necro’s weapons are greyed out all the time. Can’t fight but I can interact w cairns and the like. My newbie Druid is landlocked in a map zone w no way out. Can’t teleport using the dpad and the area isn’t attached to anything. This started after the season update. \n\nOn PS5. \n\nAnyone experiencing something similar?",
   "created_utc": 1690141178,
   "score": 2,
   "submission_id": "15756ik"
  },
  {
   "comment_id": "jt5qank",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15756ik"
  }
 ]
}