{
 "submission_id": "157zm6p",
 "title": "[Weekly Build Advice and Theorycrafting Thread] for Character Builds, opinions and discussions",
 "selftext": "This **weekly reoccurring thread** is dedicated for \n\n* asking for **advice and feedback on builds** (possible improvements for existing builds)\n* **theorycrafting** about builds (discussion and suggestions on Skill / Items / Affix interactions, synergies, improvements, etc)\n\n\u0026amp;#x200B;\n\n*Images are also allowed to be posted...*\n\n*... plus, you can use our partner website* [***DiabloBuilds.com***](http://diablobuilds.com/) *as an additional tool and resource to better show your theorycrafted build to other users.*\n\n\u0026amp;#x200B;\n\n*If you already have a* ***Full Guide****, e.g. in written form, as a Video or as an image,* ***please post them in the most recent*** [***\\[Weekly Guides Thread\\]***](https://www.reddit.com/r/diablo4/search?q=flair_name%3A%22Weekly%20Guides%22\u0026amp;restrict_sr=1\u0026amp;sort=new) ***instead!***\n\nThank you!",
 "created_utc": 1690171347,
 "permalink": "/r/diablo4/comments/157zm6p/weekly_build_advice_and_theorycrafting_thread_for/",
 "score": 10,
 "url": "https://www.reddit.com/r/diablo4/comments/157zm6p/weekly_build_advice_and_theorycrafting_thread_for/",
 "comments": [
  {
   "comment_id": "jt9ueza",
   "message": "Theorycrafting a build right now, and wondering if anyone knows if the Blight pull from Aspect of the Void counts as CC?",
   "created_utc": 1690219168,
   "score": 6,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtanibr",
   "message": "Leveling a seasonal Druid. Presently at 55 in WT3 with all my skill points unlocked and currently playing a pulverize build (I’ll stick with this until I’m blessed with a Tempest Roar down the road).\n\nMy issue seems to be Spirit generation in that I spend more time regenning spirit through my basic skill than I think I should be based on build guides.  I get that this issue diminishes with level/paragon/gear, but what are the best “low-hanging fruit” to improve that issue?  Are there any temp fixes you can spec/gear into? Thanks.",
   "created_utc": 1690230624,
   "score": 4,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jte7ih4",
   "message": "To preface, I've never played a game like Diablo before. Hoping this is the right place for questions. I'm still learning about this game having barely interfaced with the paragon board or anything outside of WT2.\n\nI just hit Lv. 50 (Necro) and completed the T2 Capstone last night. I didn't get to WT3 in the Eternal realm. I joined world boss and some helltides in World Tier 3 and think I got quite lucky by getting a sacred unique helmet (Deathless Visage) and SU chest-plate (Blood Artisan's Cuirass).\n\nI'm generally using a bone spear build with some minions, but having gotten the chest-plate, is it worth it to incorporate orbs into my build? I don't believe I have any points invested into blood skills at this point.",
   "created_utc": 1690298356,
   "score": 3,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt7rzg9",
   "message": "Is there a place where you can see the stats for Death Blow vs skill level? In PoE, there are a bunch of websites that show you the stats for every gem level. Can’t seem to find one for Diablo 4.",
   "created_utc": 1690177294,
   "score": 3,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt86f91",
   "message": "Is minion Necro really S tier? How much flexibility does it have? Got two bloodwave Legos early on, chill to swap bonestorm.for that?  Also, why in gods name do I have to have two separate slots for golem and regular summon",
   "created_utc": 1690188670,
   "score": 3,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt88lcf",
   "message": "I’m leveling a seasonal necro, I’m curious if I should be upgrading my gear and what not. Like trying to min max it? Or is it not worth it because you level fast?",
   "created_utc": 1690190460,
   "score": 2,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt98tk0",
   "message": "Brand new player - how should I build a barb for the first 15 levels or so?",
   "created_utc": 1690210694,
   "score": 2,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt9fqe4",
   "message": "My best friend and I have been waiting to play this on couch co op for months. Now that he is about to arrive we have a dilemma on what classes we want to play. We have settled on either Druid, Sorc or Necro. Any suggestions or advice would be fantastic.",
   "created_utc": 1690213489,
   "score": 2,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtage12",
   "message": "I'm level 71 and I wonder for pure exp gain is it better to run keys as high as possible keeping it quick or doing lower keys with monsters similar level to mine assuming I could run lower keys same speed as higher?\n\nI'm kinda confused because they nerfed xp from way higher monsters or something, right?",
   "created_utc": 1690227903,
   "score": 2,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtbzv4s",
   "message": "I've been really digging Diablo 4. There is plenty to do and keep me interested. Concurrently, I've been listening to the LitRpg, \"He who fights with Monsters\". If you have some free credits on Audible, consider giving book 1 a listen. I did, and now I'm finishing book 9. Really fun series. \n\nIt got me thinking about how cool it would be to have a Jason Asano inspired Rogue or Necromancer. Why stop there? What about Farah, Rufus, Gary, Clive, and the whole Gang? Just some fun thoughts I've been kicking around. Of course, I'm not that good at build crafting, but I would love some thoughts on what your builds would look like?",
   "created_utc": 1690251387,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt9njlu",
   "message": "Does anyone have a full paragon board for [this Reap Shadow Summoner Necro build from Marco Santos @ GameRant](https://gamerant.com/diablo-4-endgame-shadow-summoner-necromancer-build/)?  \n\n\nI've been running [Luxthos' leveling Sever Summoner Minion Necro build](https://www.youtube.com/watch?v=GeGkQ-yNXdU) ([mobalytics link](https://app.mobalytics.gg/diablo-4/profile/40cf937f-b8f1-49d5-8fcf-ac48d6c5e897/builds/36232232-a070-410d-af84-e0492e8d35e1)) and just hit 50, thinking of trying Marco's build out.",
   "created_utc": 1690216527,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jt9wejs",
   "message": "I am running the shadow + cold imbument rogue and just hit wt3. in normal dungeons i do okay, but hell tides i just seem to die constantly. is it a gameplay issue? or am i lacking survivability because i’m new to wt3? i have mostly sacred stuff, and i have a defensive aspect that gives shield vs elites.",
   "created_utc": 1690219931,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtacxbf",
   "message": "With the new babarian unique item, what's the gameplan for freeze/cold barbarians? Azurewrath + Frostburn + Penitent Greaves are the only three things (I think) that does anything cold related. How can it be made to work?",
   "created_utc": 1690226566,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtaxbvw",
   "message": "Leveling a seasonal rogue. Got the word of Hakan unique. Is there any viable low lvl build for rain of arrows? I am lv50 currently",
   "created_utc": 1690234429,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtb4jk5",
   "message": "Hey! I'm on level 55 as Rogue and I play with a friend Necromancer.  \nWhat's the best build to start? I'm actually into Twisted Blade but i feel so squishy and also being melee makes me dying when doing high content. But the build isn't finish at all so maybe with more survival thing it should be better.  \n\n\nWhat's the best between Penetrating Shot \u0026amp; Twisted Blade in end game?",
   "created_utc": 1690237366,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtb91ni",
   "message": "I am level 70 sorcerer and want to play blizzard build but i didnt see Glacial aspect this whole time , just unlucky or am i doing something wrong ?",
   "created_utc": 1690239288,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtb9g98",
   "message": "Hi, with the new Druid seasonal aspect. If I upgrade landslide will i get increased damage when I use my creepers?",
   "created_utc": 1690239460,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtbfe10",
   "message": "I'm playing on PC and every time I alt tab out and back in the game freezes with just the music playing in the background. The fix is to alt tab again and then my game goes back to normal. I have a 3090 latest drivers and playing in Windowed full screen. Super annoying and Google searching the issue only returns results about a crashing issue which seems to be patched and not what I'm seeing. Anyone getting this issue?",
   "created_utc": 1690242039,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtc5nus",
   "message": "I'm a rogue with barrage arrows as my main attack with poison trap and then caltrops for good measure.\n\nI'm getting legendaries that have nothing to do with my build so I salvage them. Should I be saving them just in case?",
   "created_utc": 1690254227,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtc8q3k",
   "message": "Just had Mystery legendary items disappear when I transported to a town. Its not in the stash",
   "created_utc": 1690255775,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtc9tg7",
   "message": "At what level are people generally clearing/farming ancestral (21+) NMDs this season?\n\nI just did my first one a 62 Sever Necro and I'm wondering if the build is underrated or if it's just that easy now. And for the capstone Elias died in like 15seconds, which was way easier than my first time w/ a 64 rogue.",
   "created_utc": 1690256347,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtcskax",
   "message": "Not sure if this is the right place for this but here goes:\n\nThis is my first Diablo and played on and off since release and completed the campaign/capstone but was only level 48. Is there any point of continuing with that character at all? Or should I do seasonal? Dont want to sink too much time (which is already limited) on a character which isnt much use anymore. Thanks in advance!",
   "created_utc": 1690268666,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtd326h",
   "message": "Is helltides even still a thing? I'm level 52 on wt3 and I haven't seen helltides AT ALL",
   "created_utc": 1690277164,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtd5k05",
   "message": "So with how quickly it seems like folks can chew through most normal enemies and a fair amount of elite packs, are DoT builds any real use outside of boss fights? I love playing DoT classes is other games and was trying to figure out one I could play in D4 (recommendations appreciated), but with how spicy it looks like some of those high nightmare elite packs can get it seems hard to justify letting them stay alive long enough for DoTs to tick enough to be worthwhile.",
   "created_utc": 1690279135,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtdc5pd",
   "message": "Level 45 season sorc, leveling with ice shards since my early experiments with firewall didn't feel too good.\n\nHowever staff of endless rage dropped, so it might be good for a fireball build, but I did see some posts from a month or so ago about how fireball isn't great. Is this still the case?",
   "created_utc": 1690283755,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jte4vp3",
   "message": "Fellow rogues out there any big jumps in survivability I should look for? I am running aspects like Cheat and Might but damn I am struggling to stay alive on WT4. My max life is only like 2400 on level 67. My gear isn't optimized so that is the next goal but is there anything else I can do to see a big jump in max life/ Armor.\n\nI am following this build guide (Twisting Blades) : [https://maxroll.gg/d4/build-guides/twisting-blades-rogue-guide](https://maxroll.gg/d4/build-guides/twisting-blades-rogue-guide)",
   "created_utc": 1690297348,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtec9wk",
   "message": "Is there a \"lazy\" pure summoner build in this game?\n\nI am not hoping to take on Uber Lilith ever, but to at least be end-game worthy",
   "created_utc": 1690300169,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtezara",
   "message": "Running Rogue for the first time and I'm just wondering if there are any good endgame builds that utilize shadow clone?  I'm enjoying it so far, but it just seems like twisting blades is the only good build at the moment which is kinda boring coming from Druid.  I'm currently using Rapid Fire Flurry though which does make the game a bit less idle.",
   "created_utc": 1690308789,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtf22fi",
   "message": "I've tried finding a recent answer regarding the Druid's key passive Nature's Fury but there doesn't seem to be a straight answer. So I will ask here:\n\nIf you have points invested in Landslide say, 5/5 will Lightning Storm proc that 5/5 skill or just the level 1 skill?\n\nWill the Primal Landslide ( When you Immobilize or Stun an enemy, you gain a *Terra mote*. ) upgrade proc from Nature's Fury if Landslide is not placed in the skill bar? If not how about passive upgrades such as Enhanced Landslide (After landslide hits 4 enemies it will immobilize for 3 seconds)?",
   "created_utc": 1690309829,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtfdzif",
   "message": "Hello everyone!\n\nI’m currently playing Druid for season 1, and just got to 50.  Mainly playing pulverize, which was a bit fun, but I’m looking for a change.\n\nDoes anyone have a recommendation for a good mid game build that either doesn’t require uniques, or functions pretty well without them until you find the unique?\n\nI looked online a bit and saw that lightning shred uses Tempest Roar, but it seems like it still works ok without?  Im gonna try that later today, but I thought I would ask if anyone else has a better suggestion? or has tried lightning shred without TR?\n\nThanks!",
   "created_utc": 1690314325,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtfoiu4",
   "message": "Can someone help me understand Knock Back and the passive benefits from extra damage, etc?\n\nDruids have a passive that states you deal more damage to enemies if they are knocked back (Nature's Reach)\nBut what is the window for this extra damage?\n\n1) Do I gain extra damage for 'x' seconds after a knock back?\n\n2) Do I gain extra damage to that mob indefinitely as it has been knocked back?\n\n3) Or, the worst answer, does it only count for the duration of the knock back? \n\nI hope it's not the last one, because the duration of the anmation is generally the same duration as the knock back, so I would never benefit from it.",
   "created_utc": 1690318192,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtfwwr3",
   "message": "I have a question with regards to rough estimate of damage while levelling and picking up weapons. Using an example of my archer rogue, I have one bow which has 200 DPS and + 11% damage to slowed enemies (which my build does proc) and a second bow which has outright 227 DPS but useless affix. Would the first bow effectively be 222 DPS when damaging a slowed enemy, and then this 222 DPS is taken into account for skill damage % modifier?",
   "created_utc": 1690321971,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtgc39s",
   "message": "Are stats on weapons local or global? For example +15% basic attack speed - does that apply to just when using that weapon or overall?\n\nAlso, does barb basically get free aspects since there are two two-handed weapons and 2 one-handed weapons?",
   "created_utc": 1690328084,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtghcqn",
   "message": "Does the druid aspect, stormwolf, can the area damage caused by shred critting, also crit?",
   "created_utc": 1690330342,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jth6j3d",
   "message": "I just got a Bloodless Scream. I’m currently running a bone spear necro to great effect, but am wondering if the darkness sever build is powerful enough to consider switching.\n\nThoughts?\n\nAlso is anyone having issues with Fortify? I haven’t changed my build and my fortify dropped off completely today, it was so weird.",
   "created_utc": 1690342199,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jthhr5o",
   "message": "I’m a rogue who’s trying to make a cold/poison imbue work—are there any viable builds out there to draw inspiration from? At the moment I’m gearing and paragoning like a poison imbue rogue and just replacing trap with cold imbue",
   "created_utc": 1690348579,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtlpz0n",
   "message": "My necro got to 60, and I am hoping to take my minion build to T4, but man, they are getting obliterated. Even my golem with the 75% extra health/dmg is getting 4-shotted by an elite.\n\nis there specific stats/aspect i need to keep them alive, or do i just need to be higher level to see them survive as mob in T4 is level 73 iirc",
   "created_utc": 1690419813,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtlqhb5",
   "message": "I just came back home from a week of vacation elsewhere. Left the game with a lv51 druid and came back realizing I do not want to continue playing because it feels like a slog leveling up further and WT3 being too challenging, mobs take forever to kill and never having enough resources. Am I the only one?",
   "created_utc": 1690420033,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtmpns6",
   "message": "Anyone know if blood lance necro is viable to defeat Uber Lilith in eternal realm at the moment ? I’ve been bone spear since level 1 (currently 95) and want to switch it up but don’t want to go blood lance for 5 levels to then find out it’s much harder and feel forced to switch back to BS for Uber Lillith",
   "created_utc": 1690438757,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtoyplt",
   "message": "does unstable imbuement aspect work with vile apothecary heart?\n(rogue)",
   "created_utc": 1690480335,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtp5s8x",
   "message": "Any fun Druid builds?\nI leveled one to 35 pretty much using a pulverize/trample build.\n\nAfraid to say it's boring to me as I don't think my DPS is where it should be.  Nevertheless, the playstyle is not my cup of tea.\n\nTried a version of the Subterranean Barber build I saw online where the malignant heart sucks in up to 50 mobs while you have an ult up.  Seemed fun, but gear and level just isnt there yet.",
   "created_utc": 1690483022,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtpt97j",
   "message": "What’s up bros I need some feedback. \n\nI’m making a rogue to lv 50 in HC for the PlayStation trophy. My main is a poison TB so I’m thinking about something a little different! \n\nYou think a RF/barage build would be useful to keep me at a distance(safe) from dying or a flurry build and it’s built in regen would help keep me alive better?",
   "created_utc": 1690491844,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtqpooe",
   "message": "Can anyone on xbox join me for a min? I'm at the capstone boss for wt3 -\u0026gt; wt4 and keep dying.",
   "created_utc": 1690505222,
   "score": 1,
   "submission_id": "157zm6p"
  },
  {
   "comment_id": "jtr94ss",
   "message": "I have a individual post for this but trying to determine why this pulverize build has so many storm bonus damages in it. Especially in the linked paragon tree. \n\nhttps://www.icy-veins.com/d4/guides/pulverize-werebear-druid-build/",
   "created_utc": 1690514443,
   "score": 1,
   "submission_id": "157zm6p"
  }
 ]
}