{
 "submission_id": "15b72n8",
 "title": "Appreciation Post: Say what you will about the main story, I felt like Act 6 totally kicked ass",
 "selftext": "The final act of the main story was honestly great. The Wanderer is being manipulated by both sides: Lilith and Mephisto. They're forced to work with the enemy of their enemy, and is there to see their \"ally\" crumble. It's the height of drama, and a good payoff for what most of the campaign had spent time setting up. \n\nLilith in particular is great. She constantly hits the Wanderer with \"we want the same thing\", a classic manipulation tactic. Which is ironic since it essentially parallels the Wanderer's relationship with the Church, Lorath even tells the High Priestess the same thing. In contrast, Mephisto doesn't play on emotions, but twisted logic. His argument is essentially \"what happens after doesn't matter if what's happening now comes to pass\". As a player, I felt like I myself was being torn over the two demons' arguments, and sometimes even thinking \"well, they have a point\". \n\nGameplay is also at its peak. It's the most linear section, and the portion cutting your way through Hell feels like Diablo 3. You get to see Karma catch up with the Church and Inarius, and the cutscenes of the Church fighting the demons are great. \n\nCertainly the rest of the main campaign has its ups and downs. But Act 6 is easily the peak, and it's a great part. It's a shame that in basically all subsequent playthroughs, you're likely to skip the campaign entirely. I hope they use Act 6 as a model for future seasons, because it's a perfect template for both gameplay and narrative. I'd even love the opportunity to replay the campaign in a WT3 or WT4 context, because the campaign gives your actions purpose.",
 "created_utc": 1690476958,
 "permalink": "/r/diablo4/comments/15b72n8/appreciation_post_say_what_you_will_about_the/",
 "score": 201,
 "url": "https://www.reddit.com/r/diablo4/comments/15b72n8/appreciation_post_say_what_you_will_about_the/",
 "comments": [
  {
   "comment_id": "jtoqezp",
   "message": "I choose mephisto cause he’s a dog!",
   "created_utc": 1690477310,
   "score": 220,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtozqz7",
   "message": "Act 6 was amazing. My biggest gripe with it though, was that it felt very out of order. Like, I wanted to see the battle between Prava's army and hell way before we saw it. We should have already had that cutscene way earlier. Getting there after the fact and just seeing the aftermath before even seeing what had gone down was a real let down to me.\n\nOh, and Donan's end was just awful. So dumb and ridiculous. Such a silly way to close out his arc.\n\nOther than that, I loved everything about Act 6, and most of the story in general (other than Taissa as well. Dumb, forgetful witch).",
   "created_utc": 1690480716,
   "score": 30,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtosf19",
   "message": "Yes, I loved the end of the story and also being in Hell. I feel like that's what this game needed more of, more of you know, actually being in hell killing demons. I could've done without the whole \"Neyrelle running off with the soulstone thing\", honestly I think the story would've been better without her entirely.",
   "created_utc": 1690478038,
   "score": 178,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtozmk8",
   "message": "*killed by wall*",
   "created_utc": 1690480670,
   "score": 20,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoylzl",
   "message": "I like that in the end everyone is fucked either way, Noelle killed her mother twice and is carrying a primal evil, Lorath is bound to the dead tree, Doran is dead and so is Yorin, Inarius dead, Lilith dead, Mephisto is Noelle pet and the traveler is still just a traveler. 10/10",
   "created_utc": 1690480299,
   "score": 65,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtot9be",
   "message": "My only 2 complaints story wise is it dragged quite a bit in the two to three acts leading up to A6, a lot of running around in empty space, clicking beakers, seeing story exposition through ghost scenes I found unnecessary etc. And the fact that the story felt a little unfinished? It felt like the first half to the rest of the game, which I'm assuming will be completed through additional releases/seasons, but that's kind of frustrating when paying full price for a game.",
   "created_utc": 1690478344,
   "score": 40,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp1uib",
   "message": "I literally said wait there were 6 acts? I've played the campaign twice actually and honestly it all blends together. Couldn't tell you what happens in what act",
   "created_utc": 1690481503,
   "score": 15,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp5443",
   "message": "I liked the end when lilith approaches us as if we are the final boss instead of her.",
   "created_utc": 1690482774,
   "score": 28,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoveez",
   "message": "I was legit confused. Fifth act felt so long and act 6 ended so fast.\n\nWas surprised I already kicked Lilith's ass and expected to meet mephisto and Diablo and so on I felt like wth did I miss lol.",
   "created_utc": 1690479120,
   "score": 20,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtozzz8",
   "message": "Why is our character called “The wanderer”? It irrationally pisses me off because that is what Diablo possessed warrior was called in D2.",
   "created_utc": 1690480808,
   "score": 21,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtox5uf",
   "message": "The campaign and cut scenes are very good.",
   "created_utc": 1690479767,
   "score": 5,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoxt3x",
   "message": "That cinematic for the battle towards the end is one of my all time favorite cinematic. Blizzard definitely does not fail when it comes to cinematic.",
   "created_utc": 1690480005,
   "score": 5,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp4wit",
   "message": "After 3 games of the prime and lesser evils getting repeatedly owned by mortals I have a hard time taking their threat very seriously tbh.",
   "created_utc": 1690482698,
   "score": 13,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtouw6q",
   "message": "They should have let us (the player) choose to ally with either Lilith or Mephisto. That would have been an interesting decision point for players. Instead, I hated that it was all pre-determined. Or imagine if it was your character that could take the crystal at the end if they wanted, setting your character up for a corruption arc.",
   "created_utc": 1690478934,
   "score": 24,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoxumg",
   "message": "The war scene was fucking  amazing. I haven’t heard many people complain about the story just the mechanics.",
   "created_utc": 1690480021,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpgexc",
   "message": "I'm not trying to be mean or overly confrontational when I say this,(Though I'm sure it'll come off that way.) but for all the people that think D4's story is a masterpiece, do you guys play a wide variety of games or do you only play Blizzard games?\n\nI ask because to me, D4 didn't really do anything original or unique. The dialogue was cliche, the plot structure was chocked full of filler content and none of the characters really had much of an arc or any big moments.\n\nThe whole campaign to me was just very... dry. The only slightly interesting character was Doran, but the little arc that he had was basically just solved via magic and feel good vibes before he got killed off by wandering into a clickable loot object. Naturally this happened because his presence in the plot became inconvenient, since if Doran was present they wouldn't have been able to do the whole, \"Neyrelle is the only one that can be trusted to be rational right now.\" shtick.\n\nI'm really not trying to be mean. I just genuinely don't see much of redeeming value in D4's story.",
   "created_utc": 1690487046,
   "score": 32,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp2z9n",
   "message": "Nah. The ending really had me feeling heartburn over D3's shit hole of a story. \n\nLeah, I mean Neyrelle, leaving with the Soulstone and the Wanderer TRUSTING her to do so, was the most annoying part. Plus others. \n\nThe finale of your conflict with Lilith though was fantastic and the scene was beautiful. Left you wondering.",
   "created_utc": 1690481946,
   "score": 12,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp0nrc",
   "message": "I somehow wished they made 2 cutscenes for the ending to be honest. In scenario number one u would use the SS on Mephisto and go on killing Lilith. And scenario 2 u use the SS on Lilith and would have to face Mephisto. And in making said choice u would gain a BOON unique for making that choice. And making that BOON available for Every character u create there after. And incentivising a second Replay of the story to unlock the second boon. I know most People probably hate doing the campaign AGAIN. But in my opinion it might be worth it if the boon would be significant.",
   "created_utc": 1690481055,
   "score": 11,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtowk01",
   "message": "I loved the final 2 acts a lot, really the whole campaign was done well. I did have a gripe with the ending. I just don't understand trusting a young one handed girl with one of the 3 prime evils in a soulstone. Feels like they let that go too easily. Other than that, some epic boss fights, amazing cutscenes, great voice acting, and an overall compelling story. The campaign is definitely the high point of the game. Really wish we could replay most of those bosses on a higher difficulty.",
   "created_utc": 1690479543,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoxm0z",
   "message": "Act 6?! I legit thought all that end stuff was still act 4 lmao",
   "created_utc": 1690479934,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp1l7g",
   "message": "The final cutscene with Liliths army vs Anarius is probably one of the most badass cinematic in gaming",
   "created_utc": 1690481407,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp1x7s",
   "message": "I would say Inarius was underwhelming and pathetic ij the story. That Lilith and Inarius cutscene seemed like a disney move of smth. Though I really liked Mephisto. Everything about him was perfect imo.",
   "created_utc": 1690481531,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp2xg5",
   "message": "The main story is the only reason I don't feel like I wasted my money.  It was great, the endgame stuff is where they dropped the ball. IMHO.",
   "created_utc": 1690481928,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp7bx5",
   "message": "I loved the story of D4. Blizzard did a really good job with it.\n\nNow.... anything after that in the game....is totally different...",
   "created_utc": 1690483604,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpcknm",
   "message": "I loved entering Lilith's domain with the whole Gates of Hell thing. \n\nThat entrance area was so cool.",
   "created_utc": 1690485603,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpctrv",
   "message": "the let down for me was not being able to choose my BBEG fight, why can't I side with Lilith and fight a manifestation of mephisto? If the narrative plan is to fight him anyway, why not now and enjoy the consequences of Lilith getting super juiced? Why not banish it back to the void again so she can't absorb his power for another 100 years (pr however long its been since the black soul stone) and work on defeating her after he's re-dealt with? the wanderer feels like they don't respect the \"prime\" part of this evil and it's even called put by both Neyrelle (whose decisions at the end also make no fucking sense to me) and Lorath throughout their dialog.",
   "created_utc": 1690485698,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpcvj0",
   "message": "I enjoyed the story but hate the ending. For ppl who feared the prime evils, they sure underplay it by not following up with that naive girl who took mephisto with her. It's just dumb.",
   "created_utc": 1690485717,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpcxlx",
   "message": "Spoilers for S1: Your allies reference you as being a force of nature. Of how terrifying you are. The Church speaks of you in hushed whispers because they are essentially powerless to stop you; heck even their most well-defended place was nothing but matchsticks before your wrath. Merchants sell items you've only touched, and possibly never even used, they are that valuable; they actually do try and sell you back your won items sometimes (not you rebuying- it sometimes updates their inventory with your specific item)!",
   "created_utc": 1690485738,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpdoyp",
   "message": "Devs really fucked up by not letting us pet mephisto",
   "created_utc": 1690486025,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpfuuv",
   "message": "I think Neyrelle running away with a prime evils soulstone, and our good ol' horadrim buddy going \"YO I KNOW WE TRACKED DOWN COUNTLESS PEOPLE AND DEFEATED ENDLESS AMOUNTS OF EVIL, BUT NO WAY WE CAN FIND A LITTLE GIRL WITH 0 MONEY AND A BIG SHINING STONE\" was kind of lame. Both her running away, but also his response..\nBut I think most of the acts were pretty cool? I think that the story was maybe a little bit short though. I did not expect it to end so fast, after us getting pretty much nowhere for a long time",
   "created_utc": 1690486837,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpg70j",
   "message": "That cutscene in hell was a masterpiece.",
   "created_utc": 1690486963,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpgrpq",
   "message": "I just wish there was more to Inarius. He was too fucking cool to die the way he did.",
   "created_utc": 1690487178,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtphjd6",
   "message": "My impression was \"wait...it's over?\" Like idk, i kinda expected Lilith to escape or bagged us and someone saved us or whatever, but it felt kinda sudden and a bit underwhelming.",
   "created_utc": 1690487464,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpzimj",
   "message": "The story was mediocre. Donan had the most pathetic death EVER and it's full of plot holes. I seriously don't understand all this praise it's getting.. It's good for a Diablo game, but not good for a story game. Sorry.",
   "created_utc": 1690494203,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpzxfc",
   "message": "It was subpar",
   "created_utc": 1690494365,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtq041a",
   "message": "Already forgot all about the story",
   "created_utc": 1690494436,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoykdh",
   "message": "It all felt to me like they put like 75% of all the effort it took to make the game in the main story.\n\nDoing the campaign the first time was awesome.\n\nJust a shame that the rest is kind of lackluster",
   "created_utc": 1690480283,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpi4gt",
   "message": "I couldn't get into it because almost all of the writing in Act 6 felt really, really stupid.\n\n* Let's taunt Inarius with our soul stone! Why? Because a writer wanted a scene where Inarius takes it away, I guess.\n* But then the characters shrug and carry on because, as Lorath tells us, Inarius stealing the stone changes nothing. Good thing we had bullet point 1 to get this powerful story moment.\n* We need to use the Sightless Eye to find Lilith! Yes, we know exactly where she's going and there's only one path forward, but we have to alert her to our presence because reasons.\n* After fighting through hordes of demons, Donan dies the lamest death possible.\n* Neyrelle runs away with Mephisto in a soul stone, but Lorath and main character are totally cool with letting her go because Neyrelle politely asked them not to follow her.\n\nLilith and Mephisto's manipulations of main character are alright, but everything the humans do in Act 6 is remarkably dumb.",
   "created_utc": 1690487681,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoqqmz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtozimu",
   "message": "I mean, Lilith really just wanted peace. I'm not sure why we killed her....",
   "created_utc": 1690480630,
   "score": 6,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtovrhl",
   "message": "A6 was the only act i liked. no pointless fetch quests just endless good ol demon slaying",
   "created_utc": 1690479252,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtovsuf",
   "message": "i like the story too but why posters always feel the need to say : I dont care what youthink of X or Y  but here my toughts\n\nReally why would someone give shit about what you say when you start by telling them you dont give a shit of what they said ? \n\nEDIT : Some post lately are all build this way, not only this one\n\nGLHF",
   "created_utc": 1690479266,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtowwwm",
   "message": "To me, it felt like a bunch of errands. Only a couple demons.... You don't even see Lilith until the very end.. you fight Elias 30 times. Some of the NPCs forget who you are and what you've done for them despite helping them in the previous quest.. also.. and most importantly, Lilith was right.",
   "created_utc": 1690479676,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtp5t6s",
   "message": "I love how some people demanded like complete narrative consistency from a fucking Diablo game. The whole series through D2 was literally based on a vibe. None of it needed to make complete sense, it was just uniquely grim, fatalistic and cool. You didn't need to know the full backstory of Tyrael or understand why demons were such dicks, all of it was just cool. Then D3 came along and added a bullshit WoW aesthetic to the game and, imo, completely ruined it. I feel like D4 largely modernized and resurrected the original vibe of the series. I don't give two shits if you have to squint real hard to make the narrative make sense or overlook plot holes. I never once consumed a Diablo game actually caring about the story that much before D4. And D4 succeeded by making me kind of care a little, so it is, by far, the best of all four games when it comes to art direction, style, and badass visuals.",
   "created_utc": 1690483033,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpjeur",
   "message": "The campaign was awesome. I was hoping season to season we'd see the story expand, I guess not.",
   "created_utc": 1690488162,
   "score": 1,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtounhf",
   "message": "D4 knocked it out of the park for story. I don't expect a lot in the campaign for diablo games but they definitely did great with it and the cinematics were great too.",
   "created_utc": 1690478846,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtoygrb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtqku61",
   "message": "Hard disagree ending was complete dog shit.\n\nAnd it's like 1% of the game",
   "created_utc": 1690503024,
   "score": 3,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtqbosv",
   "message": "downvotes incoming\n\ni thought the story sucked.\n\n- no Diablo\n- Lilith is not scary\n- Mephisto is stuck in a placenta and then later on a rock\n- don't care about any of the characters",
   "created_utc": 1690499093,
   "score": 4,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtph4gd",
   "message": "I honestly don't know why Lilith is treated as an antagonist in this game. She's the bad guy just because a random guy we just met told us so?\n\nShe wants to kill one of the main 3 BIG BAD EVIL GUY(s) that we 100% KNOW is evil as hell. Why do we want to kill her??? \n\nLet's assume she is evil as fuck too; ok, she deserves killing. Cant we kill her after she helped us kill the guy that is EVILER and more powerful, and then we deal with her?",
   "created_utc": 1690487310,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpjpfm",
   "message": "You mention the battle cutscene, surely I'm not the only one who was disappointed that more of the cutscenes were done in high quality CGI(I know technically the whole game is computer graphics) instead of just gameplay graphics cutscenes.  Diablo 2 even had way more of these, and I loved every one of them.  Heck, the scenes in Diablo 1 were probably about as numerous as the ones in IV.  There was an opening and one at the end at least.  I was just disappointed.  Enjoyed the story overall, but wanted more movies thrown in like 2 and 3.",
   "created_utc": 1690488274,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpp1hc",
   "message": "Lilith is the protagonist and the PC is the villain.",
   "created_utc": 1690490272,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpz428",
   "message": "Donan's death was pretty stupid, though.\n\nNot angry he died, just how he died.",
   "created_utc": 1690494047,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtpzzpe",
   "message": "It was great, but I wish we chose the other way and sided with Lilith.  Why wouldn't I want to see more Lilith in the expansions?",
   "created_utc": 1690494389,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtq10g3",
   "message": "Lilith deserved better. She tolerated humans more than imperious after all.",
   "created_utc": 1690494782,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtqagrj",
   "message": "I only have one major issue with Act VI, \u0026gt;!That is how they killed my boy Donan. I know for story purposes they wanted to kill him but that was an incredibly dumb/poorly written way to die.!\u0026lt; That is my only complaint as for the most part, Act VI was good.",
   "created_utc": 1690498578,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtqb9ya",
   "message": "Not that it matters, but I actually completely disagree. It felt like the entire story was leading up to THE PLAYER being able to make a significant choice as to which side you’d pick. Instead the entire story culminated in…an npc choosing for you and then literally running away. \n\nAnd the response is just…oh she said not to follow. Better not follow her despite her literally possessing a stone containing a demon lord.",
   "created_utc": 1690498918,
   "score": 2,
   "submission_id": "15b72n8"
  },
  {
   "comment_id": "jtqiwvo",
   "message": "My favorite part of the story was when it ended, boring ah story",
   "created_utc": 1690502173,
   "score": 2,
   "submission_id": "15b72n8"
  }
 ]
}