{
 "submission_id": "15b7fdq",
 "title": "Something positive: Strongholds are a great addition to the game.",
 "selftext": "Strongholds are really awesome in this game.  I enjoy the mini stories that go along with them.  And I like how they play like dungeons with a plot.  I wish there were more of them.",
 "created_utc": 1690477779,
 "permalink": "/r/diablo4/comments/15b7fdq/something_positive_strongholds_are_a_great/",
 "score": 29,
 "url": "https://www.reddit.com/r/diablo4/comments/15b7fdq/something_positive_strongholds_are_a_great/",
 "comments": [
  {
   "comment_id": "jtp2bhp",
   "message": "They're nice, but once you finish with them you just return for fast travel or legion events. It would be nice to have something like in The Division, where when you capture a \"stronghold\" from time to time there are attacks and you have to defend it or you lose it. That would add replayability to the strongholds.",
   "created_utc": 1690481684,
   "score": 137,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp7unj",
   "message": "Yep, no complaints about strongholds. They are fun, handcrafted experiences with interesting lore, good layout, and some unique settings (e.g., the battle across shipwrecks to the lighthouse in the NW Scosglen stronghold).\n\nThe worst thing about them is they make the hundred cookie-cutter dungeons feel absolutely horrible when played after.",
   "created_utc": 1690483801,
   "score": 23,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp5xln",
   "message": "Helltides should be used as a contestation of currently held strongholds.",
   "created_utc": 1690483078,
   "score": 19,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtoxa3g",
   "message": "Love them. More of them please. Honestly could you imagine a nightmare stronghold? Or a Seasonal Stronghold?\n\nWalk up to the bells in the stronghold and get one of the current strongholds just cut out from the environment with nightmare affixes or seasonal monsters sprinkled throughout.",
   "created_utc": 1690479811,
   "score": 34,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp6chn",
   "message": "Strongholds are definitely the best content the game has other than main story. Blizzard should aim to expand on them and have new ones each season.",
   "created_utc": 1690483235,
   "score": 8,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtoybay",
   "message": "I wish they were replayable. Having Nightmare versions with better rewards would also be great. Better yet, targetable unique rewards and/or cosmetics.",
   "created_utc": 1690480192,
   "score": 14,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp4fvs",
   "message": "If they aren’t going to swap renown rewards 4 and 5, need 5-6 strongholds in each map.",
   "created_utc": 1690482523,
   "score": 5,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpnaul",
   "message": "Stronghold siege should be mass event just like legions and keep respawning at regular interval - idealy for some more original rewards.. because I think the big problem is with minor exception of mats - everything just drops the same shit and nothing has unique loot tables - neither the boss, nor event.",
   "created_utc": 1690489620,
   "score": 3,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtozh1p",
   "message": "Some of the best conent in the whole game, they are fun every time.",
   "created_utc": 1690480614,
   "score": 5,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp87vd",
   "message": "Yes, make Nightmare Strongholds. I really like them too and wish there was a reason or way to do them multiple times.",
   "created_utc": 1690483939,
   "score": 2,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp7l11",
   "message": "I agree.  I realized this when I was running Temple of Rot and Onyx Hold to quickly farm experience.  I would leave the stronghold before the final boss so I could keep running it.  Those two in particular are fantastic experience pre level 50.  Once I was done with them, on my final run I went to the boss to complete them.\n\nThere was dialogue between my character and the bandit leader final boss of Onyx Hold.  It made me feel like there was some life in here.  A backstory to this stronghold that I was intrigued by.  The atmosphere of Temple Rot did this as well.  When your character see's the giant corpse that all these people had been worshipping, your character talks about it to themselves.  It made me wonder what the backstory was of this place.\n\nIt reminded me of how I felt running a dungeon for the first time back when I was a young boy playing WoW.  I was drawn to the theme of the dungeon, and the little bits of lore you would get throughout, as well as the dialogue coming from bosses.  I used to get lost down rabbit holes reading lore of these bosses and other characters on wikis.\n\nThe game needs more of this for sure.",
   "created_utc": 1690483700,
   "score": 2,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtotxq8",
   "message": "They are pretty fun.",
   "created_utc": 1690478589,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp6fdj",
   "message": "They're like a 6 out of 10 at best.\n\nYou only get to do them once, the mechanics are not very engaging and the boss fights are bland.",
   "created_utc": 1690483266,
   "score": 250,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp8vdr",
   "message": "Did they add new strongholds or something? Or is this a pointless post about something that’s been in the game to “combat the toxicity” of the sub",
   "created_utc": 1690484186,
   "score": 254,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtovbwz",
   "message": "nice blizzard empoloyee content. downvote",
   "created_utc": 1690479093,
   "score": 241,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp5tlz",
   "message": "Should make conquer Stronghold somewhat longer, like 15-20 minutes with multiple stages.      \n\nDefending Stronghold against wave after wave of enemies. Group up with your friend, or split up, what if enemy are too strong ? abandon bonus object or risk to fail the whole mission.  \n\nSo many potentials to make the game fun, with friends.",
   "created_utc": 1690483037,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp6jf5",
   "message": "I really really really want a nightmare/seasonal stronghold rotation, new or current strongholds. And at the end you fight a random campaign boss.",
   "created_utc": 1690483308,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp7auf",
   "message": "Yeah, one of the best additions to D4. I’d like to see them expanded.",
   "created_utc": 1690483593,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtp86in",
   "message": "They are just the inbetween of cellars and dungeons.  I agree more would be nice or if they reset every once in a while for whatever reason.",
   "created_utc": 1690483925,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpb0sk",
   "message": "They’re super well done and fun. I’d love to see that design space utilized a bit more going forward as I think there’s more potential",
   "created_utc": 1690485008,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpb9fc",
   "message": "Strongholds are a great part of the base game.",
   "created_utc": 1690485101,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpbtlo",
   "message": "Stronghold were some of my favorite content! Had some of the most diverse gameplay",
   "created_utc": 1690485316,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtphors",
   "message": "Love strongholds and would like to see blizz add some endgame version of them",
   "created_utc": 1690487520,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpl0mf",
   "message": "They could of been better. Some, especially early, are a challenge.",
   "created_utc": 1690488765,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpo3fd",
   "message": "I love the strongholds, I think some of the towns should be taken over and turned into strongholds randomly throughout the day with different objectives and such...",
   "created_utc": 1690489919,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpobln",
   "message": "Would love to have the ability to reset them and have more of them",
   "created_utc": 1690490004,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpoz3h",
   "message": "I wish they were repeatable.  Having them as a \"one and done\" seems like a waste.",
   "created_utc": 1690490248,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpp1pw",
   "message": "You know why you like strongholds? because a human made them.\n\nThe garbage that is NM dungeons is just auto generated.",
   "created_utc": 1690490274,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpp7ti",
   "message": "True but would be great if we could re use them by making then Helltide or Tree of whispers endgame variants.",
   "created_utc": 1690490336,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpppdk",
   "message": "Hey hey hey stop it. No positivity. U can either bash the devs / or the patches / or compare the game to d2 or poe. / max u can do is say smthg like this is crap but maybe after some seasons it wont be crap that much. Thanks.",
   "created_utc": 1690490517,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtppyl6",
   "message": "Strongholds are literally the only thing that is fun to me now that I've finished the story.",
   "created_utc": 1690490612,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtprmts",
   "message": "Strongholds are the best thing in the game by far",
   "created_utc": 1690491236,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtprrir",
   "message": "They are my favorite 'event' to take on. When season 1 began, was the first thing I bee-lined to once at the appropriate level. \n\n\u0026amp;#x200B;\n\nBlizzard, we need nightmare versions of these suckers.",
   "created_utc": 1690491286,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtptf8j",
   "message": "I don't understand why mobs aren't taking them back? Looked like it could be set up for something fun and exciting to do. What annoys me the most is that blizzard nerfed them so hard. You really question if you're playing arpg or not when you kill mobs in there and they drop no loot because people were farming them. Why do they keep balancing the game around people racing to 100 or some other goal? It only affects the rest of us.\n\nCall me crazy I thought this game was about killing mobs and getting loot. When you kill mobs and they drop nothing that's just poor design. \\*I should clarify elites in this case.",
   "created_utc": 1690491909,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpx2h0",
   "message": "I guess I'm in the minority when I say I think they are just ok. I really don't see the replayability with them without them becoming boring. As far as I can remember only a few of them stood out as creative. The rest was based on the same boring concept just like ever dungeon with their few boring objectives.",
   "created_utc": 1690493275,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpxlxj",
   "message": "I think a cool mechanic would be if guards helped you push back enemies in the wilderness. Eventually you would all make it to the stronghold and take it together. Then slowly the wilderness would grow stronger again and attack the stronghold. Eventually causing it to be lost. This could just be a cycle that goes on forever. But you get rewards like, unlocking a world boss for that day if you take the stronghold.",
   "created_utc": 1690493476,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpy3g7",
   "message": "Agreed, I think this aspect of the game is universally praised",
   "created_utc": 1690493663,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtpykmv",
   "message": "If they cared about gameplay, they'd have a multi year plan for a storyline based on the attempted invasion that changes based on where players defend and where they are pushed back. There would be towns unavailable, newly spawned dungeons, etc. The campaign for s1 was pitifully short.",
   "created_utc": 1690493841,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtq0csj",
   "message": "Strongholds are a great *start to something great for the game. On their own, They're only good for renown. Not even that useful for storybuilding rn",
   "created_utc": 1690494531,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtq1uzw",
   "message": "Its unfortunate you have to say \"Something positive\" for a post in this sub....",
   "created_utc": 1690495111,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtq2aqb",
   "message": "Or that they were replayable. They're easily the most fun content of the gane.",
   "created_utc": 1690495283,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtq3hsh",
   "message": "Yes and no \n\nThey are but people have begun exploiting them for xp farms.. that has to be stopped",
   "created_utc": 1690495754,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtq65mk",
   "message": "How the fuck do you get to them being awesome? \n\nLol. Jesus christ dude. \n\nThey are for all intents and purposes just an event.\n\nWtf are you even on?",
   "created_utc": 1690496811,
   "score": 1,
   "submission_id": "15b7fdq"
  },
  {
   "comment_id": "jtq9c4u",
   "message": "They NEED to implement them into endgame",
   "created_utc": 1690498117,
   "score": 1,
   "submission_id": "15b7fdq"
  }
 ]
}