{
 "submission_id": "15bbb89",
 "title": "Remember when we had target farming for uniques in helltide?",
 "selftext": "We had target farming for uniques in hell tide for about 3 hours. It was designed, patched in and we had it. Then someone at Blizzard didn't account for the uber uniques dropping and some people actually got some. They emergency patched and we no longer have target farming for uniques in helltide and the Mystery Chests cost 75 more.\n\nMost of us could care less these uber uniques exists at all considering the drop rate. The game at this point would have been better off without them since we would still have target farming.\n\nThat aside they have had quite some time to bring back our target farming and... It isn't even on the radar anymore due to the state of the game and the last patch.\n\nBring back target farming.\n\n/rant",
 "created_utc": 1690486907,
 "permalink": "/r/diablo4/comments/15bbb89/remember_when_we_had_target_farming_for_uniques/",
 "score": 30,
 "url": "https://www.reddit.com/r/diablo4/comments/15bbb89/remember_when_we_had_target_farming_for_uniques/",
 "comments": [
  {
   "comment_id": "jtpr54s",
   "message": "Yeah I would rather them just turn off the uber uniques instead of turning off target farming.",
   "created_utc": 1690491050,
   "score": 253,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpq4ia",
   "message": "I do not understand what the actual grind for this game is. There is no reward, there isn't even a carrot to chase that gives the illusion of reward.",
   "created_utc": 1690490673,
   "score": 243,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpwn3w",
   "message": "Uniques don't drop from helltide chests anymore?",
   "created_utc": 1690493114,
   "score": 14,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtph6m0",
   "message": "People are just going to tell you to farm certain mobs for certain unique drops, but all of that is anecdotal bullshit.",
   "created_utc": 1690487332,
   "score": 33,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpwphm",
   "message": "That was a nice 3 hours. I got my Tempest roar that day.",
   "created_utc": 1690493139,
   "score": 14,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtprxxz",
   "message": "Fuck you in particular to whoever decided to make the mystery chests cost 250.  Oh no, can’t have people having *fun* in Helltides.    \n     \nEdit: holy shit the mid-wits in the comments defending this pointless nerf.  What the fuck is wrong with you all?  Are you anti-fun?  Did you approve of the change to make leave dungeon a 5 second cast as well?  I bet you all bought a $25 cosmetic too.    \n      \nEdit2: one more edit because some of you all are DMing me stupid shit and you’re too busy smelling Rod’s malignant tunnels to use any common sense.  I *personally* am having no problems clearing content quickly and efficiently.  The nerf was just dumb.  Served no purpose.",
   "created_utc": 1690491352,
   "score": 89,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpji5k",
   "message": "The worst part about helltide chests is that even if they give you a legendary, you don't actually want it because it'll cost an arm and a leg to reroll it into something useful. I rarely ever even find uniques from chests anyways, so they might as well not exist. Only ever found one since the update. Helltides are essentially a waste of time, only do them for forgotten souls and fiendrose. And don't even get me started on the xp...",
   "created_utc": 1690488197,
   "score": 9,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpuwmu",
   "message": "They seem to drop frequently in NM dungeons, more so since the patch. Had numerous on my druid and back to back Raiments on my Sorc",
   "created_utc": 1690492465,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq1iiv",
   "message": "If the separate the roll chance of a unique from a super unique target farming could exists. Let's say you have a 1\n20% chances to get a unique it should only roll non supers and then you also have a .05% chance for a super unique. If you class has no uniques in the slot that you still have a .05% chance as super but anything else is not a unique. \n\nI made up the number but I'm just making a point.",
   "created_utc": 1690494974,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq28oj",
   "message": " Uber uniques are waste of dev time. I agree with that one guy in stream who questioned the devs about it.\n\nI mean realistically I think less than 10 people this season will get the new Uber unique it's just madness.",
   "created_utc": 1690495261,
   "score": 84,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpk4nf",
   "message": "What u mean by uniques? Those that u cant change the aspect or the affix?\nI had a lot of them, the specifics for my class, not the shako or stuff but they are not really that good anyways, for my build necro a helm unique its really good, but i can deal without any uniques tbh they just a little plus",
   "created_utc": 1690488432,
   "score": 0,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtpzaiw",
   "message": "I miss old helltides it was easily the best part of the game smh.",
   "created_utc": 1690494117,
   "score": 14,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq37po",
   "message": "not to mention it feels like the forgotten souls rate has been reduced tremendously aling with the amount of rares and uniques from the chests.. I did about 1100 cinders worth of chests and salvaged 3 inventories of blues/rares/and some uniques and received 11 forgotten souls for 50 minutes of helltide...",
   "created_utc": 1690495645,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq3phe",
   "message": "\"Most of us could care less these uber uniques exists at all considering the drop rate\"\n\nEven as someone who loves this game, I am one of these. I pretend the Shako doesn't exist because I'll almost certainly never get it.",
   "created_utc": 1690495839,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq3uvy",
   "message": "In still astonished that they give that much importance to Uber uniques, but they don't even seem Uber good. Like, they are above average? Yes, but for something with this low drop rate, I would expect literally game breaking powers, that would allow you to literally run any combination of abilities/other legendary, and still be op as fuck. What's the point of having something that rare, that is just like, slightly better then the other options?",
   "created_utc": 1690495899,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq3v8f",
   "message": "Whoever thought it was rewarding to farm for an item maybe 1-2 players get per season is fucking stupid. There are millions of us, why is the drop rate on Uber uniques so insane? Why would that be considered fun? It’s beyond me who’s making these decisions.",
   "created_utc": 1690495903,
   "score": 2,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq4pvo",
   "message": "yeash we had it for like 6h, it was awesome",
   "created_utc": 1690496241,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq57zn",
   "message": "I think a good solution would be some kind of a system that would utilize unwanted uniques so that each time we get something we have no use for, it would still be a step closer to getting the one we need.",
   "created_utc": 1690496437,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq8g1r",
   "message": "[https://www.youtube.com/watch?v=om7O0MFkmpw](https://www.youtube.com/watch?v=om7O0MFkmpw)",
   "created_utc": 1690497746,
   "score": 0,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq8vg7",
   "message": "I’d like being able to target farm specific pieces. I mean, you can with obols, but it would be nice with Helltide chests. But you can spend 250 cinders and get like 4 random legendaries or 75 cinders and get one rare. I feel like the tortured gifts should have at least one legendary",
   "created_utc": 1690497926,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq91np",
   "message": "Ya. WhyTF did they remove it completely? Is this another one of their half assed “we can’t fix it properly quick enough so we’ll just do the worse fix possible because it’s the easiest” approaches?\n\nThe fact uniques couldn’t drop from them at all before is mind boggling. The whole point of these things is target farming. But what’s the point in target farming legendarys if the aspects aren’t unique to a specific item slot?\n\nTarget farm rares? Yea no thanks. Let us target farm uniques. We all know the drop rates are so bad you probably can’t rely on getting one anyway from the ~2 item specific chests you could open from a Helltide, so what’s the harm?",
   "created_utc": 1690497997,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtq97vb",
   "message": "I’ll probably get an Uber unique the day before the season ends",
   "created_utc": 1690498068,
   "score": 2,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqb20h",
   "message": "I don’t even do helltides anymore - not even worth it… at one time, they were an awesome break from dungeon running, now it’s just not worth it",
   "created_utc": 1690498828,
   "score": 10,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqk3q8",
   "message": "If only games were managed by actual gamers instead of accountants with Excel spreadsheets",
   "created_utc": 1690502699,
   "score": 6,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqnytr",
   "message": "Never forget that when you wanted stash space it took weeks for you to get 1 tab but when 150 people got an item they wouldn’t be able to trade or sell it was fixed immediately.",
   "created_utc": 1690504445,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqb7ty",
   "message": "Haven't done a hell tide since lol",
   "created_utc": 1690498894,
   "score": 2,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqg8c2",
   "message": "So many things really do make it feel like they are slowing the game down intentionally, even though they denied it.  I don't believe them",
   "created_utc": 1690501009,
   "score": 3,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqghv2",
   "message": "its almost like they are determined to nerf or otherwise fuck with what the paying customer finds \"fun\", they said they would give us broken builds a while back... well, now i think of it they are right, they broke literally all builds in some way LMAO",
   "created_utc": 1690501123,
   "score": 2,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqh8m1",
   "message": "And then, even if you managed to find one, it's useless in 2 months when the new season starts and you start a new toon.",
   "created_utc": 1690501444,
   "score": 2,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqu3l9",
   "message": "Pepperidge farms remembers",
   "created_utc": 1690507222,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqqmix",
   "message": "Sry, but the devs are stupid asses. We‘ve farmed some hearts today and my colleague received a gray one, that just onehits elites and bosses and even become stronger and more effective, the stronger the party is. Just stupid ass broken and still not patched. I suppose they don‘t even know, cause they do not test the shit they produce. This whole game is based on stupid dev decisions and shitty bugfixes. The best part to play was the story. Rest seems to be like unfinished bullshit.",
   "created_utc": 1690505641,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqnbzs",
   "message": "No longer have target farming? To be clear, if I want to find a druid staff I read that doing a dungeon with Fallen (such as Demon's Wake) would give me a better chance of getting a staff.  Are you saying that is no longer a viable way to \"target farm\" a staff?",
   "created_utc": 1690504146,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqsk39",
   "message": "On another note, I really wish glyph xp was shared among characters. At the very least ones that aren't class specific like control, essence, exploit, etc.",
   "created_utc": 1690506517,
   "score": 0,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqu8uq",
   "message": "The amount of illiterate people in the comments is concerning. 'Target farming' being removed ≠ uniques not dropping. Uniques still drop from helltides, none of yall can read...",
   "created_utc": 1690507288,
   "score": 0,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqbl8d",
   "message": "Looking at my eternal realm character with a shako on her head and 3 in stash. Lol",
   "created_utc": 1690499051,
   "score": 251,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqn3r8",
   "message": "Not that hard to find a spreadsheet of the monster families and the dungeons associated with them. Problem solved.",
   "created_utc": 1690504041,
   "score": 255,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqqxoj",
   "message": "You can bash the game all day long and you're right for it. But remember, it took years for Diablo 3 to become a good game. They'll get there",
   "created_utc": 1690505780,
   "score": 255,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqc0p0",
   "message": "[Pepperidge Farm Remembers](https://youtu.be/r2QVjp4KEjU)",
   "created_utc": 1690499233,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqc15g",
   "message": "What's target farming?",
   "created_utc": 1690499239,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqct7p",
   "message": "Wait so uniques can’t drop in helltides at all?",
   "created_utc": 1690499566,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqcxa6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqepmr",
   "message": "Anyone know if the silver heart farming is still a thing or have they patched that? Saw a YouTube short on it awhile ago.",
   "created_utc": 1690500363,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqg20f",
   "message": "I was arguing with a friend if your odds were high winning the lottery or getting a Harlequin Crest.  My money was on the lotto.",
   "created_utc": 1690500935,
   "score": 1,
   "submission_id": "15bbb89"
  },
  {
   "comment_id": "jtqgjjv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15bbb89"
  }
 ]
}