{
 "submission_id": "15bd0ia",
 "title": "Am I the only one who's enjoying the detail of the art in this game?",
 "selftext": "I know there's a lot of focus on the mechanics and nerfs and buffs and stuffs. I can't help but find myself looking close at the details of the dungeons and the landscape, to the point where I get a couple respawns of wolves, cannibals,  etc. \n\nAnybody else?",
 "created_utc": 1690490817,
 "permalink": "/r/diablo4/comments/15bd0ia/am_i_the_only_one_whos_enjoying_the_detail_of_the/",
 "score": 142,
 "url": "https://www.reddit.com/r/diablo4/comments/15bd0ia/am_i_the_only_one_whos_enjoying_the_detail_of_the/",
 "comments": [
  {
   "comment_id": "jtpqqea",
   "message": "The art direction is top notch. The best an ARPG has ever achieved. Fight me.",
   "created_utc": 1690490896,
   "score": 37,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpr1fa",
   "message": "The game is beautiful. It's pretty bleak and brown too, though. I wish it were easier to zoom in on specific things though - or even a monster compendium so we can see the really cool models up close",
   "created_utc": 1690491012,
   "score": 72,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpv0j9",
   "message": "I’m an artist and it’s one of the main reason why I bought the game. The artists are just so great and I wish there were more concept art pieces in the game.",
   "created_utc": 1690492506,
   "score": 25,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq9fjn",
   "message": "“Am I the only person who…” no, you aren’t.",
   "created_utc": 1690498155,
   "score": 20,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpsu1k",
   "message": "I like the attention to detail in dungeons when you open iron maidens and a skeleton pops out or you interact with guillotines.",
   "created_utc": 1690491684,
   "score": 15,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpvd8h",
   "message": "Lilith is amazing. They manage to animate her facial movements in a way she can actually communicate. She looks more realistic in that way than most animated characters",
   "created_utc": 1690492637,
   "score": 15,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqaroh",
   "message": "Nah just you, the only person to notice the good art nice",
   "created_utc": 1690498707,
   "score": 15,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpydj1",
   "message": "The art is perfect and the animations are amazing. The details in dungeons and the open world, the armour details and the design of monsters are 10/10.",
   "created_utc": 1690493767,
   "score": 8,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpwzz4",
   "message": "This was the game that made me finally buy a new TV for the first time in over 10ish years. Got a bigger screen and said \"well shit, now I gotta' upgrade from ps4 to 5\". Game is beautiful, but the color pallet still tends to make me sleepy. Lol",
   "created_utc": 1690493249,
   "score": 5,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqvbl1",
   "message": "Yes. You are the only one that appreciates it.",
   "created_utc": 1690507787,
   "score": 6,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpziho",
   "message": "Yeah you're the only one....",
   "created_utc": 1690494201,
   "score": 9,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq4av6",
   "message": "Yes. Literally the only one.",
   "created_utc": 1690496075,
   "score": 10,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqebve",
   "message": "According to this sub, nobody else is enjoying any part of this game in the least bit xD",
   "created_utc": 1690500202,
   "score": 4,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpt3n0",
   "message": "Are you the only one who is enjoying the thing that is literally propping up the entire game?",
   "created_utc": 1690491786,
   "score": 25,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpzd4j",
   "message": "Shame that the items regardless of rarity look the same. Literally identical legendary and named unique that share icon and in game art. Complete wind out of the sales when they are pumping cash shop skins while this exists.",
   "created_utc": 1690494144,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq06ux",
   "message": "I’m honestly loving this game. I just run around killing what ever I want. Switch classes off and on trying new builds.",
   "created_utc": 1690494467,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq2a78",
   "message": "The art is amazing very well done. I like the detail and the lighting.  I like the footprints left in the snow and mud. Also the movment of the trees are nice.",
   "created_utc": 1690495278,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq38cg",
   "message": "Came here looking for boobs…",
   "created_utc": 1690495652,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq6ild",
   "message": "The combat and in the moment gameplay is also better than any arpg I've played",
   "created_utc": 1690496958,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqljts",
   "message": "\"Am I the only...\" No.",
   "created_utc": 1690503342,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqmacx",
   "message": "The artwork in all the diablo games is phenominal, I loved it most in d3 if I'm being honest just those special ones that still look like they're almost real, D4 they all just look great though they never come up short with the graphics though imo",
   "created_utc": 1690503673,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqn1do",
   "message": "Background art is top notch. You are not alone.\n\nSometimes i feel the game moves too fast and you miss all the details.\n\nThis was true for diablo 2 back then.",
   "created_utc": 1690504011,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqq0pl",
   "message": "\"Am i the only one\"\n\nNo is your answer.",
   "created_utc": 1690505371,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqsbwl",
   "message": "If your questions starts with \"**Am I the only one...?**\", the answer is always \"No\".",
   "created_utc": 1690506413,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqu9qu",
   "message": "Yes out of the millions of people who have played the game your the only one who likes the artwork of the game",
   "created_utc": 1690507299,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqwjzu",
   "message": "Yes you’re the only person out of the millions who bought this to appreciate the artwork, you little special person you",
   "created_utc": 1690508356,
   "score": 3,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqxf2m",
   "message": "90% of the world looks like the same rocky dirt path.",
   "created_utc": 1690508756,
   "score": 4,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq4hh3",
   "message": "Yes, nobody else is enjoying {insert\\_thing} in this game.\n\nMods should make a flair for posts like this.",
   "created_utc": 1690496147,
   "score": 4,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq4ozs",
   "message": "Only you, mate.",
   "created_utc": 1690496231,
   "score": 6,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq7375",
   "message": "Oh yeah absolutely NOBODY ELSE has enjoyed it.  Nobody.  Now this is a great question, what a great idea for a thread.",
   "created_utc": 1690497190,
   "score": 5,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq9ju9",
   "message": "Only one?\n\nWhat are these posts? Of course you are not\n\n\nIn fact the visuals are liked by most, and I do t think I have even seen a complaint about it..\n\n\n\n\nOnly one....",
   "created_utc": 1690498204,
   "score": 5,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtptjyq",
   "message": "Yes! The art style, the whole art team, designers, etc have done an insanely good job. Its all so beautiful. \n\nWish the same can be said about the actual gameplay designers.......... heh",
   "created_utc": 1690491959,
   "score": 4,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpv468",
   "message": "I really enjoy them going back to their roots. Diabloverse is dark,depressing,evil and filled with death. Good to see it’s not all unicorns and teddy bears like last entry.",
   "created_utc": 1690492543,
   "score": 5,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq0akb",
   "message": "The art is very good especially for this type of game in which you're supposed to have lots of enemies on the screen at once. It's very easy to cut corners, but they didn't. The terrain and the few actual big vistas/buildings are also very well done.",
   "created_utc": 1690494507,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq15qa",
   "message": "OOO love the art the looks and feel of D4. now they have to make the game fun, The Victorian era and Middle Ages dark ages where cool to see the amazing art that came from those time periods, but it was not fun playing and living in those time periods.",
   "created_utc": 1690494837,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq2izw",
   "message": "The game is a visual treat for sure",
   "created_utc": 1690495375,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq2krd",
   "message": "Audio and visuals in this game are fuckin aces, overall.",
   "created_utc": 1690495395,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq7y70",
   "message": "Was just looking at some of the dungeon drop offs. Stellar. Like looking around",
   "created_utc": 1690497542,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq7ylh",
   "message": "Absolutely. It's so enjoyable soaking in the world and details.",
   "created_utc": 1690497547,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq85rb",
   "message": "Halt - you have complimented something about the game. That is unacceptable on this subreddit. Please revise your post to describe the ways in which you hate the artwork and how it is worse than all of the other Diablo games combined, while also fitting in something about farming renown being bad. Thank you.",
   "created_utc": 1690497628,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq861t",
   "message": "It’s so good. It honestly covers all the other holes. Glad to know they still have a functioning art department.",
   "created_utc": 1690497632,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq8k80",
   "message": "Art and Cinematics. TBH those two are worth the price of the game. Now if they can make the post campaign better that would be sweet.",
   "created_utc": 1690497794,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq9kg3",
   "message": "Blizzard can make a overflowing septic tank look nice. They have always been good to create cinematics / art. The problem is the game mechanics and so on, they are kinda shit at that.",
   "created_utc": 1690498211,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqat7u",
   "message": "The barbarian destroying enemies to flesh ponds is insanely detailed and kind of gross",
   "created_utc": 1690498725,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqbgia",
   "message": "i take a screenshot every time i hit a load screen bouncing around towns in hopes of compiling a collection of them. they're so fucking beautiful and detailed!!! (after the tooltip text goes away ofc)",
   "created_utc": 1690498995,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqbqpl",
   "message": "That’s why it took me so long on my first play through of the campaign. I uncovered everything and definitely enjoyed the ride.",
   "created_utc": 1690499117,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqease",
   "message": "My main is necromancer, and the character design is just phenomenal, maybe the best I've seen in any rpg ever. I know other classes have somewhat different experiences tho (speaking of male sorcerer).",
   "created_utc": 1690500189,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqegfn",
   "message": "I won't say I like it but the way they made the world is so immersive. So much so that I would never dream of living there. Their world is a literal nightmare. I feel so bad for the npcs that I couldn't resist helping them. 😩",
   "created_utc": 1690500255,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqf0ok",
   "message": "When i got to Hell, I just stopped and stared.",
   "created_utc": 1690500493,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqgmbf",
   "message": "Art and music carry D4.",
   "created_utc": 1690501177,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqh2f7",
   "message": "Wouldnt know. I spend most of my time looking at the mini map.",
   "created_utc": 1690501371,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqh691",
   "message": "I love the general look of the game for sure! I'm new to Diablo as well and arpgs I guess. I haven't started the season because I'm probably just not going to for a while and I'm still trying to get my character to level 100 just playing an hour or two every now and then. I'm at level 87 and I am bored as shit. Lmao!\n\nBut it's definitel look at the game it's definitely impressive.",
   "created_utc": 1690501416,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqh6b8",
   "message": "The art is so good. I replayed the campaign just to see it again. The nasty eggs, slick rocks, worms and tentacles, the wetness and just absolute grime and filth is just amazing. The entrance to hell is amazing too. The fleshy door schlacking as they open. \n\nI wish the dungeon maps were half as good as the art.",
   "created_utc": 1690501417,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqhk10",
   "message": "The art/sound are just about the only thing they got right here.",
   "created_utc": 1690501582,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqhpkz",
   "message": "Yes. The bricks in the dungeons, the broken furniture in dark cellars etc. I love Scosglen, the mud and rain, the look of blood on rocks. So many details!",
   "created_utc": 1690501649,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqi4ky",
   "message": "It's one of the few reasons I continue to play.",
   "created_utc": 1690501832,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqiqss",
   "message": "The art is amazing. It's a beautiful meticulously crafted world.",
   "created_utc": 1690502099,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqk45z",
   "message": "Sometimes I feel like its so detailed, if the game were in first or third person it would be beautiful and its wasted on the isometric. So yes I enjoy the detail",
   "created_utc": 1690502704,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqkfb2",
   "message": "It’s a blizzard game, it’s always going to look good because the art department is the only group that knows what it’s doing, cares, and doesn’t have much executive oversight. \n\nEvery other department either is staffed by incompetent fools, doesn’t care, or had Bobby breathing down their neck to push more monetization.",
   "created_utc": 1690502839,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtql38y",
   "message": "Not the only one. That's not a homerun, they hit it so hard the ball disapeared into space. I have many critisism about this game, but art is not one of them.",
   "created_utc": 1690503136,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtql86p",
   "message": "If they would have put as much attention into balancing as they have into art, this would be an amazing game.",
   "created_utc": 1690503197,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqlz78",
   "message": "Really makes me wish there was more control with the camera. Especially when you’re in a dungeon with massive gorgeously detailed statues that are always somewhat obscured or made transparent before you can get them in frame",
   "created_utc": 1690503536,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqmqnj",
   "message": "I love it! I get distracted in dungeons. I'm like \"WAIT LOOK IN THIS HOLE IN THE WALL WHY CAN I GO IN.\"\n\nParty leader 😑",
   "created_utc": 1690503876,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqpchl",
   "message": "I’m so happy they chose this art direction as opposed to gigantic ass armor Paul drones and cartoony graphics.",
   "created_utc": 1690505069,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqpg20",
   "message": "No, even people very critical of the game will admit the graphics are very good. Best in the genre. I do wish it was less grey though. I prefer a more red / black palette to show \"darkness\" or \"evil\" as opposed to everything being kind of greenish grey.",
   "created_utc": 1690505113,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqpqhq",
   "message": "Those weird ass spider legs in the walls still give me the creeps, 10/10 design, first time i ever felt a shiver from a video game",
   "created_utc": 1690505245,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqpwe8",
   "message": "Funny, I was running through a town and I said to myself, “damn, the graphics are good!”",
   "created_utc": 1690505317,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqpy3n",
   "message": "I ran a dungeon today where I saw a ghoul spiked into a wall, and when I got near it came to life and had an animation of pulling itself off the spike to attack me. That was cool and unique.",
   "created_utc": 1690505339,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqsnme",
   "message": "The environment is top notch until you have to navigate a character through it with this dog shit pathing system they decided to ship. The game looks beautiful, but it's obnoxious to play.",
   "created_utc": 1690506560,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqt8wb",
   "message": "It’s been universally praised by literally everyone that has reviewed the game. Art/sound/environment is top notch. Cinematica and campaign were very decent. What’s left is all their systems and mechanics and that’s where the game starts falling apart.",
   "created_utc": 1690506829,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqto29",
   "message": "Blizzard should buy turtle wow optimize it and let ppl have it in its best and optimized way possible.",
   "created_utc": 1690507024,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqtwcb",
   "message": "I just did a dungeon that was so different from the rest and it looked so grotesque. I loved it. I actually took like 3 minutes to admire the entrance art. Most of the game looks very generic to me, but it has its moments where I am just like man this is beautiful.",
   "created_utc": 1690507131,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqx8tc",
   "message": "No enjoy. \nOnly complain.",
   "created_utc": 1690508675,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqxjmf",
   "message": "Well honestly this makes general feeling of what we’ve got even more depressing.\n\nUnder superb visuals, animations, really solid voice acting and great style we have the most shallow arpg with barely any choice in build terms, and endgame progression/itemization are also terribly done and lacking.\n\nBlizztard just put lowest effort possible for quick bucks gameplay wise.",
   "created_utc": 1690508813,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqxpuk",
   "message": "Why is this listed NSFW? No succubus boobies that I can see?",
   "created_utc": 1690508894,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqy26n",
   "message": "Nope. The art team at bliz has always been more than competent. Nobody really hates on them that isn’t just trolling.",
   "created_utc": 1690509051,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqz56c",
   "message": "My buddy I play with would stop playing and just say “dude lust look at our characters and how their shadows move, how cool is this?” Beautiful game!",
   "created_utc": 1690509551,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqzcft",
   "message": "nah that’s probably one of the things that keeps me playing",
   "created_utc": 1690509644,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqzmyt",
   "message": "Bro, that's literally the only thing universally praised. No you aren't the only one lol",
   "created_utc": 1690509780,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr00u4",
   "message": "I’m constantly just admiring everything while playing. I love seeing Sanctuary in such stunning detail.",
   "created_utc": 1690509962,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr04q4",
   "message": "Not just the art, but also the sounds! It's games like this that make me glad I invested in decent speakers.",
   "created_utc": 1690510012,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr0ncd",
   "message": "It really is amazing. I really enjoy all the 3d levels in the open world I never felt before in Diablo. At least that I remember. All the complaints about game play aside (by other people we are having a great time) I think the art is great",
   "created_utc": 1690510252,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr0zm8",
   "message": "Absolutely! Love seeing the mosaics found in the floors of some dungeons",
   "created_utc": 1690510415,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr10lh",
   "message": "The art and landscapes are amazing. \n\nI love the beaches and oceans.",
   "created_utc": 1690510428,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr1jfi",
   "message": "No that was the first thing I noticed! I was like daaaaang blizzard, ok I see you! Lol",
   "created_utc": 1690510675,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr2mor",
   "message": "The sheer effort that went into this incredibly important and thoughtful post is staggering.\n\nThank you for your service.",
   "created_utc": 1690511189,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr2pht",
   "message": "I love the graphics so much. Once the gamepkat gets ironed out, it's gonna be great.",
   "created_utc": 1690511226,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr3c5f",
   "message": "Yeah, that's part of the reason why so many people are upset. A lot of this game is really good at the base layer. The art and music is great, the combat is fluid and satisfying. It feels like they could've made this such an amzaing game, but they kind of ruined it with the bugs, lack of balancing, and lack of QoL.\n\nIf the game was bad at the base layer, people wouldn't even bother to be upset, they'd just drop it and move on.",
   "created_utc": 1690511532,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr3eim",
   "message": "Dude i kinda avoided anything Diablo 4 related after seeing it was announced. I saw the character creation and the model was really well done but there was no way it’d look this good in game. Then it did, the art direction is crazy good for the genre",
   "created_utc": 1690511563,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr54c3",
   "message": "Yeah not many on the sub have posted in critique on the story and creative direction of the game which either no one has a problem with or they don’t play the game for that purpose. I came for the story but stayed for the characters I created. Technical stuff has never really bothered me. I’m a big cyberpunk fan and people are even more critical of that compared to this.",
   "created_utc": 1690512404,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr5cn1",
   "message": "Graphics/art are hard carrying this game.",
   "created_utc": 1690512518,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr5rfb",
   "message": "Ah the good old [Am I The Only One Who] [insert popular opinion here]",
   "created_utc": 1690512721,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr6aoy",
   "message": "The art is absolutely amazing!",
   "created_utc": 1690512985,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr6jp4",
   "message": "Yeah, the art in D4 is top notch. Its the strongest aspect of the game, imo.",
   "created_utc": 1690513111,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr6zbs",
   "message": "I just want glowy trails so I don't have to stare at the mini map while navigating",
   "created_utc": 1690513330,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr83me",
   "message": "I did for sure. However, once I got to the point when I realized all I can do is grind for gear that is too weak for me all the little nice pleasant things like the details, scenery, and some of those insane views disappeared to me.",
   "created_utc": 1690513905,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr91re",
   "message": "The art direction is the best part about this game. Shame the rest of the game isn't on par",
   "created_utc": 1690514399,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtra1r2",
   "message": "I think it’s great!",
   "created_utc": 1690514921,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrajb0",
   "message": "This game needs more cut scenes.  There were some great ones in previous games when they had chapters.  This mmo lite game ruined that.",
   "created_utc": 1690515178,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrbmaa",
   "message": "Unfortunately it's overshadowed by how bad the game mechanics are at the time",
   "created_utc": 1690515740,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq5df1",
   "message": "Yes you are definitely the only one enjoying the one department that has been carrying Blizzard for years",
   "created_utc": 1690496497,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq861x",
   "message": "Why nsfw tag",
   "created_utc": 1690497632,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpqqnr",
   "message": "Yeah, you’re the only one who noticed",
   "created_utc": 1690490899,
   "score": 0,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpvyj0",
   "message": "Yes you are the only one in the entire world.",
   "created_utc": 1690492857,
   "score": 2,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtpv7vj",
   "message": "If we are on this topic.. there are skeletons with axes with 10 FPS animations.. is it intentional?",
   "created_utc": 1690492581,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq2fs1",
   "message": "Art and music are best in class.",
   "created_utc": 1690495340,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq5v9u",
   "message": "Quite the opposite, there is nothing special and every single room/dungeon feels exactly the same. It’s pretty sad",
   "created_utc": 1690496694,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq93db",
   "message": "The graphics engine is great. The art direction is wet farts on saltines. Literally everything in the game is black, red, or brown, with a heavy emphasis on brown. The whole aesthetic of the game seems to be a wild overcorrection from the early (utterly baseless) critiques of Diablo 3 claiming that it looked like Disney.\n\nLook, I get it, you want your Hellscape to look like Hell. And it should. The problem is when **EVERYTHING** looks like Hell. Every dungeon tileset is in the same slightly damp sepiatone, like the entirety of Sanctuary was shat on by [H.R. Giger](https://en.wikipedia.org/wiki/H._R._Giger).\n\nAlso, from a gameplay perspective, the detail is also a complete impediment. In order to be able to make all the fiddly detail they put in visible, they zoomed in on the characters, which means your field of view is microscopic, and if you're a ranged character, you're shooting people from 10 feet away, which just makes the game torturous.",
   "created_utc": 1690498016,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqf71s",
   "message": "I enjoyed the uninstall button a few days ago lol",
   "created_utc": 1690500567,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqj6u7",
   "message": "The aesthetics of this game is what lured me. I loved D2’s grittiness. Then D3 looked like it borrowed too many of WoW’s textures and I couldn’t get into that. D4 had this bleak world feel that felt almost like an updated D2 that I had been yearning for. I just wish there was more Hell.",
   "created_utc": 1690502297,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqjjuz",
   "message": "I agree, the aesthetics of the game are sick af to, like the depth and detail in some of the environment",
   "created_utc": 1690502454,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqjrt6",
   "message": "If only the mechanics were as elegant as the art. The art is spectacular! The gameplay is horrible. \n\n\nIt's like they took a Lamborghini and put a Pinto engine and drive train into it.",
   "created_utc": 1690502551,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqlinh",
   "message": "Yes, you are. You're the only one. Literally everyone else has only complained about the art. The art is the only problem in the game, everything else is perfect.",
   "created_utc": 1690503327,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtqn7b6",
   "message": "Eh idk, I've seen more well done cuts cutscenes on random ps2 games. Outside of the big cinematic ones, the game is just a rehash of d3s textures and environments. It's real bad.",
   "created_utc": 1690504086,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtq3xeh",
   "message": "You are easily pleased. Good for you. I wish I had such low standards of being entertained. Maybe I would enjoy life more.",
   "created_utc": 1690495927,
   "score": 254,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtr9bzo",
   "message": "Even when this sub was peak negativity the only thing I saw get criticized is how the bleak aesthetic makes different biomes not look as distinct from one another as they should.\n\nAnd you could maybe gripe about the music not being as good as it has been in other games.\n\nOverall, art and voice acting are high points.",
   "created_utc": 1690514547,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrbrx6",
   "message": "No.. Obviously that's the only point in the game they put any time or care into.",
   "created_utc": 1690515824,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrbsoc",
   "message": "The art us not the problem with this game.",
   "created_utc": 1690515836,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrbsqw",
   "message": "It’s amazing.  The amount of work they put into the game is stunning.",
   "created_utc": 1690515837,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrc9bz",
   "message": "Very cool ambiance lol. I love it, game is abit buggy but I am enjoying everything.",
   "created_utc": 1690516081,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrci9j",
   "message": "Absolutely top notch",
   "created_utc": 1690516212,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrd7yv",
   "message": "This is a big thing that keeps me coming back. For me, the game just looks and feels so good to play. Am I happy with all of the dev decisions? No. But honestly since it came out I have not found a game that was better to chill and play, and I think the art and atmosphere are a big part of that.",
   "created_utc": 1690516592,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtreedm",
   "message": "The art and sound teams have been carrying blizzard for ages now.",
   "created_utc": 1690517214,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrgims",
   "message": "Thank you!!  The game has some really nice visuals but everyone is flying 100 miles an hour to run as many dungeons for a few .2% better gear and I do not see anyone else admiring the landscape.  Like the Cliff in Tur Dulra seeing the beached whale down below.",
   "created_utc": 1690518393,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrgrz6",
   "message": "I am loving the beauty of this game, absolutely. I still see new textures, architecture  and environments that blow me away. \n\nI am a casual olayer, currently only lvl 64 as a sorc (I know, but arc lash/chain lightning is still melting everything) so 99% of the end game gripes dont apply to me. \n\nIm having a blast.",
   "created_utc": 1690518542,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrhibh",
   "message": "Hadnt even thought about that. I just look at the mini map and smash buttons",
   "created_utc": 1690518958,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrhsj6",
   "message": "I think you are not alone. And think a man who already playing video games at least 10 years, he already knows blizzard=art.",
   "created_utc": 1690519120,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtrib7e",
   "message": "The Mosaics in this game are friggin AMAZING. I always end up zooming all the way in and stare at them for 30 min",
   "created_utc": 1690519419,
   "score": 1,
   "submission_id": "15bd0ia"
  },
  {
   "comment_id": "jtridbi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15bd0ia"
  }
 ]
}