{
 "submission_id": "15bebik",
 "title": "Rediscovering waypoints is ass",
 "selftext": "Just now really starting to feel this after staring a new hc char",
 "created_utc": 1690493849,
 "permalink": "/r/diablo4/comments/15bebik/rediscovering_waypoints_is_ass/",
 "score": 230,
 "url": "https://www.reddit.com/r/diablo4/comments/15bebik/rediscovering_waypoints_is_ass/",
 "comments": [
  {
   "comment_id": "jtpz2r8",
   "message": "the Waypoints aren't near as bad as needing to run another 100+ dungeons for renown again",
   "created_utc": 1690494033,
   "score": 50,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqx2ey",
   "message": "Nah waypoints are easy. Its the renown system thats bad",
   "created_utc": 1690508592,
   "score": 6,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqqmdv",
   "message": "I just wish more people would realize that the only reason why they’re making us regrind renown in each new season right now is because there’s basically no endgame content to speak of. It’s a shitty substitute and one that shouldn’t exist.",
   "created_utc": 1690505639,
   "score": 7,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtpyvtc",
   "message": "I think having to do waypoints and redoing renowned is pointless. Just give me all that crap I already had to grind for.",
   "created_utc": 1690493960,
   "score": 13,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqx80r",
   "message": "This is a hilarious complaint, but nevertheless… one of the tricks I learned quickly in wt3 this season is to use the NM dungeon teleports to quickly get to spots where you can quickly go tag a waypoint before coming back and doing your dungeon. This sped the process up a lot for me.",
   "created_utc": 1690508665,
   "score": 3,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtq68rn",
   "message": "D2 seasons must look like hell to you guys.",
   "created_utc": 1690496847,
   "score": 17,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqbe0g",
   "message": "Forcing us to farm renown for each character sucks because the activities are just not fun",
   "created_utc": 1690498966,
   "score": 5,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqetr1",
   "message": "Fucking zoomers.\n \nWhy not just watch someone else livestream the game so that you dont have to do anything to enjoy the content.",
   "created_utc": 1690500411,
   "score": 10,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqpa3q",
   "message": "What's the point of unfogging the whole map if you still have to do a full run around the map with your horse each playtrough to unlock all the waypoints ? That shaves like what, one hour of zig zagging between waypoints to uncover the nooks and crannies.\n\nThey credit us the altars of lillith, which took at best three hours to gather once you have your horse and a decent interactive map... But hey, let's have them clear 125+ regular dungeons each season for crappy codex of power unlock of the absolute worse version of each of these aspects.\n\nLet's also have them redo all the super forgettable and bland Side Quests BUT let them skip the much better Campaign and and it's unique set pieces, bosses , cutscenes, hell an entire act set in a location that's never available once you clear the game ever again... It's not like the majority of the game's budget was put into making the campaign great, but hey, let's have them skip it in hardcore / every new season... \n\nFinally, let's lock the new campaign mechanics behind campaign to give even more reason to skip story...\n\nWhat the hell were you thinking , Blizzard !",
   "created_utc": 1690505038,
   "score": 2,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqys7s",
   "message": "Look, More farming for karma",
   "created_utc": 1690509382,
   "score": 3,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtq9cp0",
   "message": "My OCD doesn't exist, except when I see a little grey waypoint on the map.",
   "created_utc": 1690498123,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqtqu3",
   "message": "Season has two and half months to go and people complaining about like an hour of work. \n\nSmh",
   "created_utc": 1690507060,
   "score": 0,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtr115f",
   "message": "It takes 15 minutes, max. \n\nQuit bitchin.",
   "created_utc": 1690510435,
   "score": 0,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqug4q",
   "message": "Ohhhh nooo, we have to do something.",
   "created_utc": 1690507381,
   "score": 255,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtq152r",
   "message": "Also make the Exploit glyph carry over to alts once you've leveled it up once on a particular realm (i.e. once on seasonal char carries over to other seasonal char)  \\^.\\^\n\nThank you",
   "created_utc": 1690494830,
   "score": 254,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqkslr",
   "message": "I don’t know why you have to do this on all characters after your first. I’ve died twice to DCs and it’s really fucking frustrating to not have the waypoints too",
   "created_utc": 1690503004,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqsbbq",
   "message": "Got my 100 hrs out of the game, will wait for the next 100 hrs I spend",
   "created_utc": 1690506406,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqvc1x",
   "message": "I can't wait until they just let us play the game. I'm fine making a new character every season. If the game simply must have an arbitrary, grindy renown system, at least make it account-wide.",
   "created_utc": 1690507794,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtqzylm",
   "message": "There's only 35 waypoints in total and you get the 5 capitals and the tree of whispers ones automatically so it really isn't as bad as people make it out to be. I don't have a problem with the waypoints and the strongholds. Everything else I am getting as I play and am not so worried about it. Honestly the extra paragon points aren't as big a deal as people make it out to be either and Obol limits don't matter at all so all of the whining about the renown is just whining about nothing.\n\nSo many gamers now want everything handed to them on a silver platter and it is really starting to get old hearing about it every third thread. The season lasts for 3 damn months. Deal with it.",
   "created_utc": 1690509933,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtr10h6",
   "message": "Man if you ever play any other rpg like last epoch or poe you’d DiE. They make you replay play the whole campaign every season.\n\nAnyway, Imagine… playing the actual game lol.\n\nI liked having to traverse the terrain, do quests and see content again.",
   "created_utc": 1690510426,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtr2vgv",
   "message": "I love how this (along with rediscovering the map) are complaints in this game. You'd think the people here have never played a Diablo game before.",
   "created_utc": 1690511306,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtra9zv",
   "message": "Agreed. It just feels like needless busy work.",
   "created_utc": 1690515043,
   "score": 1,
   "submission_id": "15bebik"
  },
  {
   "comment_id": "jtrbvpu",
   "message": "Just wait until you have to redo renown for paragon",
   "created_utc": 1690515881,
   "score": 1,
   "submission_id": "15bebik"
  }
 ]
}