{
 "submission_id": "15bf16q",
 "title": "Forgot to rename, or World Tier 5 Capstone leaked?",
 "selftext": "After going through the last chapter of the Season Journey, I realized something is weird. The journey asks us to kill Echo of Lilith in the Archives of Issalia.\n\n\u0026amp;#x200B;\n\n[Last Chapter of Season Journey](https://preview.redd.it/8ra9lv0twkeb1.png?width=793\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=41dcab93ae74218a52c10d8e9f85d248f5f08de1)\n\nNow, that actually made me interested, so after a quick google search, I found a leaked video footage of the Closed Endgame Beta of someone actually going inside the dungeon, fighting monsters, etc.\n\n\u0026amp;#x200B;\n\n[The Inside of Archives of Issalia](https://preview.redd.it/9qnmn3wjxkeb1.png?width=1920\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=409ecac8b42a2a4c6080dca56bad2069fe808baf)\n\nAfter checking out a bit more of the video, it clearly shows the entrance around the border of Scosglen and Dry Steppes, near Farobru\n\n\u0026amp;#x200B;\n\n[Closed Beta Screenshot of the map and entrance](https://preview.redd.it/xzfmt9o5ykeb1.png?width=1920\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=a931741e4b0d6f387e098c773e53093c89893e11)\n\nNow, if you check it out ingame, that are is clearly off the map\n\n\u0026amp;#x200B;\n\n[Current map of the area](https://preview.redd.it/atmdotrnykeb1.png?width=1920\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=d7625aaf009b2b1d48d912dfbfcd2b174a025e86)\n\nAnd the way to get up there is obviously on the map too\n\n\u0026amp;#x200B;\n\n[Stairs are obviously there, but blocked](https://preview.redd.it/0ou1is1vykeb1.png?width=1920\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=120216b42d4ddd0945c5bda2af21cc8212db7be9)\n\n[Stairs are obviously there, but blocked](https://preview.redd.it/5ja6e1pxykeb1.png?width=1920\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=61dd6a3203509c9a9524eefb1559ce58c36e509f)\n\nWhat's your opinion on this? Did Blizzard just replace Echo of Lilith and took the dungeon out of the game, or could it be the entrance to the Capstone Dungeon to let us into the previously leaked/datamined World Tier 5?",
 "created_utc": 1690495572,
 "permalink": "/r/diablo4/comments/15bf16q/forgot_to_rename_or_world_tier_5_capstone_leaked/",
 "score": 238,
 "url": "https://www.reddit.com/r/diablo4/comments/15bf16q/forgot_to_rename_or_world_tier_5_capstone_leaked/",
 "comments": [
  {
   "comment_id": "jtq36pc",
   "message": "all i know is maybe",
   "created_utc": 1690495634,
   "score": 208,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtq7hri",
   "message": " I think when WT5 was datamined that location was datamined with it too along with the gem upgrades that were tied to WT5. The fact that they didn't just use the dungeon as the build up to the final boss kind of leads me to believe they want to use it as a capstone at some point in the future.",
   "created_utc": 1690497355,
   "score": 35,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqb2md",
   "message": "Well from what I understood wt5 used to be torment and wt4 was hell, in the beta/alpha of the game, looks like they removed Hell difficulty... I hope they don't increase \"difficulty\" like on diablo 3 but give us more difficulites between 50-100... \n\nLike 50-70 nightmare 70-85 hell and then 85-100 torment would have been so much better imo. A lot of people lose interest around 75-80 so if there was a extra point of interest it would help everything so much.\n\nPlus a wt5 (85-100) with more exp, better unique drop rates, and even more mob density+more aggressive. Would just be so much better",
   "created_utc": 1690498835,
   "score": 49,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtq5ba2",
   "message": "This is some darn good detective work!",
   "created_utc": 1690496474,
   "score": 21,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqe66w",
   "message": "This is more work than I put into my thesis",
   "created_utc": 1690500136,
   "score": 16,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtq4ns8",
   "message": "Seems possible. It's to be expected that world tier 4 won't be the last... It's really just a question of when",
   "created_utc": 1690496217,
   "score": 9,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqrv3o",
   "message": "I've cracked the case!\n\nThis area is unlocked for the Sorcerer class only. How do I know this? Because the Oculus is the key to this puzzle.\n\nUsing the Oculus in this area should teleport you (eventually) outside of the current map boundaries thanks to the advanced Activision Blizzard coding techniques used to craft this unique weapon.",
   "created_utc": 1690506199,
   "score": 7,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqnei7",
   "message": "That’s another thing that bothered me playing through the game. There’s a number of obvious paths that are currently blocked off. Content that was cut from the game to be added back in later.",
   "created_utc": 1690504179,
   "score": 5,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqrh16",
   "message": "World tier 5 was in the closed NDA build... according to my friend. WT4 was 60-70 and WT5 was 70+ and dropped sacred ancient items.  \n\n\nIf they do introduce WT5 I don't think it will happen until the first expansion comes out.",
   "created_utc": 1690506022,
   "score": 4,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr074h",
   "message": "There was a “tip” on a loading screen in pre-season referencing world tier 5. They load so quick I never was able to get a screen grab",
   "created_utc": 1690510043,
   "score": 3,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtq54j2",
   "message": "It's quite clear Blizzard is gearing up for wt5 release because of the nm dungeon squish.",
   "created_utc": 1690496400,
   "score": 4,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqjvyj",
   "message": "Probably a combination of future planned content and place-holder text from the beta that should have been changed to \"Defeat IV Torment Echo of Varshan\" for Season 1.  Can't believe they purposely designed it that you get nothing towards seasonal rewards for defeating his \"final\" form.\n*As pointed out below, Varshan is a separate challenge. So I have no clue.",
   "created_utc": 1690502602,
   "score": 2,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtrek6k",
   "message": "the destiny approach. make 90% of a game. release it early, break it up into the first 2 dlc's, while making more seasons and content.\n\npeople realize fairly quickly that its broken up content.",
   "created_utc": 1690517301,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqqk7k",
   "message": "WT5 is a very easy/lazy thing blizzard could do. Many people have asked for it, and it would probably be initially exciting.\n\nHowever, WT5 fixes nothing about the game. In fact, I'd argue that WT1-4 is a completely meaningless system.\n\nIf you want to fight level 60 monsters, you have to be in WT3. If you want to fight level 80 monsters you have to be in WT4. Since the game scales anyways, they could literally remove the world tiers entirely, and just let the game organically scale up, unlocking content at various points.\n\nAnother way to look at this is... no matter how casual or bad at the game you are, no level 90 player would ever choose to go down to WT3. Because the content there isn't \"easier level 90 content.\" It's literally level 65 content... \n\nLikewise, if the game was more evenly balanced, a level 55 would never choose to go to WT4 solo, as it would be a waste of time to be doing level 75 content as a level 55. Now of course in practice, people have learned that the game is easy enough that you can in fact go to WT4 at level 55. But thats more of a game balance issue than an intended design.\n\nSo now we have this bloated system that could have just been even scaling up to a 100 maybe with difficulty modes, like the difference between WT1 and WT2. Essentially those are just 'normal' vs 'hard.' Oddly enough, everyone who wants to level quickly ignores WT2 and just races on WT1, in order to go to WT3 10-15 levels too early in order to start getting gear.\n\nThe entire system is so poorly designed its insane. It's overly complex for how shallow it is. WT5 might be coming because it's lazy. It wont make D4 a better game.\n\nNow if WT5 is just difficulty modes that challenge you and give you better rewards, like Torment levels in D3. Sure you can go that route. I'm sure we'll be getting a WT10 in season 9 then. But the fact is, what is there in the game exactly to do \"harder content for more rewards.\" I mean all the items in the game are incredible stale, and unless they let you collect uber uniques in WT5. There isn't much point to just keep grinding and grinding at level 100. By the time you're level 100 you're already full best in slot gear.\n\nOf course this means WT5 would HAVE to come with new itemization, but that makes it less lazy... and less likely to be a quick addition to the game. Even if WT5 fixed itemization by actually being good. Now you have a 100 hour grind in order to start playing the \"actual\" game? Again, so many issues with this concept it's crazy...",
   "created_utc": 1690505612,
   "score": 7,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqozq7",
   "message": "So how do you complete this Season Challenge then? Just kill Lvl 100 Lilith?",
   "created_utc": 1690504908,
   "score": 2,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtq6v1n",
   "message": "I do think we'll get a WT5 eventually but my bet is that this was simply moved to Nevesk during production",
   "created_utc": 1690497098,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr7c9p",
   "message": "In the end game beta, the Archives of Issalia was the capstone to get into WT5, but iirc, the boss wasn’t Lilith because that would have been major spoilers. The level 100 end game boss was also not Lilith, though I did clear it at lvl 98 with my Necro.\n\nHaving played the closed end game beta, it’s been very difficult for me to understand why they didn’t implement WT5 because many of the Uber uniques that are currently unobtainable were actually dropping for the majority of players once they unlocked WT5.\n\nI had several Harlequin Crests and a Grandfather or two, and Harlequin Crest in particular actually dropped as Sacred. \n\nIt makes me wonder about which version of the game they were testing back last October and whether the version we’re playing now is actually a bit older. \n\nThe version of the game I played had a more fluid end game experience with better defined world tiers, world bosses every hour or two, and “Uber” uniques that were actually obtainable for the average player.",
   "created_utc": 1690513515,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqjkjm",
   "message": "Remnant 2. Baldur's Gate 3.",
   "created_utc": 1690502463,
   "score": 255,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqjo0w",
   "message": "It might be a dumb idea but I noticed you only have 2/9 side quests complete here could the entrance to this place be locked behind one as a few dungeons/cellars are?\n\nEdit: changed 1/9-\u0026gt;2/9",
   "created_utc": 1690502505,
   "score": 0,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqdqb8",
   "message": "To access World Tier 5, you will be required to be level 100, having used at least 666 platinum on store purchases, and paying $20 for the DLC or $50 for 3 days early access to the DLC. lol\n\n... and once World Tier 5 is accessed, sorcs will get a 20% damage reduction and crit scaling will be cut in half.",
   "created_utc": 1690499953,
   "score": 250,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtqdubs",
   "message": "Could be right, it would be wild if they released it with the next patch, otherwise I expect it maybe next season or season 3.",
   "created_utc": 1690500000,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr6eco",
   "message": "It's looking more likely they just removed WT5 at this point, for whatever reason. I don't think there's any plans to add it back anytime soon.",
   "created_utc": 1690513037,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr6ohq",
   "message": "I feel like there are enough world tiers already.  I would hate to have to upgrade my gear to sacred, then to ancestral and then to whatever the hell T5 is just to get to the end game as it's already a slog.",
   "created_utc": 1690513179,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr7crg",
   "message": "Cool sleuthing OP! Might not have been the first to find it but I found out from you so good job! I really hope they make more the Lilith fight available again without the omega difficulty.",
   "created_utc": 1690513522,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr7msr",
   "message": "Tier 5 is leftover from endgame beta last year. They removed old t4 and made t5 into t4. T4 now is literally old t5. T4 in endgame beta just added more drops at 60+ it just divided the game more.",
   "created_utc": 1690513663,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtr8fdr",
   "message": "I just take this hint as bottle off salt …",
   "created_utc": 1690514075,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtra8b1",
   "message": "I swear when they first announced there would be difficulties in D4 they said there was going to be 5.\n\nI can’t find it anywhere, anyone know what I’m talking about? But I’m pretty sure it’s just one of the many things that was in the game that has been removed just to hold off as “content”….",
   "created_utc": 1690515018,
   "score": 1,
   "submission_id": "15bf16q"
  },
  {
   "comment_id": "jtrb4hg",
   "message": "There are several places like this in the game that are never unlocked or progressed during/ after campaign. It's something, even if it isn't specifically capstone wt5. Maybe gm Island?",
   "created_utc": 1690515482,
   "score": 1,
   "submission_id": "15bf16q"
  }
 ]
}