{
 "submission_id": "15cqkhg",
 "title": "Why are Uber Uniques even in the game?",
 "selftext": "No, really.  It's not a rhetorical question.  I'm trying to imagine the game designer's thought process with regards to how these items were implemented.  Obviously they are not meant for most players to find, but did they even realize how rare they made them?  Was it a mistake like how two handed sword's names were all off by 1?  Because the way they are currently implemented just means you will never see them.  Maybe 5-10 people will find one, per season.  If trading were a thing it might make sense, but that rarity would make even trading impossible.  Nothing else in the game is worth close to that much.  So that can't be it.   \n\nIs it that some players won't realize how rare these items are, and will essentially spend eternity chasing them, therefor increasing engagement and therefor increasing cash shop engagement?  That's literally the only thing I can think of that makes sense.  The items are not meant to ever be found or used or even sold.  They are just legends that are supposed to keep you playing forever.\n\nEDIT: I got a Reddit Self Harm message lmao.  Blizzard shills, that's incredible.",
 "created_utc": 1690632001,
 "permalink": "/r/diablo4/comments/15cqkhg/why_are_uber_uniques_even_in_the_game/",
 "score": 37,
 "url": "https://www.reddit.com/r/diablo4/comments/15cqkhg/why_are_uber_uniques_even_in_the_game/",
 "comments": [
  {
   "comment_id": "jtxy8oz",
   "message": "Half the people commenting on here don’t understand math",
   "created_utc": 1690638915,
   "score": 155,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtxqowl",
   "message": "Hopefully they tune this reasonably. \n\nI’m ok with super rare items. I’m not ok with the fact that these are so rare you can play your entire life and rng could prevent you from seeing one in that timeframe. That is unreasonable. \n\nThese should be the pinnacle grind item. That’s fine, but at this point they’re not even worth caring about.",
   "created_utc": 1690635542,
   "score": 106,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty8bp5",
   "message": "A one in 5 Million hours played Droprate in a game with a 3 Month season cycle and No trade.\n\n\nBIG BRAIN 5HEAD DEVELOPER",
   "created_utc": 1690643168,
   "score": 68,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtxqnoh",
   "message": "It's essentially a combination of anchoring and priming.\n\nThe value that you attribute to something is largely shaped by the initial value you attribute to it even if many minor details like drop rate and how powerful that item relative to alternative options changes over time.\n\nThis primes players to be excited/enthusiastic for the future content where/when these items get drop rates that makes it actually feasible to obtain them.\n\nDiablo 4 is aiming to appeal to many players that are completely new to this genre of game, so while long-time diablo fans have known what a shako is for ages, none of your new players would have even heard of it 6 months ago. By putting these items in the game now they generate discussion throughout the community so that even people that have never played a diablo game before will grow to attribute some form of value to these items in their mind.\n\nWhen devs get asked about the low drop rates of these items in the streams they typically respond by explaining that it's much easier to increase the the availability of an item than decrease it. This is why they're in the game, they're to trigger a positive emotional response to a future content update because they've already gotten you to attribute a high value to these items previously.",
   "created_utc": 1690635525,
   "score": 131,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty2hgz",
   "message": "If they had the same drop rate as like zods/chams from d2 I think that would be good but as they are now holy shit",
   "created_utc": 1690640644,
   "score": 193,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtxxnoh",
   "message": "For all intents and purposes Uber Uniques are not in the game. They are a 0% of the population item that factor into absolutely nothing anyone is going to do. They are a waste of resources to create and put into game files. It should be an embarrassment to admit that they created these items on purpose.\n\nReal talk why they thought it was a good idea? News articles. They wanted games journalists to talk about each and every single lottery ticket that drops in game and the long droughts between seeing it. It's been 4 months since the last X dropped look at how lucky so and so was on this season for having the ONLY ONE! \n\nIt's stupid, it's bad, and it should be shamed.",
   "created_utc": 1690638667,
   "score": 238,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtytdg1",
   "message": "I don’t understand what the point is, if you find one the only logical course of action is to break the EULA and sell your account.",
   "created_utc": 1690651377,
   "score": 10,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty1f5w",
   "message": "Because some guy in Shanghai gets a Shako and at least \\~50,000 players across the world won't put the game down until they get theirs even if that will never happen.\n\nAll about player retention.",
   "created_utc": 1690640213,
   "score": 27,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty3srk",
   "message": "Uber uniques aren’t in the game",
   "created_utc": 1690641201,
   "score": 32,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtxn7wz",
   "message": "They explained on the dev chat.  They envisioned it as an \"oh wow awesome\" moment if you found one, but players having no expectation of getting one or needing one to make a build (which is probably why none of them do anything actually interesting).  A fun lucky moment for the players that found them, that's  all.\n\nMaybe they were aiming for something like Thundefury in vanilla/classic - there were like 1 or 2 on a server.  Half the faction would turn out when someone was doing the final quest, it was just cool to be a part of seeing the thing made. \n\nWhich is a super naïve idea in a game primarily about solo play and amassing all the things.   Being told \"here is a great thing; but you will never, ever have it\" in such a game gets the response it deserves.",
   "created_utc": 1690633939,
   "score": 68,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty0ihp",
   "message": "For people who believe they have a shot they will keep playing trying to get them.. this increases playtime analytics and is good for shareholders to see.. this is why they fixed the bug with them dropping in lightning speed instead of “should be fixed in season 3”",
   "created_utc": 1690639843,
   "score": 31,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty5j99",
   "message": "I almost went bald after reading some of these clueless comments.",
   "created_utc": 1690641960,
   "score": 32,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtxkuxz",
   "message": "\" Obviously they are not meant for most players to find \" - I hear this argument, but I am always asking myself: Why? Sure the \"casual\" who plays 30 hours a season shouldn't get it. But once you have grinded past lvl85 and like 100+ hours in a season why shouldn't you have an actual chance of getting one?\n\nAdditionally, this game has no endgame content. Once you have reached 100, done max tier NMD and Uberlilith, the game is done. These items are \"game changing\", but even with very low drop rates (hundreds of times higher than they are now) you most likely still wouldn't see one of these items before you are geared well enough to have done all the above things, i.e. lvl 100, tier 100NMD, Uberlilith. So what is even the point of the item to begin with? At the point you potentially would get one would be way past the point it provides anything useful to you.\n\nSo it's all around just absolutely dumb design.\n\nMe personally, I'd say give them low drop rates, but balance it in a way where you have say an overall chance of 10% to get one before you reach level 100. and say 25-50% before you reach the power level needed to beat Lilith.\n\nAt least then their existence would have a point",
   "created_utc": 1690632785,
   "score": 87,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty6og9",
   "message": "As far as I'm concerned, they don't exist.... I'm having fun with d4, but those Ubers aren't even real in my eyes, so there is no reason to even think about them. Stupid for them to even be a thing in the 1st place.",
   "created_utc": 1690642460,
   "score": 17,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtya8hi",
   "message": "Shits and giggles",
   "created_utc": 1690643973,
   "score": 8,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty1c5o",
   "message": "Same reason some poor folks are pro billionaire. They’re sure they’ll get there one day and will love lording it over the jealous masses. The Ubers may as well not even exist to me, I will likely never see one and if I do I’d be disappointed that THAT’s the thing that beat the odds for me lol",
   "created_utc": 1690640179,
   "score": 40,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty1nve",
   "message": "Because they know some of these nerds will spend huge numbers of hours grinding for them regardless if they like the game or not",
   "created_utc": 1690640305,
   "score": 9,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtybb84",
   "message": "Because one of the higher ups want to impose their own fantasy of wierd itemization, and it seems thw rest of the team have to \"yes man\" it.\n\nBullshit system",
   "created_utc": 1690644417,
   "score": 7,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtybuwy",
   "message": "I think it’s because they gave up on making games fun in favor of making them addictive",
   "created_utc": 1690644645,
   "score": 9,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty0gq2",
   "message": "Because bad decisions were made and green-lit based on projected metrics and psychological profiling rather than fun.",
   "created_utc": 1690639823,
   "score": 16,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty65xs",
   "message": "Need to be like way way way less rare.\n\n\nLike if I play 5 hours a day every season I should have the probability of finding one.\n\n\n\nAlso uniques in general.  There isnt enough.\n\nEach class and general need like 25 more uniques.\n\n\nDiablo also had good, weird, kinda good, and amazing classes of uniques.\n\n\nNow it's just a few that are good and most everything else is just more gold.\n\n\nEvery class needs like 5 different items that are tempest roar caliber (build enabling)  a couple that are very weird and some 5 head can make obscure new builds that eventually break the meta.  And a few items that just suck and your just vendor them",
   "created_utc": 1690642237,
   "score": 13,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty5kt5",
   "message": "I legitimate think devs do not realize themselves how rare they are. Otherwise whats the point of these items if only 2 players per season will find them.",
   "created_utc": 1690641979,
   "score": 9,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtyc49y",
   "message": "thank god for the nerf patch they stopped my addiction",
   "created_utc": 1690644753,
   "score": 8,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtyedxp",
   "message": "They aren't.",
   "created_utc": 1690645685,
   "score": 3,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "ju0fqep",
   "message": "Once I realized I was never going to to be able to make the optimal storm werewolf build because it is dependant on an uber unique ring, I quit playing. How are you going to have a game that is loot and build oriented and then gatekeep people from the loot to make their build with absurdly low drop rates? We spend enough time chasing impossible dreams in the real world, don't need to do it in video games too.",
   "created_utc": 1690676171,
   "score": 3,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtxo021",
   "message": "[removed]",
   "created_utc": 1690634311,
   "score": 17,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtyazh4",
   "message": "They have half the idea right. They shouldn't feel \"required\". They should be very rare. They should be \"chase\" items. That is all great!\n\nThey just have them too rare by order of magnitude. \n\nThat part is concerning. They either don't get how numbers work, or legimately don't want anyone to EVER get them. \n\nThey should be as rare as a JAH, BER or ZOD. Instead, they are like 5 times as rare as a Mirror of Kalandra.",
   "created_utc": 1690644279,
   "score": 6,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty4uji",
   "message": "For that 1 person",
   "created_utc": 1690641657,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty953m",
   "message": "Re your edit OP: you can report abuse of the feature and Reddit will give them a temp ban :)",
   "created_utc": 1690643510,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jty9hdt",
   "message": "I just want to experince shako barb",
   "created_utc": 1690643655,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtzeoi4",
   "message": "From certain scientific perspectives, they actually aren't",
   "created_utc": 1690660118,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtzkg1o",
   "message": "I got that same self harm message, someone on this forum is a troll for sure, and kind of a disgusting human for abusing a system designed to help people. I hope they get caught and banned. Realistically probably too scared to false flag on their main account though and are using a burner. Actually cringe XD",
   "created_utc": 1690662462,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "ju0a014",
   "message": "These super rare things should only be cosmetics imo, having them waste dev time in these Uniques that are made for nobody instead of using that time to work on other things is just dumb.",
   "created_utc": 1690673497,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "ju0g3bf",
   "message": "The people that defend it are idiots. They usually compare it to d2 but it’s not even a close comparison. By this time in Diablo 2 I had every item In The game I ever wanted and every unique in the game these uniques in d4 are like 100x more rare than anything was in d2 with no way to target farm for them. It’s a joke they basically don’t exist.",
   "created_utc": 1690676339,
   "score": 2,
   "submission_id": "15cqkhg"
  },
  {
   "comment_id": "jtynotf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15cqkhg"
  }
 ]
}