{
 "submission_id": "15d0wsu",
 "title": "There's way too many on-death effects....",
 "selftext": "Seriously, why is there SO MANY of these? It's like half the mechanics in this game involve an on-death effect. Don't believe me?  \n\n\nBase Mob Types with an on-death effect:\n\n\\- Fallen Lunatics (they get a pass because they actually die doing it and it's their only attack)\n\n\\- Spider Carrier\n\n\\- Bloated Corpses\n\nElite Affixes:\n\n\\- Fire Enchanted (seriously fuck this affix)\n\n\\- Poison Enchanted\n\nNightmare Dungeon Affixes:\n\n\\- Blood Blisters\n\n\\- Death Pulse\n\n\u0026amp;#x200B;\n\nI probably missed a few but you get the picture. Seriously this isn't fun or engaging. It's especially egregious when you end up in a NMD and these things can all stack together, leading to almost every monster with an on-death explosion effect. NMDs also often come with permanent \"dodge the mechanic\" effects (Stormbane's Wrath, Drifting Shade) so I feel like 99% of the dungeon is me making sure I'm not standing in an explosion about to go off.\n\nOne or two of these is fine, but when you put all of this together it's just repetitive and boring. If your monsters aren't threatening until they're dead, maybe they need to be looked at again. The only things in this game that are actually a threat are on-death effects and chain CC, neither of which is fun to deal with.",
 "created_utc": 1690659624,
 "permalink": "/r/diablo4/comments/15d0wsu/theres_way_too_many_ondeath_effects/",
 "score": 234,
 "url": "https://www.reddit.com/r/diablo4/comments/15d0wsu/theres_way_too_many_ondeath_effects/",
 "comments": [
  {
   "comment_id": "jtzlx4e",
   "message": "I'm not a fan of the mob being more dangerous after I kill it",
   "created_utc": 1690663068,
   "score": 157,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzn3dg",
   "message": "The ones I hate the most is the Spiders. Every other affix you can get away from quite easily, but if you're a melee type, well, I hope you brought some potions for that poison.",
   "created_utc": 1690663559,
   "score": 20,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzykmx",
   "message": "It's gotten to the point where I basically assume every pack has some sort of explode-on-death effect in it, especially because it can be hard to tell friendly explosions from enemy ones",
   "created_utc": 1690668362,
   "score": 13,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtziiui",
   "message": "Can't believe I'm actually seeing people in other threads defending fire enchanted lmao. They think moving out of useless shit 4 times every pack and wasting 6 seconds before you can loot makes them skilled players or something.",
   "created_utc": 1690661675,
   "score": 66,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzz2u4",
   "message": "And my poor minions would eat that shit every time.  Kill a dungeon boss....run like hell to get out of the blast radius....the minions eat it.  RIP boys, we hardly knew ya.",
   "created_utc": 1690668570,
   "score": 7,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzpoeu",
   "message": "Yo, dawg, I herd u liek explosions so we- *Dead*",
   "created_utc": 1690664651,
   "score": 6,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0rqye",
   "message": "The funniest thing to me is, that on death effects were amongst the number 1 complaints against POE for years. But somehow Blizzard thought it was a good idea to copy a gameplay aspect everybody hated",
   "created_utc": 1690681868,
   "score": 8,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0az6x",
   "message": "Some of them wouldn’t be bad if resistances actually worked.",
   "created_utc": 1690673950,
   "score": 6,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0xv0m",
   "message": "An overused mechanic that's become annoying, just like 90% of shrines being cursed.",
   "created_utc": 1690684894,
   "score": 5,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzt7x6",
   "message": "In an action rpg anything that slows down the pace and action fucking sucks and is unfun. I am surprised the developers of an action rpg find this concept confusing. It’s like blizzard went back in time and hired EverQuest devs who don’t understand the concept of playing games for fun.",
   "created_utc": 1690666137,
   "score": 13,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0h66f",
   "message": "On death effects should also affect other nearby enemies. Might get a chain reaction or knock them back. Etc..",
   "created_utc": 1690676838,
   "score": 2,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0i1vk",
   "message": "No reason to have that shit for trash mobs",
   "created_utc": 1690677255,
   "score": 2,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0is72",
   "message": "But how else could they ensure we die in an otherwise ridiculously easy game?   On death and CC lock are pretty much the only reason I ever die.  It’s usually both events simultaneously.",
   "created_utc": 1690677603,
   "score": 2,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0oojc",
   "message": "Does everyone just want hallways filled with huge packs of piñatas that just explode?",
   "created_utc": 1690680387,
   "score": 2,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0dxxc",
   "message": "Ehhh. This has been an ARPG staple for 10+ years now. Learn how to play the game inatead of wanting to change it.",
   "created_utc": 1690675335,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0dupe",
   "message": "Oh boy you better never try PoE.",
   "created_utc": 1690675293,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0nkij",
   "message": "I like it. Game is easy as can be anyways. Why are you guys crying to make it easier. Hopefully Blizzard learns that listening to people in this sub is the worst thing they could do.",
   "created_utc": 1690679848,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzw6w4",
   "message": "By count of a database there are 764 enemy types in the game your list seems relatively low or am I missing something?\n\nAlso these are largely demonic enemies from hell, I would be shocked if they didn’t try to take you out on their way back",
   "created_utc": 1690667362,
   "score": 253,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju03s4z",
   "message": "It was probably to make resistances a requirement for melees that don't have high int. I feel like if resistances worked and it didn't delay item drops it would be less of an issue.",
   "created_utc": 1690670671,
   "score": 0,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0nx0p",
   "message": "\u0026gt;Seriously, why is there SO MANY of these?\n\nBecause its a Diablo game. Have you not played the other entries?\n\n\n*yawn*\n\nSomeone posts a criticism and then every one else has to regurgitate it to get their free karma off it. And it made no sense to begin with.\n\nI don't go into forums for fifa games and complain that there's so much kicking.",
   "created_utc": 1690680017,
   "score": 255,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzkjv2",
   "message": "The point of all this on death effect is to force you into a play style where you always are on the move and always have to pay attention. It shapes the style of the game",
   "created_utc": 1690662506,
   "score": 249,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzr2pd",
   "message": "I like it its challenging except fire enchanted",
   "created_utc": 1690665237,
   "score": 254,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0uq2i",
   "message": "Do you guys find everything to complain about.",
   "created_utc": 1690683315,
   "score": 255,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "jtzenh1",
   "message": "Yes that sounds challenging \n\nFor me and many that equals fun",
   "created_utc": 1690660106,
   "score": 240,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0b6ks",
   "message": "At least it’s like 1/4 of Poes on death/after death",
   "created_utc": 1690674044,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0gigw",
   "message": "And the worst thing is you will respawn at the farthest possible part of the map.",
   "created_utc": 1690676531,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0k3k8",
   "message": "\u0026gt; Seriously this isn't fun or engaging. \n\nI'll give you the first one, I wouldn't call those effects fun. However, I rarely get more engaged than when I hit a skill that \\*should\\* blow up a fallen lunatic and it only knocks out half their health mid-explodey squat. The panic definitely increases my level of engagement.",
   "created_utc": 1690678213,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0kiml",
   "message": " Do we then have to disable all self target based AOE's from living mobs as well? \n\nWhats the difference between a mob doing an AOE when its alive and casting the same AOE one last time on death?",
   "created_utc": 1690678407,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0sobz",
   "message": "Ya, there is definitely too many.  In general I think its hard to come up with effects that are interesting without being frustrating or problematic.  \n\nCC issues and thus frost enchanted, backstabber and resource burn for example all just got pulled.",
   "created_utc": 1690682316,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0uudz",
   "message": "Need to lower the %%s, by a lot.",
   "created_utc": 1690683375,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju0vxg5",
   "message": "I hate anything that follows you. Its annoying as f. The worst for me are the swirling clouds that blind and prevent you from pressing buttons until you move; unfortunately there are 10 of them tight together near what you are trying to kill.",
   "created_utc": 1690683918,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju115lp",
   "message": "Laughs in POE",
   "created_utc": 1690686596,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju11jkk",
   "message": "I can see your point, but I kinda like it. Forces me to be alert. Otherwise it’s a snooze fest.",
   "created_utc": 1690686809,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju11ozx",
   "message": "The bloated zombies are kind of annoying but for real fuck the spider mobs. Toxic spiders and the infested dudes that blow up *and* spawn more tiny spiders? GO AWAY. BEGONE.",
   "created_utc": 1690686889,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju14ec7",
   "message": "Didnt play pre season or betas? This shit was old more than a month ago",
   "created_utc": 1690688323,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju17cpl",
   "message": "Death pulse in so bad with small spiders when the floor is cluttered with all sorts of effects anyways.\n\nLet us disable the spell effects of other people and tone down our own.",
   "created_utc": 1690689936,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju18tv7",
   "message": "My melee focused druid suffers hard from enemies that form poison pools after death.",
   "created_utc": 1690690772,
   "score": 1,
   "submission_id": "15d0wsu"
  },
  {
   "comment_id": "ju19204",
   "message": "I don't think it's that much of an issue, but what is the real issue is the lack of versatility in dealing with enemies that have an on death effect. For example if you play a Rogue or Sorcerer,  you can just freeze these enemies then kill them while frozen and the on-death affect doesn't happen. Diablo 2 had a number of these enemies too, but every class could find a way to manage it either on their characters skills, items or on their merc. Hell you can just throw in a malignant heart that either prevents the effect or freezes/petrifies an enemy so you can kill it before they do it, problem solved.",
   "created_utc": 1690690906,
   "score": 1,
   "submission_id": "15d0wsu"
  }
 ]
}