{
 "submission_id": "158nw3y",
 "title": "Privacy watchdog says Health Department failed to protect Victorians' data during COVID",
 "selftext": "",
 "created_utc": 1690234511,
 "permalink": "/r/melbourne/comments/158nw3y/privacy_watchdog_says_health_department_failed_to/",
 "score": 28,
 "url": "https://www.abc.net.au/news/2023-07-25/victoria-covid-government-data-breach-ovic/102641956",
 "comments": [
  {
   "comment_id": "jtaxlnb",
   "message": "“In one case, an external staff member who had relevant criminal history and was on bail at the time used personal information from the departmental system to attend the home of a woman who was isolating.\n\nThe staff member then pretended to be a health department inspector and attempted to coerce the woman into sexual acts.\n\nOVIC found while the staff member completed a police check application, the department did not submit it to be processed.”",
   "created_utc": 1690234537,
   "score": 20,
   "submission_id": "158nw3y"
  },
  {
   "comment_id": "jtb3mlw",
   "message": "Who would of guessed…",
   "created_utc": 1690236981,
   "score": 8,
   "submission_id": "158nw3y"
  },
  {
   "comment_id": "jtb5oyj",
   "message": "\"Victoria's privacy watchdog has found the Department of Health failed to protect against the misuse of citizen's personal information during the pandemic.\n\nThe Office of the Victorian Information Commissioner (OVIC) found that *the use of third-party call centres to meet the increased demand for staff during COVID led to the misuse of personal information.*\n\nThe report, released Tuesday, said the department \"failed to take steps to ensure that all external staff who had access to that information could be trusted with it\".\n\nOVIC's investigation found poor pre-employment screening and police background check practices in place.\"\n\n\nDevastating that the right people weren't in the right place or were spread too thin. It's horrible how people jump at an opportunity to exploit. That poor woman.",
   "created_utc": 1690237851,
   "score": 3,
   "submission_id": "158nw3y"
  },
  {
   "comment_id": "jtc2bc7",
   "message": "No surprises there.\n\nToo bad that anyone who raised these concerns at the time were shouted down.",
   "created_utc": 1690252552,
   "score": 2,
   "submission_id": "158nw3y"
  }
 ]
}