{
 "submission_id": "158r3e1",
 "title": "Dog attack outside school this morning",
 "selftext": "I’ve posted for advice in the past regarding an owner who leaves her dog unattended at the school during drop offs. The dog has always been calm and seems friendly but I’ve raised concerns with both the owner and the school because dogs, and kids, can both be unpredictable. Each time the owner would become aggressive with me and talks about how controlled and kind their dog is and that it would never hurt anyone. The school hasn’t really taken anything but token action.  \n\nWell this morning the dog attacked another dog out of nowhere. It was with the owner but she couldn’t control it, it pulled the leash out of her hands, ran across the street and mauled a much smaller dog. \n\nThat could have been a child. \n\nSo to anyone out there who thinks they know their dog, or anyone who is kinda nervous. Report that shit. If the school and the owner don’t take it seriously, call 000.",
 "created_utc": 1690242012,
 "permalink": "/r/melbourne/comments/158r3e1/dog_attack_outside_school_this_morning/",
 "score": 190,
 "url": "https://www.reddit.com/r/melbourne/comments/158r3e1/dog_attack_outside_school_this_morning/",
 "comments": [
  {
   "comment_id": "jtbsf9p",
   "message": "I work in a vet clinic in Melbourne.. last week a very distressed elderly owner walked in with her small dog who had just been attacked by another dog on a nearby street.\n\n The owner explained she attempted to save her dog that was being literally tossed around and was bitten on her hand in the process. She had puncture wounds and bruising on her hands. Miraculously her dog was not seriously injured. \n\nApparently the attacking dogs owner came out from her house (attack was on the street) and called her dog back in to their property. She was completely unapologetic and refused to help! \n\nLuckily the owner had witnesses to back her up. She reported to council and police, however police said nothing they can do and it is a council matter only.\n\nI realise they can't get involved in every dog attack,  but I was surprised that a human being bitten by a loose dog doesn't rank as a police matter... I wonder at what point they step in? \n\nDoes it need to be to a level requiring hospitalisation? or fatality???  \n\nWhat happens if dog in OPs post actually bites a child?  \n\nIt doesn't seem right...\n\n\nTLDR - elderly lady was bit by a loose dog and police refused to get involved.",
   "created_utc": 1690247875,
   "score": 87,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbnb1u",
   "message": "Call the dangerous dog line on 136 186. My dog who was minding her own business was attacked last week by a vicious American Staffy who was off lead. They take it pretty seriously and have a no tolerance policy. I had the same thoughts especially since my kid likes to walk our dog the most.",
   "created_utc": 1690245518,
   "score": 72,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbfszc",
   "message": "The day that dog owners become legally criminally responsible for the behaviour of their dogs cannot come too soon.  Another child or elderly person mauling cannot be too far away unfortunately.",
   "created_utc": 1690242222,
   "score": 195,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtburm7",
   "message": "After every dog attack, the owner will comment that “It was unlike their dog, and they’d thought they’d be fine around smaller dogs and kids”. Despite the fact the dog was specifically bred to be a powerful attack dog. The more dangerous a dog, the greater chance their owner is an ignorant dipshit.",
   "created_utc": 1690248938,
   "score": 19,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbn3y2",
   "message": "Just yesterday I was lamenting not having the opportunity to take my dog (8 year old female border collie) for school pick-up. They don't allow dogs inside. With all of the kids getting about there is no way I would leave her unattended. I can't trust the dog or a child to behave appropriately so I just don't do it. It wouldn't be fair on her or the kids. Plus, the toddler is enough of a handful.",
   "created_utc": 1690245430,
   "score": 22,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc05d2",
   "message": "\u0026gt; it would never hurt anyone\n\nThey may be well behaved 99.9% of the time but it only takes one instant out of the decade it’s alive for something disastrous to happen. You can’t honestly claim “never”.\n\nThis sentiment is always bullshit, but especially so coming from the mouth of an aggressive human, as OP claimed. How would this animal that sees you as the pack leader be better behaved than you are? You’re its example.",
   "created_utc": 1690251530,
   "score": 8,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbjl47",
   "message": "Leaving a dog unattended would be a Council matter, as would a dog attack. Take photos, report to council. The only time police would become involved is if the owner deliberately set their dog on another dog or person. Don’t waste emergency services resources by contacting emergency services for non-emergencies.",
   "created_utc": 1690243877,
   "score": 30,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbwxl4",
   "message": "Everytime I hear stories like this I become more nervous to take my dog out for walks at all. I try and walk at 7am to avoid people but this should not even be happening. Should be mandatory to pass a education course to own dogs and more breeds need to be restricted..",
   "created_utc": 1690249953,
   "score": 6,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc018d",
   "message": "Yeah I agree with you fully. This topic really upsets me because when I was 13, I had my lip bitten off by a dog, totally unprovoked. Fast forward to pools of blood everywhere, the worst pain I've ever felt in my life, and plastic surgery and a skin graft and so many years later, it's been rough. I have 2 dogs of my own now who I love and trust so much, but they're also dogs. We can never be careful enough.",
   "created_utc": 1690251472,
   "score": 6,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc01n5",
   "message": "Dog owners who don’t take responsibility for the damage their dog does to other people and/or their pets are scum. \n\nPlain and simple. Echoing what other people say, people need to be criminally charged for that shit.",
   "created_utc": 1690251478,
   "score": 5,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbjyqe",
   "message": "000 is not for this sort of thing, the local council is. \n\nThat said, yes, I agree - report it every time and insist on a record number",
   "created_utc": 1690244041,
   "score": 17,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbrhuz",
   "message": "I personally dont think warrants calling 000 as its not an emergency. Perhaps the non emergency line would be better suited but even then you are better off calling the council instead of the police since they cant do much.",
   "created_utc": 1690247464,
   "score": 11,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbulqs",
   "message": "Our dog opened a window and escaped (six feet drop) . Went down the road to play with the dog two houses down. He sat outside their front door.\nThey put him back in our yard and locked the window.\nThat afternoon the rangers came around to check our house and our dog.\nWe put a wire screen across the window. 👍",
   "created_utc": 1690248865,
   "score": 3,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc20df",
   "message": "Was the dog in school grounds or out the front gate? \n\nDogs are not allowed on school ground in Victoria by law (other than organised therapy dogs), so you might also need to give the school a ring so they can send out a reminder in the newsletter that they aren’t allowed.",
   "created_utc": 1690252410,
   "score": 3,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc4zqj",
   "message": "I agree with this except for the last part.\n\nDo not call 000 just because a dog is off leash. People do this then bitch and moan about the wait times for actual emergencies. Far out.",
   "created_utc": 1690253875,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbuw5s",
   "message": "R/banpitbulls",
   "created_utc": 1690248994,
   "score": 6,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbr3f5",
   "message": "You should contact your local council as dog attacks are a council matter.\n\nAll dogs need to be \"under effective control\", which in this case it appears the dog was not as the woman could not control the dog on lead. If the dog is tied up and does anything it is the owners responsibility as it is not on her property.\n\nFor the dog attack, the council will contact the victim and have the victim do an official statement.\n\nPossible outcomes include:\n- the owner paying the victims vet bills\n- declaring the dog as menacing or dangerous\n- a fine for the dog being off lead",
   "created_utc": 1690247289,
   "score": 3,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbr6ui",
   "message": "Dog should be put to rest and owner in the jail. \n\nWhy do dog owners think their dogs deserve extraordinary privileges , its a fucking dog/animal.",
   "created_utc": 1690247330,
   "score": 3,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbyaqt",
   "message": "I'm a bit confused about your post honestly. The dog wasn't unattended at the time, it was on lead, and (apparently) didn't have a history of aggression.\n\nIs it the fact that it was near school grounds in the first place? I'm not trying to be a pain, just genuinely not sure what you're asking for to change.",
   "created_utc": 1690250612,
   "score": 2,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc5ul9",
   "message": "r/BanPitBulls",
   "created_utc": 1690254322,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbh5i9",
   "message": "You suggest 000 operators waste their time and attention on nervous people?",
   "created_utc": 1690242811,
   "score": 2,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbxv5z",
   "message": "So wait, the dog mauled a dog and then pulled the leash away from the owner and mauled a different dog? That’s quite abnormal behaviour to run away from a fight it started then to start another one.\n\nAnyways, I have no reason to question anything I read on the internet at all.",
   "created_utc": 1690250403,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc0eth",
   "message": "I’m 6ft3 admittedly but I have scared off a few dangerous  dogs in my time  with very loud aggressive screaming and swearing if a dog comes at me.  Let it know who’s boss. The next step is to kick it as hard as you can away from its face it isn’t  backing down. Only did that once and it yelped its way home to mumma.  Or a large rock thrown at it if you can find. I genuinely like dogs but when they are out of control they are a dangerous wild animal.",
   "created_utc": 1690251660,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbjfa4",
   "message": "Did you call police?",
   "created_utc": 1690243808,
   "score": 0,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc0o5d",
   "message": "\u0026gt;Well this morning the dog attacked another dog out of nowhere. It was with the owner but she couldn’t control it, it pulled the leash out of her hands, ran across the street and mauled a much smaller dog.\n\n\u0026gt;That could have been a child.\n\nSounds a little melodramatic tbh, I've never seen a child maul a dog before\n\n(Sorry just a little humour to try and brighten your day, I imagine it was a little traumatic)",
   "created_utc": 1690251784,
   "score": 255,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbyyjd",
   "message": "Sorry 😔",
   "created_utc": 1690250937,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtbz2qj",
   "message": "As someone that got bit by a dog a couple weeks ago under similar circumstances, it ain't fun. Not only do you get puncture wounds that bleed heaps but the bruising is so bad for a solid week straight and only then starts to go away.",
   "created_utc": 1690250993,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc68iv",
   "message": "God, I HATE dog owners who just assume their dog won't hurt anyone. Even if the dog is legit normally trained, calm and well-behaved, they are still animals and should be respected as such; you don't know what may trigger an attack. Just last December, I unfortunately witnessed a pair of loose dogs mauling a loose cat- I was too late to save the poor cat, and she died from her wounds as I carried her in my arms. Keep your dog supervised, well-trained, secured, and be alert and ready to jump in to remove your dog if it seems to want to be aggressive. There honestly need to be better laws regarding dogs...",
   "created_utc": 1690254516,
   "score": 1,
   "submission_id": "158r3e1"
  },
  {
   "comment_id": "jtc6pgw",
   "message": "Dogs can't be trusted, I've been attacked by 4 dogs at various stages through my life (2 German Shepherds,  1 Lab, 1 Rottweiler).\n\nThe worst one ended up cracking a bone in my shin and significantly severing the sensory nerve to the point that I still have limited feelinfmg in the lower half of my left leg. \n\nAll four dogs were supposedly \"good, well trained dogs\". Embarrassingly, the one that got me worst was my own.\n\nThe nonchalant attitude that people have regarding dogs, especially around kids does my head in. If I had my way they would need to be harnessed and partially muzzled when out in public. I have no patience left for them.",
   "created_utc": 1690254758,
   "score": 1,
   "submission_id": "158r3e1"
  }
 ]
}