{
 "submission_id": "158sirm",
 "title": "Medicinal cannabis users could soon be allowed to drive in Victoria",
 "selftext": "",
 "created_utc": 1690245577,
 "permalink": "/r/melbourne/comments/158sirm/medicinal_cannabis_users_could_soon_be_allowed_to/",
 "score": 64,
 "url": "https://www.heraldsun.com.au/news/victoria/medicinal-cannabis-users-could-soon-be-allowed-to-drive-in-victoria/news-story/11d05d28d6132d4293f65f76b20dc8a9",
 "comments": [
  {
   "comment_id": "jtboggi",
   "message": "So if you pay a corporation for your weed it's ok but otherwise not.",
   "created_utc": 1690246056,
   "score": 47,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtbpw2n",
   "message": "From behind the pay wall (and no, I don't pay for the herald scum. This is courtesy of my boomer dad)\n\n\"Victorians using medicinal cannabis could soon legally get behind the wheel under an Australia-first closed trial being considered by the Andrews government.\n\nThe Herald Sun can reveal the state is working to establish a select trial to let a small number of medicinal cannabis users drive if they are not impaired.\n\nIn 2016, Victoria became the first state to approve the use of weed for medicinal purposes, but it remains a criminal offence for any person to drive with any THC — including from medicinal cannabis — within their system.\n\nDespite the potential effects of cannabis having been abated by morning, traces of the drug will remain in a person’s system for weeks and will likely be picked up in a roadside drug test.\n\nIt is a serious offence under Victorian road rules to test positive and there is currently no universally accepted technology to test for impairment instead.\n\nThis has led to many users being driven to instead take addictive high-risk medications like codeine and Valium, which have the potential to cause drowsiness, but aren’t screened in roadside drug tests.\n\nA trial would be a major win for the Legalise Cannabis Party who surprised by picking up two upper house seats at the state election. Their votes are now crucial for the government to pass legislation.\n\nIn February, the minor party introduced a Bill to parliament to amend the Road Safety Act and allow prescripted users of medicinal cannabis to drive.\n\nPremier Daniel Andrews has flagged a willingness to review roadside testing for medicinal cannabis after they made it a policy priority.\n\nBut he warned that road safety needed to remain paramount, with government figures reluctant to make major changes to drug testing during a horror year for the states road toll and as Victoria Police deal with other major changes such as the removal of the public drunkenness offence.\n\nAs a compromise, it can be revealed that work is underway to establish a trial running for at least a year which could pave the way for a permanent change if successful.\n\nIt would involve a small closed group of medicinal cannabis users and focus on ways to mitigate the issue of how to handle impairment.\n\nThe Herald Sun understands that one of the measures being canvassed would be to ensure trial participants must be aged over 25 and have a zero blood alcohol limit.\n\nLegalise Cannabis MP David Ettershank said the government was due to have a proposal confirmed by July 1.\n\n“We would be extremely distressed if this trial was not up and running before Christmas,” he said.\n\nSenior Criminal Lawyer Ben Watson said he has represented many clients who had lost their licence for having traces of THC in their system, despite lawfully having taken medicinal cannabis.\n\nOne recent client had a terminal cancer diagnosis with just six months to live.\n\n“No one should be ostracised from society due to taking a prescribed medication which impacts their life so positively,” he said.\n\n“People should not have to choose between their choice of pain management and the freedom to drive.”\n\nA government spokesperson said there were “no plans to legalise cannabis beyond medical use’’.\n\n“The safety of all road users is the highest priority and we make no apologies for our focus on this,’’ they said.\n\n“We also recognise that medicinal cannabis patients need to be able to get around.”\"",
   "created_utc": 1690246734,
   "score": 31,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtbzt05",
   "message": "About time, if you can drive with alcohol in your system why can’t you have cannabis in your system.\nEven days after consuming cannabis it’s still in your saliva. Makes no sense to keep these stupid laws",
   "created_utc": 1690251358,
   "score": 5,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtbp69b",
   "message": "They won't be able to afford the petrol to drive due to the exorbitant cost of medicinal cannabis, but it's nice to know they could drive if they wanted to",
   "created_utc": 1690246394,
   "score": 8,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtbzg4o",
   "message": "honestly not holding my breath. Been a prescription pot head for a while now (round two years or so i think, maybe lil longer). Every few months theres similar news. Ill believe it when the laws change",
   "created_utc": 1690251179,
   "score": 2,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtbnnkt",
   "message": "Any comrades have a subscription? Or a nifty way of breaching the pay wall?",
   "created_utc": 1690245677,
   "score": 2,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtc1wan",
   "message": "[deleted]",
   "created_utc": 1690252357,
   "score": 1,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtc4kqr",
   "message": "Great idea but a select group over 12 months isn't going to help most of us, I use cannabis oil, great for pain relief, about time these outdated laws are modernised",
   "created_utc": 1690253659,
   "score": 1,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtc1ljm",
   "message": "years of being sidelined, side eyed, and threatened as a criminal by The Boss make people less willing to listen to or follow drug advice that would potentially save their lives. factor that risk in. not gonna?\n\ncannabis, like coffee, like cacao, like many others, is a plant that people have known how to use for thousands of years. we're talking generation after generation of cultivation and use. \n\nyeah you can have too much and experience negative effects, just like too much coffee can cause you to have a heart attack. \n\nso ban coffee, and ban turkey (tryptophane content will put you to sleep), ban sugary fruits because they all can be overdosed on by people who get behind the wheel of *high speed, multi-ton metal cages propelled by pressurised explosions*. which should never be banned or even limited in any way other than being unable to attach flamethrowers and drop road mines.",
   "created_utc": 1690252219,
   "score": 254,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtc4qsq",
   "message": "No insurance claim will be paid out if a cannabis user was at fault in an accident legal or not. It’s one of the basic disclosure questions you are required to answer.",
   "created_utc": 1690253746,
   "score": 1,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtc59xq",
   "message": "The US DMV have a position paper on cannabis and driving, there's no association between blood levels and impairment.  Australian RACGP also.\n\nIt's at the stage where defending a positive test is easier than ever. Seems like the police are giving up",
   "created_utc": 1690254022,
   "score": 1,
   "submission_id": "158sirm"
  },
  {
   "comment_id": "jtc6pjf",
   "message": "Anyone seen the stickers on medicinal cannabis containers? Same aticker as what's on valiums etc. \n\nSays, if affected do not drive. \n\nCan already drive on CBD anyway. My cannabis doctor said it won't trigger a roadside positive.",
   "created_utc": 1690254759,
   "score": 1,
   "submission_id": "158sirm"
  }
 ]
}