{
 "submission_id": "158t3oc",
 "title": "PSA for University students",
 "selftext": "Keep multiple backups and as much proof that you have done your own work - for example, screenshots, search history, etc.  One major university (possibly more) has been incorrectly targeting students for the use of generative AI.  The disciplinary process for this is extremely daunting and will nit pick every little detail (such as using abbreviations, not the whole elaboration).\n\nIn my experience I was proven innocent as I provided screenshots + search histories + edited and non-edited versions.  Despite this, they continue to target me since I have to use a recording software (I assume only students who have been accused, because my other colleagues don't have to use it).  A bit frustrating as other work submitted I see are blatantly AI and not getting noticed.",
 "created_utc": 1690247079,
 "permalink": "/r/melbourne/comments/158t3oc/psa_for_university_students/",
 "score": 31,
 "url": "https://www.reddit.com/r/melbourne/comments/158t3oc/psa_for_university_students/",
 "comments": [
  {
   "comment_id": "jtbsi8m",
   "message": "I feel for you uni students of today  \n  \nBack when i was still studying, i got pinged for not properly citing a journal, got off with a stern warning and learn my lesson that its better to over cite stuff than prove after the fact",
   "created_utc": 1690247912,
   "score": 12,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtc2ojk",
   "message": "OP if it was proven you were incorrectly targeted, i am extremely suspect about their use of recording software. You are being punished, through an egregious breach of privacy, for *not* cheating. Talk to your student union ASAP. I wouldn't imagine they have any standing whatsoever to make you use a recording software on your own time, on your own computer - especially if you haven't done anything wrong in the first place.",
   "created_utc": 1690252722,
   "score": 8,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtbsisu",
   "message": "Onedrive will also store 25 (I think) versions of a file and you can sync across multiple devices. Not sure about apple offerings",
   "created_utc": 1690247919,
   "score": 8,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtbzdaw",
   "message": "Are you using the recording software as an equitable learning accomodation? Might be time to talk to your student union about this",
   "created_utc": 1690251141,
   "score": 4,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtc0u43",
   "message": "Write it on Google Docs first until you're ready to produce the final draft, then copy it over to Word.\n\nGoogle Docs tracks revisions, including time stamps.",
   "created_utc": 1690251862,
   "score": 2,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtc1qlp",
   "message": "Have they shown you what is being flagged on Turnitin?",
   "created_utc": 1690252284,
   "score": 2,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtbv89h",
   "message": "Which uni",
   "created_utc": 1690249149,
   "score": 1,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtc4uk2",
   "message": "Would referencing not deal with this? AI doesn’t know how to reference properly, and often makes references up. Long as you got your references sorted, should be fine ey",
   "created_utc": 1690253800,
   "score": 1,
   "submission_id": "158t3oc"
  },
  {
   "comment_id": "jtc7klk",
   "message": "Almost all universities have Office 365 that can record version history of documents.\n\nUniversities need to adapt and restructure the way they evaluate students to account for the existence of AI.",
   "created_utc": 1690255198,
   "score": 1,
   "submission_id": "158t3oc"
  }
 ]
}