{
 "submission_id": "15pnylw",
 "title": "Can I just take a moment to appreciate how good the tapwater is in Melbourne?",
 "selftext": "Seriously. I’ve so far tasted the water in Brisbane (metallic tasting and gross), Perth (somehow dirty tasting), Sydney (just no, oh God no) and Cairns (god tier rainforest runoff with minimal additions because the hippies get butthurt about it) and Melbourne seriously has the best tasting water aside from Cairns, my gleaming gold standard.\n\nWhen I lived in Brisbane having filtered water was absolutely a requirement for good drinking and use in fancy coffee making, but here I’ve never felt the need to filter it or buy bottled water for any reason besides convenience, not to mention for the majority of the year it’s nice and cold, cold enough to be refreshing but not too cold it’s annoying.\n\nLooking it up it makes sense to me, it comes from protected catchments and very clean sources, but that still doesn’t completely explain why it’s so tasty.\n\nOne day I’ll have to bring some with me back up to Cairns and do a proper side by side taste test, really nail down which one is better as both a drinking water and an ingredient in coffee.",
 "created_utc": 1691896843,
 "permalink": "/r/melbourne/comments/15pnylw/can_i_just_take_a_moment_to_appreciate_how_good/",
 "score": 236,
 "url": "https://www.reddit.com/r/melbourne/comments/15pnylw/can_i_just_take_a_moment_to_appreciate_how_good/",
 "comments": [
  {
   "comment_id": "jvyj6qw",
   "message": "Love it! Its my favourite drink. r/HydroHomies",
   "created_utc": 1691897197,
   "score": 103,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvylise",
   "message": "So true, Melbourne water tastes sweet and clean to me compared to other cities. Even in Bendigo I find myself missing Melbourne water. The subtleties are interesting!",
   "created_utc": 1691898482,
   "score": 35,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyjs3m",
   "message": "Melbourne water catchments are some of the most protected in the world... Def good water",
   "created_utc": 1691897517,
   "score": 245,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvykg10",
   "message": "You should try Adelaide water. Tastes like you’re drinking chemicals with some added water, it’s horrible. I have to buy bottled water when I go back over there or I’ll get dehydrated from avoiding the tap water.",
   "created_utc": 1691897881,
   "score": 184,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvynpwv",
   "message": "I’m a home brewer, so actually chased down a water report for my region (SE Melbourne). \n\nOur tap water is as close to RO (reverse osmosis filtered) water as makes no difference for brewing purposes.",
   "created_utc": 1691899709,
   "score": 130,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyn9nc",
   "message": "When I visted some family in New York City last year they raved about how they have the best tap water in the country, and it didnt even hold a candle to how good Melbournes tap water is! Big fan.",
   "created_utc": 1691899457,
   "score": 92,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvykx5c",
   "message": "We’re very lucky",
   "created_utc": 1691898145,
   "score": 36,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvymbch",
   "message": "Had a conversation about this with someone I met at work once. He’d traveled all over Australia and was telling me about the different tap water. Victoria came out on top of the rankings, and surprisingly it was Seymour which he reckons has the best tasting tap water in Victoria",
   "created_utc": 1691898921,
   "score": 60,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyz53c",
   "message": "Heya, I work at GWW and yeah Melbourne Water supply is some of the best in the world. Mostly because of the catchments but we're just super lucky to have such clean water here. \n\nAs for the taste, that's actually mostly because we don't filter out water as we have no need to - you're probably tasting trace sediments in the water which are actually good for you, if you strip them all out the water tastes... hollow, and fake.\n\nThese sediments do mean though that if pipes get disturbed that the water colour can change from clear to yellow/brown as a result of concentrations of sediment building up in the bottom of pipes - it can be quite jarring and concerning to see happen but nonetheless the water remains safe just a lil funky in appearance (and can affect clothes washing).\n\nWe have a number of key catchment areas so there can be slight variation in the water taste depending on which one/s service you and when we have to make changes to increase supply to meet demand etc. \n\nAlso I will point out that whilst we don't filter water we do still treat it. It has multiple checkpoints for testing and treating starting from the Melbourne Water owned catchments - which go through usually three checkpoints before they come into our (gww) owned pipes where we have our own plans and checks before passing it on to the consumers. There are full reports available publically showing target and achieved water composition for every area in Melbourne so you can check those out on your retailers site if you're curious to know exactly what makes up your water!",
   "created_utc": 1691907068,
   "score": 27,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvymjow",
   "message": "Wait until you get to Adelaide.",
   "created_utc": 1691899052,
   "score": 51,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvylw6m",
   "message": "I'm drinking it as I'm typing this comment. It's so good! I travelled to Wollongong a couple years ago and tried the tap water there and omg, I missed home. It was like drinking liquid dust. Fucking horrible. I have friends who don't like the taste of water (like what?) and I feel so bad for them cause our water is so tasty",
   "created_utc": 1691898686,
   "score": 19,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyoeyj",
   "message": "I love waking up at 3 am an going to the sink and putting my mouth under the stream an gulping away then when I stand up it’s like yehhhhhhh now that was refreshing haha love our water",
   "created_utc": 1691900115,
   "score": 18,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvymwz7",
   "message": "I never had too much issue with Brisbane water growing up there. Having moved tho… Melbourne water is perfect. And it’s because we have such stringent protections for our reservoirs. \n\nNow Dalby water… I’d rather die of thirst.",
   "created_utc": 1691899257,
   "score": 17,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyr3fc",
   "message": "South east water ✊🏼✊🏼✊🏼✊🏼✊🏼",
   "created_utc": 1691901699,
   "score": 18,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyp021",
   "message": "It is absolutely magnificent. There are 180+ countries where you cannot drink tap water and of the handful where you can, ours is one of the best tasting.",
   "created_utc": 1691900456,
   "score": 35,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyl75q",
   "message": "A hard earned thirst needs a cold glass of water, and the best cold water is Melb, Melb warts. You can get it walkin', you can get it talkin', you can get it workin' a plough... Matter o' fact I got it now! Cheers",
   "created_utc": 1691898300,
   "score": 40,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvylld3",
   "message": "Worst water I've ever tasted is in a little town called Narrandera in NSW, tastes like actual dirty bin water.",
   "created_utc": 1691898522,
   "score": 13,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyo4zv",
   "message": "I've just moved from NZ and so far Melbourne ranks number one in terms of water directly from the tap.\n\nI just assumed that the apartment we are in has a water filter system.  But now I'm thinking it's just good water.",
   "created_utc": 1691899950,
   "score": 13,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvypv8m",
   "message": "Cruise ships wait until they dock at Melbourne to restock their reserves.",
   "created_utc": 1691900961,
   "score": 11,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvynw7h",
   "message": "Having traveled to many countries and to every state in Australia, we are definitely very lucky here in Melbourne.",
   "created_utc": 1691899808,
   "score": 9,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvymo3n",
   "message": "I grew up in a town in North Queensland that had pretty consistent giardia warnings to the point where the council had to drive around handing out water. Then moved to Brisbane: yuck. Melbourne water is awesome!!",
   "created_utc": 1691899120,
   "score": 8,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvypr0o",
   "message": "Good water is so delicious to drink. We are lucky here in Melbourne.",
   "created_utc": 1691900890,
   "score": 8,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyo7fc",
   "message": "It’s nice to not have warm tap water to be honest. \n\nBrisbane tap water was normally warmer than Melbourne and it was very unpleasant",
   "created_utc": 1691899991,
   "score": 7,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyonf0",
   "message": "After living in Adelaide, town water anywhere else is just fine. There were times in Adelaide when you'd have a shower and somehow come out smelling like a swamp.",
   "created_utc": 1691900252,
   "score": 7,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyp5d0",
   "message": "But in summer Melbourne water can have a chlorine taint due to increased throughput from the dams with less time for the chlorine to come off. \nPut a bottle in the fridge in advance. \nRestaurants who don’t know this should.",
   "created_utc": 1691900540,
   "score": 12,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvypus3",
   "message": "Yeah I was genuinely surprised how different it was from state to state… I can’t complain about Victorian water in general",
   "created_utc": 1691900953,
   "score": 6,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzj001",
   "message": "Melbourne absolutely has the best council juice in Australia. I'm so used to it now every time I visit family in Perth I'm so repulsed by their metallic swamp water.",
   "created_utc": 1691922668,
   "score": 7,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyl7gj",
   "message": "Having spent the last week in Tasmania, I couldn't agree more.\n\nDevonport is terrible.\n\nHobart is awful and genuinely tastes like it came from a quarry.\n\nLaunceston, actually not that bad.\n\nThey all pale in comparison to Melbourne, though.",
   "created_utc": 1691898305,
   "score": 18,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyou4t",
   "message": "Drink phillip island water, do it. :D",
   "created_utc": 1691900360,
   "score": 6,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyuj4s",
   "message": "Omg I know right! When we moved from Brisbane to Melbourne, we brought our water filter for our kitchen tap, and I've never hooked it up since we got here. Never needed to.\nI have photos of how dirty Brisbane tap water used to get. White sink, yellowish brown water.\nIt was terrible.\n\nActually here we go, I found the photo! Brisbane tap water at its finest! \nhttps://ibb.co/txGrfFY\n\nThe only non-bottled water I've tasted better than Melbourne tap water is the water from the natural spring out near Warburton",
   "created_utc": 1691903888,
   "score": 5,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvywgmy",
   "message": "Closed catchments baby!!!",
   "created_utc": 1691905189,
   "score": 4,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz7sf3",
   "message": "When I moved to Melbourne from the Netherlands, the water had a hint of chlorine flavour in it. I used bottled water for coffee for a while until I got lazy and now I can't even taste the chlorine anymore. My parents were over last year and they said they tasted the chlorine still though.",
   "created_utc": 1691913608,
   "score": 5,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyufwx",
   "message": "Having lived in both Melbourne and Canberra I would say Canberra edges it. Worst I have had is Toowoomba, but has been 5 years or so since I was last there.",
   "created_utc": 1691903829,
   "score": 8,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz0pbu",
   "message": "We are so lucky here.  Makes me wonder why the hell anyone buys bottled water.  Such a scam.",
   "created_utc": 1691908208,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvytrop",
   "message": "This is all very subjective. \n\nConsidering Melbourne has one of the highest salinity levels for tap water I think it's clear why you like what you like.",
   "created_utc": 1691903383,
   "score": 9,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyr5h6",
   "message": "I used to live there, noticed it immediately. Went back for a short trip about 6 weeks ago and fuck me, I forgot just how good it is. Brisbane water tastes like dirt.",
   "created_utc": 1691901735,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvytazp",
   "message": "I moved to London a year ago and the water here is awful. Tastes weird, makes everything harder to clean and fucks up my skin.",
   "created_utc": 1691903081,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyuwlu",
   "message": "Any peeps using tap water in the espresso machines?",
   "created_utc": 1691904134,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyxx5a",
   "message": "I checked into a hotel in Tennant Creek NT and asked if the water is safe to drink.  The receptionist said \"yes it's safe but there is a bit of an after taste and you might get a tummy ache after\".  She didn't quite understand why I said that I'd be drinking bottled water then.",
   "created_utc": 1691906197,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz5z5m",
   "message": "As a Melburnian who now lives in Europe, I think about this daily",
   "created_utc": 1691912179,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz7lco",
   "message": "Sydney and Melbourne are equally good I think",
   "created_utc": 1691913455,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz7puw",
   "message": "Sydney water is renowned for being good! It and Melb water is fine. Wtf is wrong with Syd water?",
   "created_utc": 1691913553,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzbdjk",
   "message": "I always had rain catchment growing up in rural south/east VIC and it is 100x better than Melbourne tap water.",
   "created_utc": 1691916488,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzey58",
   "message": "Such a luxury! Staying in Indonesia for a few months and the thing I might miss most is having safe, drinkable water on tap 24/7. Let alone our tasty Melbourne stuff.",
   "created_utc": 1691919391,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzidfw",
   "message": "Melbourne has the best water for sure! Thought I was the only person who felt like this about tap water in Melbourne",
   "created_utc": 1691922170,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzky0q",
   "message": "I think it's got to do with the culture of Melbourne, like those other cities are just so terrible with their resources management. I mean look at Sydney they got rid of their trams for heavens sake. Petulant little brats think they have it all, they wouldn't know good water if we filled their stupid harbour with it. The best water in the world, the best coffee in the world, the best transport system in the world, the best culture in the world, the best food in the world, the best sporting city in the world, the most liveable city in the world, the smartest people in world, the best universities in the world, Melbourne has it all!!!!!!! We do everything better than anyone else!!! Everything! Water especially!",
   "created_utc": 1691924171,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jw041r4",
   "message": "Glad you enjoy it. We've used a water purifier at home for 10+ years now. When we go out for dinner or something and they bring water all I can smell and taste is the chlorine.\n\nMelbourne water may be better than many places but I'd still recommend getting a purifier if possible. It makes such a difference",
   "created_utc": 1691935018,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvys4hg",
   "message": "Tassie water is the best I've tasted anywhere outside the Scottish highlands. But Melbourne is certainly drinkable. Brisbane, Adelaide, Sydney, and Perth are all variations of disgusting",
   "created_utc": 1691902332,
   "score": 4,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvysfpb",
   "message": "I grew up on rain water. Still the best water you'll ever taste imo. Took me quite a while to get used to the water here in Melbourne. But it's leagues beyond Adelaide that goes without saying.",
   "created_utc": 1691902527,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyugcw",
   "message": "I never appreciated melbourne water properly cause I grew up here and didn't realise how lucky I was. \n\nTook a trip to Horsham and started to ran a bath for my baby and thought someone had knocked over a bottle of bleach or chlorine! Refused to wash him in that water let alone drink it. \n\nNow I appreciate our tap water.",
   "created_utc": 1691903837,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyxhr9",
   "message": "Agree. Recently moved to Brisbane and water in here tastes so bad. 😢",
   "created_utc": 1691905898,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz2w34",
   "message": "I agree with 99.9% for Vic water with the exception of Portland.  Wannon water lost the plot.",
   "created_utc": 1691909827,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz3xd5",
   "message": "My understanding of why Melbourne water is so good is due to the protected catchments. A lot of the dams and weirs have native bushland around it and are fenced off to protect it from illegal dumping/agriculture run off etc. Apparently (and surprisingly) this is quite rare in the world. This mixed with the quality of the rainfall itself, the distance the catchments from the CBD etc makes for some high quality H2O... Or so I understand it.",
   "created_utc": 1691910594,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz523a",
   "message": "I had a friend from Brisbane staying last year and she drank about 5 glasses of water in a row when she first arrived because it tasted so much better.",
   "created_utc": 1691911461,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz7hpv",
   "message": "I personally avoid tap water, but yes Melbourne water is so much better that other water. Perth tap water leaves you calcification in your kettle after 3 used.",
   "created_utc": 1691913374,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz8im4",
   "message": "I'm from the UK and one of the first things I noticed is how there's zero limescale in any kitchen appliance! I've never seen kettles so clean before. When I moved into my first apartment it included a dishwasher. I wanted to check if the salt needed refilling and I couldn't find the salt compartment. Turns out that Melbourne dishwashers don't need salt. Completely blew my mind!",
   "created_utc": 1691914181,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzcmze",
   "message": "Perth tap water never felt hydrating. Just.. Chemically.",
   "created_utc": 1691917503,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzf82f",
   "message": "I remember being on holidays around the world for a bit over 3 years. The joy of drinking water readily available from the tap was just amazing feeling. From then on I've been very concious about water wastage and preservation/recycling water.",
   "created_utc": 1691919619,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzgpu7",
   "message": "Gold Coast/Brisbane water is the pits, tastes and smells like chlorine.",
   "created_utc": 1691920846,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzhpe0",
   "message": "So interesting because I’m from melbourne but when I go up to NSW central coast to family’s house and have their tap water I always think it tastes so much better than Melbourne’s water. Can’t put my finger on what it is but it tastes cleaner and less chemicaly?",
   "created_utc": 1691921638,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzjt0x",
   "message": "Legit can't drink ballarat water anytime I go I buy bottled",
   "created_utc": 1691923304,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzjz7a",
   "message": "Wait until you try Hobart tap water … the gold standard",
   "created_utc": 1691923434,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvznqp2",
   "message": "You missed Babinda, just down the road from Cairns, it used to sing in your mouth.\n\nE, I'm in the UK now, and this post makes me sad.",
   "created_utc": 1691926148,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzowy6",
   "message": "Facts",
   "created_utc": 1691926924,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzp1bt",
   "message": "Only problem is the total dissolved solids are so low, my coffee machine’s water tank often doesn’t register that there’s water in there because the conductivity is so low. \n\nFirst world problems.",
   "created_utc": 1691927003,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzt75b",
   "message": "I live in Cairns. I love the tap water here. Lived in a rural place previously, and our house relied on rainwater. I found the transition from fresh rain water to Cairns tap water really easy. There was little difference. I visited Melbourne recently, and was surprised that such a big city had such nice tap water. I wasn't expecting much from it.\n\nBrisbane tap water: gross aftertaste. Cooked rice with it, and could still taste the water.\n\nTownsville tap water: on par with Brisbane, if not worse.",
   "created_utc": 1691929539,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzyi98",
   "message": "Still getting s filter in Melbourne. Still\nHas fluoride and chlorine.",
   "created_utc": 1691932382,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jw002jb",
   "message": "Sydney for me is the best one and with less taste. Brisbane and Perth are the worst followed by Adelaide and then Melbourne.",
   "created_utc": 1691933158,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jw00di6",
   "message": "Yes. The water here is good straight out of the tap. I don't why people feel the need to waste money on bottled water.",
   "created_utc": 1691933308,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jw23n34",
   "message": "Not only is the tap water good for drinking, but it did wonders for my hair when I was there. I could go DAYS without washing it and it wouldn't look dirty or greasy.",
   "created_utc": 1691963137,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyqgxc",
   "message": "Different parts of Melbourne have different tasting water. It's not as good out west.",
   "created_utc": 1691901324,
   "score": 4,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvywnk0",
   "message": "I had culture shock in when i travelled to the UK from Melbourne. Stayed in Barnett for awhile and literally choked on the water.\n\nI had no clue what what hard water was, and was absolutely shocked to find white powder (limescale) inside my brother's kettle.\n\nTastes and smells like laundry water lol.\n\nHad to ask if it was normal and if it was safe to drink... apparently it is safe.\n\nI guess we are spoilt in Melbourne. Now that i think about it...is limescale a required ingredient for authentic English Tea? Haha.",
   "created_utc": 1691905319,
   "score": 4,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyp2wu",
   "message": "Very few countries that Ive been to have water that taste as good as Melbourne tap",
   "created_utc": 1691900501,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyrhm8",
   "message": "Carins' water leaves Melbourne's for dead.",
   "created_utc": 1691901942,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvysxm5",
   "message": "It’s no Christchurch tap water",
   "created_utc": 1691902842,
   "score": 3,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvywgnf",
   "message": "Yes, Melbourne tap water is among the purest in the world and just won an award for best in Australia",
   "created_utc": 1691905189,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzf8ag",
   "message": "And yet my sister and her partner choose to only drink big jugs of water from wholefoods, they don't even boil our tap water because of the chemicals they put in our water 🥴🥴🥴🥴\n\nSomething to do with conspiracy theories I stopped listening",
   "created_utc": 1691919624,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyuxe1",
   "message": "Grew up in the Netherlands, live in Melbourne. My standards are therefore super high and Melbourne water tastes like swimming pool to me. Some areas are worse than others. Currently living in a suburb with OK tasting water. But the swimming pool smell is still there at times.",
   "created_utc": 1691904148,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyua34",
   "message": "Cairns water comes from Lake Morris, which is above Crystal Cascade. That lake is stunning. Used to have keys to the gate and drive 4wd tours across it. There are wild cattle in the forest there, so it could get contaminated. Sydney is shit water because the runoff goes through cattle country and gets contaminated.",
   "created_utc": 1691903720,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvyx2qb",
   "message": "Compare it to Adelaide water which is technically hard water and to me has the consistency of dishwasher liquid, I also think it effects the quality of coffee, coffee in Melbourne is gorgeous, coffee in Adelaide is disgusting and I say this as a die hard South Aussie who has hate for Victoria in their DNA.",
   "created_utc": 1691905610,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz7qel",
   "message": "Tap water here tastes better than the bottle water you can buy at the shops.",
   "created_utc": 1691913565,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvz8ag5",
   "message": "Melbourne tapwater: the unofficial beverage of champions! Cheers, fellow Hydration Enthusiast! 🚰💦",
   "created_utc": 1691914001,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jvzvvs0",
   "message": "I think it's what you become accustomed to.  I'm a Perthite and Melbourne water tastes strange to me.",
   "created_utc": 1691931034,
   "score": 2,
   "submission_id": "15pnylw"
  },
  {
   "comment_id": "jw0a4gu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pnylw"
  }
 ]
}