{
 "submission_id": "15py5p6",
 "title": "Accessibility CBD cafes/restos",
 "selftext": "Hi everyone. I’m heading back home to Melbourne on my own for the first time since I became disabled and started using a mobility aid (walker type contraption). I am a little nervy as so much of great Melbourne stuff (restaurants, bars) is up and down stairs. Even Degraves St was hard to manage last time I was back, as the cafes are so small. Could anyone give any great tips for places I can go that are delicious but also flat? And are all train stations accessible? Half the trams really aren’t.",
 "created_utc": 1691931198,
 "permalink": "/r/melbourne/comments/15py5p6/accessibility_cbd_cafesrestos/",
 "score": 2,
 "url": "https://www.reddit.com/r/melbourne/comments/15py5p6/accessibility_cbd_cafesrestos/",
 "comments": [
  {
   "comment_id": "jw0bsv5",
   "message": "Unfortunately a lot of Melbourne still needs to catch up on making things accessible (even public transport hasn't met their quota). Expect to take longer detours to go down accessible ramps or find elevators in most places.\nThere are low floor trams on most tram lines but it's often a 10 or 15 minute wait on peak times (I have to catch them daily along Swanston st, and it's not as frequent as most Melbournians think). You'll also need to fight peak hour crowds just to get onto the trams (the amount of times I've asked people to kindly move out of the doorway or accessible area so that I can embark on a low floor tram is also too often).\nFor dining or cafes, I've ended up frequently going to Emporium mall or Melbourne Central in the CBD because at least it's easier to navigate in them and find elevators and accessible amenities. Laneways are a bit too narrow and difficult to get around with mobility aids or wheelchairs.",
   "created_utc": 1691938348,
   "score": 2,
   "submission_id": "15py5p6"
  },
  {
   "comment_id": "jw1w0ar",
   "message": "The laneways generally suck. Too crowded, too narrow, and generally no space to have your mobility aid beside your seat. \n\nI’ve got a couple of go to places - the NGV tea room, and Ca De Vin next to H\u0026amp;M. I can fit in my tank of a power wheelchair, and the staff have always been helpful in moving chairs and making sure I can fit. \n\nI need more places, but get so discouraged trying to find them.\n\nEvens places listed as accessible on google maps aren’t reliable. I call them technically accessible. I can get inside, but it’s so cramped inside I can’t easily move around.",
   "created_utc": 1691960120,
   "score": 1,
   "submission_id": "15py5p6"
  },
  {
   "comment_id": "jw24mdy",
   "message": "Brunetti on Flinders Lane is one of the more accessible cafes in the CBD.",
   "created_utc": 1691963529,
   "score": 1,
   "submission_id": "15py5p6"
  }
 ]
}