{
 "submission_id": "15qe4gv",
 "title": "Why the hell is my hot water bill so high?",
 "selftext": "I was going through my emails this morning and saw I had a hot water invoice sitting unopened.\n\nTo my surprise, the bill (for only 2 months) is over $2,000 AUD!! \n\nThe provider told me it was because it was an \"actual meter read\" instead of an estimate. \n\nStill, $2000 for a 62 day period is crazy.. what do you guys think?\n\n\u0026amp;#x200B;\n\nhttps://preview.redd.it/vogzf121syhb1.png?width=755\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=d911721a25365834238003998f47766b2631d4e4\n\nhttps://preview.redd.it/5zsbt9i1syhb1.png?width=716\u0026amp;format=png\u0026amp;auto=webp\u0026amp;s=8f9f0d9ce06373cc49e27d8239c4fe6fd65f39e1",
 "created_utc": 1691970205,
 "permalink": "/r/melbourne/comments/15qe4gv/why_the_hell_is_my_hot_water_bill_so_high/",
 "score": 5,
 "url": "https://www.reddit.com/r/melbourne/comments/15qe4gv/why_the_hell_is_my_hot_water_bill_so_high/",
 "comments": [
  {
   "comment_id": "jw2ocjs",
   "message": "Your previous read of 23410677 was an estimate.\n\nThis invoice reconciles the account.\n\nI would check the actual meter to ensure that the reader hasn't accidentally inputted incorrect data, a lot of unit blocks have all the meters together next to the gas boiler. You might need a key to access the meter room to do this.\n\nFYI with a power shower which pumps 8 litres per minute your bill is equivalent to 211 hours of constant hot water usage or nearly 9 days.",
   "created_utc": 1691971855,
   "score": 14,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2lsar",
   "message": "It does seem ridiculously high. You don't say anything about how much you use hot water, however? Are you cooking potatoes under a running tap? (Not even kidding, that's happened). \n\nAlso having a \"hot water\" bill seems weird; for most of us it's just water use, gas and electricity that would make the hot water. What kind of place are you living in?",
   "created_utc": 1691970726,
   "score": 18,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2n6iq",
   "message": "Maybe they accidentally charge you for the usage of the whole complex. Did you use 100,000 litres of water last month?",
   "created_utc": 1691971342,
   "score": 8,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2n63e",
   "message": "Keep fighting it, that's just not possible unless there's a leak in your apartment gushing hot water everywhere all the time. I assume you're not bathing in your living room spa?\n\nIf they keep insisting it's a read request another. Use the ombudsman. Use your local Member.\n\nEdit: is that usage for your whole apartment building? There's just no way you've used all that.",
   "created_utc": 1691971337,
   "score": 10,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2onji",
   "message": "100,000L of just hot water over 2 months? Either you have a monster leak (which you would undoubtedly notice) or they stuffed up the read or are charging you for the entire building usage or something. Do you have another actual read bill you can use to compare to the actual reading on the meter?",
   "created_utc": 1691971991,
   "score": 5,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2ltvp",
   "message": "How much was the previous bill?\n\nI know that recently in my building people got \"actual reads\" bills from Origin that turned out to be estimates instead",
   "created_utc": 1691970745,
   "score": 3,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2nkaa",
   "message": "If you are in an apartment complex it might be worthwhile reaching out to building management. Origin are dodgy about these things, they tried ripping everyone in my building  off a couple of months ago by playing around with the estimated and real readings.",
   "created_utc": 1691971512,
   "score": 3,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2p2d3",
   "message": "I take huge offence at using \"Lt\" when there's an existing measurement \"L\". Fuck's sake Origin. \n\nSo that flow rate is 1650L of hot water a day. \n\nThat's about 2 full bath tubs of only hot water every day. Does that seem right? There could be a leak but that's a fair bit. \n\nCan you call Origin? The last bill was estimated, maybe they got something wrong then",
   "created_utc": 1691972173,
   "score": 3,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2n1zz",
   "message": "Lived in an apartment compared with paid hot water from origin at the Highest rates imaginable. Because it was a shared boiler we couldn’t negotiate or change providers and it was really effin expensive. Never using origin again.",
   "created_utc": 1691971286,
   "score": 2,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2md3h",
   "message": "Like someone else said, I've never seen a hot water bill. It's usually gas, electricity or water.\n\nAre you in an apartment or shared building situation? I'd be looking into whether you're paying a portion of someone else's high usage and see if you can get an individual meter, that happened to a friend of mine (but for regular water, not hot water).\n\nOtherwise I'd be checking for a leak or burst pipe. The water usage in my block skyrocketed suddenly and it was because a pipe had burst.",
   "created_utc": 1691970980,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2ndrm",
   "message": "That's enormous man.. my quaterly bill for three people is less than $100. We are frugal with it but not excessively so. Any leaks in your building?",
   "created_utc": 1691971432,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2ovoj",
   "message": "Check your taps aren't leaking. I had a tiny drip but it cost a fortune! Think how many litres of water a drip of water each 3 seconds adds up to over a quarter period.",
   "created_utc": 1691972090,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2owdd",
   "message": "Go back through your old bills to find the last actual read and work out your actual usage",
   "created_utc": 1691972099,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2p2g6",
   "message": "There has been a gap of 100,000l between their last estimate and and the latest actual reading, so you have been underpaying on previous bills or there is a leak. When did you move in and what was their last actual reading? if you haven’t lived there since the previous actual reading you could contest it.",
   "created_utc": 1691972174,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2sgj4",
   "message": "Thanks to the evil greedy Australian fossil fuel cartel, and their political arms the National/Liberal parties facilitated by overseas influencer Rupert",
   "created_utc": 1691973683,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2t1ol",
   "message": "Your previous bill was $122. What are all your others like? Have you had estimates ever since you moved in? Is it a share house where a utility was transferred to your name (allowing for prolonged build up of lower than actual bills?). Either way your. Previously billed amount is quite low; there’d be at least some element of catching up to actual if you have not been billed actual for a while",
   "created_utc": 1691973946,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2ubw3",
   "message": "Also turn all your tap mixers to cold not centered.",
   "created_utc": 1691974517,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2ug3n",
   "message": "It depends on how long you’ve been having estimated reads. Some buildings change locks and things and you can have a year of estimated reads before you get your actual, meaning you’ve been underpaying for years. Call Origin, arrange a payment plan, if you are in any state other than Vic you can also go on their hardship program. If you are in Vic see if you qualify for the utility grant which is $650 you can call DFFH to get it. Origin will also set a payment plan for whatever you can afford.",
   "created_utc": 1691974571,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2vh1j",
   "message": "Check the pressure release gasket…\nI purchased and moved into a house that must have been leaking hot water for years. It was like a tropical  paradise out the back. It quartered my bill after I got it fixed",
   "created_utc": 1691975036,
   "score": 1,
   "submission_id": "15qe4gv"
  },
  {
   "comment_id": "jw2vik5",
   "message": "What is a hot water bill? I only get a water bill + gas bill + electricity bill. I’m going to to Google “hot water bill” 🤨",
   "created_utc": 1691975056,
   "score": 1,
   "submission_id": "15qe4gv"
  }
 ]
}