{
 "submission_id": "15qfbwt",
 "title": "Renters are an increasingly influential voting block",
 "selftext": "",
 "created_utc": 1691973391,
 "permalink": "/r/melbourne/comments/15qfbwt/renters_are_an_increasingly_influential_voting/",
 "score": 1,
 "url": "https://www.abc.net.au/news/2023-08-10/renter-voting-block-labor-greens-national-cabinet/102709286",
 "comments": [
  {
   "comment_id": "jw2uw3u",
   "message": "\u0026gt;\"The Commonwealth does not control rents,\" [Albanese] said.\n\nNo kidding. What the Commonwealth does have is:\n\n1. [substantially greater ability to raise revenue](https://www.aph.gov.au/Parliamentary_Business/Committees/Senate/Former_Committees/reffed/reffed/report/c04), and\n\n2. the capacity to lead national change via mechanisms such as the National Cabinet.\n\nAlbanese has so far wanted to use Commonwealth revenue to fund social housing and Commonwealth leadership capacity to influence planning and zoning reforms. The choice to not use those capacities to also lead rental reform is purely a political one.",
   "created_utc": 1691974772,
   "score": 1,
   "submission_id": "15qfbwt"
  },
  {
   "comment_id": "jw2uf35",
   "message": "How much does boosting ~~supply~~ investment vehicles help renters?^1\n\n\u0026gt;A Redbridge poll of renters in Melbourne suggests half of those surveyed cannot afford properties worth more than $500,000. And 74 per cent cannot afford properties worth more than $650,000.\n\n\u0026gt;[...]\n\n\u0026gt;[MP Max Chandler-Mather] argues most housing developments are already given the green light, but many aren't built because developers don't want to flood the market and erode their profit margins.\n\nI.e. pools of residential mortgage-backed securities:^2\n\n\u0026gt;In 2003, the former PM John Howard said “I don’t get people stopping me in the street and saying, ‘John you’re outrageous, under your government the value of my house has increased’.”\n\n\u0026gt;But here’s an economic reality that no Australian politician wants to admit: for housing to be affordable, house prices need to go down, not up.\n\n\u0026gt;Fast forward to the 2023 budget and a growing number of voters don’t or will never own a home – and for them rising prices and rents are the problem.\n\n\u0026gt;Home ownership rates are falling. Interest repayments are rising. More people are being priced out of even renting. We hear of people living in cars, caravans and tents.\n\n^1 https://www.abc.net.au/news/2023-08-10/renter-voting-block-labor-greens-national-cabinet/102709286\n\n^2 https://www.theguardian.com/commentisfree/2023/may/08/for-housing-to-be-affordable-prices-must-go-down-not-up-heres-how-it-could-happen",
   "created_utc": 1691974558,
   "score": 1,
   "submission_id": "15qfbwt"
  },
  {
   "comment_id": "jw2vb6o",
   "message": "I'm 50 next year and long ago I accepted that I will never be able to afford to be a Home Owner and merely a Home Leaser.\n\nI dread the day when I will not even be able to afford to be a Tent Owner!",
   "created_utc": 1691974962,
   "score": 1,
   "submission_id": "15qfbwt"
  }
 ]
}