{
 "submission_id": "15qggxf",
 "title": "Has anyone changed their mobile phone number to stop getting spammed? Did it work?",
 "selftext": "I'm sick of all the spam. I was on Optus when the hack happened so I'm fairly sure my number got leaked in the hack. However I was getting spam even before that. Just wondering what other peoples' experience is. I don't want to go through the hassle if I end up in the same situation. Also, fuck spammers.",
 "created_utc": 1691976554,
 "permalink": "/r/melbourne/comments/15qggxf/has_anyone_changed_their_mobile_phone_number_to/",
 "score": 51,
 "url": "https://www.reddit.com/r/melbourne/comments/15qggxf/has_anyone_changed_their_mobile_phone_number_to/",
 "comments": [
  {
   "comment_id": "jw3082l",
   "message": "You'll end up in the same situation. The majority of these spam calls are legit just testing random numbers to see if they exist as phone numbers. I reckon changing your phone number would just be a hassle for yourself, even if you get a temporary reprieve it'll be back in a matter of time.",
   "created_utc": 1691977203,
   "score": 114,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw31zsm",
   "message": "Pro tip, don't answer your phone for anyone other than your mum.",
   "created_utc": 1691978014,
   "score": 58,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw36kss",
   "message": "If you dial 04 and then 8 random numbers, you have a 1 in 5 chance of getting a real number. That's nothing for an auto dailer. It's not even worth paying for lists of legit numbers when you can just ring 10 randoms at a time and one of them will be a hit.",
   "created_utc": 1691980137,
   "score": 22,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3a4im",
   "message": "I got a new phone number last year, and it would appear that Telstra just recycled someone else's number and gave it to me.  So since day one I have been getting messages intended for Barry, the previous holder of this number.  Barry if you're out there, tell your friends you got a new number, I'm sick of this.",
   "created_utc": 1691981866,
   "score": 18,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3k2ej",
   "message": "I have a Pixel phone (don't come at me). It screens calls and knows most of the time when it's a scam so they don't ring through. Same with SMS.",
   "created_utc": 1691987154,
   "score": 12,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw34ich",
   "message": "Yeah don’t even bother, I changed my number earlier this year (major pain as well, iPhone having dual sims makes it a bit easier) and within the first week I was already getting spam calls, never even signed up to anything with the new number and only changed from my old number on important stuff. I guess they really do just try random numbers sometimes 🤣",
   "created_utc": 1691979163,
   "score": 8,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3dllf",
   "message": "Also phone numbers are recycled and there’s no longer a 1 year hold period. So you’ll get random spam, and spam from the previous owner. I’ve had my number 5 years and I still get reminders that Gary’s red Mazda is due for a service.",
   "created_utc": 1691983625,
   "score": 8,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3bbn2",
   "message": "pro tip:\n\nGet a current Android phone with Google Assistant and let it deal with it. It tells them you are not available and can take a message for you. When they speak you can see the trasncript live so you can pick up the phone if you want to talk to them.",
   "created_utc": 1691982464,
   "score": 8,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw32f7c",
   "message": "My friend changed recently. He was getting 10 a day. Now he gets 1 a day … so far",
   "created_utc": 1691978210,
   "score": 6,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw33rhg",
   "message": "I changed mobile numbers a year ago and have received pretty much zero spam texts and calls since. Maybe one or two in the last year. Before that I was getting a call nearly every day.\n\nSo I disagree with other posters saying nothing will change, the change was well worth it for me. That might not be the same for everyone.",
   "created_utc": 1691978824,
   "score": 5,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw34rck",
   "message": "Got a good one at 2am this morning saying my Medicare expired and a link to myGov. Feel sorry for those that fall for it",
   "created_utc": 1691979277,
   "score": 3,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw404ge",
   "message": "No - rarely get spam - maybe cos I’m a ferocious blocker. Someone called? Didn’t leave a msg or waited 1 second for voicemail to activate? Blocked. Don’t recognise the number and no text? Blocked. If people have a gig for me or an amazing opportunity they’ll find a way to reach me. But anyone else - sing along: Wham, bam! You’re blocked! You spam!",
   "created_utc": 1691998184,
   "score": 3,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw32s87",
   "message": "Honestly not worth it, you'll just end up in the same place. The Optus leak likely had nothing to do with the spam. That dataset is for bigger identity stealing issues, and by all accounts, only 10k records were leaked, it was a kid in over his head and he bailed when things got too hot, at least that's how it appeared. Your phone number would have been bloody everywhere prior to that. \n\nDoesn't your phone have spam blocking capabilities? My phone just detects spam texts like a spam email and I barely notice them. And phone calls, my phone also tells me if it's potential spam or not. I can also screen the call with Google Assistant or let it go to voicemail.",
   "created_utc": 1691978377,
   "score": 5,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3abp7",
   "message": "I added my number to the Do Not Call register. I was getting 6-8 calls per day between the Victorian energy upgrades and the scam calls. They completely stopped for a few weeks but I’ve started to get 1-2 per day again 😩",
   "created_utc": 1691981964,
   "score": 2,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3b42i",
   "message": "I'm on Android (Pixel, but not sure if this is an exclusive Pixel feature). I get a shit tonne of spam calls and SMS messages that do not get through (spam folder for SMS messages, calls automatically blocked).",
   "created_utc": 1691982358,
   "score": 2,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3l1cl",
   "message": "You shouldn’t be answering any calls from unknown numbers anyway. All phones have the ability to block unknown callers",
   "created_utc": 1691987722,
   "score": 2,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3ory9",
   "message": "I got a spam call 10 minutes after activating my new work number",
   "created_utc": 1691990030,
   "score": 2,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3mmqg",
   "message": "If i'm having a few beers with my mates we have a little competition where we see who can keep the scammers on the line the longest. If it's the DHL scam I can keep them going for 10-15 minutes pretending to look for a tracking number that doesn't exist and they can't say they don't need it because it gives away the scam. The refund scam I can spend 20 mins telling them how shocked and outraged I am that my credit card was charged by mistake. Then when they ask for card details I give them an expired one. When that doesn't work I tell them it must be on my wifes card (not married), then spend 10-15 more mins pretending to look for it.\n\nMy mate has the record.... He had them on the line for 1 hour 15 mins before they figured out we were fucking with them. Love hearing all the different things they want to do to my mom\n\n\u0026amp;#x200B;\n\nFun game when you're drinking",
   "created_utc": 1691988680,
   "score": 3,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3evum",
   "message": "I started doing 2 things - 1. Added it to dnd list. 2. Stopped giving my number at \u0026lt;can I get your number for receipt\u0026gt;. I stopped at Officeworks JB hi-fi Bunnings Lovisa etc etc. Slowing spams are reduced. Now it's literally 1 random spam message a week. It was 20-30 messages and 10+ calls per week.\n\nEveryone I mean everyone sells our data. This is nuts.",
   "created_utc": 1691984297,
   "score": 2,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3km8e",
   "message": "It's kind of weird, before the election Albo promised to stop the spam, it somehow died around the election time, now it's ramped back up. \n\nSick of all the spam too. Surely there's something that can be done? More and more people are losing their savings from spam/fraud.",
   "created_utc": 1691987475,
   "score": 0,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw39axm",
   "message": "It works briefly",
   "created_utc": 1691981460,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw39p48",
   "message": "Someone spoofed my number and over 300 calls later from people returning my call, I swapped my number and have not had a problem since",
   "created_utc": 1691981653,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw39ymj",
   "message": "I used to get around 8 calls per day, I changed my number last year and I’ve had around 3 spam calls in total since.",
   "created_utc": 1691981784,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3ayya",
   "message": "Block. Block heavily. Then for the spam/scam text messages, I send them a gif flipping them off.",
   "created_utc": 1691982287,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3dmwy",
   "message": "My partner just moved recently here from overseas so we got new Optus SIM card. The next day the brand new number that hadn’t been given to anyone was already getting spam/scam calls.",
   "created_utc": 1691983645,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3ds80",
   "message": "Was part of the Optus, AHM/Medibank and Latitude Financial hack (FML), my number was literally off the hook. Just started ignoring it now and declining it. It's reduced to a couple of calls a day. Had the number for 18 years, not keen of changing :(",
   "created_utc": 1691983722,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3exfi",
   "message": "I sent all unknown callers to Google Call Screening service.",
   "created_utc": 1691984320,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3fw7n",
   "message": "I was with Optus. Barely get any now but I do have a long block list.",
   "created_utc": 1691984832,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3g39w",
   "message": "Yes and it didn't work. Got my fist spam in a week and took two weeks to get back to 'normal'.",
   "created_utc": 1691984938,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3gtsk",
   "message": "Doesn't work, just need to ger an app to block all.unknown private calls",
   "created_utc": 1691985334,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3l2tx",
   "message": "I did and yes it worked.  From 20 calls a day to 0.  And it’s been that way for 2+ years.",
   "created_utc": 1691987746,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3lkpx",
   "message": "Ive thought the same thing. Ridiculous amount of calls and txts",
   "created_utc": 1691988042,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3mi0m",
   "message": "Depending on what kind of phone you have there are third party apps that will block suspected spam calls automatically for you so you don't even have to see them. Samsung phones do this with the app Hiya built in but I think you can install it on any android phone. Not sure about iOS though.",
   "created_utc": 1691988600,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3mv5v",
   "message": "No, doesn't work. Tried twice.",
   "created_utc": 1691988821,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3pfjs",
   "message": "My personal phone is Optus and I get spam calls and text daily, even before the data leak. My work phone is vodaphone and I get maybe 1 or 2 a month… I’m really wondering if Optus sell numbers out or if their is an internal spam leader sharing data. Either way it’s a bit suss",
   "created_utc": 1691990460,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3pvom",
   "message": "I just adjusted my phone setting to silence all unknown numbers. I don’t call anyone back unless they leave a (non mandarin) voicemail.\n\nIt’s seemingly worked, as I used to recurve around 2 spam calls a day and about 4 weeks after silencing unknown numbers the calls have now dwindled. I might get 1 a week now",
   "created_utc": 1691990751,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3q5qj",
   "message": "My friend got a new number for different reasons. For YEARS she complained about it. The number was recycled and belonged to someone previously as a business number. Previous owner never updated his details. Bank, insurance, even every time the alarm in his house went off, she got an alert. Drove her nuts. Kind of hilarious but I wouldnt want it to happen to me. Get a pixel if you want better spam protection. Its way better than iPhone. I have both by the way so I am not biased.",
   "created_utc": 1691990937,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3sd96",
   "message": "I was on Telstra prepaid for years and NEVER received a single spam call. About 18 months ago I switched to a plan with the same mobile number....within an hour I was receiving spam calls, maybe 4-6 daily. Telstra/telcos are the problem.",
   "created_utc": 1691992424,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3tprp",
   "message": "I’ve had my phone number since 1998 i get less spam calls now. So no, it has decreased over the years.",
   "created_utc": 1691993372,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3wmd2",
   "message": "i got a call from someone wanting to install a shower head at my PO BOX address. When i asked where they got my number from it mentioned it was from australian data services. Their website seems to be a dodgy one with the domain owner being a porn star?",
   "created_utc": 1691995518,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3xb9y",
   "message": "I never get spam calls, I've had the same number since the 90s. I have no idea if these two things are linked or not but it seems like maybe they are? I also disabled my voicemail years ago, and my phone is always on silent. So even if a scammer did call, it'd just ring and ring and ring and ring and not go to any message service and I wouldn't notice until much later. Try getting rid of voicemail if you don't need it.",
   "created_utc": 1691996037,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw3ytq3",
   "message": "I did. Worked for about 5 months then the calls started again",
   "created_utc": 1691997178,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw42dqr",
   "message": "I changed mine due to the fuckwits at TPG and got a new prepaid number. I probably get more spam now, because I got a new phone, however Block \u0026amp; report as spam is your best friend, as its getting less and less the more I have it.",
   "created_utc": 1691999968,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw42pdv",
   "message": "I got a new number a few years ago and ended up with a recycled number. I started getting more unknown number calls than ever before. Turns out half the calls were legitimate calls for someone at Mainfreight\n\n3 years on and I still answer unknown numbers with 'Mainfreight may I start with your account number and business name\" \n\nThose Microsoft tech support guys don't know what hit em",
   "created_utc": 1692000223,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw43d2s",
   "message": "Does the do not call registry work?",
   "created_utc": 1692000734,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw43yiz",
   "message": "You can use data deletion services (eg. DeleteMe, but there are cheaper ones too) to remove your personal data from the internet. Data brokers scrape your data from various online services and data leaks, consolidate it into a profile, and sell it to the highest bidder.\n\nUsing a service to delete these data profiles will reduce a large portion of spam and phishing attacks, but there will still be the auto-diallers testing random numbers to see if they are active.",
   "created_utc": 1692001204,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw46ese",
   "message": "Am I the only person that doesn’t get spam calls and messages with Telstra?",
   "created_utc": 1692003145,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw46kr7",
   "message": "Am I the only one who enjoys scam callers?",
   "created_utc": 1692003277,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw46tbe",
   "message": "I was on Optus and was getting daily spam calls, I changed to Aldi mobile and kept my number and now get one every few months,… if that.",
   "created_utc": 1692003465,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw479t3",
   "message": "I changed my number. It worked until I had to start searching for a new apartment and used my new number on realestate.com. I still have my old number activated so I changed the number on realestate to my old number again and the scam calls have lessened again. Yay.",
   "created_utc": 1692003821,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw47frj",
   "message": "I have had my number for a decade or two.\nI do not get spam calls.\nI think it comes down to not installing social media other than reddit or other apps like those filter things and games.\n\nFor those on Android that are having problems Google messages filters out spam very well.\n\nAnother feature with Android is Do not disturb.\nBasically you set your phone to only ring for numbers that are in your contacts and all others go to voicemail or whatever you use.\n\nIf you have issues with spam it is pointless changing numbers without changing the way you use your mobile.",
   "created_utc": 1692003949,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw48iol",
   "message": "I find these posts strange as I rarely get spam calls, the only thing I can think of is I’m on the do not call registry, there’s info on how you can extort money from an Australian company online if they do spam call you, takes a few steps but apparently the fine is in the thousands and people have been successful in getting $500+ apparently. So I always get a company name from them but to be honest most times I just hang up once they’ve given the company name and it has nothing to do with me. I’ve also had the same number for over 15 years and was effected by Optus and Medibank hacks. If it was those hacks or number generators I’d be getting weekly spam calls too.",
   "created_utc": 1692004788,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw48xu1",
   "message": "Turn on Do Not Disturb, set it to go straight to voicemail. If it's a real caller, they'll leave one. That's what I did and now I only get once or two every few months.",
   "created_utc": 1692005110,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw4ct8b",
   "message": "The moment you hang up, the robicaller is dialling the next number in the sequence. Say your phone number is 0414345677, the next number it dials is 0414345678. Rinse lather and repeat, doesn’t care if the number is disconnected or whatever, just keep dialling. The only way to avoid them is to not have a phone.",
   "created_utc": 1692007991,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw4gpgu",
   "message": "As someone who is having to go through everything and notify everyone because scammers stole my number and I've had to get a new one....it's not worth the hassle unless it's your number they're spoofing.",
   "created_utc": 1692010630,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw4iiz7",
   "message": "I had a burst of scam calls and texts about 12 hours after telling  the cold calling cunts at Resort Club to take me off the list and go fuck themselves. Now I’m not saying they sold my details to scammers, but I’m pretty sure they sold my details to scammers.",
   "created_utc": 1692011766,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw4iyb2",
   "message": "It's about education knowledge how avoid scammers just keep blocking them , never answer or reply....i use same number since 1990s....Change number give ur family n friends pain arse new number and scam continue.",
   "created_utc": 1692012025,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw4m4z0",
   "message": "I've had the same phone number for well over a decade. I'd be damned if I change it now.",
   "created_utc": 1692013861,
   "score": 1,
   "submission_id": "15qggxf"
  },
  {
   "comment_id": "jw4q7eu",
   "message": "No.\n\nDid it twice.\n\nDoes not matter how quarantined you keep it, I suspect it is Apps on other people’s phones that lift it from contacts.",
   "created_utc": 1692016002,
   "score": 1,
   "submission_id": "15qggxf"
  }
 ]
}