{
 "submission_id": "15qgizx",
 "title": "Our REA said they will overlook their concerns if we give the landlord $100 in cash...",
 "selftext": "We've just vacated our rental and the agent came back with a few concerns to fix, they said the place was dusty, oven was still a bit dirty and we left some picture hooks up. They recommended we get an end of lease clean for these problems which seems a bit ridiculous. \n\nWe also handed the keys in on a Monday when their office was open as our lease ended on a Saturday and they were closed, so they have said we owe them 2 days rent (~$180). I get this is our bad and we probably should've handed the keys back on Friday and hopefully got a refund for the extra day, though I'm doubtful that would've been the case. \n\nThe agent messaged us today saying they'll forget about the concerns and the extra rent if we just give them $100 cash, is this dodgy/legal? We are going to do it as the alternative if they keep complaining about the state of the house is a 2-3 year wait for VCAT to look a the issue.",
 "created_utc": 1691976709,
 "permalink": "/r/melbourne/comments/15qgizx/our_rea_said_they_will_overlook_their_concerns_if/",
 "score": 113,
 "url": "https://www.reddit.com/r/melbourne/comments/15qgizx/our_rea_said_they_will_overlook_their_concerns_if/",
 "comments": [
  {
   "comment_id": "jw30uus",
   "message": "Do not give anything and say you'll go to VCAT. \n\nIf the REA was stupid enough to send you a text trying to extort money out of you I'm sure Tenants Victoria and VCAT would be happy to hear from you.",
   "created_utc": 1691977495,
   "score": 95,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw34zw1",
   "message": "The lease ended on Saturday and the RE wasn’t available until Monday?? \n\nThat’s not your problem the RE should have organised it with you, you don’t owe 2 days rent. \n\nDon’t give them any $ and say you’ll go to VCAT. No more phone calls written emails only.",
   "created_utc": 1691979388,
   "score": 13,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw32kxx",
   "message": "No more phone calls.\n\nClaim your bond immediately in full. Be the first and dont give them anything.\n\nNo one ever has to pay for a cleaner and they are meant to give you a chance to return to fix or clean anything missed",
   "created_utc": 1691978283,
   "score": 29,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw30ef5",
   "message": "Name of agent please. Extortion is illegal. Time to name and shame.",
   "created_utc": 1691977285,
   "score": 122,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw38mdx",
   "message": "When we left our old place the REA tried to pull the same 'you'll be liable for rent if you return the keys on Monday' stunt. This was in circumstances where we'd given more than the prescribed notice period with the tenancy due to end on a Saturday. They first asked us to hand the keys back Friday because their office was closed on the weekends, but, on principle and no small degree of pettiness, we said the lease was ending Saturday, rent had been paid until and including Saturday, and so we'd only hand the keys back early if they refunded Saturday's rent.\n\nThe REA exploded at me on the phone when I said this. He insisted tenancies couldn't end on weekends (not true) and told us repeatedly we'd be liable for rent through Monday if the keys weren't handed over Friday. In writing I told him any assertion we'd have to pay rent for the period after the lease ended, where notice was validly given and no issues were raised about the lease ending on Saturday, was palpably laughable and VCAT would surely view it the same. So he backflipped and, surprisingly, their office was open with a full retinue of staff on the very Saturday he claimed it was closed.\n\nA part of me's wondering if we're dealing with the same REA. If so, I'm kicking myself a bit that I didn't make more of a stink, e.g., by making a complaint to consumer affairs Vic and whichever body regulates those fox-pig crossbreads in their tight-fitting suits.",
   "created_utc": 1691981127,
   "score": 39,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw31w5d",
   "message": "Ring \"Consumer Affairs Victoria\", they'll give you the best advice.",
   "created_utc": 1691977967,
   "score": 44,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw338gt",
   "message": "Claim your bond yourself right now. Doing this sets a 14 day timer for them to instigate a claim with VCAT (which they have to pay for)\n\nI don't know who is telling you VCAT 2-3 year wait. It's back down to about 6-8 months. \n\nIf you decide to just pay the $100 I would be getting it in writing they will release your bond in full and a receipt. Personally I wouldn't be doing it, if they felt they had a genuine claim at VCAT they wouldn't be offering to begin with.",
   "created_utc": 1691978582,
   "score": 40,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3fc99",
   "message": "We decided to use the real estate agents end of lease cleaning service, then they complained to us about it not being clean. I told them to fuck off and tell their own people to be better then. I have a very strong distain for real estate agents in general.",
   "created_utc": 1691984539,
   "score": 17,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw351hg",
   "message": "Keep the text message and then happily go off to VCAT. They will fold like a house of cards in the wind",
   "created_utc": 1691979409,
   "score": 28,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3dt49",
   "message": "$100 is such a pissant amount of money for the REA to collect that it’s not worth it (they clip the ticket for about 7% of the rent). The agent is going to pocket the hundy and the landlord will never know. Don’t pay it.",
   "created_utc": 1691983734,
   "score": 10,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw380m2",
   "message": "No way. This is dodgy as hell. Don't pay a cent out of pocket, and don't agree to any of the things they said about condition.\n\nAnd do not pay the extra rent either. If they were closed Saturday, one of their agents should have informed you of that and either allowed you to drop them off on the Monday at no charge. If they had offered the Monday key return date in advance and you agreed to pay the extra rent, different story.\n\nBut this stinks to high heaven of bad behaviour. Don't let it slide, or they will think they can get away with it and do it to others who might be more vulnerable/gullible.",
   "created_utc": 1691980831,
   "score": 17,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3bh4b",
   "message": "This is really nit picking. \n\nTell them you’ve left the picture hooks as added value and we will call it even. \n\nDid someone move in on Monday? Were they waiting to move in on Saturday? If not they’ve lost absolutely nothing.",
   "created_utc": 1691982540,
   "score": 7,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw35owv",
   "message": "100 percent not legal",
   "created_utc": 1691979714,
   "score": 10,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3ae1g",
   "message": "This looks like an awesome opportunity for entrapment via a surreptitious video recording. Definitely worth $100 to distribute far and wide over the Internet.  \n\n\nNot that I would be recommending such a thing.",
   "created_utc": 1691981995,
   "score": 5,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3fy4p",
   "message": "When my REA didn't have anyone available on a Sunday when my lease was up they also told me Friday was when I needed to hand them in, so I left the keys on the kitchen table, took a photo and sent it to them and pulled the door shut on my way out (I was able to lock the door before closing luckily). \n\nClaim your bond. Don't pay $100. Don't pay $180. Tell them you handed the keys back at the first opportunity that you could as REA was closed. They should have had a drop box or something for weekends. \n\nAsk for the keys back to clean the property as requested, you don't need a professional clean by any means.",
   "created_utc": 1691984860,
   "score": 5,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3fy78",
   "message": "You can't drop the keys off on Friday as you have access until Saturday.\n\nThey didn't have anyone available, and even if they had a drop box they wouldn't see the keys until Monday anyway.\n\n\u0026amp;#x200B;\n\nWhat they are doing is called blackmail, feel free to ignore it or escalate it.",
   "created_utc": 1691984861,
   "score": 4,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw30f4y",
   "message": "When was the last day of your lease? If it’s Saturday and your returned the key on Saturday, then you don’t owe then shit.\n\nClaim your bond now. You can do it yourself",
   "created_utc": 1691977295,
   "score": 8,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3ctck",
   "message": "Offer them $100 worth of Kiss My Arse.",
   "created_utc": 1691983224,
   "score": 4,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3glqg",
   "message": "Name and shame.",
   "created_utc": 1691985213,
   "score": 4,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3o08u",
   "message": "\u0026gt;We also handed the keys in on a Monday when their office was open as our lease ended on a Saturday and they were closed, so they have said we owe them 2 days rent (\\~$180).\n\nThis is 100% their problem. Most competent REA's will have a secure dropbox at their office where you can leave your keys when your lease ends, so you can even do it after hours. Don't give them any money, politely ask them to EADC.",
   "created_utc": 1691989537,
   "score": 3,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3tate",
   "message": "Sounds like the property manager was planning on pocketing your cash. This sounds a bit like hush money or something??",
   "created_utc": 1691993082,
   "score": 3,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw42nc2",
   "message": "Please don't pay and go to the Tribunal with this.\n\nThis is unbelievably dodgy. They must really be convinced they have no case against you to try this on.\n\nAlso, how do you know this \"cash for silence\" extortion isn't just the REA in the take?\n\nIf it's cash, how do you know it is destined for the landlord and not the REA's crooked pockets?\n\nThis is potentially a criminal act on the part of this REA.",
   "created_utc": 1692000178,
   "score": 3,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw30uag",
   "message": "Probably not worth the hassle for 100, when they say cash do they mean hand over physical cash? This is dodgy as hell but if your happy to contribute to the rea Christmas party agree and pay in 10c coins",
   "created_utc": 1691977488,
   "score": 7,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3gknw",
   "message": "I’m not a lawyer and think other comments she’d better light on the situation than I can, but I do think you should consider what your time is worth - as well as what the REA and Landlord’s time is worth - in choosing how to proceed.",
   "created_utc": 1691985196,
   "score": 2,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3zxe2",
   "message": "Why should you hand the keys back on the Friday when the lease doesn't end until Saturday?\n\nI would argue till I'm blue in the face over this point. It's not your problem or fault they weren't available until Monday. If they don't want that to happen again, they should ensure leases never end on a weekend.",
   "created_utc": 1691998027,
   "score": 2,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw404dv",
   "message": "Experienced demon Property Manager here (I left property management in April due to shit legislative laws in VIC for tenants and landlords). Everyone will blast me here.\n\nYou handed your keys in on Monday, so legally you owe rent - sometimes we had tenants slide them under the door and document it (until our office finally fucking got an outdoor key box which was amazing and tenants can slip a quick video on the Sunday or public holiday that they’ve popped the keys back when due) so to charge you rent is not ideal but reasonable.\n\nNo need for the compensation if you don’t feel it’s appropriate - get pictures, ask for the keys for the day and tidy it yourself seems minor. I used to take wipes to every final inspection I did, when landlords were picking out little stupid shit “no worries mate, I’ve got some wipes with me” saved me hassling the tenant and could finalise the tenancy and bond refund and everyone could move on :)\n\nI know you have initiated your bond claim, but all it will take from the landlord, is to apply to VCAT for these issues; the bond will stay lodged at the RTBA and the matter will not be heard for most likely over a year or two (when I left being a PM on April this year there was over 10,000 back logged bond cases exceeding 18 months).\n\nIf you don’t need the money and don’t want to do it yourself, stick it to the landlord at VCAT and you’ll probably get off. If you want to close the chapter and move on from what I would call a “particular landlord” might be worth paying the $100 (the rent is a definite regardless).\n\nI’ve given advice like this before and I get hammered every time but it’s just my experience and another perspective. Hope everything turns out all good!\n\nEDIT: also so many of the people commenting here claiming no, go to VCAT, get your bond, f*ck the landlord etc but none of them have actually seen the state of the property or understand in two years time when you’ve probably forgotten about this legal case it’s going to pop up and then you’re reliving it all again. Not all landlords are bad guys, I had so many amazing landlords who loved their tenants.",
   "created_utc": 1691998182,
   "score": 2,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw40d5l",
   "message": "They just make it up. Probably need to cover the fact they’ve done nothing while you were there and need to make good with owners so they can keep the property on their books.",
   "created_utc": 1691998375,
   "score": 2,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw34cf5",
   "message": "Can we rename this sub ‘Real estate renting advice’?",
   "created_utc": 1691979087,
   "score": 4,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3dkfj",
   "message": "Nope. It only has to be reasonably clean. You can remove the picture hooks and putty them in. Then they’ll have no complaint because you can hang pictures up now. \n\nDust is fine - feather duster and broom even with no electricity. Take it as a lesson learnt that even window sills need to be done.  That’s fair IMHO and has been standard for ages.\n\nBUT. Since they want cash means they’re under pressure to fill it in. Also the landlord may not even care. I would offer in good faith to go back once as you’re legally allowed the opportunity. If they have a problem with this then so be it.  Get it in writing your request to fix the issues. If they don’t get back to you- repeat email. Keep an eye out. If there’s a new tenant then they have to have released your bond IIRC. So that’s an instant win for you because they’ve waived your right to repair the issues, and they’re saying they’re not a concern. \n\nReal estate agents love to give feedback in your time and get dodgy when it’s their time. Stick by the law. Time is money. You’ve got them over a barrel and the cash is not only voiding your rights but accepting their claims. They may come back and ask for more. So hard no.",
   "created_utc": 1691983608,
   "score": 4,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw39300",
   "message": "We took their offer (I know I hate myself for it). We just didn't want our bond held up for that long. Though in addition we've contacted consumer affairs with all the information. We get our bond back on Monday as I have already claimed it the day we handed our keys in. It is the unfortunate reality of a lot of renters being pressed for money, real estate agents knowing this and then using long VCAT wait times as a way to strong arm tenants into relinquishing small parts of their bond. If they just take as little as $100 out of every bond then I'm sure they're making bank.",
   "created_utc": 1691981354,
   "score": 3,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3gfyt",
   "message": "Accept the $100 offer as long as it is accompanied by a final settlement receipt for the tenancy agreement in hard copy or official email letterhead.\n\nA typical agent will cause ongoing grief over this, and they may vexatiously put it into your rental history.\n\nVCAT will tell you to go and bother someone else over a \u0026lt;$200 dispute.",
   "created_utc": 1691985125,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw39fzb",
   "message": "I thought end of lease clean was compulsory",
   "created_utc": 1691981527,
   "score": 255,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3d0k5",
   "message": "Once a lease has ended they cannot make you pay anything",
   "created_utc": 1691983325,
   "score": 0,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw328lj",
   "message": "You don't really need to do that now if you don't want, since you can claim your own bond now in Vic\n\nBut it's not a foreign concept, it's been done a lot. They say the cost to fix the paint is $100, that burn mark on the carpet $20. You pay, they don't claim on your bond. Whether they fix said thing after you've gone is up to you\n\nBut like I say you can go ahead and claim your own bond now anyway - do as you feel on this",
   "created_utc": 1691978126,
   "score": 254,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3ielo",
   "message": "Legal, idk. \n\nI'd give up the $100 cash, wipe my hands on my jeans and never look back. fighting over leases is so stressful and my big learning of my lifetime is valuing stresslessness.",
   "created_utc": 1691986205,
   "score": 254,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw34tbt",
   "message": "Claim your bond back directly through RTBA.",
   "created_utc": 1691979303,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3cnjv",
   "message": "Have you started the bond claim process? Do it the instant you hand the keys back, ie you drop the keys on their counter, step outside, and begin the process. They have 14 days to dispute the claim and the clock starts ticking the moment you press “submit”.\n\nDon’t give them anything. Screenshot everything, document all communication and threaten to go to VCAT if you get so much as a vague feeling they might be about to pull some dodgy bullshit.\n\nhttps://rentalbonds.vic.gov.au/Bond/Search/Search",
   "created_utc": 1691983141,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3hakn",
   "message": "Absolutely dodgy and absolutely they will be doing this to all tenants. $100 isn’t a lot of money for a landlord, so they’re doing this for multiple tenants for multiple properties \n\nThreaten vcat and I suspect they will drop all demands (after maybe first discouraging you from going that route) merely because they don’t want how much they have done this to be revealed",
   "created_utc": 1691985587,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3j1yb",
   "message": "Do not even  respond! The audacity of agents lately is insane! You are not required to have it professionally cleaned especially if it wasn't when you moved in! If they want your bond they have to apply to vcat for it. Let them, if its really that petty they won't bother. Call their bluff you have nothing to lose. Been there! Don't pay don't even communicate! Bet they didn't say it in an email! Leave it. They can take it to vcat! It doesn't take 2 to 3 years either i had mine within a month",
   "created_utc": 1691986576,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3ka24",
   "message": "If you started the rental period and the place had been professionally cleaned and the lease agreement you both signed said you will return the property professionally cleaned, then that is what you agreed to.\n\nGetting the lease agreement upheld is another matter.\n\nI had a tenant move into a new property (first ever residents) who destroyed the walls and carpets with the help of their dog, defaulted on their rent and obviously didn't pay towards the repairs. My rent insurance covered only half the losses.\n\nIn short - you have been a good tenant - just say goodbye to them and move on there's nothing they can do (with VCAT waiting times being so long).",
   "created_utc": 1691987276,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3kbiy",
   "message": "god they are the worst, two bit low as a snakes belly dirty rotten corrupt penny rip off dumb suit wearing snake oil selling er professionals",
   "created_utc": 1691987300,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3l8uj",
   "message": "It's great that you have this in writing when you take report them for bribery and being dodgy.",
   "created_utc": 1691987844,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3lbfn",
   "message": "I love when people incriminate themselves in messages, so much! Cold hard proof. Thanks buddy! Definitely report them. REAs are running wild these days.",
   "created_utc": 1691987887,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3lzbl",
   "message": "Our old REA demanded we send them $100 because they \"had to clean up our stuff after council pickup\" but didn't provide photos or anything of what was left over. They said if we didn't they'd claim our bond and take us to VCAT. \n\nI know in theory we should have fought it and not paid but tbh I just wanted them off our back so I paid it. It was blackmail 100%.",
   "created_utc": 1691988285,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3mnby",
   "message": "$100 for the REA not telling the landlord about the few things. \n\nAt the state of the rental market, people are moving in without an end of lease clean. the REA is trying to take you for a ride.",
   "created_utc": 1691988690,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3p4gl",
   "message": "claim your bond.\n\nkeep this $100 bribe attempt (or whatever it is) as evidence.\n\ncall tenants victoria.\n\ntell them that they can go thru VCAT.",
   "created_utc": 1691990259,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3qizv",
   "message": "Tell the REA to have the landlord come and collect it directly from you.\n\nMy bet is the landlord has already signed off on everything, and the REA is just trying to pocket some extra money.",
   "created_utc": 1691991180,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3qjrp",
   "message": "Email them back, always get this shit in writing and if it was a phone call you write something like \"as per our conversation on the phone, I'm not sure if a cash payout is legal so I'll be checking with VCAT to be sure this is the right thing to do\"\n\nI'm sure they'll shit some serious bricks. \n\nEdit: just checked the post, it was a message?  \n\nOoft for them.",
   "created_utc": 1691991194,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw3sxun",
   "message": "Report them",
   "created_utc": 1691992828,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw47swu",
   "message": "Tell them you would like that offer in writing to forward to the ATO. \n\nCall Fair Trading. You shouldn't have to pay rent for those extra days. Report the REA. \n\nNow email the ATO about your owner, then take them to VCAT for your bond.",
   "created_utc": 1692004235,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw4ef0v",
   "message": "They _always_ do this.  I swear there must be some guide on some online forum where landlords congregate and share tips with each other of how to rip people off.  My last one tried extort $100 from me because the plants in the garden had grown.",
   "created_utc": 1692009107,
   "score": 1,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw4fo7c",
   "message": "Email them and quote the $100 cash offer and ask if this is genuine. Then once you have it in writing repot them",
   "created_utc": 1692009964,
   "score": 2,
   "submission_id": "15qgizx"
  },
  {
   "comment_id": "jw4pe5d",
   "message": "Just from reading these comments it's clear that there should be a law that barrs people from being landlords for life if they engage in behaviour like withholding full bonds for years with no basis, just because they can, and because itll take years for VCAT to tell them to return it. It's outright theft.",
   "created_utc": 1692015592,
   "score": 1,
   "submission_id": "15qgizx"
  }
 ]
}