{
 "submission_id": "15qjuqe",
 "title": "Woman at centre of suspected mushroom poisoning gives her account of fatal meal",
 "selftext": "",
 "created_utc": 1691986179,
 "permalink": "/r/melbourne/comments/15qjuqe/woman_at_centre_of_suspected_mushroom_poisoning/",
 "score": 90,
 "url": "https://www.abc.net.au/news/2023-08-14/mushroom-poisoning-leongatha-erin-patterson-police-statement/102725876",
 "comments": [
  {
   "comment_id": "jw3n1yv",
   "message": "There are gonna be so many podcasts about this.",
   "created_utc": 1691988939,
   "score": 56,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3s93k",
   "message": "\u0026gt;although was unable to identify the specific shop in Melbourne where she bought the dried fungi.\n\nWhat a load of shit.",
   "created_utc": 1691992343,
   "score": 13,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3rldl",
   "message": "If she is to be believed, then I’m assuming there are dozens of unreported deaths from a  unidentified rogue Asian grocer selling dried death cap mushrooms then?",
   "created_utc": 1691991896,
   "score": 242,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3kyd2",
   "message": "I don't know... I still find her claims about using random dried mushrooms from an Asian grocer, while also throwing out her own dehydrator, pretty sus. \n\n\nAnd no recalls or alerts telling the public to not buy dried mushrooms because they might actually be death caps?",
   "created_utc": 1691987675,
   "score": 88,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3tv0t",
   "message": "Yes, I always panic and throw out my dehydrator every time a friend of mine, I cooked for, dies of poisoning- PLEASE",
   "created_utc": 1691993474,
   "score": 156,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3kvti",
   "message": "Still don't get why she threw away the food dehydrator?",
   "created_utc": 1691987634,
   "score": 163,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3ui0y",
   "message": "Confuscious says “the more you spin a complex story the more your lies will entrap you”.",
   "created_utc": 1691993935,
   "score": 69,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3rfvz",
   "message": "I’ll reserve judgment for when the mini series comes out",
   "created_utc": 1691991790,
   "score": 136,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3rptx",
   "message": "Why would you be at the hospital talking about the food dehydrator? Every detail about this case makes it more confusing.",
   "created_utc": 1691991980,
   "score": 67,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3so61",
   "message": "\u0026gt; The Patterson children ate the leftovers from the lunch the following night.\nHowever, Ms Patterson said the children do not like mushrooms, so she scraped them off the meal.\n\nThis is the most implausible part for me. \n\nAre you telling me that two children ate the meal, picked out the mushrooms and had ZERO health effects? Picking out the mushrooms, sure, of course that’s plausible. But if half a mushroom can *kill* a person, I would think that a ~~stew~~ meal (not a stew, I stand corrected) that’s been cooked with the mushrooms in it, sat for over 24 hours with the mushrooms still in it, probably heated with the mushrooms in it, then picked out… you’re telling me that the rest of the meal contained no traces of the *super highly poisonous* mushrooms? I’m no food poisoning/mushroom expert but I would think the toxins would have leeched out into the rest of the stew, enough to make the kids a bit sick? \n\n\nAlso, timeline:\n\n- July 29 lunch with mushrooms \n- July 30 “The Gippsland Southern Health Service confirmed a fifth person who presented at Leongatha Hospital on July 30 with suspected food poisoning later returned and was sent to Monash.” (As stated in article above. )\n- “The Patterson children ate the leftovers from the lunch the following night.”, being July 30 (as stated in article above)\n\nSo on the same day, July 30, the kids ate leftovers for dinner, *and* the mum went to hospital with food poisoning? I *suppose* it’s plausible that they ate at 6pm, then mum felt sick and went to the hospital at 9pm. \n\n[This article states](https://www.abc.net.au/news/2023-08-09/poisonous-mushroom-deaths-victoria-leongatha-explainer/102703430) of the older folks at the lunch “After leaving the lunch, the Wilkinsons and Pattersons began developing what felt like food poisoning over the course of that night and the next morning.\n\nThey went to local hospitals in Leongatha and Korumburra, before being taken to the Austin Hospital in Melbourne's north-east.”\n\n[This article](https://www.abc.net.au/news/2023-08-07/victoria-mushroom-deaths-gippsland-korumburra-leongatha/102696100) says: “Five people were taken to hospital on July 30 after eating a meal suspected to have contained poisonous mushrooms at a Leongatha home, in Victoria's east.”\n\nSurely someone let Erin know they were all going to hospital with food poisoning? And she still fed it to her kids? \n\nIt’s somewhat less plausible that:\n\n- a) no one else alerted Erin to the fact they had food poisoning symptoms and were going to hospital, or\n- b) no one alerted Erin until *after* the kids ate dinner on 30th\n- c) all 5 adults had no symptoms until after the kids ate dinner on 30th (this seems impossible as the article above reports they had symptoms on evening 29th and morning 30th)\n\nIf the kids never ate it, and she’s lying about that, why?\n\n\nEdited to add- [This video](https://www.abc.net.au/news/2023-08-08/victoria-mushroom-poison-meal-deaths-korumburra-leongatha/102699622?utm_source=abc_news_web\u0026amp;utm_medium=content_shared\u0026amp;utm_campaign=abc_news_web\u0026amp;utm_content=link)(scroll down) shows an interview with Det. Insp. Dean Thomas. He states “she is a suspect because she cooked the meal… *she hasn’t presented with any symptoms*”. Granted it’s an older interview, but how could police make that statement if Erin had indeed showed symptoms, gone to hospital and been able to prove she’d been in hospital with food poisoning symptoms.\n\nEdited to add - [The Age reports that Erin fell ill on July 31](https://www.theage.com.au/national/victoria/what-the-chef-from-the-fatal-poisonous-mushroom-lunch-says-about-the-case-20230814-p5dwdg.html), not July 30 as reported in the ABC article:\n“But Patterson says she did fall ill with intestinal problems on July 31 – two days after eating the lunch herself – and was admitted to the hospital in Leongatha before an ambulance transferred her to a hospital in Melbourne.”\n\nEdited to add - I’ve learned it’s not a stew, my bad",
   "created_utc": 1691992640,
   "score": 103,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3td2w",
   "message": "If you did go mushrooming back in may, dried them, stored them and now suddenly find out you must have fucked up and picked poison by accident, how much trouble would you be in? Not murder but some kind of negligence manslaughter?  If it was a tragic accident. What's the risk of just being truthful. It happens every few years. In box hill about 10 years ago a women died after a family picked mushrooms and cooked with them. If anyone was charged, the papers didn't report it.",
   "created_utc": 1691993126,
   "score": 37,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3vv47",
   "message": "\"Hey kids, wanna have a deadly lunch with your grandparents or go to the movies?\"",
   "created_utc": 1691994944,
   "score": 40,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3oqrx",
   "message": "I find the unspecified Asian grocery bit very suspicious. I grew up in Mt Waverley and am familiar with all the East Asian grocery stores in the Mt Waverley shopping village/Hamilton Square area. There's maybe 4 total if you include the 2 Korean ones as well as the Chinese ones. I can't fathom how she wouldn't remember which one she bought the mushrooms from, especially since she owns property in Mt Waverley and presumably knows the area.",
   "created_utc": 1691990009,
   "score": 123,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3mnpn",
   "message": "She said she preserved what was left of the lunch and gave it to hospital toxicologists for examination. She said she told investigators from the department where she had bought the mushrooms – although was unable to identify the specific shop in Melbourne where she bought the dried fungi.",
   "created_utc": 1691988696,
   "score": 66,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3onf0",
   "message": "\\- Right, so someone from the country is buying random mushrooms in a hand-labelled container from a random shop in Mt Waverley.\n\n\\- 'Scraping' the mushroom layer off the dish sounds way too coincidental.\n\n\\- The dehydrator at the tip doesn't add up.",
   "created_utc": 1691989947,
   "score": 78,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3wa9d",
   "message": "She is lying her arse off.",
   "created_utc": 1691995262,
   "score": 25,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3o5j3",
   "message": "I really hope this doesn’t have a negative effect on Asian grocers. They had a hard enough time at the start of covid.",
   "created_utc": 1691989629,
   "score": 134,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3wgd9",
   "message": "Cops are quiet for a reason.",
   "created_utc": 1691995392,
   "score": 41,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3xhez",
   "message": "This woman is either the dumbest cook in the world, or the dumbest criminal. Her and her kids eat a separate meal, her ex husband spends days in a coma years ago due to a mystery food poisoning. If i smells like horses, sounds like horses and looks like horses, its not a zebra. This woman is guilty as sin and clearly mentally unhinged",
   "created_utc": 1691996165,
   "score": 41,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3z1sk",
   "message": "this is one of the most bizarre things of my life time.",
   "created_utc": 1691997351,
   "score": 15,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3zha4",
   "message": "The fact that the first thing she did was throw out her food dehydrator is evidence she's guilty. How did she correlate her food dehydrator to poisonous mushrooms if she was innocent in the first place. She killed them intentionally.\n\nSurprised she hasn't been locked up yet tbh, detectives should easily be able to tell if she's lying or not, as she doesn't seem to be particularly good at it",
   "created_utc": 1691997677,
   "score": 16,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw409gr",
   "message": "Does anyone else feel two conflicting urges, one to eat some tasty mushrooms, and the other to never eat a mushroom again? Stupid delicious poison fruit",
   "created_utc": 1691998295,
   "score": 16,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw45mcj",
   "message": "It’s just…why wouldn’t you say “I made a meal with mushrooms I’d foraged, I can’t believe this happened” and be done with it? Why dig yourself into such an implausible hole?",
   "created_utc": 1692002518,
   "score": 15,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3uac1",
   "message": "So given comments here (mine included...might delete)...how hard is it going to be for a fair jury if this goes to trial?",
   "created_utc": 1691993780,
   "score": 16,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw49012",
   "message": "This statement is written by someone who is shitting bricks. The way it has been reported suggests this is a police statement, but it’s actually something she’s sent to police and apparently ABC news. I would be absolutely amazed if a lawyer advised her to say the things she’s said in this statement. It is extraordinarily defensive and adds information that incriminates her further. Such as her children eating leftovers (the mushrooms “scraped off” - as if you’d feed your kids food if others who ate it were fighting for their life) and her husband accusing her of poisoning his parents when she discussed the food hydrator at the hospital - an oddly specific thing to discuss when people are dying. \n\nAlso the fake crying - sobbing of the kind she is trying to imitate comes with a lot of tears and snot. She’s not good at this. The wiping of her eyes and looking at her hands is to give the appearance of tears where there is none. She’s using eye wiping to cover her eyes. At one point she’s staring at the sky, I think this is an attempt to get her eyes to water. It’s worth watching closely to see what she’s trying to do here.",
   "created_utc": 1692005158,
   "score": 16,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3uf1y",
   "message": "She probably tried to kill them herself to claim an inheritance because they are the only ones that have died from these mushrooms. She says she purchased them ages ago and if that was the case there would be others dying from them that we would have heard about but I don't recall any other deaths",
   "created_utc": 1691993875,
   "score": 14,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw4363a",
   "message": "Everytime she talks she talks about herself and how stressed she is.\n\nIf people you loved had died and others were ill you wouldn't be 'stressed'.",
   "created_utc": 1692000579,
   "score": 13,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw49uqq",
   "message": "If death cap mushrooms were being sold anywhere, all mushrooms would be recalled for public safety. She is so dumb to even suggest that she bought them. She should have just said she foraged for them and it was all an accident. I hate that she is blaming this on Asian grocery stores. It's not enough she killed people, but she's trying to hurt some random grocery store owners by blaming them for selling poison mushies",
   "created_utc": 1692005810,
   "score": 11,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3mk7i",
   "message": "Anytime I’ve ever cooked something for someone else I make sure to try it first.",
   "created_utc": 1691988637,
   "score": 34,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3owvc",
   "message": "She should stop talking and get a lawyer.",
   "created_utc": 1691990119,
   "score": 31,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw41f2d",
   "message": "I could understand her using exotic mushrooms in cooking, but Beef Wellington? A rather bland English dish? Even if she was a foodie and experimenting with different flavours, I would imagine she should have tried them first to make sure they would work with the dish. Especially if they're from an Asian grocer as they may be strong flavoured for soups.\n\nOn the other hand, my MIL will often buy food that she has no immediate plans to cook with. Her pantry and freezer are chockas with random stuff. We used to clear it out instead of going to the grocery store.\n\nBut shouldn't she still have the mushroom packet???",
   "created_utc": 1691999206,
   "score": 10,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw43nko",
   "message": "Next thing it will be an asian pop-up store",
   "created_utc": 1692000964,
   "score": 10,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw443jy",
   "message": "CHAPTER 1\n\n\\*cue rainy city noir jazz mix\\* \n\nA hundred lies, see, can dance around the truth like shadows in a dark alley. But it only takes one cold, hard fact to bring the whole charade to its knees, like a bullet to a cheap lock. Right now, the case was gnawing at me, taunting me with its complexities and secrets. We were only hearing from one witness, the accused, her words dripping with desperation and deceit, like rain on the grimy windows of my office.\r  \n\r  \nBut there were other voices out there, hidden, just beyond my grasp. Voices that could hold the keys to this twisted puzzle. The laughter of children, once pure, now tainted with confusion and fear. A man, beaten and broken, lying in a hospital bed, his pain singing a melody of truth. They were the missing pieces, the silent notes in a cacophony of lies.\r  \n\r  \nI knew that somewhere in those shadows, the answer was waiting, lurking. And I'd find it, even if it meant tearing down the lies brick by brick, exposing the ugly truth. Because that's what I do. That's who I am. A seeker of truth in a world drowned in lies...",
   "created_utc": 1692001312,
   "score": 18,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3sun9",
   "message": "She picked mushrooms and dried them asian grocers dint sell poisons mushrooms",
   "created_utc": 1691992766,
   "score": 9,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3wl2p",
   "message": "Bruh dried asian mushroom... so she used shitake?",
   "created_utc": 1691995491,
   "score": 9,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw4057r",
   "message": "She probably just shelved a little bit so she wouldn’t get that sick.",
   "created_utc": 1691998201,
   "score": 9,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3soza",
   "message": "And she scraped the mushroom part from the beef before giving it to her kids to eat...",
   "created_utc": 1691992655,
   "score": 9,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw478we",
   "message": "- Most asian store mushrooms are imported... it's unlikely that poison mushrooms are getting through border control. They're already anal about testing for shrooms as it is.\n- There would have been more deaths if this were true... these are popular ingredients in dishes like ramen broth.\n\nThis muppet is digging her own legal grave with every statement till she proves herself guilty. Hopefully the police let her keep blabbing till they have enough conflicting statements.",
   "created_utc": 1692003801,
   "score": 8,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw47twq",
   "message": "A succulent mushroom meal?",
   "created_utc": 1692004257,
   "score": 6,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw4gbn2",
   "message": "She looks like she's never stepped inside an Asian grocer. Foodworks and IGA only.",
   "created_utc": 1692010384,
   "score": 6,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3rvvl",
   "message": "Yeah, so she's definitely a murderer. 💯%",
   "created_utc": 1691992095,
   "score": 15,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3try7",
   "message": "Ms Patterson said the children had actually gone to the movies prior to lunch.\n\n...\n\n\"I had a deep love and respect for Simon's parents and had encouraged my children to spend time with their grandparents as I believed they were exceptional role models.\"  \n\n\n**But sent them away to the movies instead of sharing lunch with their grandparents?**",
   "created_utc": 1691993414,
   "score": 24,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3x25d",
   "message": "This sounds like the lawyers doing damage control tbh. And if she and the kids did eat it (allegedly), you'd think they'd say this earlier before the case became internationally famous and the jury pool poisoned.",
   "created_utc": 1691995847,
   "score": 10,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3ya0q",
   "message": "\u0026gt;\"I am hoping this statement might help in some way. **I believe if people understood the background more, they would not be so quick to rush to judgement.**\n\nThe only reasonable way to interpret that sentence is a cry for empathy. Explaining the background only gives context to the facts, it doesn't change them. It sounds like she wants people to understand why she did it, not to change their mind about _whether_ she did it.\n\n\u0026gt;I am now devastated to think that these mushrooms may have contributed to the illness suffered by my loved ones. **I really want to repeat that I had absolutely no reason to hurt these people whom I loved.**\"\n\nAnd a gorgeous Freudian slip here. Again, that sentence only implies \"I didn't do it\", but she hasn't said that. It sounds like her guilt is speaking for her.",
   "created_utc": 1691996762,
   "score": 10,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw42c69",
   "message": "So she is responsible for several poisonings some leading to death of people close to her and when the police ask to talk she says NO COMMENT?? Why wouldn’t you want to help out and get to the bottom of things? \n\nAlso, is it true or false her ex husband was very sick last year from something similar?",
   "created_utc": 1691999932,
   "score": 4,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw47bnv",
   "message": "Of course… she blames it on the Asian grocers. How come when others buy the mushrooms they’re safe and sound, but the same mushrooms suddenly causes death?\n\nYou got more explaining to do, Erin!",
   "created_utc": 1692003862,
   "score": 5,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw47o33",
   "message": "Well, reports say she's admitted to lying to police. She's making herself seem more guilty as reports keep coming out.",
   "created_utc": 1692004129,
   "score": 5,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw4af6l",
   "message": "Not in this new article, I can't find it, but she also lost her parents in 2019 before inheriting enough money to buy properties outright without a mortgage. Ummmm.... 🤔",
   "created_utc": 1692006242,
   "score": 5,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3puyk",
   "message": "Let's blame Asians.... What a Karen.\n\nNo other ppl in last 6 months got that ill from mushrooms purchased from an Asian grocer.\n\nWhat a racist Karen.",
   "created_utc": 1691990738,
   "score": 69,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw3th48",
   "message": "She did it.\nIts so obvious",
   "created_utc": 1691993204,
   "score": 12,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw42t9g",
   "message": "Guilty AF!",
   "created_utc": 1692000305,
   "score": 5,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw463qg",
   "message": "😬 Yeah nah, say less.",
   "created_utc": 1692002909,
   "score": 3,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw4l8j1",
   "message": "She's buried herself by making a false claim about getting the death caps from an Asian grocer that she refuses to identify. She conveniently identified which supermarket she got the button mushrooms but can't/won't identify which store she got the death caps from. Once she states which Asian grocer the cops will look at her bank account and try to match against merchant sales records at that time/date. They can also see from mobile network logs where she was at that time and look at camera footage. Once her claims don't stack up they'll charge her.\n\nI agree with others that she deliberately gave herself a very small amount so she was also hospitalised.",
   "created_utc": 1692013356,
   "score": 4,
   "submission_id": "15qjuqe"
  },
  {
   "comment_id": "jw4j1x4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qjuqe"
  }
 ]
}