{
 "submission_id": "15qq6fz",
 "title": "My OC are bloody rubbish.",
 "selftext": "It turns out the group we'd been paying to manage our mid-sized, non-luxe apartment building overlooked issuing quarterly levy notices for the past 6 quarters. The new manager introduced himself by announcing that he's sending these 6 notices all together with fast impending due dates, and he'll be charging late fees.\n\nI responded asking if there were other 'oversights', and that we cannot reasonably be expected to be charged full costs considering 18mths worth of 'management' had been mismanaged. My queries weren't addressed. \n\nAnyone have this happen to them? Should an authority be notified of this? Where should I go to for advice on strata management companies and their responsibilities to my building?",
 "created_utc": 1692006648,
 "permalink": "/r/melbourne/comments/15qq6fz/my_oc_are_bloody_rubbish/",
 "score": 13,
 "url": "https://www.reddit.com/r/melbourne/comments/15qq6fz/my_oc_are_bloody_rubbish/",
 "comments": [
  {
   "comment_id": "jw4fucq",
   "message": "OC’s are the worst. We just canned ours who cost us tens of thousands of dollars in legal fees for mistakes they made. Lodge a formal complaint with consumer affairs. They handle body Corp complaints.",
   "created_utc": 1692010077,
   "score": 10,
   "submission_id": "15qq6fz"
  },
  {
   "comment_id": "jw4kmf6",
   "message": "There's a few things to consider here like and it all kind of boils down to what is in the contract between your Owners Corp and the Managing company.... How long is the contract for, what are the responsibilities in it, etc.\n\nThe board is actually a bunch of people from your building, who are elected every so often to represent the rest of you as the owners. The management company has a contract with you all and is subject to that contract.  \n\nYou want to know how long is left in the management contract, how many years left and what the cancellation clauses are. It's possible that you have a bargaining chip here, which is \"we are within our rights as a board to cancel the rest of this contract and send the management company packing, however, if they waive the late fees we will in good faith continue, etc. However, it's also possible that if you refuse to pay the late fees the contract is worded in such a way that the management company is entitled to restitution or something, and you can't get rid of them for x more years. Best case scenario is it's somewhere in between (no late fees, we'll pay for services rendered up until such time as we transition to a preferred management company).",
   "created_utc": 1692013001,
   "score": 5,
   "submission_id": "15qq6fz"
  },
  {
   "comment_id": "jw4np2x",
   "message": "How did you guys not notice that you haven't been receiving any fees for 18 months?! Did all the owners just not notice it? \n\nHow did the strata management pay for insurance, electricity, maintenance on your building without getting fees for 18 months? \n\nThis story is so bizarre...",
   "created_utc": 1692014705,
   "score": 1,
   "submission_id": "15qq6fz"
  },
  {
   "comment_id": "jw4gcov",
   "message": "Would this OC management company have a name that resembles a playing card by any chance? :-)",
   "created_utc": 1692010403,
   "score": 2,
   "submission_id": "15qq6fz"
  },
  {
   "comment_id": "jw4mts6",
   "message": "Speaking from recent experience of this one, [here](https://www.consumer.vic.gov.au/housing/owners-corporations/complaint-handling-and-resolving-disputes) is the formal process from consumer affairs for settling disputes with your OC. Keep written everything. Have a look at the Owner's Corporation Rules as per your contract of sale and the Owners Corporations Act 2006 (should also be in the contract). C+P which rules they've not upheld in your complaint and send the form via registered post. Got our OC to fix a leaky rook within 2 weeks this way after 2 years of back-and-forth emails. Good luck!",
   "created_utc": 1692014240,
   "score": 2,
   "submission_id": "15qq6fz"
  },
  {
   "comment_id": "jw4o41h",
   "message": "califorina here we come",
   "created_utc": 1692014926,
   "score": 1,
   "submission_id": "15qq6fz"
  },
  {
   "comment_id": "jw4fw5y",
   "message": "I’m a property manager and having to deal with OCs is quite often the worst part of my job. This post doesn’t surprise me in the least. “Hey, we fucked up, but guess what? Doesn’t matter, pay up.”\n\nNot sure if VCAT would handle this but I hope you can sort it out.",
   "created_utc": 1692010109,
   "score": 1,
   "submission_id": "15qq6fz"
  }
 ]
}