{
 "submission_id": "15qqs6u",
 "title": "Why do so many people buy lunch every day of the week?",
 "selftext": "I work in the City and I am constantly shocked at the amount of people that buy their lunch every day of the week rather than preparing something at home. \nHow has this become so normal?\n\nI work with a group of about a dozen people and all of them buy lunch every day. (Most of them constantly complain about being broke lol)\n\nEating at cafes and takeout joints is ridiculously expensive and in my opinion it is a lot more difficult to make good decisions around healthy eating and diet when buying food rather than preparing it yourself. I understand the convenience of buying your lunch but surely it should be treated more as a luxury than an every day thing.",
 "created_utc": 1692008570,
 "permalink": "/r/melbourne/comments/15qqs6u/why_do_so_many_people_buy_lunch_every_day_of_the/",
 "score": 117,
 "url": "https://www.reddit.com/r/melbourne/comments/15qqs6u/why_do_so_many_people_buy_lunch_every_day_of_the/",
 "comments": [
  {
   "comment_id": "jw4gzl3",
   "message": "It's the only joy I have left.",
   "created_utc": 1692010805,
   "score": 114,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4fo7f",
   "message": "A tasty fresh hot lunch is good.  Sometimes the highlight of your day.\n\nAlso means I can get away from the office and and having to talk to people.",
   "created_utc": 1692009965,
   "score": 129,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4f04d",
   "message": "If I'm going to the hassle of commuting in to the office, then I'm damn well going to have an enjoyable meal that I can only get in the city.",
   "created_utc": 1692009509,
   "score": 138,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hl3m",
   "message": "If I could afford to, I wouldn't cook a single meal. It's a massive time and energy suck and I'd rather stare at a wall if it weren't for the whole starvation thing.",
   "created_utc": 1692011180,
   "score": 88,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4fqzf",
   "message": "City lunches are a great pleasure.",
   "created_utc": 1692010014,
   "score": 63,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4g2y5",
   "message": "Because it might be the highlight of their day!",
   "created_utc": 1692010231,
   "score": 54,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4eswm",
   "message": "Too tired to make lunches and I usually eat with a coworker so it’s a social thing. I don’t work in the city everyday though so it’s not a massive outlay for me.",
   "created_utc": 1692009372,
   "score": 86,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i2wy",
   "message": "Most people that do this are trying to subtly claw back some of their slave hours by going for a coffee and lunch instead of working normal hours in the office. Think of it as the modern smoko for office workers to go bludge…",
   "created_utc": 1692011489,
   "score": 36,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hzgl",
   "message": "It’s like saying, why do people spend money on the movies? You can just watch at home. Why spend money on holidays? You can just camp in the backyard. Why buy an expensive brand car? Just ride a bike!!!! Honestly, I feel like people are so judgmental these days, you don’t know what’s going on in their personal life, home life, mental health, if they want to feel good and enjoy something just let them.",
   "created_utc": 1692011430,
   "score": 98,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i752",
   "message": "Leave me and my cheap noodles or low price banh mi alone. Can mind your own business",
   "created_utc": 1692011563,
   "score": 22,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4igq3",
   "message": "Because sometimes buying a $12 lunch every day is the only joy someone has left buddy",
   "created_utc": 1692011728,
   "score": 23,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hgut",
   "message": "It's an excuse to get out of the office.",
   "created_utc": 1692011107,
   "score": 18,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4eko3",
   "message": "Because lazy and don't wanna prepare lunch? It's not that complex.",
   "created_utc": 1692009215,
   "score": 105,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hbr4",
   "message": "Lunch is a great meal to buy. Certainly cheaper than dinner, good socialising, networking, breaks up the day.\n\nMaybe your colleagues are saving money elsewhere and lunch is their splurge.",
   "created_utc": 1692011018,
   "score": 35,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hk6h",
   "message": "I'm not in Melbourne, but I'm a sales rep so I'm on the road all day not in an office so I don't have microwave, sandwich press etc, and I like hot meals for lunch. I really don't have a choice lol",
   "created_utc": 1692011164,
   "score": 16,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hki3",
   "message": "I get interrupted every single lunch time. It always starts with “I’m sorry to interrupt your lunch but…” lunch always ends up cold. The only way I can guarantee a break is hiding in a cafe. When I get the inevitable call that the world is ending without me I can always say my noodles have just arrived. Also; gives me an excuse to take lunch because the cafes are closing. Otherwise I’m running around like a headless chook until three in the afternoon solving problems for people paid to solve problems.",
   "created_utc": 1692011170,
   "score": 12,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4j6s6",
   "message": "Cheaper than ciggies and grog, maybe that is their release? Idk I stopped caring 10 years ago, people just gotta mind their own business",
   "created_utc": 1692012162,
   "score": 12,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4gxgl",
   "message": "You are so much better than everyone else",
   "created_utc": 1692010767,
   "score": 64,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4fb58",
   "message": "One of the buildings I work in, I buy lunch because there’s no fridge or microwave available to me. Or kitchenette or break room. If I brought food I’d have to keep it in my locker, and take it outside to eat.",
   "created_utc": 1692009720,
   "score": 11,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4g8lf",
   "message": " It is definitely the cause of my bad budget but… I can’t cook. So, laziness plus comfort.",
   "created_utc": 1692010331,
   "score": 11,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4h7q2",
   "message": "Partly coz I'm lazy and partly coz im time poor but mostly coz I'm a forgetful autistic fuck.",
   "created_utc": 1692010947,
   "score": 12,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4es9m",
   "message": "I don't like using microwaves.",
   "created_utc": 1692009361,
   "score": 32,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hdhb",
   "message": "Who would you have to feel superior to if they didn’t? \n\nBut I also think your workplace might not be the norm. Every city office I’ve worked in most people bring their lunch at least some days.",
   "created_utc": 1692011049,
   "score": 20,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i0yu",
   "message": "Cause they can afford it literally. My partner was rich and bright nearly every meal cause they can",
   "created_utc": 1692011455,
   "score": 9,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kdcx",
   "message": "Because they can. How does it concern you ?",
   "created_utc": 1692012858,
   "score": 10,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i8v7",
   "message": "Most people , like me are  not comfortable eating in staff lunch room because don't want dislike  smell foods , gossip , hearing talking about work issues etc ...Going out sit  buy food or coffee in better moods ......",
   "created_utc": 1692011592,
   "score": 8,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4iqyr",
   "message": "Paying for lunch means you're not paying in time making your own, it depends what you value more",
   "created_utc": 1692011900,
   "score": 8,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4it89",
   "message": "It’s kind of like buying coffee every single day instead of bringing it from home. I know people that will buy two or three cups of coffees every single day, that adds up to but it makes their day more enjoyable",
   "created_utc": 1692011939,
   "score": 8,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4eyv9",
   "message": "It’s easy to slip into the habit. Where I work now isn’t convenient to buy lunch, so it forced me to start prepping my own meals and it only takes me a couple hours a fortnight to premake lunch for the fortnight. Cost me $38 for all the ingredients for a fortnight last time so about $3.80 per lunch.",
   "created_utc": 1692009484,
   "score": 15,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4fass",
   "message": "I don't have the time to make lunches the night before so I eat on the go,",
   "created_utc": 1692009713,
   "score": 25,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i8as",
   "message": "Convenience. \n\nEverything you people complain about young people is summed up with “convenience”\n\nWhy do we waste money on Uber? Convenience. \n\nWhy do we buy fast food? Not because it tastes good. Convenience. \n\nWe decided to value our time spent doing something else than “prepping sandwiches” or bulk meals for the week. I don’t want to spend my Sundays cooking for the week. I want to go to my favourite cafe, relax and enjoy my time. Because we enjoy this lifestyle. \n\nIt comes at a premium but that’s the luxury. \n\nAsking me why I go to cafes instead of slaving in my kitchen is a bunkers question. It’s because I want to!",
   "created_utc": 1692011583,
   "score": 25,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4g07m",
   "message": "I saw a maggot crawling up the wall of our work kitchen a few weeks ago,  no way I'm using that kitchen. I do take sandwiches from home about three days a week, but i also work such long hours I'm usually way too tired to wash the containers and make a fresh lunch for the next day.",
   "created_utc": 1692010182,
   "score": 14,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kq85",
   "message": "Just let me be happy, man.",
   "created_utc": 1692013062,
   "score": 7,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i53k",
   "message": "I go to the office two days a week and find that if I buy ingredients to prep lunch a lot will end up going to waste. The amount of wraps I've thrown out because I only use two a week and they come in a pack of eight is embarrassing. I'd rather cook something on the three days I'm home and buy food on the two days I'm in the city.",
   "created_utc": 1692011528,
   "score": 6,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jh8c",
   "message": "I enjoy the process of buying my lunch. I walk to the place, I buy my food from the place, I walk back to work. \n\nIf I didn’t buy my lunch, I guess I could still walk, but it wouldn’t have a purpose.",
   "created_utc": 1692012334,
   "score": 6,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i8uy",
   "message": "What a stupid fucking post",
   "created_utc": 1692011592,
   "score": 19,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4h1uu",
   "message": "I’m lazy as fuck",
   "created_utc": 1692010845,
   "score": 9,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4h3bb",
   "message": "Because not everyone can be fucked cooking at home,We are tired working all day.\nBeing a CDP myself in a restaurant who has freedom to eat at workplace whenever,I eat out my lunches quite a bit as well.\nA couple hundred bucks on lunch for the convenience is not that bad",
   "created_utc": 1692010870,
   "score": 11,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4iqxf",
   "message": "We're supporting small buisnesses god dammit!!!!!",
   "created_utc": 1692011899,
   "score": 5,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jw0n",
   "message": "From my experience, they seem to fall in two categories:\n\n1) CBF preparing their own/happy to pay for convenience/want something in particular that day. Whatever gets people through the work day really, if it makes people happy buying lunches then who cares\n\n2) work insane hours during peak times, and are literally home to shower and sleep before coming back in. One industry I used to work in, 14-16+ hour days was not uncommon. I’d buy lunches too",
   "created_utc": 1692012577,
   "score": 5,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4k11c",
   "message": "I just don’t want to bring left overs. I don’t want to eat something I cook every week. And I don’t want a sandwich. I want something different! \nNote: I only work in the city once every couple of weeks",
   "created_utc": 1692012658,
   "score": 5,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lk2e",
   "message": "As a person who buys his lunch every day the reason why is none of your fucking business and why does it matter to you anyway?",
   "created_utc": 1692013537,
   "score": 5,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lm9v",
   "message": "I did it for 10 years and then when covid happened became much more interested in food prep. I took 16 months off work (swoon) and by the time I went back to my job 2 years ago, had completely changed my relationship with food. \n\nMy freezer is now always full of portioned out dishes (even weighed out) in sandwiched bags. Flattened out the air, they defrost on my desk and come out perfectly in the micro. \n\nComplete control over everything I eat now. I save $100 a week and no shit, I lost 20kg last year. \n\n97kg to 77kg.",
   "created_utc": 1692013572,
   "score": 5,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4htaz",
   "message": "It’s only 12 bucks",
   "created_utc": 1692011323,
   "score": 4,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jvdj",
   "message": "The only half hour I got away from the insufferable sameness of the office",
   "created_utc": 1692012566,
   "score": 4,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kfzj",
   "message": "How can I resist the overwhelming temptation of Kenny's Bakery Bacon and Egg Roll with tomato sauce?  It's a morning ritual whenever I come into the city.  \n\nI make a beeline straight from Flinders, up through Elizabeth, give the odd cooker a Don't Argue as I storm past the tradies with their Red Bull, IC Coffee, and Sausage Rolls.  The unsullied.\n\nLunch is a righteous Pho or teriyaki chicken don.  Unless my mates are around then it's a Parma and Pot.\n\nAfter work it's whiskey with hot skewers or cold salumi, olive, pate, and cheese board (and honey!)\n\nHow on earth am I supposed to prepare all that at home?\n\nHmmm?",
   "created_utc": 1692012900,
   "score": 4,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4iciw",
   "message": "Psychological feel good factor.\nLot of people hate their job and hate commuting so buying food someone else prepared for them is the only highlight of the day.\nIf you don’t break up from rat race this just goes on and on.\nI put an end to it when I noticed I was paying too much money for food that was not even that good.\n\nAnd people who make healthier choices usually prepare food at home, unless you make big bucks. \n\nHaving a plan and following a basic health/fitness program helps tremendously. \n\nI use an app that rotates list of recipes everyday, pretty easy to cook and takes only few minutes, saves me lot of money from paying for overpriced simple food. Keeps me healthier and in form too, combined with exercise.",
   "created_utc": 1692011655,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jphb",
   "message": "It tastes nice",
   "created_utc": 1692012469,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lhy2",
   "message": "Because someone has to sustain the livelihoods of those CBD cafe owners that were so hard done by the pandemic. The media campaign to save the cafe owners has worked and now ppl are complaining it’s a bad thing. Make up your minds people!",
   "created_utc": 1692013504,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lyig",
   "message": "People like ‘convenience’, others like to profit from that ‘convenience’.",
   "created_utc": 1692013764,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4p5qu",
   "message": "Cause that roast pork banh mi tastes better than my whey protein+ weetbix mix hahaha",
   "created_utc": 1692015472,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ii40",
   "message": "Because nothing I can cook tastes good microwaved the next day.",
   "created_utc": 1692011751,
   "score": 4,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ijsm",
   "message": "Can someone suggest some decent CBD lunch spots? I'm tired of my usual gyg burrito",
   "created_utc": 1692011781,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4j8qk",
   "message": "It's actually not normal to prepare lunch and bring it from home. It's cheaper, yeah. But that is a problem with our economy. It will always make a lot more sense to have dedicated cooks who prepare meals for a lot of people. In terms of effort and material cost, that is a lot more efficient. It is still this way in many countries. But, Not ours.",
   "created_utc": 1692012194,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jm84",
   "message": "Because it's the only meal of the day so going to enjoy it 🤣",
   "created_utc": 1692012416,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4k3el",
   "message": "I do it as a treat, three days in the office and I get something I couldn't make at home, and is cheaper than a takeaway in the evening.\n\nI get to decide what I fancy at the time. It's fresh, warm, and I get time away from my desk.\n\nSome people have other vices, mine is a convenient and enjoyable lunch.",
   "created_utc": 1692012697,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kkhs",
   "message": "Not everyone works close to home. If you work 8 hours and commute to and from work (or even have a long drive), plus other commitments and responsibilities such as childcare, it can be difficult to find time to cook. Everyone's circumstances are different.",
   "created_utc": 1692012970,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kt8y",
   "message": "Because taking lunch to work reminds them of those shitty sad days at school lunch when they brown bagged it. Never again. Even if I’m broke.",
   "created_utc": 1692013109,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kzcy",
   "message": "I like to shout myself a good coffee and breakfast wrap once or twice a week, but definitely not every day. I bring food to work most of the time and make my own filter coffee in the staff room, saves me a fortune.",
   "created_utc": 1692013210,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lcrz",
   "message": "Buying lunch (and coffee and breakfast) when I'm in the office gives me immense joy.\n\nSometimes I even have a cheeky drink or two after work.",
   "created_utc": 1692013423,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lpbt",
   "message": "Depression",
   "created_utc": 1692013619,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mf66",
   "message": "Why do you care what other people spend their money on? They can do what the fuck they want with their own money. Sheesh.",
   "created_utc": 1692014016,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mgzt",
   "message": "I just refuse to eat for my 12 hours shifts 😂 I cannot be fucked meal prepping with the pathetic and minute amount of time I have to myself between shifts and the work canteen is pretty much all deep fried shit with a menu straight out of the 80s but with the most ridiculously high prices you’ve ever seen.\nI’m also pretty fanatical about healthy eating and if I’m gonna eat shit I’m gonna do it with people whose company I actually enjoy and in an environment that doesn’t make me question my entire existence 😂😂",
   "created_utc": 1692014045,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mhbv",
   "message": "Because life is short! I commuted and was religious about not buying lunch for almost a decade. Eventually you gotta live a little, even if living amounts to nothing more than a bowl of Lanzhou noodles for lunch.",
   "created_utc": 1692014049,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mjir",
   "message": "This is such a dumb question. Just because you don’t want it / can’t afford it - you can’t comprehend why someone else would like it.",
   "created_utc": 1692014082,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mk8v",
   "message": "Used to make 3x what I make now (disabled, work part time now). \n\nI’d eat out many nights and buy lunch daily. \n\nIt just didn’t count for much when pulling 60-80hrs every week. My dogs would eat out at night with me and we’d go for a walk after. \n\nBuying lunch would be a much needed reset (the walk) and often my only day light. Also connecting with teammates on other projects and bouncing ideas between each other. \n\nPlus, $10-$20 just didn’t matter compared to time availability at home. \n\nI still cooked for pleasure and to entertain. \n\nI got healthy lunches - salads, sushi etc.",
   "created_utc": 1692014094,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mner",
   "message": "Because I'm a workaholic and it gets me away from it for all of 10-15 minutes\n\nIs that okay with you or do you wanna tell me how much money I'm wasting a little bit? You can if you want",
   "created_utc": 1692014143,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4moed",
   "message": "100% because I can't be stuffed making lunch... Simple 🤣",
   "created_utc": 1692014158,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mrzi",
   "message": "A lot of ppl like to get away from work and some workplaces have no places to eat lunch. \n\nEating out for lunch costs a fortune. I'm a once anwek guy",
   "created_utc": 1692014213,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mu00",
   "message": "Who fucking cares",
   "created_utc": 1692014244,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mvz1",
   "message": "What you consider 'ridiculously expensive' isn't that expensive for a lot of people.",
   "created_utc": 1692014274,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ne86",
   "message": "It’s my reward for coming into work.",
   "created_utc": 1692014546,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4prgq",
   "message": "I'm one of those people. Nothing I hate more than people telling me how to spend my hard earned money, if I want to pay 8 dollars for a coffee then that's my choice.",
   "created_utc": 1692015778,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hoa4",
   "message": "Life style creep.",
   "created_utc": 1692011234,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4i91y",
   "message": "I am purely lazy and very easily persuaded to go and get lunch with colleagues when they ask “wanna get lunch?” It’s actually a terrible habit.",
   "created_utc": 1692011596,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4gof7",
   "message": "We don’t have takeout joints in Australia, only takeaway joints.",
   "created_utc": 1692010611,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4gsfk",
   "message": "Pro tip, buy some Coles brand pouch soups. About $3 each, shelf stable so don’t have to refrigerate or go out of date. Taste good and are about 200cals per serve. Zap them in microwave (in the pouch) for three minutes and you are good to go.",
   "created_utc": 1692010682,
   "score": 3,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4hldg",
   "message": "I just make extra at dinner the night before then take that with me for lunch",
   "created_utc": 1692011185,
   "score": 2,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4gimh",
   "message": "I prided myself on having never bought anything from the tasty truck at my last work\n\nLiving within your means in underrated, \u0026amp; why I've got zero debt",
   "created_utc": 1692010508,
   "score": 254,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mt83",
   "message": "Same OP, How can they afford it?  so many cost of living increases and outcries about rent  and mortgage.. i know where my priorities are.. a home prepared toasty is much cheaper than a store bought toasty..ditto salads  cake, biscuits , soup etc.  to each their own..",
   "created_utc": 1692014232,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ihr2",
   "message": "This is a city thing really. I live in bayswater and work in ferntree gully and everybody out here makes there own food. I am absolutely baffled by the sheer amount of people buying food whenever I go to the city for one week every 6 weeks for tafe. It’s baffling. The city is already so insanely expensive, and then people buy a $15 meal just to make it that little bit more expensive. I’m out here living on $500 a week. I see people complaining about how it’s so much worse these days than it was back then. If you just prepared your lunches at home, you would have $75 more a week.",
   "created_utc": 1692011745,
   "score": 255,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4gf5y",
   "message": "People don't understand money.\n\nThat coffee they buy every day. $4.50, insignificant right? Let's say a coffee at home, or nespresso pod costs $0.50. That's $4 a day you are saving, $20 per work week.\n\nLet's say someone puts that $20 a week in an index fund and that investment beats the rate of inflation by 5% (historical average is higher, but let's round down for this argument).\n\nBuying that coffee every day from the age of 20 until 65 has cost you over $175,000 in today's money.\n\nMaybe some days they don't buy one, bot other days they get a muffin too. As you noted, the people who do this every day, tend to also spend elsewhere and likely burn much more than $5 a day.\n\n$15 a day average (coffee, occasional lunch)? That's $660,000 at point of retirement in today's money, or the difference between retiring early with a comfortable fund, or working to 65+ with a tight future.",
   "created_utc": 1692010447,
   "score": 245,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jl84",
   "message": "And they drive to work and spend a fortune on parking plus some even smoke  How do they survive?",
   "created_utc": 1692012399,
   "score": 0,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4lbfs",
   "message": "It's called contributing to the economy, yes prices have gone up but remember, businesses rely on patrons to survive, I too frequently like to buy food from cafes and restaurants and will happily to so.",
   "created_utc": 1692013403,
   "score": 0,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ni75",
   "message": "And it boomers fault they can't afford a house",
   "created_utc": 1692014605,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4gn1d",
   "message": "Because they’re lazy.\n\nSame people complain about being broke. \nIt’s cheaper, healthier and doesn’t take long do meal prep for the week. People just cbf and don’t care about their health.",
   "created_utc": 1692010587,
   "score": 243,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ihny",
   "message": "This was normal 10 years ago when I was working in Brisbane. I tended to buy maybe 1-3 times a week for variety, but many of my workmates were 5 days a week, every week.",
   "created_utc": 1692011743,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4jirh",
   "message": "I found pre Covid for the $8 it cost me max a day it was a no brainier.. now bloody lunch costs me $15 -18 easy. I pack left overs 2-3 days a week",
   "created_utc": 1692012358,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kafg",
   "message": "You can eat real cheap with apps like EatClub",
   "created_utc": 1692012811,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kb3w",
   "message": "A team at my work always go out for drinks and a pub lunch and easily drop $80 - $100 each.",
   "created_utc": 1692012821,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kot6",
   "message": "I buy food/coffee out pretty regularly. I'm self employed and earn above average per hour, but I don't work full time due to health issues. Usually small stuff like two sushi rolls, a soy latte here and there, a banh mi, Middle Eastern pastry, or a cheap Asian meal under $15. But yes it adds up. I justify it because I don't drink. Also I struggle with depression and getting out of the house, so telling myself I can stop by my favourite coffee place/bakery whilst running work related errands or getting the groceries is often the kick up the arse I need.\n\nAnd it truly brings me joy. Apart from not drinking, I don't travel (inc weekends away in Oz) or wear fancy clothes, and have nevr owned a car. But I prioritise other things like living alone in a walker/PT-frieendly inner north suburb, and always being able to look forward to good food.",
   "created_utc": 1692013038,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4krih",
   "message": "I've noticed as well and found out, a lot of people can't cook.",
   "created_utc": 1692013081,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kszp",
   "message": "For me it’s just laziness. $15-$20 for lunch opposed to meal prepping.",
   "created_utc": 1692013105,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4kt04",
   "message": "Very true! As a rep it’s a part of my job to support and be seen at accounts and have a meal ect! So I get the observation about people buying lunch and making themselves broke. But also best to worry about what your doing and not others. People need to ware their own decisions……",
   "created_utc": 1692013105,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ku6o",
   "message": "A",
   "created_utc": 1692013124,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mm2d",
   "message": "I go into the office around 2.5 times a week. With the lunch i buy, that comes to $1700 a year and im totally fine with that.",
   "created_utc": 1692014122,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mn99",
   "message": "Because I can still afford it and I get sick of my own cooking after a few days.",
   "created_utc": 1692014140,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ms5d",
   "message": "If I'm paying the ADHD tax I might as well enjoy the food.",
   "created_utc": 1692014216,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4mvhm",
   "message": "I work in Melbourne CBD, its a joy to go out and try delicious food there. I prefer to enjoy “here” and “now” instead of saving for the future.",
   "created_utc": 1692014266,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ndyf",
   "message": "The wage slavery is real. I implore you all to find more meaning in your life.",
   "created_utc": 1692014542,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4nlcf",
   "message": "I support my local businesses.",
   "created_utc": 1692014651,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4nnyg",
   "message": "I brought lunch with me but only because I had to move around a lot. Also it's nice to occasionally support your fav local eateries. Not everything has to be crunched when it comes to the little joys in life.",
   "created_utc": 1692014688,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ntqm",
   "message": "I bring a camping stove and cook dim sum bolognese",
   "created_utc": 1692014775,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4nzt4",
   "message": "Lol jesus how sad. That fills you up?",
   "created_utc": 1692014865,
   "score": 1,
   "submission_id": "15qqs6u"
  },
  {
   "comment_id": "jw4ojbt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qqs6u"
  }
 ]
}