{
 "submission_id": "158fe9v",
 "title": "A stranger saying you’re beautiful is more significant than from someone you know",
 "selftext": "",
 "created_utc": 1690215938,
 "permalink": "/r/Showerthoughts/comments/158fe9v/a_stranger_saying_youre_beautiful_is_more/",
 "score": 62,
 "url": "https://www.reddit.com/r/Showerthoughts/comments/158fe9v/a_stranger_saying_youre_beautiful_is_more/",
 "comments": [
  {
   "comment_id": "jt9sbwt",
   "message": "A cute old man was at my work and smiled at me and gestured to my eyeliner saying “I don’t know what you call those (I had winged eyeliner) but your swoops? Those. Yeah I like those. They’re very pretty!” That made my whole day I love when girls compliment my makeup but I didn’t think men would pay attention to that stuff so it made me smile that he took the time to say something, even if he didn’t know what it was called.",
   "created_utc": 1690218355,
   "score": 114,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jta0i16",
   "message": "My wife and I were walking in a store with our twin grandaughters who were about 7 at the time. I was with one of them about 20 feet behind my wife with the other and a woman was coming toward us, nicely dressed like business attire. After she passed my wife my grandaughter turned to her and said in a loud voice “Grammy wasn’t she just beautiful?”. The grin on this woman as she passed me was just priceless.",
   "created_utc": 1690221484,
   "score": 71,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jta7aya",
   "message": "More so if the compliment is from a child, they’re very honest.",
   "created_utc": 1690224394,
   "score": 62,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtadan3",
   "message": "On a bus I saw an older woman with an old school looking summer hat. She looked depressed. I told her I found her hat to be really nice. She smiled and said that made her day.",
   "created_utc": 1690226709,
   "score": 22,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtb2t97",
   "message": "A few years ago, I (man) went to a concert at a small venue. After the show, everyone was shuffling out, and I was going against the flow to get my coat.\n\nAs I worked my way upstream, I saw a fairly buzzed guy hitting on a woman. She was smiling and appeared to be into it (and also buzzed). I ended up standing next to them for a few seconds. The guy looked me up and down, smiled, and said, \"Hey, you gotta keep going. You're too good-looking, give the rest of us a chance.\" We all laughed, and I kept going.\n\nThat one comment from a stranger has probably made more of an impact on my aesthetic self-image than anything my friends/partners have said because 1) his only knowledge of me was how I looked in that moment and 2) he had no incentive to artificially bolster my confidence/endear himself to me.",
   "created_utc": 1690236640,
   "score": 13,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtab4cc",
   "message": "What about a redditor? A redditor is a stranger. How significant is our compliment?",
   "created_utc": 1690225868,
   "score": 12,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtag2zz",
   "message": "Personally, I think it's shocking that my husband tells me that I'm cute after all these years and my hair looks crazy etc. Definitely more meaningful than a random stranger with a weird vision with you. Although, to be fair, while not meaningful, when other people hit on me I am like oh wow, people still find me attractive?",
   "created_utc": 1690227785,
   "score": 7,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtarj3h",
   "message": "It weirds me out. Any time a guy talks to me, I have to resist the impulse to ask him if he won or lost the bet or which one of his friends hates him enough to convince him to talk to me (I guess I used to be “cute,” but gaining at least 100# caught up with me when I realize what I look like now after a good look in the mirror!). Just…have some self-respect, dude \u0026amp; don’t be seen with me. 🤣",
   "created_utc": 1690232153,
   "score": 6,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtai5gh",
   "message": "I beg to differ… your SO or partner sees all of you. The good, the bad, and the ugly. They know your faults and they know your accomplishments. They know what makes you human. Compliments mean way more when it comes from someone who knows the whole you.\n\nWhereas a stranger only sees outside beauty. They don’t get to see the inner beauty near as much.",
   "created_utc": 1690228574,
   "score": 14,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtap5p6",
   "message": "An old homie in a bar looked at me and said\n\"You look like this guy from Norway who is a skiing pro, apart from you having more muscle.\"\n\nNot gonna lie, that bricked me up.",
   "created_utc": 1690231245,
   "score": 3,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtaqe2g",
   "message": "Seriously. Last year I was walking to lunch on my break from work and a guy legit did a double take, stopped, and came back to me and asked me out. I said no as I was already taken but DAMN. I still think about that sometimes. What a lovely lovely compliment.",
   "created_utc": 1690231721,
   "score": 5,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtalo4w",
   "message": "A fellow man complimented my hair in a parking lot and asked me where I get it done. He sounded surprised when I told him I styled it myself. I don’t have great hair so that really made my week.",
   "created_utc": 1690229931,
   "score": 3,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jt9mnai",
   "message": "Respectfully disagree. A stranger only knows a small version of you. It might mean more to you to hear it from a stranger, but I feel like they can only compliment what they see, which is less than what someone who actually knows you can compliment. Also, you're beautiful 💜",
   "created_utc": 1690216179,
   "score": 6,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtap5dc",
   "message": "Yes love being cat called downtown at 9am🙄",
   "created_utc": 1690231242,
   "score": 5,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtawa0x",
   "message": "A woman I hadn’t seen in almost 15 years said I’m “beautiful” and “gorgeous” one night we were spending time together. I’m a guy, it’s the the best compliment I ever got and only two others are a distant second. I didn’t even know what to say at first,  because I feel the same when I look at her.  Honestly, it changed how I look at myself.",
   "created_utc": 1690234010,
   "score": 2,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtaxi6t",
   "message": "Or creepy, depending. Lol",
   "created_utc": 1690234499,
   "score": 2,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtbzstr",
   "message": "Disagree as a woman who takes public transportation and lives in a major city and is catcalled most days.",
   "created_utc": 1690251355,
   "score": 2,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jt9mcyh",
   "message": "Yes, because they have no reason to lie to me",
   "created_utc": 1690216069,
   "score": 2,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jt9ukmx",
   "message": "That’s why I always compliment people 💙",
   "created_utc": 1690219228,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jta0qas",
   "message": "And Barbie saying it is gonna make me cry, every time.",
   "created_utc": 1690221570,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jt9ryq3",
   "message": "That’s sexual harassment. Don’t tell anyone they’re beautiful without consent.",
   "created_utc": 1690218212,
   "score": 245,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtaik5q",
   "message": "Those who consistently and genuinely give compliments are the people of real beauty",
   "created_utc": 1690228731,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtanhxh",
   "message": "A little kid calling me beautiful makes me feel some type of way",
   "created_utc": 1690230619,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtave1s",
   "message": "Except for if it's my wife. There's nobody more significant it could come from.",
   "created_utc": 1690233660,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtaxidv",
   "message": "No it's not, because I don't care what strangers think.",
   "created_utc": 1690234501,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtbsuyb",
   "message": "Depends on the situation. \nMeans much more from anyone who’s clearly *not* trying to hook up.",
   "created_utc": 1690248068,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtbu8v3",
   "message": "What a strange comment. A stranger's opinion is more important than your SO, family, friends,  respected elders, coworkers... do you not have any respect for these people?",
   "created_utc": 1690248701,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtbxt4b",
   "message": "And a kid telling you youre ugly hits much harder than anyone else calling you ugly",
   "created_utc": 1690250376,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtbyxqb",
   "message": "Last real/sincere compliment I got from a stranger was over 10 years ago. Last one from someone I know probably about the same.\n\nIf someone saw me irl \"I wont/wouldnt count any recieved now on here as none would be real\" and gave me a compliment I would probaly cry.",
   "created_utc": 1690250925,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtc05wm",
   "message": "Depends on the intent. If some rando just comes up to me and tells me I'm a beautiful person like it's their good deed for the day, then it comes off a bit less genuine than if it's somebody I know. If they're just complimenting me on my physical appearance or whatever, though, it definitely feels better.",
   "created_utc": 1690251538,
   "score": 1,
   "submission_id": "158fe9v"
  },
  {
   "comment_id": "jtc6ji0",
   "message": "I don't know... my grandma calling me handsome is pretty uplifting",
   "created_utc": 1690254672,
   "score": 1,
   "submission_id": "158fe9v"
  }
 ]
}