{
 "submission_id": "158bgjw",
 "title": "TIL that the least obese country in the world is Vietnam. Its obesity rates stands at only 2.1%, which is lower than Uganda (5.3%), and significantly lower than the U.S. (41.9%)",
 "selftext": "",
 "created_utc": 1690207099,
 "permalink": "/r/todayilearned/comments/158bgjw/til_that_the_least_obese_country_in_the_world_is/",
 "score": 92,
 "url": "https://en.wikipedia.org/wiki/List_of_countries_by_obesity_rate",
 "comments": [
  {
   "comment_id": "jt9gv62",
   "message": "The World Bank has broken out the data by gender.\n\nInterestingly enough, American men are - relative to the rest of the world - more likely to be obese but American women are actually ranked below nearly all Middle Eastern countries.\n\nhttps://genderdata.worldbank.org/indicators/sh-sta-ob-18-zs/",
   "created_utc": 1690213933,
   "score": 188,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9q7br",
   "message": "I bet we'll hear about the \"Vietnamese diet\" being marketed as a weight-loss strategy.",
   "created_utc": 1690217538,
   "score": 138,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt954rf",
   "message": "The amount of men there that can pull off a skinny jean is alarming.",
   "created_utc": 1690209179,
   "score": 212,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt93vaq",
   "message": "41% holy crap.",
   "created_utc": 1690208647,
   "score": 21,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt92go0",
   "message": "Their cuisine is based on rice, boiled dishes and fresh vegetables and herbs, no wonder",
   "created_utc": 1690208049,
   "score": 48,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9nxuu",
   "message": "Goddamn nearly 42% of Americans are obese; not just overweight, but obese.\n\nAnyone know if there is a contributing cause apart from diet?",
   "created_utc": 1690216678,
   "score": 48,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jta9enz",
   "message": "I’m American, and I lived in Vietnam from 2016-this year. I have now moved back to the deep south, and now most everyone looks exponentially more…husky…than they did when I left! \n\nNo surprise, since a meal for one at most sit-down restaurant servings here in my state could literally feed a Viet family of four.",
   "created_utc": 1690225205,
   "score": 61,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt99olq",
   "message": "What about north korea?",
   "created_utc": 1690211049,
   "score": 178,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jta2mwi",
   "message": "A few months ago I was in Vietnam and on my Airbnb's balcony just mindlessly observing the traffic. I suddenly realize that I couldn't find a single fat person, everyone was fit, some were thin but mostly just the right weight. I've been to over 10 countries as of now (not a lot but not too little either) and I never felt this way. I remember telling this to my mom on call and then I got curious to know if there is any greater statistical truth to it and voila, it was number 1.",
   "created_utc": 1690222507,
   "score": 57,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9jqkc",
   "message": "Can someone explain why Pacific Islanders’ obesity rate is so high? It’s not like Tonga or the Marshall Islands are outposts for fast food or processed food. Is it strictly hereditary and genetics?",
   "created_utc": 1690215059,
   "score": 159,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9o5ji",
   "message": "41% of America is OBESE?? Not only overweight, but obese?? That’s insane.",
   "created_utc": 1690216759,
   "score": 154,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jtafxv9",
   "message": "41.9% vs. 2.1% = \"significantly lower\" \n\n\nWell, that's an understatement 😅",
   "created_utc": 1690227729,
   "score": 16,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt98aey",
   "message": "Im actually surprised that the US is only at 41%. Thought it would be closer to 60",
   "created_utc": 1690210476,
   "score": 149,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9p8vb",
   "message": "41%?!?!?",
   "created_utc": 1690217178,
   "score": 14,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jtaatbk",
   "message": "US just catching a random stray there at the end",
   "created_utc": 1690225750,
   "score": 10,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9qcg9",
   "message": "Why the fuck do we gotta be brought up when it comes to fatness? We’re not even #1 any more 😠",
   "created_utc": 1690217592,
   "score": 35,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jtb0d8l",
   "message": "I noticed that when I lived there, especially in the north. The diet is so healthy, and their rice intake at the meal table is much smaller compared to the counties around them. I didn't see any overweight people. Many people ride bikes as well. The food is amazing.",
   "created_utc": 1690235638,
   "score": 7,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9u4ag",
   "message": "Apparently East Asians are more genetically prone to diabetes and other health problems if they're slightly overweight compared to some other ethnicities. \n\nIn the US people of Vietnamese descent and other Asians have higher rates of diabetes than the general population, and are more likely to be diagnosed with diabetes even when they're not obese. \n\nJust browsing the CDC website, it says Asians are more likely to have visceral fat (fat in their belly) instead of just fat under their skin. So they may not look fat and may not be classified as overweight in the BMI, but having visceral fat is a major risk factor for diabetes.\n\nPlus Vietnam is a relatively poor country compared so some of its Asia-Pacific neighbors, so it makes sense for them to be skinny.",
   "created_utc": 1690219054,
   "score": 44,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9ec90",
   "message": "That's from 2016 too- I am guessing all percentages are higher after lock down",
   "created_utc": 1690212936,
   "score": 28,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jta79yd",
   "message": "I am Vietnamese and can confirm. Even the kids in our family who grew up in the US with food readily available are skinny compared to Americans. Eating habits, diet, and genetics all play a role.",
   "created_utc": 1690224383,
   "score": 6,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jta6c1v",
   "message": "Looks like that Wikipedia page uses stats from 2016 though. Current numbers put the US at 36.2%. Still not good, but it's an improvement.",
   "created_utc": 1690224013,
   "score": 13,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jtb414v",
   "message": "I hate that it costs $20 for a bowl of pho now after tax and tips here in Seattle. \n\nPhuc dat shiet",
   "created_utc": 1690237151,
   "score": 5,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9phuz",
   "message": "41.9. Jesus.",
   "created_utc": 1690217274,
   "score": 13,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9f5ud",
   "message": "The best answer would be that different races of people are not comparable by the same BMI=30 statistic. East Asians are *supposed* to be of thinner build genetically, and the guideline is roughly BMI=27-28 instead of 30 for them. However, this global statistic seems to use 30 for everyone.\n\nUsing the BMI=30 guideline makes all overweight East Asians appear healthier than they are. An East Asian with BMI=27/28 will suffer about as much health harm as a White person with BMI=30. \n\nThis helps explain why Vietnam's obesity is even lower than other much poorer nations. Simply put, a BMI=29 Vietnamese ought to be considered obese, and suffers roughly the same amount of health harm as a BMI=32 White person, but the statistic does not count it as such.\n\nFYI, I myself am an East Asian with a BMI=27 East Asian GF. She really is about as flabby as a BMI=30 white woman. We're just built different.",
   "created_utc": 1690213263,
   "score": 60,
   "submission_id": "158bgjw"
  },
  {
   "comment_id": "jt9hf4y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158bgjw"
  }
 ]
}