{
 "submission_id": "158bjj4",
 "title": "Til Americans have accumulated $21 billion Worth of unused gift cards. Almost 2/3 of people have a card and half of those will likely lose the gift card before using it",
 "selftext": "",
 "created_utc": 1690207278,
 "permalink": "/r/todayilearned/comments/158bjj4/til_americans_have_accumulated_21_billion_worth/",
 "score": 87,
 "url": "https://www.cnn.com/2023/02/23/business/gift-cards-unused/index.html",
 "comments": [
  {
   "comment_id": "jt9198v",
   "message": "Yup, this is the primary reason places push their gift cards so much.  I forget the actual number, but it's something like 94% of the cards/balances get redeemed, so issuing a card is like a 6% added revenue for the merchant, instantly.",
   "created_utc": 1690207525,
   "score": 197,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt92rij",
   "message": "And in some states the cards expire if they are not used. Expiring gift cards are illegal in California, so they retain their value forever as long as you have the card and the company hasn't filed for bankruptcy. We lost a couple hundred dollars in gift cards at two clothing shops that went bankrupt shortly after the COVID lockdown.",
   "created_utc": 1690208179,
   "score": 24,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt97q8i",
   "message": "Wife and I went back to giving cash, five or so years ago.   For this very reason.",
   "created_utc": 1690210250,
   "score": 208,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt96ntv",
   "message": "Also - you take perfectly good money, that can be used everywhere and practically forever, and buy a card that can only be used a few places - with an expiry date!",
   "created_utc": 1690209812,
   "score": 17,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9mcr6",
   "message": "Don’t blame consumers, tf am I supposed to do with a $1.63 applebees gift card?",
   "created_utc": 1690216067,
   "score": 127,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt95pi9",
   "message": "two of my gift cards wouldn’t even work and they wouldn’t refund me/fix it, it’s virtually a scam",
   "created_utc": 1690209419,
   "score": 178,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt94kfj",
   "message": "Gift cards are one of the greatest scams in modern history. Fuck gift cards.",
   "created_utc": 1690208941,
   "score": 141,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt98xwl",
   "message": "My husband and I were married in Nov of 2007. Many people gifted us store and restaurant gift cards for our wedding. 90% of those places went out of business in the Great Recession that hit immediately after our wedding and we never got a chance to use them.",
   "created_utc": 1690210743,
   "score": 107,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt97qyt",
   "message": "I'm guessing that gift card money just sits in a semi-liquid, dividend/interest bearing account and makes those bigger companies cash, hand over fist.",
   "created_utc": 1690210258,
   "score": 76,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9lsi6",
   "message": "*Kitboga has entered the chat.*",
   "created_utc": 1690215851,
   "score": 20,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt93u3z",
   "message": "working as intended",
   "created_utc": 1690208633,
   "score": 40,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9c8hm",
   "message": "This is not a poor person problem.  We use those MF's immediately.",
   "created_utc": 1690212090,
   "score": 105,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9k7lv",
   "message": "I was cleaning out my father’s desk and I found a $50 Outback gift card from 2008. It would have bought a bigger meal 15 years ago but the whole balance was still on there.",
   "created_utc": 1690215245,
   "score": 18,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9674p",
   "message": "Easy money for comapanies. I just give cash",
   "created_utc": 1690209620,
   "score": 16,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9kajv",
   "message": "Guilty. Also this is why I give cash - my wife says it isn't appropriate, but my take is that a gift card is just cash w/ restrictions. Cash is a gift card that works in any store, doesn't expire, doesn't charge 5% every month starting 6 months or a year after issue, aka some Visa grift cards. The only gift cards that make sense are the ones they sell at Sam's club (or other places i'm sure) that give you a discount - like a $50 gift card for $40 for the restaurant I happen to be going to tomorrow.",
   "created_utc": 1690215278,
   "score": 10,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9hh4f",
   "message": "I have a $200 gift card that I got for Christmas and was saving to use when I move (which is this week), but when I tried to use it I found that it was never activated at the time of purchase. I'm confident it was paid for based on who gave it to me, so there was some error on the part of the store or website. I'm not going to mention it to the gifter, because they likely couldn't do anything at this point. That $200 is just a wasted piece of plastic now. I wonder how many similar instances there have been.",
   "created_utc": 1690214170,
   "score": 10,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9pwdg",
   "message": "Amazing tip someone shared with me.  If you have prepaid visa or MC and there is just a little amount left you can apply it to your Amazon account and it becomes a credit you can use when you shop on their site.  I had 8 cards each with less than 5 dollars on them and I put them all on Amazon account.  Wish more sites did this !!",
   "created_utc": 1690217423,
   "score": 9,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt92r8y",
   "message": "Giftcard / giftbox business model is based on that.",
   "created_utc": 1690208175,
   "score": 9,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9ua7a",
   "message": "In Canada, it is no longer legal for gift cards to have an expiry date, because that was even more guaranteed revenue for vendors as recipients forgot to redeem them on time.",
   "created_utc": 1690219118,
   "score": 7,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9bxuj",
   "message": "That's their whole market strategy",
   "created_utc": 1690211971,
   "score": 7,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9m9h9",
   "message": "Wonder how much of that $21B is cards that for various reasons are impossible to redeem. I had a $20 GameStop gift card that wouldn't spend, but was active in their system. The store would refer me to the help line, the help line would refer me to the physical store. Eventually threw it out because the value of the card was not worth the time I would have to spend to fix the situation. Have never shopped at GameStop since out of petty revenge.",
   "created_utc": 1690216033,
   "score": 7,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt96nh2",
   "message": "If anyone has any they don’t want, I’ll gladly take them😁",
   "created_utc": 1690209808,
   "score": 17,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt99qev",
   "message": "I feel like I’m one of the few people that likes receiving gift cards. It’s nice to get any type of gift but if someone gives a financial gift that’s just cash I’ll probably just use it on something responsible because I feel guilty if I don’t. But if I get a gift card, I’ll actually treat myself to something that I may actually just want instead of need.",
   "created_utc": 1690211069,
   "score": 33,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jtaots6",
   "message": "Why can't boomers just give cash as a gift? \"It's SO impersonal\" jfc",
   "created_utc": 1690231121,
   "score": 6,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9ddld",
   "message": "In NY, businesses have to pay the balance from unused gift cards to the state. So instead of being a money grab for corporations, it’s a money grab for the state. I’m not sure which is worse. \n[$48M of unused gift cards paid to NY](https://www.thecentersquare.com/new_york/article_b1b9b9fe-8d5f-11ed-9bf7-5b84252b0676.html)",
   "created_utc": 1690212549,
   "score": 36,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9gyya",
   "message": "“I feel bad for giving you cash for some reason so here’s a way worse version of it”",
   "created_utc": 1690213974,
   "score": 9,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9jxjs",
   "message": "I utterly despise gift cards. They're usually for some restaurant I don't like, or some store that's not in my area. And there's never a way to spend the exact amount on the card so it's money wasted no matter how you dice it. \n\nThe article says most people like gift cards but I've yet to meet anyone who wants them",
   "created_utc": 1690215136,
   "score": 7,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jta3aps",
   "message": "Lol I treat gift cards like money, what's going on in America",
   "created_utc": 1690222798,
   "score": 4,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jta6z8e",
   "message": "Who are these people? I either use them immediately or save it for a rainy day, but never just forget about them.",
   "created_utc": 1690224268,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jtb90s0",
   "message": "Not to pay myself on the back but a while back a neighbor's house burned down and she's a single mom with three kids and her mother on oxygen who lives with her. Everyone made it out safe but they lost pretty much everything. Another neighbor took up a collection for them for clothes and money. I have a whole drawer of gift cards I have acquired for years including some gifts from other professionals in my field so I just gave them away. I knew it was a good chunk of change but I never summed it up. Turns out it was like $1500. Whatever I could have bought would have never made me as satisfied as helping that poor family.",
   "created_utc": 1690239278,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9lf0a",
   "message": "It's part of our culture to basically gift everyone and their mother something a dozen times a year for every possible occasion/reason.  Half the time it's so pointless and frequent that a gift card is just the default so you can check the box and move on.",
   "created_utc": 1690215710,
   "score": 7,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9p7ko",
   "message": "I feel like gift cards aren't difficult at all but people make them out to be. The vast majority of stores you can use their in house gift cards even If there is a random small amount in them like 2 bucks. Itll just take that off your bill. For the American express ones a lot of places registers know what to subtract. If not call the number, get the balance and write It down.",
   "created_utc": 1690217164,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9vwqw",
   "message": "Luckily in maine at least, gift cards can't expire.",
   "created_utc": 1690219741,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jta2t9f",
   "message": "Had some old paper certificates for admission at AMC Theater obtained circa 2015.  Tried to use them a few weeks ago and they’re like “nah, we don’t accept those anymore.”   \nThey gave me a corporate contact, but have yet to hear anything.   So I guess I’ve just donated ~$50 to AMC.",
   "created_utc": 1690222588,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jta2ugu",
   "message": "I HATE gift cards. Unless it's one of those prepaid Visa cards or something like that, they literally have no purpose whatsoever. When you buy one your literally just taking your money and making it to wear it can only be spent at one place. What's the point of that? Just give the person cash instead at that point. Who's the idiot that came up with this?",
   "created_utc": 1690222607,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jtabgrp",
   "message": "How much of that number is that last $1.87 stuck on the card for all time?",
   "created_utc": 1690226002,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jtabvwz",
   "message": "I guess I'm in the weird sliver of the pie chart of people that actually use them within days of getting them.",
   "created_utc": 1690226164,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jtbnarm",
   "message": "and this is why companies love gift cards…",
   "created_utc": 1690245515,
   "score": 3,
   "submission_id": "158bjj4"
  },
  {
   "comment_id": "jt9evey",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158bjj4"
  }
 ]
}