{
 "submission_id": "158lp0m",
 "title": "TIL: Every year, about 30,000 people in the US lose a finger. The two most common causes: doors and power tools.",
 "selftext": "",
 "created_utc": 1690229731,
 "permalink": "/r/todayilearned/comments/158lp0m/til_every_year_about_30000_people_in_the_us_lose/",
 "score": 76,
 "url": "https://www.ishn.com/articles/105783-how-to-avoid-the-most-common-finger-loss-accidents",
 "comments": [
  {
   "comment_id": "jtamp7b",
   "message": "Everyone I know who's missing a finger (or more) lost them to power tools. Two shop teachers, two tradesmen and one cousin.",
   "created_utc": 1690230318,
   "score": 120,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtautg8",
   "message": "Doesn't anybody do it the old fashioned way by losing a bet and having it chopped off with a cleaver from Quentin Tarantino?",
   "created_utc": 1690233437,
   "score": 111,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtav289",
   "message": "I lost a portion of my finger In a work accident and the only cool thing about it is most people who see it immediately tell you about someone else they know who lost a finger. The most common cause from what I've heard is table saws.",
   "created_utc": 1690233532,
   "score": 86,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtaowln",
   "message": "my father lost the tip of one finger with a table saw.  he forgot everything Norm taught him about shop safey.  about a year and a half later he did the same thing and lost a finger and a half.\n\n\nblamed no one but himself as he didnt respect his tools and tried to save time",
   "created_utc": 1690231151,
   "score": 167,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtalfnm",
   "message": "Bet it wouldn't have gotten lost if it wasn't being shared between thirty thousand people",
   "created_utc": 1690229840,
   "score": 37,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtauqc1",
   "message": "Wonder where explosives comes in on that list of causes. My dad blew the ring and pinky fingers off of his right hand (good thing he's a lefty) with blasting caps, in the early 80s.\n\nWe lived on a farm, at the time, and one of the main irrigation canals was being blocked by a beaver dam. Makes it kinda hard to get water to the crops. He and my grandfather figured dynamite would be a pretty effective way to clear it out, so he got a permit, and bought supplies to blast it. Not sure if you can still do such a thing, but back then, in farm towns at least, you could just apply for a permit and go buy a box of dynamite and related supplies.\n\nGot in a bit of a hurry while prepping for the blast (never a good thing when dealing with explosives), and decided at the last minute that the punch he was using to put a hole in the dynamite sticks for the blasting caps needed a quick sharpening.  So he's standing at a bench grinder grinding the punch, with the blasting caps still in the other hand, and \\*blammo\\*. No more fingers.\n\nThey surmised a spark from the grinder must've come in contact with the blasting caps...",
   "created_utc": 1690233402,
   "score": 16,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbd7it",
   "message": "Cool, cool, cool ….eternal fear verified …. Cool, cool, cool , cool, cool, cool, cool",
   "created_utc": 1690241086,
   "score": 12,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtateo8",
   "message": "Surprised fireworks isn't a leading cause of USA finger loss.",
   "created_utc": 1690232881,
   "score": 63,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtayls9",
   "message": "The risk being higher in men aged 55+ is interesting and I wish they gave the context.\n\nOlder, so less likely to…\n- Use proper Personal Protection Equipment (gloves)?\n- Successfully undergo the procedure to reconnect the lost digit?\n- Seek immediate medical care and reduce the window of time to reattach?\n- Have well maintained/sharp tools?",
   "created_utc": 1690234937,
   "score": 31,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbg0h0",
   "message": "Random story.  I once got a text from an unknown # that read in part...\"they think they can reattach the finger and thumb, but there is nothing they can do about the tongue\"\"\nI tried to get a follow up or an update...but it was one zbd done.",
   "created_utc": 1690242313,
   "score": 7,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb2ahy",
   "message": "LPT : if you ever lose a finger in an ice rink don't preserve the detached portion with the snow from the ice rink, it is dirty and will infect the detached finger. \n\nLearned this from a story last week",
   "created_utc": 1690236425,
   "score": 6,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb8gxb",
   "message": "This is why dads evolved a defense mechanism of farting whenever one of their kids tries to pull their finger off.",
   "created_utc": 1690239043,
   "score": 8,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbyhbh",
   "message": "When I was in medical school, a trauma surgeon told a story of 2 friends who were neighbors and had a hedge between them. Tired of using  a hedge trimmer and more than a little drunk, they decided that if they could lift a push lawn mower onto the top of the hedge they could be done faster. They lifted lawn mower onto the hedge but could not start it in that position. \n\nUndeterred but still drunk, the 2 friends put the mower back on ground, started it and then both reached under the mower simultaneously with both hands. \n\nThe result was “a shower of blood and fingers” as 16 fingers flew from the mower. One guy’s wife called 911. The other wife gathered fingers in a plastic Walmart bag. \n\nAn ER nurse sorted the fingers for each proper owner. \n\nThe surgeon claimed that multiple teams operated and reattached 15 fingers. One finger was found the next day by another neighbor’s dog. It was not reattached.",
   "created_utc": 1690250702,
   "score": 7,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtapv9p",
   "message": "I seen this while scrolling and I’m not wearing my glasses so everything’s a little blurry and I misread finger as tiger for a second and I was like damn bro were losing that many tigers how is nobody talking about that",
   "created_utc": 1690231519,
   "score": 10,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtat59r",
   "message": "I nearly lost my thumb a couple years ago. Lacerated the tendon with a wood chisel. It’s not as difficult to do as you’d think.",
   "created_utc": 1690232779,
   "score": 4,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtav5go",
   "message": "But who exactly is finding those 30,000 fingers?",
   "created_utc": 1690233566,
   "score": 5,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb0018",
   "message": "I knew a foreman who used to come to the hardware counter I was at back in the day, and missing part of his index finger.  I asked, and was expecting some wild story, but he said he was strapping a load to a flatbed once and simply raised his hand to grab the strap and clipped it on the bottom of the truck frame and it was sharp enough to do the job.  Couldn't get to a hospital quickly enough to save it.  \n\nIt was that easy and unexpected.",
   "created_utc": 1690235490,
   "score": 5,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb2lt1",
   "message": "Did they follow-up with the victims and see how many became world-famous guitar players?",
   "created_utc": 1690236554,
   "score": 4,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbl86x",
   "message": "One Female SGT (US Army) had her ring caught in the back of an LMTV some 20 odd years ago and ripped it right off.  If I recall correctly, because of that incident in our unit, the SOPs made a serious change to the wearing of rings during any type of operation that includes heavy wheeled vehicles.",
   "created_utc": 1690244590,
   "score": 5,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtaxwpp",
   "message": "I once nearly lost the tip of my finger in a heavy door. It still hurts if I just lightly squeeze it all these years later.\n\nMy teacher in third grade told the story of how he lost most of his finger: he and his son were exploring some sort of quarry, and his son was throwing rocks down from the top of a rubble pile. My teacher was standing at the bottom of that mound, and apparently one of the thrown rocks ricocheted and struck him in the hand. He didn't even realize he'd been injured until he looked down and saw his finger dangling by some shredded skin.",
   "created_utc": 1690234658,
   "score": 5,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtam6yc",
   "message": "You'd think the carny folks might lose one, setting up all those metal rides",
   "created_utc": 1690230129,
   "score": 3,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbaniz",
   "message": "Chopped off tip of my finger in a power tool, BUT, they just sewed it back on at an urgent care. One nurse vomited.",
   "created_utc": 1690239975,
   "score": 3,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtavgi3",
   "message": "Not a finger!!!!",
   "created_utc": 1690233686,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb0wvg",
   "message": "[Bike chain, band saw, penalty box door.](https://youtu.be/_KLSbCtinXs?t=62)",
   "created_utc": 1690235859,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb14sw",
   "message": "\u0026lt;Grandpa voice\u0026gt; Back in my day we'd lose three fingers, a toe, and an ear every day. You young people are so lazy.",
   "created_utc": 1690235948,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb6was",
   "message": "When I worked with younger kids I had to tell one of them virtually every day not to mess around with doors — especially not the big heavy ones like schools often have. Even the ones that seem to open easy can be very heavy, and you can still get a finger through the gap on many when the pneumatic door closer drops it.\n\nKids seem to love playing \"hold the door shut from inside while another kid tries to pry their way in. I know a guy who lost his middle and ring finger playing exactly this game and have a picture that I show kids if I catch them after the first warning.\n\nMy first warning I do the removable thumb trick.",
   "created_utc": 1690238371,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbco28",
   "message": "Have cut off two fingertips working in a butcher's shop but managed to get both reattached. Separate incidents",
   "created_utc": 1690240852,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbcwn6",
   "message": "My grandpa was a logger for 50 years. No incidents. His last week before retiring he slammed his middle finger shut in his cab door and took the tip right off!",
   "created_utc": 1690240956,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbgj1l",
   "message": "Lawnmowers were mentioned in the article, and that was one thing I was told when the consumer safety board (whatever the name is) called me about my accident. \nI’d say fireworks too, but that seems mostly focused around one day in particular 🤔",
   "created_utc": 1690242539,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbhd3t",
   "message": "Almost chopped my finger off with a sliding door on a work truck. Lessons were learned.",
   "created_utc": 1690242902,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbhjps",
   "message": "My dad and my paternal grandfather are both missing part of the same finger. My dads was shut in a heavy metal door and lost the tip down to the top knuckle. My grandfathers was some sort of power tool and down to the bottom knuckle. Both on their left ring finger. I’ve always joked it’s hereditary and it’s a matter of time before I lose part of mine.",
   "created_utc": 1690242984,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbozyg",
   "message": "I read that as paper towels",
   "created_utc": 1690246312,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbq1re",
   "message": "When I was 10 or 11 I almost got my finger taken off by a car door, so I can’t say I’m entirely surprised",
   "created_utc": 1690246811,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbvzb4",
   "message": "Honest question - how do so many ppl lose their fingers to doors?? \nHurting them sure, but outright severing them?",
   "created_utc": 1690249501,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbw34m",
   "message": "I thought it would be from wedding rings",
   "created_utc": 1690249551,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbw5ub",
   "message": "My brother worked in a bakery years ago. He saw an extension cord on the floor which was a tripping hazard. He threw it over a machine \u0026amp; it caught on his wedding ring. Pulled it in \u0026amp; he lost his finger",
   "created_utc": 1690249586,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbypiv",
   "message": "i wonder if this happens in other umm, non america places.",
   "created_utc": 1690250814,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtc04m7",
   "message": "Most folk'll never lose a toe  \nBut then again, some folk'll  \nLike Cletus, the Slack-Jawed Yokel\n\nOh wait, *fingers*",
   "created_utc": 1690251520,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtaupl1",
   "message": "Most folk'll never lose a toe, but then again some folk'll!",
   "created_utc": 1690233393,
   "score": 3,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtaslf6",
   "message": "Lost two fingers to a stripper. Long, long story but a great night",
   "created_utc": 1690232564,
   "score": 3,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtarwp1",
   "message": "Third most common? Magicians and it's self-inflicted.",
   "created_utc": 1690232298,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtavg5s",
   "message": "These people have cheapened the phrase \"I can't count on one hand the number of times that...\" and I'm not going to stand for it. \n\nSigned,\nOne of the 150,000 annually who have a lower limb amputation.*\n\n*not really, still have both legs",
   "created_utc": 1690233682,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtaqrxx",
   "message": "First they came for our toilets, then for our stoves. Now for our doors.",
   "created_utc": 1690231866,
   "score": 2,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb49dy",
   "message": "those damn full auto machine doors are the most dangerous",
   "created_utc": 1690237248,
   "score": 0,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbymdf",
   "message": "Surprisingly, not fireworks/explosives",
   "created_utc": 1690250770,
   "score": 0,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtat758",
   "message": "Better then working in a meat processing place",
   "created_utc": 1690232799,
   "score": 255,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtarged",
   "message": "Also, sudden spasmodic butt clenching.",
   "created_utc": 1690232125,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtavb5p",
   "message": "So I guess I should stop throwing power saws at my bedroom door.",
   "created_utc": 1690233628,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtay6rb",
   "message": "0.01% of people every year lose a finguh",
   "created_utc": 1690234772,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtayqq0",
   "message": "Guy at work lost a finger by cleaning the extruder without the guard.",
   "created_utc": 1690234991,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtaz00h",
   "message": "The two most common causes of finger loss in the US are doors and power tools. But if you really want to lose a finger, try using a power tool to open a door.",
   "created_utc": 1690235092,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtazxv4",
   "message": "Have they checked the lost and found?",
   "created_utc": 1690235466,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb01sr",
   "message": "They still count each one by hand? Wait....",
   "created_utc": 1690235510,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb02hw",
   "message": "Add car doors to the list.",
   "created_utc": 1690235518,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb1tl6",
   "message": "i lost mine last year ,got stuck in a machine for 3 anf a half hours",
   "created_utc": 1690236229,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb33dj",
   "message": "America needs more fingers! Vote now!",
   "created_utc": 1690236758,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb542h",
   "message": "I'm sorry, doors? You're telling me i need to be 30,000 times more cautious around doors?",
   "created_utc": 1690237605,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb55aa",
   "message": "Got a used radial arm saw, got a safety kit that mentions several time in the instructions “do this and you will lose fingers”",
   "created_utc": 1690237619,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb5t6f",
   "message": "Ok well. No more doors for my family.",
   "created_utc": 1690237901,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb5yq7",
   "message": "People lose a lot of fingers to pulling down garage doors and getting them stuck in between the panels.",
   "created_utc": 1690237968,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb7des",
   "message": "There are roughly 340,000,000 Americans so, approximately 1 in 11,333? I would have expected it to be much higher honestly.",
   "created_utc": 1690238575,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb7tg0",
   "message": "Buddy of mine, somehow, exploded a white Bic in his hand, took his index finger.",
   "created_utc": 1690238763,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtb7xsb",
   "message": "Mr. Adler said \"no screwing around or you'll lose a finger or an eye\". #mr.adlerwasright",
   "created_utc": 1690238813,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbaljz",
   "message": "Doors?!? But I use doors!!",
   "created_utc": 1690239952,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbaxcm",
   "message": "My kids' great grandma stitched a couple off in an industrial sewing machine. Their grandpa lost one from some power tool. Their grandma on the other side had one chopped off with a butcher knife by her sister because she was snatching something off the cutting board.\n\nI tell them to watch themselves because it's genetic.",
   "created_utc": 1690240092,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbbc4k",
   "message": "Pretty soon, those 30,000 people will have no fingers left!",
   "created_utc": 1690240268,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbcj3a",
   "message": "**Dooooooooooors!**",
   "created_utc": 1690240792,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbcqsi",
   "message": "My profession has a elevated risk of losing a finger. In my15 years I've seen it once but heard many horror stories",
   "created_utc": 1690240885,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbdlqp",
   "message": "Lost the tip of my left ring finger to a big old wood splitter. Completely obliterated where it cut/crushed, so no putting it on ice and reattaching it. Very lucky that was all it took. \n\nSilver Lining: I can throw out a mean ass “East Side” sign with my left hand. Shit is equidistant and everything.",
   "created_utc": 1690241257,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbdn03",
   "message": "The thing i am fearful of, when using my saw, is not the cut.  I am fearful of my complete failure to change my blade to a sharp one. Ive done it twice in 10 years. 😭. Imagine your fingers running into a dull blade.  . . SHREDDED.  At least a clean slice is repairable.  So many times i put wood in and it flies passed me like a bullet. Imagine shredded fingers. Imagine looking for them in the sawdust.  Lmfo (no; lmfo is not a typo… you will figure it out)",
   "created_utc": 1690241273,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbduef",
   "message": "At least they've got 120,000 more",
   "created_utc": 1690241363,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbdvin",
   "message": "That's a fuckton of fingers.",
   "created_utc": 1690241376,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbhbls",
   "message": "Our worth is what we bring in",
   "created_utc": 1690242884,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbi0qh",
   "message": "I crushed my left index finger in a steel door and it took a couple minutes to get the door open. The tip of my finger from the first knuckle was literally flattened and the pain was horrendous. Luckily it regained its normal shape but Its now permanently numb.",
   "created_utc": 1690243194,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbi9ie",
   "message": "[Relevant documentary.](https://youtu.be/1ZQknuTAVJ0)",
   "created_utc": 1690243302,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbjbx0",
   "message": "Aw man and I work at a door factory...",
   "created_utc": 1690243767,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbjp3n",
   "message": "Had to have my index finger amputated right around the nail bed., separating two dogs. They took out the bit of nail. Took a year to fully heal. Nail grew back, but now curves down over 50% of finger.",
   "created_utc": 1690243926,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbjqkg",
   "message": "I am number three.",
   "created_utc": 1690243943,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbl2dc",
   "message": "Where’s that dude who chopped off his index finger and part of his thumb from yesterday?",
   "created_utc": 1690244519,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbly7d",
   "message": "I remember slamming a heavy wood door at an old house once and, while I was at no risk at all of losing a finger then and there, I do recall going \"Woah, I easily could have just lost a finger...\"\n\n\nDoors can be no joke.",
   "created_utc": 1690244910,
   "score": 1,
   "submission_id": "158lp0m"
  },
  {
   "comment_id": "jtbma6y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158lp0m"
  }
 ]
}