{
 "submission_id": "159n439",
 "title": "[WP] You have the ability to instantly learn someone’s native tongue through a kiss. When you share your first kiss, with someone special, you find yourself being able to speak a long forgotten language.",
 "selftext": "",
 "created_utc": 1690323713,
 "permalink": "/r/WritingPrompts/comments/159n439/wp_you_have_the_ability_to_instantly_learn/",
 "score": 14,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/159n439/wp_you_have_the_ability_to_instantly_learn/",
 "comments": [
  {
   "comment_id": "jtg1fes",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690323714,
   "score": 1,
   "submission_id": "159n439"
  },
  {
   "comment_id": "jth2kyr",
   "message": "My father believed that my boyfriend Robert was bad news. Always giving him the old stink eye whenever Rob came over for dinner despite my mom’s urging to play nice. Always had an excuse not to dine out or go to Rob’s hometown when the latter sent us an invitation.\n\nIt all started when I was a kid, and Grandpa first came over to have a reunion dinner with us. A quick peck on the cheek was how I learnt his dialect. Naturally, Grandpa was over the moon that a young child could pick up and speak the old dialect so fast, so he began to invite his birdwatching group to meet me and “teach” me their dialects. I would kiss them on the cheek and they would teach me the nuances of their dialect that I didn’t master instantly.\n\nThis unconventional mastery of dialects and languages was practically a cheat code, as I studied linguistics and worked as a freelance translator. And that’s how I met Robert.\n\nHe was part of a group of fishermen who were trying to sue a chemical production company for dumping their industrial wastes into the waters. The lawyer working pro bono to assist them engaged me to bridge the communication gap. A young dashing man in his early twenties who could manage some garbled English, Robert was chosen to be the spokesman for the fisherfolk.\n\nWhen I told him about my gift with languages, he laughed it off initially. Let me try it, it’ll make things easier if I spoke your tongue, I urged him. He insisted he was just a big dumb jock who didn’t earn himself a kiss from a pretty and smart lady like me. Eventually, he caved in, though unwilling to let me kiss anywhere on his face, so I settled for smooching the back of his rough, scaley hand.\n\nNew vocalizations that felt out of this world enveloped my mind. They felt less like words and more befuddling assortment of noises and sounds that didn't match any existing language I heard of. Not to mention the throbbing headache and the nosebleeds I was getting.\n\nRobert was apologizing profusely, wiping my nose with thick wads of tissue. Flustered and panicked, he danced around the edge when I asked him just exactly what language I picked up from him. Insisting that he would do his best to brush up on his English so as to be less reliant on me to provide translations. I assured him I didn’t mind, for the pulsing pain in my head soon went away and I felt capable of conversing with his people and providing translations.\n\nWe eventually won the case, though there were stories of their best lawyers suddenly pulling out from maddening stress, so their team was chock full of rookies. Robert took this opportunity to ask me out on a date and I agreed to be his girlfriend.\n\nSo, you see, that’s where the trouble began. That smile. That damned smile he flashed before me when I accepted.\nAt first, it was simply an onset of migraines every time we met and spoke in his language. The headache was bearable, something I dismissed as mere coincidence, too enamoured with him to see all the signs. Whereas I fell in love with how he smelt like a refreshing ocean breeze, everyone else around me had nothing about complaints of how he stank of rotting fish. Even my father’s dog wouldn’t stop barking when I first brought him home and introduced him to my family.\n\nWhat can I say, love is blind, and a powerful hypnotic force of nature. It didn’t matter to me that my friends were calling him “fishface” or “monsterboy” behind our backs, he was charming, if a little brusque at times. He made me laugh, never ever made me cry, and always had a shoulder to lean on and a listening ear to hear my woes. Caring and loving, without judging some of my less-than-stellar life choices. What more could I ask from a boyfriend?\n\nIn hindsight, perhaps I could have asked for a more normal boyfriend.\n\nIt was when he got down on one knee and proposed to me that things began to unravel. Despite my family’s protests, he was very adamant I came to live with him in his fishing town. Stubborn as a mule on how the wedding must be held at his church, to have his god officiate and bless our unholy sanctimony. His archaic words in his tongue had caused my mother to collapse, my sister to dial emergency services, and my father to yell about how wrong everything sounded.\n\n“This can’t be good news, sis,” my brother muttered as he thrust his phone to me. “Look what I found on the internet…you can’t be marrying a Deep One from Innsmouth or have his mad eldritch god Elvari oversee your wedding! Nothing good gonna come outta that!”\n\nMy father believed that my ex-boyfriend Robert was bad news. And he was, to my horror, absolutely right.",
   "created_utc": 1690340184,
   "score": 58,
   "submission_id": "159n439"
  },
  {
   "comment_id": "jtga43j",
   "message": "##Grovish\n\nLayla was an extraordinary woman in spite of how she'd tell you how average she was. Her job was an account manager at a bank where she dealt with numbers and angry customers. She called her job dull and stressful, but I still loved to listen to her talk. Her hobbies included hiking, gardening, and knitting, and grandma was the term used to describer herself. I appreciated her art.\n\nHer sense of humor consisted of horrible puns, but I still laughed at them. She was horrible with technology, but she knew to instantly google her questions. One strand of her hair always stuck out, and she tried to keep it down. I wished that she would understand that I like it. I was so lucky to have her.\n\nLayla claimed that she was lucky to have me as a partner. I was the international lawyer who spoke ten languages. To me, the law degree is the result of wasting my early twenties in years of all night study sessions and tears. The language learning was a gift, but it wasn't a conventional one.\n\nWhen I was sixteen, I had my first kiss with a Polish exchange student named Ewa. It didn't last, but I found out that I could speak fluent Polish. The next year, I kissed Marco, and I learned Portuguese from him. Throughout college and law school, I would flirt with a variety of people to learn their languages. Through this, I learned Spanish, Arabic, Mandarin Chinese, Japanese, Swahili, German, and Tagalog. \n\nKissing Layla was when I learned the most important language. We were at my place watching a conspiracy thriller from the 70s, our favorite niche genre. When I put my arm around her, she didn't move away. I moved closer, and she mirrored me. Leaning my head close to hers, we kissed for a few seconds.\n\n\"Mohwa peb,\" I said. She laughed, and my face turned red. \"I'm sorry. I don't know why I said that.\"\n\n\"It's cute,\" she said. New words flooded my brain. Grammar and syntax followed the words, but I didn't understand the language at all. It was a bizarre collection of noises and sounds that didn't match any other language. Was it an isolate? She continued to giggle next to me.\n\n\"What's so funny?\" I asked.\n\n\"You'll think I'm being ridiculous,\" she replied.\n\n\"Why?\" She must know what language it was.\n\n\"You just said, 'that was good,' in Grovish,\" she said.\n\n\"Grovish, I've never heard of it.\"\n\n\"It's a language that I made with my friends when we were kids. We lived on Grove Avenue so we called it Grovish. It's stupid really,\" she said.\n\n\"Mohwa peb,\" I repeated.\n\n\"Stop it. You're making fun of me,\" she said.\n\n\"I'm not. I think it's cool that you and your friends did something so nerdy. Can you teach me some words?\" I asked.\n\n\"Okay, we'll see how much I remember,\" she said.\n\nAfter the movie, she spent the rest of the night tutoring me. She was shocked by how quickly I learned it. I quickly reminded her that I already was a polyglot so I was good at languages. That satisfied her, and by the end of the night, I was teaching her. \n\nOver time, Grovish became our language. We kept our voices low and whispered comments and jokes for each other. It was a deep connection that no one else had.\n\nAfter two years of dating, I told her my secret. She didn't believe me at first. The next week, we were at a party, and she started a game of spin the bottle. It landed on her friend Hyun that spoke Korean so I kissed him. After, I spoke the language fluently, and she confessed that it was a test.\n\nI never kissed anyone else from that point forward. At our wedding, we gave our public vows in English, but we gave our private vows in Grovish. We might teach our kids the language if they don't inherit my ability. Either way, I was happy spending my life with her.\n\n---\n\nr/AstroRideWrites",
   "created_utc": 1690327260,
   "score": 97,
   "submission_id": "159n439"
  },
  {
   "comment_id": "jthb9d7",
   "message": "I think it was around evening that day. Sky was filled with clouds and it was raining heavily. She called me, asking if I could come pick her up. It was very unusual that she asked for my help.\n\nI married Nahila one year ago. Our marriage was arranged by our parents. I liked her though, and I thought she liked me too. That wasn't fully the case though. She would get uncomfortable even if I would try to as little as touch her hands. We were just like very good flatmates. But there didn't seem any affection between us. \n\nEvery day, she would be gone to her office before I would wake up. But there would always be freshly prepared breakfast for me. I would often leave my room unkempt before going outside myself, but it would always be neat and tidy when I returned. Whenever I would finish my favorite fruit juice, a new pack would be there in the fridge the next day. My socks would regularly be replaced with new ones. \n\nBut she would never let me do anything for her. She wouldn't eat the food i cooked for her. She wouldn't let me enter her room. She wouldn't let me wash her shoes. I would even fight with her about it sometimes, that I needed at least some affection from my partner. But she would just bow her head and listen with a guilty face, without saying anything. \n\nThat was why when she called today, to pick her up, it was very unusual. I was feeling uneasy during the whole drive. I was just praying that she was okay. I realized, during the 1 hour drive, that despite the awkwardness in our marriage, I, in fact, loved her very much.\n\nIt was night by the time I reached, and it was still raining. I was looking for Nahila everywhere. In the end I found her sitting on a public chair outside, all drenched in water. I called her name. She looked at me but didn't move. Pissed off, I went to that bench. She looked at me with tears in her eyes. \n\n---------------------part 1/3",
   "created_utc": 1690344684,
   "score": 10,
   "submission_id": "159n439"
  },
  {
   "comment_id": "jthtq6f",
   "message": "\"Living or dead?\" I asked. \n\n   \"God you are so picky. Living, this time,\" Allen said.\n\n\"Really?\" Maybe this job wouldn't be quite so bad. Corpses were the worst. Well, there's a spectrum of goodness and badness even amongst the dead. \n\n   \"Check them out, near that place with the giant ostrich out front. Can't miss it.   \n   Can you do it tomorrow?\" \n\n\"Sure.\" \n\nYeah of course I knew where that ostrich was. Ostrich Bob's was THE place. Nothing like a basket of fries piled high. Each fry was like a finger God personally carved from Russet potatoes directly from heaven. The patties were so juicy too. Even the black bean burger slathered with a spicy hummus sauce was killer. But I was there to get the job done. I approached the small window for ordering. \n\n\"Ostrich Bob, is he around?\" I asked a waitress in a white hat with the red ostrich embroidery. She looked like she knew what she was doing.\n\n   \"Who's asking?\"\n\n\"I'm Jennifer Pterodactyl.\" \n\n   \"Got it. Bob!\" She yelled through the doors of the kitchen.\n\n\"And I'll take a Spicy Black Bean Double Patty with extra sauce plus fries.\" I asked. Might as well multi-task. Too much meat recently. Gotta cut back. \n\nThen I saw Ostrich Bob. Or rather, Bob Ostrich. His eyes measured me in an instant. I was distracted by his looks. Stay on task Jennifer. Down girl. But his neck glistened a lustrous white, like the moon. His dark brown body was round and tight like a drum, telegraphing his workouts.  \n\nI swooned. Collapsed on the floor, yes I did. I started by fake falling because I suddenly felt like I needed to distract everyone...but then I actually hit my head on a chair leg and went down for the count. \n\n\"Jennifer?\" Bob's face was so close to mine. My vision was blurry. \n\n   \"What...what's going on?\" I asked.\n\n\"You fell.\" Bob said. \n\n\"Gods Almighty of the Pacific Ocean,\" he muttered under his breath. \n\n   \"What God is that?\" I asked.\n\n\"When did you learn Western Ostrich?\" \n\n   \"I didn't.\"\n\n\"Well apparently you learned it well enough to understand my curse words, and what I'm saying now.\" \n\n   \"Oh!\" I said. So he must have been the one to give me mouth-to-mouth resuscitation! He kissed me! But damn, how was I supposed to rob Ostrich Bob's now that I was in love with him? Allen was going to be so pissed.",
   "created_utc": 1690357185,
   "score": 0,
   "submission_id": "159n439"
  },
  {
   "comment_id": "jti4gri",
   "message": "**You have the ability to instantly learn someone’s native tongue through a kiss. When you share your first kiss, with someone special, you find yourself being able to speak a long forgotten language.**\n\nGrowing up, Mother always told me to save my first kiss for that special person I wanted to marry. She emphasized that a first kiss was the most intimate gesture you could give to someone. After all, it was this magical act that allowed two souls to start sharing their true selves, and potentially kindle a profound and meaningful relationship.\n\nHonestly, I never really took it to heart after seeing many of my friends kiss in high school.\n\nYet, a part of me seemed to hold onto her words.\n\nPerhaps, believing in the magic that it possessed for my parents from how their love blossomed into something romantic. At the very least, all I wished for was a wholesome moment to lose my first kiss.\n\nEventually, seasons change and university started.\n\nAnd so did the wild college parties that transcended the boundaries of races from across the world. Elves. Dwarves. And the most intriguing of all, the mysterious small Fairies from the Floating Island of Elysium.\n\nMy love life began with a seemingly innocent game of spinning the potion.\n\nThe Elves called it a special bonding experience, but to me, it felt like a whimsical twist on the classic game of spin the bottle. Our dormitory's \"mad scientist\" concocted various potions, each with a kaleidoscope of colors, scents, and flavors, all infused with a hint of hard alcohol to get us drunk. \n\nThe effects were the definition of unpredictable, ranging from momentary hallucinations to complete body transformations. Yet, amidst the craziness, everyone knew the effects would wear off in a few hours, leaving behind cherished memories of a night well spent.\n\nTonight, the blonde Elven girls from across Merlin's Hall brought along a special friend named Arella — the first fairy I had ever witnessed in person. She stood no taller than my palm, her delicate features framed by a pair of circular glasses that accentuated her cuteness.\n\nAs I looked at her, I couldn't help but be captivated by her stunningly adorable appearance. With golden hair elegantly tied in a ponytail, her skin pale and smooth, and her eyes resembling the deep hues of the ocean, she exuded an otherworldly beauty.\n\nIt was a strange feeling as I was a human crushing hard on a fairy.\n\nAs expected, Arella effortlessly made friends with everyone, becoming the center of attention at the party. Fairies were a rarity in our school, with only three known to attend our university, and they usually kept to themselves.\n\nHowever, Arella seemed to be an exception.\n\nThough she could only speak her native language of Elysium, she used magic to help translate. Her excitement was quite evident in the way her eyes sparkled as she flew around, enjoying the company and wildness that came from the diversity of races having fun.\n\nI went ahead and asked Arella if she wanted to spin the potion, to which she replied with a delighted nod. Everyone was eager to see what sort of effect was contained in the mysterious black potion due to its uncanny color and occasional bubbles.\n\nI noticed that Arella had trouble spinning the bottle due to her size.\n\n\"Need a hand?\" I offered, to which she nodded shyly.\n\nTogether, we spun the vial, and a collective cheer erupted as the potion pointed toward me. What an ironic twist of events.\n\n\"Cheers!\"\n\nEveryone encouraged me on while I lifted the vial to my lips and downed its contents in one brave gulp.\n\n*Please don't be a transformation potion.*\n\n*I don't want to be a cow for the rest of the night again.*\n\nThe taste was surprisingly fruity. It reminded me of a delightful fruit punch with a very sweet and tangy twist. However, the roughness of the alcohol hit my throat at an odd angle, throwing me into a brief coughing fit.\n\n*But what an awful aftertaste.*\n\nArella quickly flew to my aid, offering a soda as a chaser to soothe my throat from the unexpected reaction.\n\n\"T-Thank... you...\"\n\nShe nodded with a beautiful smile and patted my shoulder. But that was when I started levitating, disrupting the rather wholesome moment.\n\nMy gaze darted around the room, feeling a mix of confusion and euphoria as I hovered in mid-air.\n\n\"Yooooo... look at that potion effect.\"\n\n\"This is... incredible!\"\n\n\"No way bro! You're actually flying!\"\n\nSoon enough, the dorm erupted with enthusiastic cheers and amazement at the spectacle of a human floating. My friends were taking photos of me while I scanned around the room.\n\nMy eyes eventually met Arella's, and I could see the wonder in her expression as she flew closer, sharing in the unexpected thrill of the moment.\n\nAmidst the jubilation, someone in the room playfully shouted:\n\n\"Kiss!\"\n\nThe room quickly joined in, chanting the word with playful enthusiasm.\n\n\"Ignore those fools,\" I said to Arella, not wanting her to feel pressured or uncomfortable. \"They're just caught up in the moment. Don't need to do something you don't want to.\"\n\nInstead, she smiled back at me, her eyes shining with a hint of mischief.\n\nWith a touch of enchantment in the air, she leaned in for a quick peck, and the room erupted in cheers once more.\n\nFlushed with embarrassment, I muttered:\n\n\"That was exciting but rather embarrassing... I can't believe I just kissed a human. But it's not like I didn't find him attractive.\"\n\nSuddenly, it dawned on me — I could understand what Arella was saying in her native language of Elysium.\n\n\"That was my first kiss you know...\"\n\nHer shocked expression mirrored my own astonishment.\n\n\"You can speak Elysium?\" she asked incredulously.\n\n\"No, I don't know how...\" I replied, still trying to comprehend the situation. \"Yet, I am speaking it right now. Maybe it's the potion's effect\"\n\n\"How serendipitous!\" Arella exclaimed in amazement. \"A human speaking an ancient language so fluently that countless scholars struggle to master! Attending this so-called college party turned out to be an unexpected miracle.\"\n\nAs the realization settled in, I found myself in awe of this newfound ability. This magical connection that had woven itself between us, almost like a romantic encounter in itself.\n\nBefore I could respond back, my body crashed down onto the carpet. It seemed like the potion's effect had faded away.\n\nArella immediately flew down to check on me, her worry evident. Many of my friends followed through with concerned expressions of their own.\n\n\"Are you okay?\" the Fairy asked gently.\n\n\"I'll be fine,\" I replied, feeling the world around me spinning slightly. \"Give me a few minutes.\"\n\n\"Yo, rest on the couch for a bit,\" I heard one of my friends say. \"I'll get some water for you so stay hydrated bro.\"\n\n\"Thanks bro.\"\n\n\"All good bro, that was cool! I caught it all on video too. I'll send it to you later.\"\n\nThe next few moments were a fleeting blur while I relaxed on the comfy couch with a cold bottle of water. Laughter and conversations filled the room, but Arella stayed by my side, attentively tending to my needs. A part of me felt guilty for taking up her time.\n\n\"Thank you for taking care of me. But I'm probably out for the night. Are you sure you don't want to join the others?\"\n\n\"I've already had my share of fun,\" she stretched her petite arms into the air. \"Besides, I'm rather exhausted. Interacting with this many people is quite draining.\"\n\n\"I know that exact feeling.\"\n\n\"I suppose we're both introverts.\"\n\nFlying closely next to me, Arella's expression turned serious, and she spoke with an unusual determination.\n\n\"I have a favor to ask you,\" she said, her voice unwavering. \"Even now, I am puzzled by how you can speak my language so fluently. But I am a believer of fate, and I can't help but feel that this is no coincidence. Speaking Elysium means you have the potential to be a magician.\"\n\nThat was when she flew in close to my face and asked:\n\n\"Starting tomorrow, will you allow me to teach you magic?\"\n\nHer request caught me completely off guard, yet I couldn't help but feel excitement at the thought of learning magic with this extraordinarily cute fairy.\n\nLittle did I know, that an unexpected journey of love and tragedy awaited me.",
   "created_utc": 1690365616,
   "score": 1,
   "submission_id": "159n439"
  }
 ]
}