{
 "submission_id": "159wjh5",
 "title": "[WP] Everyone on Earth wakes up with a number on their wrist indicating how many lives they've impacted. You, an unremarkable person working a mundane job, have a number exponentially higher than anyone else",
 "selftext": "",
 "created_utc": 1690349181,
 "permalink": "/r/WritingPrompts/comments/159wjh5/wp_everyone_on_earth_wakes_up_with_a_number_on/",
 "score": 200,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/159wjh5/wp_everyone_on_earth_wakes_up_with_a_number_on/",
 "comments": [
  {
   "comment_id": "jthiovo",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690349181,
   "score": 1,
   "submission_id": "159wjh5"
  },
  {
   "comment_id": "jthm2qp",
   "message": "The night that upended the world. Mostly, just the entertainment world. It took a few months for the right minds to get theories up, and then a year or two to confirm said theories. How many people’s you’ve significantly affected, for good or ill, suddenly shows up on people’s wrists. A blue, undulating ichor shifts slowly, live, as we change others.\n\nCelebrities were born as those with huge numbers can boast and make their own shows. \n\n“How to make a positive impact on the World.” \n“The trends of a Philantropist.”\n“From Doubles to Triples and Beyond!”\n\nEven in this cafe in the middle of the town, the TV shows the current “Impact” celebrities. My coffee is nice and my company is friendly enough. If a bit chatty. Ed has always talked a lot. Great at keeping secrets. Just bad at not shutting up about everything else. Today was quiet so he was nagging me about his favourite private topic at hand.\n\n“Still don’t get it. Doesn’t make sense. Numbers in the hundreds of millions. You know the current record is just shy of ten thousand. Think about that. You are several orders of magnitude away from the current world record. Doesn’t make sense. How did you do it?”\n\nI shrug as I always do in these conversations. He means well. I also answer as I do every time.\n\n“I do like that good deed a day thing. Could be the reason why.”\n\nHe doesn’t buy it.\n\n“One good deed a day. Even if you did it for your entire life. That’s what, ten thousand? Might give the record holder a run for their money. Wouldn’t come close to what you have. Come on man. Tell me. How did you it?”\n\nThen he starts with his theories and speculations while probing me.\n\n“Stop a nuke from blowing up? Must have been something like that right? No, maybe? Your an office clerk that puts away files that nobody reads, what, maybe once in a blue moon? Seriously, how did you it?”\n\nThe bacon and eggs are particularly good today. The TV is now showing a list of celebrities with either three or even four digit numbers.\n\n“I’d say maybe you’re some secret writer for millions of fans.” He looks at the TV. “Then again, fame doesn’t seem to count in these numbers.” He rubs his wrist. \n\nPersonally, I don’t see the issue. Ed is in the high doubles at just a bit of over twenty. Maybe I shouldn’t have shown him mine. It making him self-conscious.\n\n“Hold on, I think I’ve got it. Secret spy that somehow thwarted World War. That’s why you have that boring pointless office job right? Have the mundane office worker disappear from the job nobody notices isn’t being done?”\n\nI sip my coffee. They’re using a new blend this time. It’s slightly more bitter. I prefer the original from the cafe’s founder.\n\n“Then again, you barely leave the city. Don’t get it. Normal exercise, diet. Nothing special about your hobbies. Nothing I can tell. Good deed a day and... That’s it. Doesn’t make sense.”\n\nAs the celebrities show up on screen, one in particular is shown on screen. A four digit celebrity a few spots behind the record holder and the oldest among the Fours as they call them. I recognize an unusual  mole on his left cheek and become slightly surprised. I whisper.\n\n“Boy is grown up.”\n\n“Excuse me, you said something?”\n\nI realize what I said and play it off.\n\n“Nah, just... Thinking about the celebrities and what it is they do for their numbers.”\n\nHe stares. I can tell he doesn’t believe me but doesn’t push me. He gets annoying about it but knows when not to push. He’s a good friend that way.\n\n“Sure, yeah. Wonder what they do for their numbers.”",
   "created_utc": 1690351475,
   "score": 1,
   "submission_id": "159wjh5"
  },
  {
   "comment_id": "jti2uqe",
   "message": "\"How'd you do it? How'd you glitch your number so high?\"\n\n\"I..I didn't.\" I stammer at the menacing thug, known only as Nombro.\n\nThe numbers on our wrists indicate 'lives impacted' for better or, as in Nombro's, for worse.\n\n\"You know why they call me Nombro?\" I shake my head a little\n\"Because I. AM. THE. NUMBER! I have the highest known number in the world. No one even comes close. Then you waltz in, with your number zooming up by the second.\"\n\nHe holds out his wrist, then grabs mine. His numbers are a dark red, almost black. The number is impossibly high, and stable, at 14,703. Even the font oozes menace. Mine is much lighter, but clearly visible, in a more rounded font, like comic sans. Mine is constantly ticking higher. Currently at 11,545,461 and counting.\n\n\"One million five hundred thousand\"\n\nI don't point out the missed number.\n\n\"Do you know what I've done to *earn* my number? The next closest hasn't even broken 10,000. What do you do? You a doctor, nurse, researcher? Why it it still going up?\"\n\nI shake my head. \n\n\"Like you say it's a glitch. I just don't know what caused it. It was all normal until last year. I had a couple of hundred, and I was quite proud of it. When it suddenly went up, and kept going up. In answer to your question about my job, I'm only an administration assistant at a small electrical component manufacturer. We mostly do parts for the automotive industry. One of our parts is now used in most brands of cars made all around the world.\" I sense he's about to interrupt. \"BUT other than proof reading documents, I had literally nothing to do with designing, creating, or building that part. I promise, no one else will ever know about my...glitch. It's a mistake.\"\n\nNombro leans back, releasing my wrist.\n\n\"Did you ever save anyone's life?\"\n\n\"Yes... Well sort of. A guy that worked at my company, he... I stopped him from jumping off the roof... the first time.... not the second. And\" I added hopefully \"I'm a blood donor. That might of saved a few lives, but the rest is a glitch. I'll be more careful about covering it with make up or my watch band.\"\n\n\"Or\" Nombro said as he played with a hunting knife, twirling it casually in his fingers\n\"I could kill you, resume my title as *THE* number\"\n\n\"Sure, sure\" I said. Thinking quickly and trying to suppress my panic. \"What if it's not a glitch? What if eleven million people descend on you to seek revenge. My number has a positive glow, a positive impact. So sure, you could kill me and hope that it's all fine, but even if ten per cent of *my people* that I've 'greatly impacted' come to find you, you're done for. Or, perhaps I could be a great ally to you, but you can have the glory of the title. \"\n\nNombro weighed up the options, and I hoped that that the next person I positively impacted would be him.",
   "created_utc": 1690364379,
   "score": 1,
   "submission_id": "159wjh5"
  },
  {
   "comment_id": "jti28tu",
   "message": "When the phenomenon occurred, it was met with worldwide confusion. Each individual, young and old, awoke with a glowing number imprinted on their wrist. As the pattern became clear - the numbers represented the count of lives each person had impacted - shockwaves reverberated through societies. \n\nMost bore numbers that ranged from a few hundreds to thousands. Celebrities and leaders had tallies reaching into the millions. Then, there was me, Jake, a routine city sanitation worker with an inexplicable number that dwarfed them all: 987,654,321.\n\nThe media frenzy that ensued was overwhelming. Overnight, I found myself in a blinding spotlight, under a microscope for the world to dissect. Why me? What had I done to earn such a high score?\n\nAs weeks passed, my number only grew while others plateaued. The public intrigue turned into suspicion and fear. Was I a messiah or a monster in disguise?\n\nThen came the day when my number soared to 7,654,321,098, surpassing the total human population. The global reaction was one of hysteria and terror.\n\nThat night, a strange figure approached me, revealing himself as an envoy from an alien civilization known as the Zephyrites. He explained that my mundane job had unexpected implications. The waste I had been sorting and disposing contained residues of human creativity and culture - traces of paints, writings, electronics, music instruments, books - which had been unknowingly transmitted to their civilization via quantum particles.\n\nTo the Zephyrites, our waste wasn't refuse, but a treasure trove of knowledge that had catalyzed a technological revolution in their society. The discarded remnants of our civilization had propelled theirs forward in ways they could never have imagined.\n\nBut the rapidly increasing number and the sudden visitation didn't herald a time of unity or celebration. Instead, it revealed a chilling truth. The Zephyrites had exploited the knowledge they gained, not for peace or prosperity, but for power. They had built weapons and technologies that now posed a threat to Earth. The number on my wrist wasn't just a measure of impact; it was a ticking clock, a silent countdown to the impending doom of our world.\n\nThe fame that once felt exhilarating now weighed heavy on my heart. I was not a savior, but an inadvertent betrayer of my own kind. My simple actions, my regular job, had pushed humanity to the brink of subservience to an alien civilization. As Earth prepared for an uncertain future, I had to live with the knowledge that I had unknowingly played a part in its downfall.",
   "created_utc": 1690363900,
   "score": 1,
   "submission_id": "159wjh5"
  }
 ]
}