{
 "submission_id": "15awf5h",
 "title": "[PI] As a psychic interrogator you've seen many people do many things to resist you reading their mind. Some use pain, some try to Marshall their thoughts, some even repeat a word or mantra ad nauseam. For the first time you're shocked at how someone did it.",
 "selftext": "Link to the original prompt [here.](https://www.reddit.com/r/WritingPrompts/comments/s3ski0/wp_as_a_psychic_interrogator_youve_seen_many/) \n\nThe coin toss. Where did that one originate from?\n\nJess couldn't remember ever reading or hearing about it. Yet suspects often resorted to this method, despite no memory in their little heads of a show or book advising them to use the trick.\n\nNope. Somehow, suspects started to imagine a coin falling on a pile of coins. And another, and another. *Plink, plink, plink.* Not that it helped them, Jess was way too good at her art to be disturbed by such a basic attempt at deflection.\n\nBut it raised questions about human nature. How come people who've never met and without a common background fell back onto the same defense mechanism when pushed? Psychiatrists would have a field day with this one.\n\nOf course, there was also the matter of Jess' own head. After dwelling so long in foreign memories, she was unsure how much of what cluttered her head truly belonged to her. \n\n\"He threw the bag in the river,\" she said.\n\nThere, job done.\n\nClive escorted the crying suspect away. Having your mind prodded was never a nice experience, Jess made it fast to minimize the suffering. Sometimes, it left life-long sequels. Your cocoon, your innermost sanctuary, the one place where you could think freely in complete seclusion for a lifetime suddenly violated by a pair of prying eyes.\n\nNeeds must.\n\nIt didn't make Jess feel any better.\n\n\"We have another one for you,\" said Clive.\n\n\"What now? It's supposed to be one a day.\"\n\n\"It's about *that* case.\"\n\nAh yes, the enigma. Four death in a coffee, a high number of witnesses, yet despite informants, detectives, officers and Jess with her peculiar skills, they were no closer to catching the killer. The news were having a blast pointing out police incompetence; the case had gotten the entire department on edge over several weeks.\n\n\"He's a witness. Not of the killing itself, he stood outside. But he was in the middle of the street the killer had to take. I doubt he did it, but you never know. There's gotta be something of value in that brain. He claims he was daydreaming and didn't notice what happened.\"\n\nShe didn't like those. They weren't criminals, just happened to be in the wrong place at the wrong time.\n\nSalim sat across the table, waiting.\n\n\"Did you understand what I said?\" asked Jess.\n\n\"Yes,\" replied Salim.\n\nStrange. Usually, people were biting their teeth and bracing for impact before she did her thing. Salim was neutral, awaiting, the same way one waits for the dentist to finish their work.\n\nShe closed her eyes.\n\nA single white blink in the darkness of her eyes. Her own presence, shifting and moving towards the rumbling black mass of an unknown consciousness.\n\n*In and out, fast and efficient, come on Je...*\n\nA tendril, a snare. This mind didn't try to block her intrusion.\n\nIt absorbed her.\n\nAnd threw her into a hurricane.\n\nA lone castle, a pile of corpses in the courtyard. She was thrown into the stars, into a sun, to a house bigger on the inside where inhabitants shaped their flesh beyond the human and saw it as art. Jess hadn't stepped her blurry foot on the shifting ground that she was ripped away to a world about to collide with another, herself in the middle, music blaring in a cacophony of electric guitar and bells.\n\n\"Make it stop!\" she screamed.\n\nAround her, the same lone castle with its pile of corpses, slightly higher, with the walls a different tone of color. The two worlds still threatened to crush her in an instant.\n\n\"You're about to kill me, please stop it!\"\n\n\"Stop what?\"\n\nThe question came with a dull voice from everywhere at once. She was alone now, no worlds or castle, only the feeling that many eyes were on her, that she was the center of attention of the sanctuary that was Salim's mind.\n\n\"Let me leave,\" she begged.\n\nWhite smoke formed into two arms. They shrugged.\n\n\"Miss, I'm not doing a thing here.\"\n\nJess stood in Salim's mind, aghast, unsure. Far away, a hurricane of thoughts was forming and growing fast, more violent and feral than the last one.\n\nHer eyes closed, on her head and in her mind.\n\nThe white dot jumped out of the bubbling, melting mass, and returned to the calm pastures of her psyche.\n\nJess was sweating on her chair. Salim was still waiting.\n\n\"You okay?\" he asked.\n\n\"You tried to kill me.\"\n\n\"What? No!\"\n\nShe left the room and splashed her face with cold water in the toilet. This one was a first. She was the invader, the dreaded intruder. But Salim's head had no fear. In fact, he didn't give a damn about her presence or not, it was like an overactive child constantly...\n\nJess returned to the room.\n\n\"What are you thinking about?\"\n\n\"Nothing,\" replied Salim with a frown.\n\n\"The better you answer, the faster you're out. What's with the castle and the corpse.\"\n\n\"Okay, okay. I played a video game with a lone wanderer storming the place, I like the way it was drawn and portrayed. I've been playing with the idea and twisting it every time I revisit the scenario.\"\n\n\"You switched to two worlds about to crush me. That's a murder attempt.\"\n\n\"I didn't even know you were already there!\"\n\n\"You always jump from one thought to another so fast?\"\n\n\"Yes.\"\n\nJess reflected for a minute.\n\n\"What music is playing?\"\n\n\"All of them. None of them.\"\n\n\"Can you switch it off?\"\n\n\"I couldn't, even if I wanted to,\" Salim suddenly looked very tired. \"Do you know how tiring it is? It always changes, you never have a moment of peace inside your head, always a music, always a scenario, always a picture growing, forming. It's tiring.\"\n\nJess left the room, found Clive with a file in his hands. He handed it over.\n\nIt was a psychological evaluation of Salim. How Clive had gotten his hands on someone's medical file when it wasn't supposed to be allowed was anyone's guess. He did that often.\n\nIt appeared Salim's claim had some truth to it. Therapists described him as wholly unable to focus on a single problem for long, he either got lost in unrelated thoughts, or had those thoughts running concurrently while working his task on auto-pilot. He could walk from point A to B and never leave the confine of his imagination. No matter when and where, he was assailed by intrusive thoughts all the time. The diagnostic was clear: maladaptive daydreaming.\n\n\"Nothing,\" she said, \"and I'm not trying it again. He nearly murdered me.\"\n\nClive tilted his head to the side.\n\n\"Don't give me that look Clive, you don't know what it's like to be in there. To be in the head of others. I have to read a list every morning to check which thoughts belong to me and which don't. I can't remember writing it. I can't do this anymore.\"\n\n\"Just once. We solve that, and your name is going down as one of the best investigator we ever had and your retirement fund is secured.\"\n\n\"What about my sanity?\"\n\n\"Just once.\"\n\nHis last word hung in the air like a blade awaiting sentencing.\n\nJess sighed. A part of her remembered herself as a much tougher nut to crack. Perhaps she had change, perhaps how she saw herself wasn't hers.\n\n\"Salim. I will ask you to focus.\"\n\n\"Okay.\"\n\n\"Not for long. Try to clear your head, as hard as it is. Just a minute or two, I won't dwell in your head much longer.\"\n\n\"Sure.\"\n\nShe heard nothing but an earnest desire to help in his voice.\n\n\"But warn me when it comes back,\" she added before taking the dive, a single white dot into an unknown sea.\n\nA world of mud. Each steps she took in his mind required effort, just as it took effort from him to keep the world solid. Buildings dripped substance, the sun bled in the sky, colors were washed away and dulling.\n\nClose, she was so close. She found the corner where the coffee was, where the murder happened. She pinpointed the day Salim took a stroll.\n\n\"Officer, I can't...\"\n\nThere was a rumble on the horizon, a wall of thought and mayhem advancing like a tsunami, devouring the city.\n\nShe heard the murders happening, each shot provoked an earthquake, the street was broken, pieces flying high and hanging in the air.\n\n\"I can't...\"\n\nA shape, forming, slithering out of a broken window, she could make it out, she could make it out...\n\n\"GET OUT!\"\n\nThe shape was devoured by the wall, a universe of randomness coming right for her, Jess could only close her eyes.\n\nShe awoke, nurses standing over her and a man holding her hand.\n\n\"Hey Jess, it's me, Clive.\" he said.\n\n\"Who's Clive?\" she replied.\n\n\"We're friends, and co-workers. You do recognize me, don't you?\"\n\nShe looked puzzled. \n\n\"Try... try to focus,\" said the man called Clive, who was struggling to keep an even voice, \"try to remember.\"\n\n\"I remember music. There's lots of music playing. All of them. None of them. I can't switch it off. It's tiring.\"\n\nShe was lost in thoughts, found it hard to stay in the present.\n\n\"What did you say my name was?\" she asked after a while.\n\nThe man called Clive sighed and lowered his head in shame.",
 "created_utc": 1690447657,
 "permalink": "/r/WritingPrompts/comments/15awf5h/pi_as_a_psychic_interrogator_youve_seen_many/",
 "score": 24,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15awf5h/pi_as_a_psychic_interrogator_youve_seen_many/",
 "comments": [
  {
   "comment_id": "jtn15i4",
   "message": "**Welcome to the Post!** This is a [\\[PI\\] Prompt Inspired](https://www.reddit.com/r/WritingPrompts/wiki/how_to_tag_prompts#wiki_pi.3A_prompt_inspired) post which means it's a response to a prompt here on /r/WritingPrompts or /r/promptoftheday.  \n\n**Reminder**:\n\n\u0026gt;[Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback provided in the comments.\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690447657,
   "score": 1,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtn2e9k",
   "message": "This is beautiful.\n\nThis reminds me a bit of that movie with mark strong where he is a memory investigator. Totally different plotline of course. There the target is revealed to be malicious in the end.",
   "created_utc": 1690448650,
   "score": 120,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtnxgqc",
   "message": "So Salim wasn't the murderer? Just a very addle brained civilian and she ended up being overwhelmed by his condition, falling victim to it as well?\n\ntbh I thought Salim had a subconscious personality that was the murderer, that transferred itself to her or something. Great story either way wordsmith!",
   "created_utc": 1690466414,
   "score": 71,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtnvnnr",
   "message": "Screw Clive. This is a god tier story.",
   "created_utc": 1690465669,
   "score": 25,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtnvw8m",
   "message": "I'm reminded of the bit in Mercedes Lackey's *Chrome Circle*, where Tannim uses the entire discography of They Might Be Giants to do this to a group of psychics. The theory was that the nonsensical nature of the band's lyrics made it impossible to sing along to without devoting a considerable amount of conscious thought to them, meaning his (and their) minds would be too preoccupied with thinking about the lyrics to do much of anything else.",
   "created_utc": 1690465768,
   "score": 19,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtn48d9",
   "message": "Really good one! I liked it a lot! Love the end as well.",
   "created_utc": 1690450108,
   "score": 7,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jto5pw8",
   "message": "There are parts of that which made me go 'oh, he has ADHD?', but other parts which are...  Different enough from my own mind.",
   "created_utc": 1690469647,
   "score": 8,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtn9v9j",
   "message": "Scary good",
   "created_utc": 1690454304,
   "score": 9,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtpbhmf",
   "message": "Ok...so Jess ends up exactly the same as Salim...was he also a psychic at some point? I know that it says he has maladaptive daydreaming, but wouldn't her diagnosis be the same at the end of the story? \n\nI really wanna know about the rest of the psychics in this world...have they built a defense against this type of thing? Could a group together reset and calm Salim's/Jess's minds? Is this the inevitable result of having psychic powers? Are psychic children warned not to use their powers so as to avoid this fate? \n\nThanks for the story, I really enjoyed it!!",
   "created_utc": 1690485188,
   "score": 6,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jto5b33",
   "message": "The Cell vibes for sure :)",
   "created_utc": 1690469492,
   "score": 3,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jto86ni",
   "message": "The Demolished Man? If not then I recommend it.",
   "created_utc": 1690470585,
   "score": 3,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtodjh6",
   "message": "Would love to read the continuation of this story. Does Jess recover? What about Salim? Will the murderer be caught? Very good read!",
   "created_utc": 1690472586,
   "score": 3,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtov5tk",
   "message": "I had a thought of a psychically interrogated PTSD sufferer deliberately triggering a flashback, and the interrogator being sucked into whatever hellscape traumatized his victim, bombarded with graphic images of nuclear warfare, genocide or something.",
   "created_utc": 1690479031,
   "score": 6,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtoba04",
   "message": "Clever!",
   "created_utc": 1690471745,
   "score": 1,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtphiuy",
   "message": "Clive is such a boot lmao",
   "created_utc": 1690487458,
   "score": 1,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtphqpt",
   "message": "\r  \nwonderful, perfect, it was very good OP\n\n\u0026amp;#x200B;\n\nThe constant storm in Salim's mind reminds me of unmedicated ADHD, that must be what gave me a familiarity, very good 10/10",
   "created_utc": 1690487540,
   "score": 2,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtqmi2j",
   "message": "\"How am I supposed to do this???\"  Charlie just kept imagining himself having sex with the psychic.",
   "created_utc": 1690503769,
   "score": 2,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtqtx9x",
   "message": "This, my friend, is a really outstanding one. I loved every word of it. What a ride!",
   "created_utc": 1690507143,
   "score": 2,
   "submission_id": "15awf5h"
  },
  {
   "comment_id": "jtrx44e",
   "message": "Haha, thanks! Glad you enjoyed it. Yeah, it's like a quirky psychic version of that movie! 😄",
   "created_utc": 1690529477,
   "score": 1,
   "submission_id": "15awf5h"
  }
 ]
}