{
 "submission_id": "15b5waq",
 "title": "[WP] There are five types of Genies. Blue Genies give you what you want, not what you asked for. Green Genies give you what you asked for, not what you want. Yellow Genies grant wishes in random ways. Black Genies demand something in return for a wish. Red Genies twist wishes into something harmful.",
 "selftext": "",
 "created_utc": 1690474123,
 "permalink": "/r/WritingPrompts/comments/15b5waq/wp_there_are_five_types_of_genies_blue_genies/",
 "score": 45,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15b5waq/wp_there_are_five_types_of_genies_blue_genies/",
 "comments": [
  {
   "comment_id": "jtohq15",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690474124,
   "score": 1,
   "submission_id": "15b5waq"
  },
  {
   "comment_id": "jtrkfuy",
   "message": "I'd found him. I knew I had when the velvety tendrils of chill crept over my skin, though I stood at the bottom of a muggy basement stairwell in Jackson Mississippi. This soon after sunset, the cracked concrete still steaming around me, I should've been sweltering. But the closed windowless door in front of me couldn't totally contain the profound iciness behind it and it leaked out, saturating the air.\n\n\u0026amp;nbsp;\n\nHe was in there. The black genie. \n\n\u0026amp;nbsp;\n\nI know what you're thinking. The blue genie is the one everyone tries to find. Blues are the most sought after, because no matter what you ask for, you get what you want. No contest, right?\n\n\u0026amp;nbsp;\n\nThat's what I thought until I actually found a blue genie. Lazy degenerate , he was wasting away on some tiny remote island in the Pacific. I'd made my wish rather flippantly, knowing my exact words didn't matter, and that bastard gave me exactly what I wanted.\n\n\u0026amp;nbsp;\n\nI just didn't realize you could want something without knowing it. \n\n\u0026amp;nbsp;\n\nHe gave me a yellow genie. Idiot. Sent me straight to the most damp, humid rainforest in the world, of course in the middle of a torrential downpour. What I hate even more, though, is that I've enjoyed every minute of this stupid runaround. \n\n\u0026amp;nbsp;\n\nI've planned it out, every little piece.\n\n\u0026amp;nbsp;\n\nIn the Amazon I'd known I was in for some dodgy wish-granting. Horribly fickle fiends, yellows. Especially this one, obsessed with her looks and the latest fashion like she was some Parisian snob. Her whole body was pockmarked and soaking up the rain like a yellow sponge, for crimini! Some people just refuse to see the truth.\n\n\u0026amp;nbsp;\n\nSo, not messing around, I'd succinctly asked to trade her for a green genie.\n\n\u0026amp;nbsp;\n\nOf course, whimsy miss scotchbrite had let me wait a good seven years before the trade was completed. Seven years, the same amount of time it had taken me to find the blue genie. The wench!\n\n\u0026amp;nbsp;\n\nI took a deep, relishing breath of the cold around me, thick as ink. Fourteen years, six continents, and three genies later, here I was. Finally. \n\n\u0026amp;nbsp;\n\nThe black genie who had cursed me. \n\n\u0026amp;nbsp;\n\nFor fourteen years I had to travel around in this disgusting , humiliating way. Purposeless, unable to return home. \n\n\u0026amp;nbsp;\n\nAnd now I was here to get my revenge.\n\n\u0026amp;nbsp;\n\nHe must have been expecting me, because when I turned the flecked metal knob it let me in without protest. The basement was dark and cold, freezing, like a giant refrigerator. I smiled, enjoying the harsh contrast from the Jackson sun.\n\n\u0026amp;nbsp;\n\nDeep vibrations rumbled the walls, and I stepped further inside. His snores were deceptively soothing. He was well aware of my presence.\n\n\u0026amp;nbsp;\n\nA moment later his booming voice confirmed this, echoing through the darkness. \"Why do you seek me out?\"\n\n\u0026amp;nbsp;\n\nI smiled. \"I am here to make a wish.\"\n\n\u0026amp;nbsp;\n\nAnother rumble, a creaking groan, a monster stirring from sleep. \"One wish. You have one chance to ask for your deepest desire,\" he growled. \n\n\u0026amp;nbsp;\n\nBlah blah blah. As if I didn't know the rules.\n\n\u0026amp;nbsp;\n\n\"But in return you must grant me a demand of my own.\"\n\n\u0026amp;nbsp;\n\n\"Understood,\" I said, my voice smooth and silky. This was exactly why the blue genie hadn't done it himself.\n\n\u0026amp;nbsp;\n\n\"Very well,\" he rumbled. \"What is your wish?\"\n\n\u0026amp;nbsp;\n\n\"I wish to be restored to my true form.\"\n\n\u0026amp;nbsp;\n\nWind hissed through the basement, the black genie's huge inhale moving every particle of air. Then he was silent for a long, long time.\n\n\u0026amp;nbsp; \n\nSurely he hadn't recognized me when I came in, changed as I was since he cursed me. But now... Now he must realize his mistake.\n\n\u0026amp;nbsp;\n\nAt last he spoke. \"Then this is what I require in exchange. You will forget who I am, that I ever existed, what I ever did to you. Your memories of anything to do with me will be erased forever.\"\n\n\u0026amp;nbsp;\n\nAs he spoke the last word I felt the weakness I'd been bound to dissipate, my true form returning. I laughed freely as my human skin shed from my body and I grew ethereal, malleable once again. My cackling grew louder, and as hot as my smoky red form. I circled him, expanding, ascending.\n\n\u0026amp;nbsp;\n\n\"Then this is goodbye...forever.\" I grinned with my entire being. \"Enjoy the heat.\" \n\n\u0026amp;nbsp;\n\nEven as I began to forget, the decades of memories slipping away, I used my newly restored power to send the basement up in flames. Scorching heat a thousand times hotter than the Phoenix sun. An eternal flame that would never move and never be extinguished, tormenting a black genie that could never die. \n\n\u0026amp;nbsp;\n\nIn a hundred million years, perhaps I might have become bored enough, or even been tinged by a speck of mercy, to bring it to an end. \n\n\u0026amp;nbsp;\n\nBut not now. I would never remember.",
   "created_utc": 1690520693,
   "score": 1,
   "submission_id": "15b5waq"
  }
 ]
}