{
 "submission_id": "15b72ft",
 "title": "[WP] You wish to become the most powerful sorcerer in the world! That… is a much lower bar than what you were expecting.",
 "selftext": "",
 "created_utc": 1690476945,
 "permalink": "/r/WritingPrompts/comments/15b72ft/wp_you_wish_to_become_the_most_powerful_sorcerer/",
 "score": 38,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15b72ft/wp_you_wish_to_become_the_most_powerful_sorcerer/",
 "comments": [
  {
   "comment_id": "jtopf25",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690476945,
   "score": 1,
   "submission_id": "15b72ft"
  },
  {
   "comment_id": "jtpbnt1",
   "message": "Competition flowed in my blood. Hell, I had to compete with millions of sperm to be born. I had to compete with the 20 babies born in the same hospital to get more attention from the nurses. I had to compete with everyone in my year to be the best student. \n\nYou get my point. I compete. I like being the best. I like people telling me how talented I am and how my parents must be so proud of having a child like me. They are proud, but not prouder than I am of myself. \n\nNow it just seems like I am boasting. I am not. I am just that good. \n\nThat is why when I set my sights on becoming the most powerful sorcerer in the world, I start working hard. Every waking moment of my day is spent studying and practicing magic. Even when I am sleeping I dream about the mistakes I made or what new spell I could create. My dreams soared higher than the ionosphere where they disintegrated into their basic forms. Ionised by the will of my dreams. \n\nI create my first spell when I am in the third year of Sorcery School. They crown me the greatest sorcerer this generation will ever see. I am not surprised. I worked hard, but my only complaint is that they hand out titles too soon. I mean I have only created one spell about folding socks. It's not much. \n\nBut then there's always the title of sorcerer supreme. The most powerful sorcerer in the world. I will have to excel at everything for that. Work hard. Spend countless days researching. Find new cures, new curses, new defenses, the possibilities were endless!\n\nAll it took was a bunny to jump out of my hat to grant me that title. \n\nMy day was ruined and my disappointment was great. \n\nAll that hard work planned, all that lovely competition to look forward to came to a crashing stop. This was way too easy. Life didn't come this easy. \n\nThe sorcerers needed to raise the bar! \n\nI will do that but side by side I need to look for a new field to excel in. \n\nBeing *the* villain sounds interesting. Maybe I'll look into that. \n\n*\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690485254,
   "score": 5,
   "submission_id": "15b72ft"
  }
 ]
}