{
 "submission_id": "15b72ft",
 "title": "[WP] You wish to become the most powerful sorcerer in the world! That… is a much lower bar than what you were expecting.",
 "selftext": "",
 "created_utc": 1690476945,
 "permalink": "/r/WritingPrompts/comments/15b72ft/wp_you_wish_to_become_the_most_powerful_sorcerer/",
 "score": 37,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15b72ft/wp_you_wish_to_become_the_most_powerful_sorcerer/",
 "comments": [
  {
   "comment_id": "jtopf25",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690476945,
   "score": 1,
   "submission_id": "15b72ft"
  },
  {
   "comment_id": "jtpbnt1",
   "message": "Competition flowed in my blood. Hell, I had to compete with millions of sperm to be born. I had to compete with the 20 babies born in the same hospital to get more attention from the nurses. I had to compete with everyone in my year to be the best student. \n\nYou get my point. I compete. I like being the best. I like people telling me how talented I am and how my parents must be so proud of having a child like me. They are proud, but not prouder than I am of myself. \n\nNow it just seems like I am boasting. I am not. I am just that good. \n\nThat is why when I set my sights on becoming the most powerful sorcerer in the world, I start working hard. Every waking moment of my day is spent studying and practicing magic. Even when I am sleeping I dream about the mistakes I made or what new spell I could create. My dreams soared higher than the ionosphere where they disintegrated into their basic forms. Ionised by the will of my dreams. \n\nI create my first spell when I am in the third year of Sorcery School. They crown me the greatest sorcerer this generation will ever see. I am not surprised. I worked hard, but my only complaint is that they hand out titles too soon. I mean I have only created one spell about folding socks. It's not much. \n\nBut then there's always the title of sorcerer supreme. The most powerful sorcerer in the world. I will have to excel at everything for that. Work hard. Spend countless days researching. Find new cures, new curses, new defenses, the possibilities were endless!\n\nAll it took was a bunny to jump out of my hat to grant me that title. \n\nMy day was ruined and my disappointment was great. \n\nAll that hard work planned, all that lovely competition to look forward to came to a crashing stop. This was way too easy. Life didn't come this easy. \n\nThe sorcerers needed to raise the bar! \n\nI will do that but side by side I need to look for a new field to excel in. \n\nBeing *the* villain sounds interesting. Maybe I'll look into that. \n\n*\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690485254,
   "score": 6,
   "submission_id": "15b72ft"
  },
  {
   "comment_id": "jtr30s6",
   "message": "I walked briskly across the stage to accept my doctoral hood of sorcery, remembering to smile at my arcane department chair, Professor Pond. These interminable social rituals were only partially her fault, after all. It wasn’t as though she designed the education system she worked within.\r\r  \n\r  \nBut she willingly perpetuated this cycle of academic elitism that clearly favored the wealthy while essentially lying to the lower classes…\r\r  \n\r  \nI bent my knees a little to allow the short woman to better place my new hood around my neck. The audience erupted into applause the moment it was done. I determined not to let my smile waver. There were a lot more people here than usual - including the press - and I knew they were here for me.\r\r  \n\r  \nThis was a joke. A waste. But at least I could finally put this formality behind me.\r  \n\r  \nThe crowd did not stop cheering until I had walked off stage. They called me a genius, a prodigy who earned her So.D. in only one year at the most prestigious academy in the country.\r  \n\r  \nI was decent at research, that’s all. Skimming text to winnow away anything unnecessary. Mentally separating the grain from the chaff. Deep down, I still thought anyone could have done it, if they tried a bit harder.\r  \n\r  \nI got into the academy on a scholarship - the token poor kid who aced all her studies in some rural school no one's heard of. Students like me weren’t expected to go far - we had farms to get back to, right? But I figured there must be more efficient ways to feed the world. \r  \n\r  \nWe received all the class syllabi a few weeks before fall semester began. In those weeks, I found the required reading at the local library and completed the coursework. I handed everything in on day one, and requested to take the final exams early.\r  \n\r  \nFarm kids don't mess around.\r  \n\r  \nI met the sorcery department chair a few days later. Pond put me through the finals; I passed with flying colors. Impressed, she allowed me to begin the second semester - practical magic. Finally.\r  \n\r  \nWhen I returned to her office two weeks later requesting finals again, she seemed less impressed and more concerned. “Slow down,” Pond advised. “Lasting knowledge needs time to settle into your long-term memory.” She refused to test me, though she did give me a list of required reading for the remaining years of study in her department.\r  \n\r  \nI flew through the textbooks. There were only about 10 pages of useful information per 100 pages of verbosity - I copied what was relevant, and practiced the spellwork wherever I could. Speed, Agility, and Portal spells for getting between classes. Light and heat spells at night, to save on candles and firewood. Mending and transformation for my clothes. Growth and ward spells for the secret garden I maintained in the forbidden forest. Spells to remove fatigue, so I never needed to sleep again. I saved so much time and money just by utilizing magic constantly. Why wasn’t everyone doing this?\r  \n\r  \nI showed the department chair my completed studies at the end of my first semester. I reviewed my essays on arcane theory, which I had written in response to chapters in her textbooks I disagreed with. I presented my dissertation, describing enchantments used in my own garden that could vastly improve the agricultural industry. I gave her practical demonstrations of my powers - from invisibility to juggling fireballs to summoning the ghost of her own grandmother - which I knew would pass any final exams she might throw at me. \r  \n\r  \n“I am ready to graduate.” I stated the obvious.\r  \n\r  \n\"This isn't how it's done,\" she gently rejected. “You clearly lack the patience and wisdom to be a full sorcerer. Complete the years ahead of you, so you may reach your full potential.\"\r  \n\r  \nWhat a pile. I stormed out.\r  \n\r  \nMagical reproduction of anything of value for the purpose of resale is illegal, naturally. If it weren't, magic would wreak havoc on the economy. But how do you get caught? By being stupid. \r  \n\r  \nWhat happens if you *do* get caught? Fines, or prison. If you can afford some good lawyers and don’t hurt anyone important, you never have to worry about the latter possibility.\r  \n\r  \nSo if you’re doing it right, the crime overcomes the punishment.\r  \n\r  \nI was back in Pond’s office by spring, telekinetically signing a check with the fanciest phoenix-feather quill I could conjure. I willed the check across the desk to her waiting fingers, and let her read the amount. \n\nIt was enough to cover tuition and living expenses for the remaining years that I was asking to skip. \rThe money her academy would lose from the grant funding my scholarship, if they graduated me early.\r  \n\r  \nShe raised an eyebrow at me. “Where did you get this kind of cash?”\r  \n\r  \n“Magic.” I smiled while checking my glowing, color-changing nails. \r  \n\r  \nLots of little laws broken, as I was sure she could guess. But also, lots of real-world evidence that I had mastered the coursework. \r  \n\r  \nDid she really care about the details?\r  \n\r  \nUnsurprisingly, she did not. \r  \n\r  \n“You will attend this year’s hooding ceremony.” Professor Pond smiled at me.\r  \n\r  \nNo wonder most sorcerors didn’t solve more of the world’s problems. It was so easy for them to cheat through life, they had little motivation to work. What a pity.\r  \n\r  \nI moved on to other projects once fast money was no longer necessary. I had no need to attend any more classes. There was work that needed doing.\r  \n\r  \nMy tomato plants could grow new tomatoes within an hour, so long as I kept harvesting them. Food would be free for everyone within five years, using my techniques. My parents would be upset that I messed with their industry, but some things are more important.\r  \n\r  \nI started a fungi farm as well, and discovered a new antibiotic among my mold samples. So I got in touch with the local arcane healing wards to set up some fast experiments. Turned out it worked really well against MRSA, among other infections.\r  \n\r  \nThe overnight fame that came with this discovery was heavily distracting. I hired interns - former peers - to handle the press for me. Who has time for interviews and awards?\r  \n\r  \nI enchanted the school gym with wards that absorbed the energy expended by students within, distributing it back into the school’s electric grid. This technique had far wider potential applications, as I explained in the paper I published detailing how to upgrade any shield to conserve energy. More press, more fanmail to keep the interns busy.\r  \n\r  \nThey were calling me the best sorcerer in the world by the time the hooding ceremony came around. \r  \n\r  \nFunny. I was just getting started. \r  \n\r  \nDisguising an intern to attend the pompous ritual in my stead was very tempting. But my parents would be there, and I needed to speak with them about my crop management techniques. \r  \n\r  \nThe ceremony tested my temper more than I had anticipated.\r  \n\r  \nAll these students, all these professors - they knew how easy it all was. But this benefitted them too much to ever change it. Shortsighted. Lazy. \r  \n\r  \nA small part of me argued, *What if it really is harder for them to think? Where’s your empathy?*\r  \n\r  \nMy empathy was resolution-focused. If thinking was a problem for most people, well, I’d fix that too. But one step at a time. I was officially a doctor of sorcery, and I had parents to strike a new deal with.\r  \n\r  \nThere’s work that needs doing.",
   "created_utc": 1690511378,
   "score": 1,
   "submission_id": "15b72ft"
  }
 ]
}