{
 "submission_id": "15b8kli",
 "title": "[TT] Theme Thursday - Wanderlust",
 "selftext": "##### “Nostalgia in reverse, the longing for yet another strange land, grew especially strong in spring.”\n\n---\n---\n\n### **Happy Summer writing friends!**\n\nYour challenge this week is to write secret messages into your stories! That’s right, it’s acrostic week again! You can feel free to be creative with your version of an acrostic, by either using the first letter or word of every line or paragraph, or whatever! **Be sure to include your message [and method] at the end so you get awarded your points!** Good luck and good words!\n\n[**[IP]**](https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/dfb7fa18-3f45-4a17-a198-d31bd2e46cf2/dfrvbqz-30fac769-6b46-499c-9074-e645273215da.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcL2RmYjdmYTE4LTNmNDUtNGExNy1hMTk4LWQzMWJkMmU0NmNmMlwvZGZydmJxei0zMGZhYzc2OS02YjQ2LTQ5OWMtOTA3NC1lNjQ1MjczMjE1ZGEucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.BzecXysw_z9wO8nNme7JFg0lTnkexMzgnnXgcY3V4R8) **|** [**[MP]**](https://youtu.be/l5fe3vZyX3U)      \n\n**Try out the new [genre tags!](https://www.reddit.com/r/WritingPrompts/wiki/genre_tags)**\n\n---\n---\n\n### **Here's how Summer Fun works:**\n\n* Use the tag [TT] when submitting prompts that match this week’s theme.\n\n**Rules** \n\n* Leave **one** story or poem between **100 and 750** words as a top-level comment. Use [wordcounter.net](https://wordcounter.net/) to check your word count. Your story must meet the criteria of the game in order to qualify for ranking.\n* Deadline: **7:59 AM CST next Wednesday**\n* No serials or stories that have been written for another prompt or feature here on WP \n* No previously written content\n* Any stories not meeting these rules will be disqualified from rankings and will not be read at campfires\n* *Does your story not fit the Theme Thursday rules? You can post your story as a [PI] with your work when the TT post is 3 days old!* \n* [Vote](https://forms.gle/Qg7Ltf6k7oBXqT7L6) to help your favorites rise to the top of the ranks! I also post the form to submit votes for Theme Thursday winners on [Discord](https://discord.gg/writingprompts) every week! Join and get notified when the form is open for voting!\n\n\n**Theme Thursday Discussion** Section:\n\n* Discuss your thoughts on this week’s theme, or share your ideas for upcoming themes.\n\n**Campfire**\n\n* On Wednesdays we host a Theme Thursday Campfire on the [Discord](https://discord.gg/WritingPrompts) Voice Lounge. Join us to read your story aloud, hear other stories, and have a blast discussing writing! \n\n* **Time**: I’ll be there **7 pm CST** and we’ll begin within about 15 minutes. \n* **Don’t worry about being late, just join!** Don’t forget to **sign up for a campfire slot on discord**. If you don’t sign up, you won’t be put into the pre-set order and we can’t accommodate any time constraints. We don’t want you to miss out on outstanding feedback, so get to discord and use that `!TT` command!\n\n* There’s a Theme Thursday role on the Discord server, so make sure you grab that so you’re notified of all Theme Thursday-related news!\n\n---\n\n#### Ranking Categories:\n\n* **Weekly Game** - 50 points for correctly participating in the game using the weekly theme. \n* **Actionable Feedback** - 10 points for each story you give detailed crit to, up to 50 points\n* **Nominations** - 10 points for each nomination your story receives, no cap; 15 points for submitting nominations\n* **Ali’s Ranking** - 50 points for first place, 40 points for second place, 30 points for third place, 20 points for fourth place, 10 points for fifth, plus regular nominations (On weeks that I participate, I do not weight my votes, but instead nominate just like everyone else.)\n\n---\n\n### **Last week’s theme: [Color](https://redd.it/154y42j)**\n\n---\n\n[Winning Story](https://www.reddit.com/r/WritingPrompts/comments/154y42j/tt_theme_thursday_color/jthnjy8/) by /u/Ryter99       \n                \n\n### **Crit Superstars:***\n\n* /u/London-Roma-1980    \n* /u/Dependent-Engine6882     \n* /u/wileycourage     \n* /u/Xacktar    \n\n**Crit superstars will now earn 1 crit cred on WPC!*\n\n=====\n\n#### News and Reminders:\n\n* Join [Discord](https://discord.gg/WritingPrompts) to chat with prompters, authors, and readers!     \n* **We are currently looking for moderators!** [Apply](https://redd.it/pwiee5) to be a moderator any time!     \n* [**Nominate**](https://www.reddit.com/message/compose?to=%2Fr%2FWritingPrompts) your favorite WP authors for Spotlight and Hall of Fame!                \n* Love the feedback you get on your Theme Thursday stories? Check out /r/WPCritique  \n * This week’s quote is by Vladimir Nabokov",
 "created_utc": 1690480448,
 "permalink": "/r/WritingPrompts/comments/15b8kli/tt_theme_thursday_wanderlust/",
 "score": 23,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15b8kli/tt_theme_thursday_wanderlust/",
 "comments": [
  {
   "comment_id": "jtoz8qr",
   "message": "**Theme Thursday Discussion**: \n\n\u0026gt;**All top-level comments must be a story or poem.**\n\n\u0026gt; * Reply here to discuss the theme, suggest future themes, and share your theme-related inspirations!\n* Please remember to [follow the subreddit rules](https://www.reddit.com/r/WritingPrompts/wiki/rules) in any feedback.\n\n-----\n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128226; [News](https://www.reddit.com/r/WritingPrompts/wiki/announcements) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)",
   "created_utc": 1690480528,
   "score": 1,
   "submission_id": "15b8kli"
  },
  {
   "comment_id": "jtp50iw",
   "message": "\u0026lt;Realistic Fiction\u0026gt;\n\n***Creative Writing***\n\nI pull out a notebook and start to write down some words, but they are mostly stream-of-consciousness.  This is my process, my start; the point of it is not to write down *something* in particular, but *anything* at all.  To get the ideas flowing.  My fingers moving.\n\nSometimes I think of that fickle thing called \"muse\" as water in pipes.  If I use it too much, the pressure drops, and I can feel it just starting to dribble out, so I need to be a little more careful about it.  Conserve it.  However, if I don't use it enough it can clog up with gunk and stale ideas.  Then when I turn the tap on it just... does not flow.  Or what comes out stinks.  So I just write and write and write until the words become sentences again and the thoughts are clear.\n\nMaybe this point of view is wrong.  My teacher has said that the stagnation is not a result of \"not writing\" enough but instead related to my surroundings.  The same four walls, the same carpet, the same decor.  No change in any sensory stimulation is what causes the ideas to cease flowing.  I suppose there is *some* potential truth to that.\n\nExcept that... I simply can't reconcile it with my own experience!  I *love* staying in my dormitory and have never given in to the urge to travel elsewhere.  Sometimes if I feel a little stir-crazy I'll splurge and go out to the college store to buy some overpriced mundane things - like more painter's tape, or shampoo - and by the time I make it back to my little cubby-hole of a room I am overjoyed to be in a place of familiarity and comfort.\n\nTo some, the advice might be welcome.  Heck, it might even be requested.  But extolling one's opinion as \"truth\" without the noted caveats of \"In my experience\" or \"I've been told that\" then it can come across as conceited.  I, *personally*, do not need to change my surroundings to find inspiration to write.  That exists *within* me.  My environment certainly plays a factor, but that is due more to comfort than sensory activation.  Perhaps others have it differently.  In fact, they almost certainly do.  But neither of these extremes are universal truths.\n\nAbout now is where I'd start erasing things and work on something more fictitious.  Something a little more in-line with what my teachers expect of me.  \"Creative Writing\" classes are all about that, right?  But I feel like there is more creativity in the way I've managed to capture these truths here on this paper.  Perhaps it's *too* true?  Or perhaps it\n\n\\----------------  \nWC: 442/750  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing  \nFollow my Summer Challenge progress [Here](https://www.reddit.com/r/TomesOfTheLitchKing/comments/14c22dj/ot_summer_challenge/)\n\nNotes:  \n- The last two words of the final paragraph are spelled out in the first letter of each paragraph\n- \u0026gt;! \"is meta\" !\u0026lt;",
   "created_utc": 1690482738,
   "score": 2,
   "submission_id": "15b8kli"
  },
  {
   "comment_id": "jtr34qq",
   "message": "##Hazel's House\n\nI used to love going to grandma's house.\n\nHazel was the sweetest woman on the planet. All of her neighbors knew it; they would run up to me on the street to let me know. The door was always open at Hazel's house, and she had a plate full of treats. Everyone absolutely loved her. Don't believe the rumors.\n\nMy family was very fortunate to have someone like her who was always willing to help us in our times of need. You never know when you'll need someone like her.\n\nGreg, my younger brother, always disagreed with us though. Right before leaving, he would sit on the stairs and cry. Always dramatic, I learned to cope with our trips long ago. Neither ran nor shine would keep my mother from forcing us to go to her house. Didn't matter how much we resisted. Maybe we could've skipped once, just once. Anyway, it doesn't matter.\n\nWe were forced to go. Hazel greeted us with a smile. You know that was enough.\n\nWe needed her in our lives anyway. Overall, it was the best times of my life. Never complain about anything. Taught us well, she did.\n\nThe neighbors always remarked about how good we were. \"Hazel, your grandchildren are wonderful,\" they'd say. Every time, my grandma would nod her head. Talking about our behavior was bragging, and we were supposed to be humble.\n\nLove was always in her heart. It was our job to accept that love. Spoiled brats was what were being. Toughen up. Everyone knew the world wouldn't be kind. No excuses.\n\n---\n\n\u0026gt;!First line of every sentence. I hated my grandma. Why won't they listen.!\u0026lt;\n\n---\n\nr/AstroRideWrites",
   "created_utc": 1690511432,
   "score": 2,
   "submission_id": "15b8kli"
  }
 ]
}