{
 "submission_id": "15bagvo",
 "title": "[WP] When humanity joined the galactic council we expected to be treated like to children who still have a lot to learn from the older species. We did not expect to be the adults in the galactic kindergarten that is the council.",
 "selftext": "",
 "created_utc": 1690484940,
 "permalink": "/r/WritingPrompts/comments/15bagvo/wp_when_humanity_joined_the_galactic_council_we/",
 "score": 79,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bagvo/wp_when_humanity_joined_the_galactic_council_we/",
 "comments": [
  {
   "comment_id": "jtpauhb",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690484941,
   "score": 1,
   "submission_id": "15bagvo"
  },
  {
   "comment_id": "jtpkrsq",
   "message": "\"Here we go again\"\n\n\u0026amp;#x200B;\n\n\"Yes...\"\n\n\u0026amp;#x200B;\n\nBoth men sighed and looked at each other for reassurance that wasn't there.  There was no way they could get this bill to pass right now ever since the Ugnoosian Gard decided to fly in front of the B'aleth delegation after they left the wormhole.\n\n\u0026amp;#x200B;\n\nThey pushed the two large doors open in tandem, pushing into a room as bright as it was loud.  Someone with a migraine would probably have just died instantly upon entering. \n\n\u0026amp;#x200B;\n\nIt took a moment as the two walked in, but the din that was a series of trills, clicks, beeps, snorts and unintelligible gagging sounds turned into the God Emperor's English.\n\n\u0026amp;#x200B;\n\n\"JDSOGHH GHHH AHGHH CIK CIK NEEYAI CIK GAH -- we cannot abide being in the same room as these dogs.  They flew their sorry excuse for a warship in front of our Holy Emissary from Golahn.  They should be executed by our laws!!\" The B'aleth stood tall, eyes surrounded by eyelashes on tentacles shaking like Truffula Trees while spit flew from their circular teeth-strewn mouths.  Multiple mouths.\n\n\"Dang, that's crazy.  Remember when we ALL SIGNED THIS PAPER THAT MADE US PUT ASIDE CULTURAL DIFFERENCES TO PUSH GALACTIC POLICY?\"  The Ugnoosian delegation started laughing and high fiving each other.   The B'aleth turned a shade of green while another leapt up from his seat after a loud wet smacking sound.\n\n\"WHOOO SHOT THIS SPITBALL???\"  The B'aleth held his tentacle high, showing a large wad of wet something that clearly had hit the back of its head -- which was newly wet.  He turned to the laughing crowd behind him, one Ugnoo tried to seem unassuming.    \n\n\n\"Don't think I do not see you, filthy beast!  Those long mouths are good for nothing but SPIT\"  \n\n\nNo sooner did he finish the last syllable when the B'aleth and the Ugnoos both rushed each other, smack and pawing.  The Bongolo presiding cleaned his teeth as he loomed over the entire council.  Other council members played games on their communicators.  One seemed to be masturbating... again.  He was just caught last week.  \n\n\nThe humans looked at each other, and walked up to the Bongolo, weaving between the bar brawl that was the center for galactic policymaking.   With a spin move past a whipping tentacle that smacked around a long mouth Ugnoo and yanked him.  Their meager proposition landed on the Bongolo's table.  Only his eyes moved as he read the paper, one eyebrow over his center eye raising while the other two furrowed.\n\n\u0026amp;#x200B;\n\n\"Does this mean what I think it means?\"\n\n\u0026amp;#x200B;\n\n\"Yes... I do not really think anyone wants to be here anyway, right?\"  One human said with visible irritation.  The other was watching the fight.\n\n\u0026amp;#x200B;\n\n\"OK.\"\n\n\u0026amp;#x200B;\n\nThe Bongolo raised one furry arm and brought down the gavel with a thunder that cracked the dais.  The fight stopped instantly, tentacles and tentacle like mouths receding back to their hosts.\n\n\u0026amp;#x200B;\n\n\"The humans brought forth an interesting measure.  They propose to dissolve this council into a smaller council, consisting of the humans and the Bongolos.  Everyone else will be able to go home\"\n\n\u0026amp;#x200B;\n\nCheers erupted throughout.  No one really liked dealing with each other anyway.  The council had not done anything of merit for hundreds of cycles.  It ended up being where different civilizations sent their political exiles or just annoying members of their species.  \n\n\u0026amp;#x200B;\n\nThe humans and the Bongolo turned away from the crowd that was starting to go out the door and into the clubs that were right outside.  \n\n\u0026amp;#x200B;\n\n\"So, we will be able to annex both the Dilarian Nebulas AND the Tinctian Traverse?\"\n\n\u0026amp;#x200B;\n\n\"As long as you back the Earth Empire when we expand our divine holdings.  The Emperor demands expansion and tires of this politicking.  Humans have not begun to show the strength of their arms yet.  We have waves of legions ready to--\"\n\n\u0026amp;#x200B;\n\n[\"Yeah, so we don't care about all that -we got your back if you have ours.\"](https://talesofatravellingsalesman.com/)",
   "created_utc": 1690488672,
   "score": 19,
   "submission_id": "15bagvo"
  },
  {
   "comment_id": "jtq43q7",
   "message": "Jinn Mayar sighed deeply while reflecting on humanities sordid past attempts at governing disparate cultures over the centuries. Compared tot he lunacy on display in front of her, humanity's past efforts were wildly successful. \n\nIn front of her the sentient gas filled jellyfish Ihili representative was futily beating the subterranean MukMukQu. Beating was a very generous word. All because the MukMukQu dared to pass gas in front of the Ihili, or so representative Oghpho claimed. Darren, the MukMukQu representative had let out a racious belch that impressed Jinns aid who remarked that he rated it at an 8.5 out of 10, and thus was now in a similar situation as Darren being 'assaulted' by Oghpho's aid. \n\nThis caused the Fublu representative to hoot in delight at the scene, earning them the ire of the typically stoic Crin, a feathered species capable of flight. The Crin flung a bone leftover from their meal at the Crin, but was intercepted by the cat-like Volin'ti'ahn'ver. Upset that their display of displeasure was interfered with, the Crin and Volin'ti'ahn'ver were now rolling on the ground in a dustball of feather and fur. This provided further entertainment to the baboon like Fublu rep who's hooting escalated to unbearable levels.\n\nAdjacent to them the skeleton-covered-in-jelly representative, Blrplrplrplrblr, grew annoyed at the Fublu and began making farting sounds in displeasure. Darting around chaotically was the Shleen delegation, a sentient swarm. Seeing an opportunity of the distracted Blrplrplrplrblr to finally get a taste of their jelly, causing the Blrplrplrplrblr aid to swat at the Shleen indignantly. \n\nAnd this is just a sample of the chaos that comprised of the Galactic council. Wearily Jinn extricated herself from the chaos and approached the nominal area of the Ihili, found their data slate and tapped hers to it, transferring a document. It took hours of avoiding bodily fluids, thrown food, gases, swinging appendages and worse to get her file transferred to several hundred of the representatives. Today marked the day she finally reached the critical number of 51% of the representatives to transfer the file to, a project that has been months of work. \n\nWork that would hand control of the Galactic council over to humanity and bring some sanity to the farce of a government  it is now. But first, Jinn needs to retreat to her ship and take a shower.",
   "created_utc": 1690495996,
   "score": 9,
   "submission_id": "15bagvo"
  }
 ]
}