{
 "submission_id": "15bbazh",
 "title": "[WP] everybody knows the world's greatest detective lives at 221b Baker Street. What they don't know about is the world's greatest baker that lives on 221b detective street.",
 "selftext": "",
 "created_utc": 1690486891,
 "permalink": "/r/WritingPrompts/comments/15bbazh/wp_everybody_knows_the_worlds_greatest_detective/",
 "score": 62,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bbazh/wp_everybody_knows_the_worlds_greatest_detective/",
 "comments": [
  {
   "comment_id": "jtpg049",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690486891,
   "score": 1,
   "submission_id": "15bbazh"
  },
  {
   "comment_id": "jtpn72a",
   "message": "The kitchen is on fire. \n\nThe kitchen is on fire, and there’s a person standing in the middle of it.\n\n“Wh- Aghh!! Look out!” I say, grabbing my bowl of batter off the counter and throwing it at the person. I let go, and the bowl crashes into his head, then sails to the ground upright, most of the batter still inside.\n\n“Ow,” he says, clutching his head and bending down. A dark detective hat slides down over his hair. “The hell was that for?”\n\n“You’re on fire!” I cry, but even as I say it, I admit he doesn’t appear to be.\n\nHe stands, russet cape swishing around his shoulders and looks around the kitchen, apparently unfazed by the flames.\n\n“Alright, I’ll help.” \n\n“Wha-“\n\nHe opens a cabinet behind my sinks and looks at the levers, untwisting then retwisting the water. I frown uncertainly. It appears like nothing happened. \n\n“Your detector isn’t going off?” he asks. He mounts a stool and fiddles with a smoke alarm. Finally the ancient sprinkler system creaks on, and a wash of water comes down over us. \n\n“Thank goodness,” I raise my hands, enjoying the cool spray of water. \n\nWhen I turn back, the man is flipping through a thick leather book, a pencil tucked behind his ears. \n\n“I’m Joanna, and you are?” I ask.\n\n“Sherlock Holmes,” he says, looking up at me. His eyes are grey beneath the brim of the hat, his cloak keeping himself and the book dry.\n\n“Holmes, why don’t we get out of the water?” I suggest. He nods. \n\n“Where are we?” he asks when we wander into the front of the cafe. It’s empty, streetlight and starlight from outside illuminating the stacked chairs and swept floor.\n\n“My cafe, 221b Detective St., I was attempting a new recipe and it got away from me,” I say with an uncomfortable laugh. “Can I ask what you were doing in my kitchen? You just kind of appeared out of nowhere.”\n\n“Uh… well…” the man pulls the cloak closer around his shoulders and the collar is high enough that it acts as a screen for his face. He waves a hand. “I was meeting someone for work as a detective. I must have gotten the address wrong and ended up here.”\n\n“You’re a detective?” I ask, pleased.\n\n“Yes, and this,” he lifts a hand, holding up the book, “is from someone I’m trying to track down” he says. “Have you seen someone by the name of Terry Thomas? Or heard of him or the Thomas brothers?”\n\n“Um… no. And no offense but that book looks mostly blank.”\n\n“I was trying to see if there’s any invisible ink on there,” he says, bending over the parchment, he lifts a page to the heat of a candle, and the page comes away slightly blackened.\n\n“That’s not what was supposed to happen?” He raises and eyebrow at me, and I can feel my face grow red. “What? I’ve never seen detective work before, how was I supposed to know that wasn’t it?” \n\nHe smiles, “You’re right. I’ve been on my own for so long I forget average people aren’t dealing with invisible ink and the like on a regular basis. I need to get more than just the address or else-“ his face looks… concerned, but he cuts himself off. I try and smile comfortingly.\n\n“Do you like pastries? I can hardly do anything when I’m hungry, much less detective work. And the cafe has a little office upstairs where you can set up for some work if you need to hang around a while longer.”\n\nHe looks at me, silent again, and I wonder if he’s offended that I offered him a dinky cafe office.\n\n“Of course you must be a pretty important person if you do detective work, so I can point you toward a hotel if you’d rather not work out of here,” I say, throat drying up. \n\n“No, that’s… nice. And pastry sounds amazing.”\n\n“Luckily, the pantry didn’t burn so I should have today’s leftover scones,” I say, marching toward the smokey kitchen. Carving cheese, dicing veggies, toasting pastry (without burning anything down), was my happy place. I completed two heaping plates while Holmes puzzled over the bound book, playing with cutlery.\n\n“You like my pizza cutter,” I say, watching him spin the circular blade curiously. \n\n“Hm…”\n\n“You said you’re alone. Do you have a partner?” I ask. “Someone who typically works with you on these things?” I notice how the underside of his cape contains some bizarre pattens. I will ask about them later. \n\n“I *had* a partner,” he says, spinning the blade again. “He passed. I’ve been on my own for several years now.”\n\n“I’m sorry… You must miss whoever it was.” I pause then push the plate over to him. He takes a scone in his hands, grey eyes sparkling with curiosity. He takes a bite, and his eyes warm.\n\n“WOW that’s good!! No wonder you own a cafe! What’s this place called?” \n\n“Yeah well, it’s no big deal. I just love cooking. Watson’s Bakery,” I say with a chuckle while he inhales his food. He pauses at the name, frowning at me. I glance over his shoulder. “Hm… do you know him?”\n\n“Hm?” he hums, following my hand to look over his shoulder. A cloaked figure is standing, black silhouette in the front window. \n\n“Holmes?” I ask, he’s still sitting. The figure flips something shiny in the air and I realize with horror that it’s some sort of gun. “Holmes!” I yell, tackling him to the floor as a shot rings out and hits my marble counters.\n\nDamn him, those were expensive.",
   "created_utc": 1690489581,
   "score": 28,
   "submission_id": "15bbazh"
  },
  {
   "comment_id": "jts9ym5",
   "message": "Baking is simple really, combine some foods into taste. Thats how people see it. But when you try reaching the peek of how tasty something can be… you'll quickly realise that taste is subjective. Sure your cream croissants can be the best in the world because of the perfect balance between crispiness and creaminess, but others might not like cream. And just like that your entire title, all those years of practise are worthless!\n\nWho cares about what some critic says if I can't even satisfy the regular customer!\n\nSo i tried something different. I made bread sculptures! It took a bit of practise but eventually i made a turtle, i even gave him an apple as a head. He became my mascot, i called him snacks. The people loved him!\n\nSo i started making other animals. A dog, cat, a bird out of bread, anything the customers wanted. Though in time, sales on that started dropping too. People had seen it.\n\nI decided to make one last sculpture: a human. It was tough and required many days of work, but sales were slow anyway.\n\nI decided to theme him after my first sculpture, like a humanoid version of the bread turtle. I made the skelleton first, out of toasted bread. Wouldn't want him falling apart off course. And i then fit dough around each seperate part of the skelleton to make every seperate limb and body part. I’d have loved to do it in one go but my oven wasn't big enough.\n\nUpper arms, lower arms, hand (more a nub than a hand though), same with the legs.\n\nThen the body, which i did in 4 parts\n\nThe body split in 3 parts and then half a pastry cut out as a turtle shell which he would wear like a backpack.\n\nAnd then a massive bread bun as his head, with a little smile painted on it.\n\nAnd finally: the finishing touch. I gave him a little bowtie with “made with loaf” on it.\n\nNow, i wouldn’t describe this in such detail if nothing special happened with snacks. I explained it because to my surprise, he came to life.\n\nLove truly is a wonderfull ingredient. Turns out that enough of it can bring even some dough to life. \n\nHe's been my partner ever since, and we’ve been creating more living sculptures. Like, a *lot* of living sculptures. It’d surprise you how durable they are too, their bones are kept together way better than toasted bread should be, they don’t die to bullets, toxic gas, cold or hot temperatures, they don’t starve. Perfect soldiers.\n\nAnd i think, officer that you know the rest.\n\nBy all means, lock me up. I still have 1000 sculptures being made every day by other sculptures, and that number will only rise. Don’t think about nukes, you'll kill civillians, and the sculptures are in multiple locations.\n\nYou can’t stop this, even i can't. The world is mine, unless some detective finds all 5 sculpture factory. And i’m not merciless, i'll give you a clue. The first one is on 221b detective's street.",
   "created_utc": 1690539488,
   "score": 1,
   "submission_id": "15bbazh"
  }
 ]
}