{
 "submission_id": "15bfpq8",
 "title": "[SP] In the garden grew the most beautiful flowers; and they were all poisonous.",
 "selftext": "",
 "created_utc": 1690497233,
 "permalink": "/r/WritingPrompts/comments/15bfpq8/sp_in_the_garden_grew_the_most_beautiful_flowers/",
 "score": 12,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bfpq8/sp_in_the_garden_grew_the_most_beautiful_flowers/",
 "comments": [
  {
   "comment_id": "jtq7703",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690497233,
   "score": 1,
   "submission_id": "15bfpq8"
  },
  {
   "comment_id": "jtqbrzr",
   "message": "If you looked up \"pick your poison\" in a dictionary, it should have a picture of this place: Humboldt Floralweapons Research Lab, four two-story greenhouses built over the space of an American football field, dedicated entirely to the growth and genetic manipulation of the world's deadliest flowers.\n\nAnd not just deadly, but beautiful and carnivorous. Nature plays a deadly game where only the strongest survive, and most of these plants have common ancestors with the pitcher plant, venus fly trap, and drosera capensis. In modern times, we know these by their current incarnations: the predator plant, Jupiter man cage, and the flauntethesis imperialis. Legendary predators of man that scooped, snapped, and beguiled their victims into a slow, acidic death.\n\nBut, like our other great predators - the lion, the tiger, the bear - imperfect. But while those once-terrifying animals have long incubation periods, Humboldt Floralweapons uses test tube genetics to rapidly bring about the next age in bioterror.\n\nThat's where I came in! I'm a huge fan of the Humboldt lab and dreamed of getting a job helping create the perfect species of deadly plant. I've read and studied and planned, and finally reached the age of sixteen, when I could apply to their internship program. And guess what? I made it!\n\nSo far on the tour, I've seen a few people crushed in the jaws of cacti-snappers, another keel over screaming as their flesh boiled off because they took their mask off before decontamination finished in the virulent fungi division, and one other commit suicide by jumping off a second-story balcony in a full nosedive after staring too long at a vaporous mind scrambler lily. What a day it's been so far!\n\nBut despite that, after the full tour I don't think I want to work there anymore. Not because I can't stomach it, but because they already have so many people doing great work! I couldn't help but feel like the floralweapons industry had already been explored to its utmost. There had to be some other avenue that I could take, somewhere I could pioneer my own brand of necrotic ingenuity. \n\nAnd then it came to me: what about a chocolate factory?",
   "created_utc": 1690499132,
   "score": 1,
   "submission_id": "15bfpq8"
  }
 ]
}