{
 "submission_id": "15bhrut",
 "title": "[WP] You fell in love with a vampire. You married her on the condition that she would never bite to convert you. Life is good. You get to keep both your love and your humanity. However, you forgot to account for your teething baby daughter biting you.",
 "selftext": "",
 "created_utc": 1690502496,
 "permalink": "/r/WritingPrompts/comments/15bhrut/wp_you_fell_in_love_with_a_vampire_you_married/",
 "score": 103,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bhrut/wp_you_fell_in_love_with_a_vampire_you_married/",
 "comments": [
  {
   "comment_id": "jtqjnam",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690502496,
   "score": 1,
   "submission_id": "15bhrut"
  },
  {
   "comment_id": "jtr64ew",
   "message": "You know, life has a funny way of throwing unexpected curveballs your way. Falling in love with a vampire was one thing, but marrying her with the condition that she'd never turn me into one of her own kind was quite another. Yet, here we are, happily married, with a beautiful daughter. It seemed like the perfect compromise, keeping both my love and my humanity intact.\n\nI never imagined that my biggest challenge as a human would come not from the outside world but from within my own home. Our little bundle of joy, our adorable daughter, she's the light of our lives. But there's something about babies; they have this way of grabbing your finger and not letting go. Oh, how I wish it were that simple!\n\nYou see, my daughter inherited her mother's vampire traits. It's fascinating and terrifying at the same time. While her eyes sparkle like sapphires, they also seem to glimmer with an otherworldly charm. I should have known that her vampire heritage would manifest in unexpected ways.\n\nThe first time she bit me, I laughed it off, thinking it was just a playful gesture. Little did I know that her little fangs had pierced through my skin, drawing a few drops of blood. It didn't hurt much, and I brushed it off as a mere accident, unaware of the implications it held.\n\nAs days passed, my daughter grew more curious about everything around her. Her little baby teeth were sharp, and she had this peculiar habit of testing them on anything she could find. Including me. Oh, how naive I was to believe that I could remain human in this situation.\n\nIt happened one evening, as I held her close, rocking her gently to sleep. I felt a sudden, sharp pain, and before I knew it, her tiny teeth had broken my skin again. This time, the sensation was different – a tingling warmth spread from the bite mark. I couldn't deny the truth any longer; she had turned me.\n\nAnger and frustration surged through me. I had been so cautious, so adamant about not becoming a vampire, yet here I was, a creature of the night against my own wishes. I didn't want this eternal existence, this life that I couldn't control. I wanted to grow old with my wife, to cherish every fleeting moment as a human.\n\nBut life doesn't always care about your wants and desires. Fate has its way of playing cruel games with us. And now, I must live with the consequences of my oversight. It's not that I hate being a vampire because of what I am, but rather because it wasn't my choice. I lost the chance to decide my own fate.\n\nAs I look into the mirror, my reflection staring back at me, I wonder what lies ahead. How will my wife react to the change? Will she blame herself for this unintended transformation? I wish I could reassure her that it wasn't her fault, that I made a mistake, that we both did.\n\nFor now, all I can do is embrace this new existence and try to make the best of it. I love my wife and daughter with all my heart, and no matter the circumstances, that will never change. I just hope that, in time, I'll come to accept this unexpected turn in our lives and learn to navigate the complexities of being a vampire and a husband and father.",
   "created_utc": 1690512899,
   "score": 196,
   "submission_id": "15bhrut"
  },
  {
   "comment_id": "jtrz2ac",
   "message": "„For the last time, could you stop laughing at me? this is serious!“\n\n„Sorry, Sorry. It‘s just, all these years you basically didn‘t even french kiss me and now …pfffffthahahahahahaha“\n\nOkay, i‘ll admit, i did not know that actually rolling on the floor while laughing was a thing, especially with beautiful, etheral, very much *undead* vampires was a thing but here we are. Holding our toddler at arms length I feld blood dripping down the back of my hand. And the little rascal had the audacity to\ngiggle at me as well. All these years of caution for naught. \n\n„Okay, okay, I think I got it all out. Give her to me, you go get a tissue, unless you want me to take care of your ouchie?“ She grabbed the adorable little hellspawn from my hands and gave me her best deadpan look. Aside from the occasional twitch of her lips and her still trembling shoulders she really pulled it off. „I didn‘t even know babies teeth that early…“ I grumbled. \n\nWhich set my wife off again. „Look at the bright side. You‘ll be around for much longer. No more sunburns. You will be able to literally bite your coworkers head off and we can share a bloodbag.It will be so romantic!“ \n\nNow I couldn‘t help but chuckle. If you can‘t beat‘em…",
   "created_utc": 1690531002,
   "score": 45,
   "submission_id": "15bhrut"
  }
 ]
}