{
 "submission_id": "15bhs5d",
 "title": "[WP] This labyrinthine castle you call home is a hot spot for upstart adventures to try to loot and conquer. So imagine your surprise when one comes alone; not to challenge it, but to rent one your rooms.",
 "selftext": "",
 "created_utc": 1690502513,
 "permalink": "/r/WritingPrompts/comments/15bhs5d/wp_this_labyrinthine_castle_you_call_home_is_a/",
 "score": 18,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bhs5d/wp_this_labyrinthine_castle_you_call_home_is_a/",
 "comments": [
  {
   "comment_id": "jtqjoqs",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690502514,
   "score": 1,
   "submission_id": "15bhs5d"
  },
  {
   "comment_id": "jtqwq9o",
   "message": "I remember when I first met Ander. Torn clothing, greasy hair, scar down his cheek, the baby girl in his arms. He and his daughter were on the run, and he was very desperate. She had dark Magic coursing through her veins, magic that, uncontrolled, had claimed there child's mother. And the Council wanted the child executed. So he decided to delve into a dangerous dungeon no one ever returned from to convince a powerful sorcerer to shelter him and his daughter. \n\n\"Please, I have nothing to offer, but they'll kill her! I beg of you.\"\n\nI, to his surprise, accepted. I was curious, to be honest. How had he gotten past my guards? How powerful was this child? Why would the Council be so centered on killing her? But after a little while, I found myself endeared to the child and her parent. It was nice to have someone new to talk to, apart from my apprentices, and Ander was a very distinct personality. He was upbeat, and eager, and had a knack for quips and sarcastic remarks. The daughter, Sam, was constantly running around and touching dangerous magical artifacts. Baby proofing a dungeon lair has its challenges. And she grew up very fast.\n\nShe was gifted at magic, and learnt to control her powers easily. Her face beamed when she showed Ander a new spells she had mastered. She quickly became competition for some of my apprentices,some of which were hundreds of years old. She eventually grew up to be a charming, refined young woman. But then Ander, Who was growing quite old, perished from a terrible disease. Age had catched up to him. \n\nBeing an powerful mage meant I had a few more hundred in me, but a death so close to me... I feared for Sam, and even myself. I delved into magic no high mage would willingly use. \nNot dark magic, I already did a lot of that, but Alchemy. The equivalent of political science of magic. I Lost all dignity at that point and actually used Alchemy, creating an elixir to extend life. And It worked. Sam, still hurt by the los of her father used It too, and set off in an adventure to see the world. \n\nIt has been a hundred years and she only visits me when she wants to use one of my magical artifacts. It's like she's a teen all over again.",
   "created_utc": 1690508437,
   "score": 10,
   "submission_id": "15bhs5d"
  },
  {
   "comment_id": "jtrt7es",
   "message": "\"Have you seen the rent prices down in Hvalt? Rediculous, for barely any amenities they expect a thousand gold a month! No private bathrooms, public laundromat that only has 2 tubs and 3 lines, barely any access to the Noosphere and sits under a gladatorial arena.\"\n\n\"This place is only 500 gold a month, not discounted for working part time as a dungeon obstacle, I get access to high speed Aethernet, private bathroom and laundryroom, plus it's much shorter distance to my colledge!\"\n\n\"And before you ask my major is in Battle Magic so work is more time for theory testing!\"",
   "created_utc": 1690526565,
   "score": 1,
   "submission_id": "15bhs5d"
  }
 ]
}