{
 "submission_id": "15bhrut",
 "title": "[WP] You fell in love with a vampire. You married her on the condition that she would never bite to convert you. Life is good. You get to keep both your love and your humanity. However, you forgot to account for your teething baby daughter biting you.",
 "selftext": "",
 "created_utc": 1690502496,
 "permalink": "/r/WritingPrompts/comments/15bhrut/wp_you_fell_in_love_with_a_vampire_you_married/",
 "score": 232,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bhrut/wp_you_fell_in_love_with_a_vampire_you_married/",
 "comments": [
  {
   "comment_id": "jtqjnam",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690502496,
   "score": 1,
   "submission_id": "15bhrut"
  },
  {
   "comment_id": "jtr64ew",
   "message": "[removed]",
   "created_utc": 1690512899,
   "score": 250,
   "submission_id": "15bhrut"
  },
  {
   "comment_id": "jtrz2ac",
   "message": "„For the last time, could you stop laughing at me? this is serious!“\n\n„Sorry, Sorry. It‘s just, all these years you basically didn‘t even french kiss me and now …pfffffthahahahahahaha“\n\nOkay, i‘ll admit, i did not know that actually rolling on the floor while laughing was a thing, especially with beautiful, etheral, very much *undead* vampires was a thing but here we are. Holding our toddler at arms length I feld blood dripping down the back of my hand. And the little rascal had the audacity to\ngiggle at me as well. All these years of caution for naught. \n\n„Okay, okay, I think I got it all out. Give her to me, you go get a tissue, unless you want me to take care of your ouchie?“ She grabbed the adorable little hellspawn from my hands and gave me her best deadpan look. Aside from the occasional twitch of her lips and her still trembling shoulders she really pulled it off. „I didn‘t even know babies teeth that early…“ I grumbled. \n\nWhich set my wife off again. „Look at the bright side. You‘ll be around for much longer. No more sunburns. You will be able to literally bite your coworkers head off and we can share a bloodbag.It will be so romantic!“ \n\nNow I couldn‘t help but chuckle. If you can‘t beat‘em…",
   "created_utc": 1690531002,
   "score": 211,
   "submission_id": "15bhrut"
  },
  {
   "comment_id": "jtty1rc",
   "message": "I looked into the incubation pod. A purplish black gloss hung over the baby as the magic kept doing it's work, but more importantly, kept her from me.\n\n\"How much longer did you say this ritual will take again?\"\n\n\"3 days dear. I know you are antsy, but it really cannot be interrupted for anything besides feeding.\"\n\n\"Not even for a moment?\"\n\n\"Well... Maybe I can sneak some more time for you at the next feeding...\"\n\n...\n\n\"Honey, I'm going to grab the bag, the barrier will be lowering in just a moment, do you mind...\"\n\nShe hadn't even finished before I was at our daughter's side. I rested my hands on the spectral barrier, determined not to let a second go to waste. It fell away and my hands slipped through, right to her side... and she turned faster than any baby should have ever been able to.\n\n\"Yooowch since when do Newborns have fangs!\"\n\nHer mother came back in from the other room, a bag of O- in hand. \n\n\"Did she get you? You know she is no regular newborn.\"\n\nI sucked at the little hole in my finger, as I stepped away and let my beautiful wife through with the bag. Time was still limited after all. The baby bit right through the plastic and began sucking.\n\n\"Do you feel funny? Like something is pulling a string around your neck?\" \n\n\"I don't think she can answer while she's still sucking away at that thing.\"\n\n\"Not the baby, you ignoramous. You've been bitten now.\"\n\n\"Well I do always feel like your tugging at my heartstrings whenever you're near...\"\n\nShe rolled her eyes. Nailed that one. \n\n\"But there is some discomfort there, now that you mention it. It couldn't be...\"\n\n\"It...hmphh\" she stifled a laugh. \"It certainly could\" and she no longer stifled it.",
   "created_utc": 1690565779,
   "score": 15,
   "submission_id": "15bhrut"
  }
 ]
}