{
 "submission_id": "15bjnsn",
 "title": "[WP] Your local Coffee Shop is open 24/7. This wouldn't be abnormal if it weren't for that it's employed by one person alone without ever stopping for sleep.",
 "selftext": "",
 "created_utc": 1690507735,
 "permalink": "/r/WritingPrompts/comments/15bjnsn/wp_your_local_coffee_shop_is_open_247_this/",
 "score": 18,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bjnsn/wp_your_local_coffee_shop_is_open_247_this/",
 "comments": [
  {
   "comment_id": "jtqv7p7",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690507736,
   "score": 1,
   "submission_id": "15bjnsn"
  },
  {
   "comment_id": "jtr07qv",
   "message": "This coffee shop that Brian had been frequenting a half block from his apartment had become a festering sliver in his mind for some time. But we’re getting a little ahea of ourselves. \n\nBrian had moved to this small suburb after his wife had left him for a coworker. After three weeks of feeling numb to everything he found himself outside of his work at 9am and just couldn’t go it. He simply googled “where to start fresh” while in his driver seat and started driving to the first location that popped up. \n\nHe didn’t even have to look for an apartment. He found a sign as he was walking his new home streets the first moment he arrived. A simple “apartment for rent. Inquire within”.  He approached the man at the desk and asked about the apartment.\n\n“Do you want it?” The middle age man, who didn’t even look up at Brian, asked.\n\n“Umm yea that’d be great” Brian said timidly not thinking that was all it would take to get the apartment. \n\n“Here’s the keys, rents due before the 7th ever month. It’s 800. Apartments 211 up the stairs”\n\nThe man handed over the keys while still not looking up from his desk. Brian found it odd that there wasn’t a showing, background check, or even getting a look at his face for the matter. Then Brian remembered that he didn’t have much to lose anymore and decided that an easy place to live at was better than sleeping in his car. \n\nHe found he settled into this new home almost instantly. He took an insurance job for a local agency and was amazed by how good the pay was for very little work. He wondered for time to time how it seemed no one ever got into any accidents here. \n\nBut there was his go to coffee shop that kept him up at night. At first he was enjoying having one so close to his apartment and on the way to work. Even better they were open 24 hours as he still hadn’t gotten a good night sleep since his wife left him two months again at this point. \n\nBrian had never seen this store closed even for a moment. He had also never seen anyone else work there besides one gentlemen. Who Brian didn’t ask his name in time for it not to be uncomfortable for him to admit he didn’t know it. \n\nHe had started trying to find out if anyone else worked there. He went in early in the morning, the afternoon, middle of the night. Always the same gentleman. Brian felt guilty for he never received bad service nor a bad cup of coffee there but thought something odd was happening. \n\nThere was something more going on. Brian was sure of this. He had finally worked up the courage to ask this person to their face what the deal was.\n\n“Good to see you again Mr. O’Connell!” The barista greeted Brian. \n\n“As to you! How are you holding up with all the hours your working?”\n\n“Oh just fine, I have the coffee to keep me going” the barista laughed. \n\nBrian feigned a chuckle and ordered his usual black coffee. \n\n“So I have a question” asked Brian.\n\n“More than happy to help” replied the barista \n\n“So it’s just you that works here right?” \n\n“Oh heavens no there’s a team of six of us” the barista answered.\n\nThis confused Brian as he was sure he’s only ever seen this man ever behind the counter no matter what hour it was.\n\n“Oh do you have identical siblings to help you run this?” Brian asked hoping that was the answer and not some greater conspiracy.\n\nThe barista answers slowly and now seemed concerned “Oh no my older brother lives abroad and it’s just him and myself. Why do you ask?” \n\nBrian now feeling like he’s overstepped answers “oh I’m sorry I don’t mean to pry. It’s just I’ve come in here at all hours of the day through the week and I’ve never seen anyone but you here and I’ve been curious. I’ve come in on Monday, Thursday, everyday over the weekend at late hours and I’ve only ever seen you” \n\nThe barista pauses and now looks very concerned at Brian. \n\n“Mr. O’Connell, we close at 4 every day. Is there anyone I can call for you?”",
   "created_utc": 1690510050,
   "score": 1,
   "submission_id": "15bjnsn"
  }
 ]
}