{
 "submission_id": "15bjxaq",
 "title": "[WP] In a neglected, ancient library rests a cursed book, enticing readers with its charm. Once opened, it ensnares unwitting souls, making them part of its tale. Assist them in breaking free.",
 "selftext": "",
 "created_utc": 1690508468,
 "permalink": "/r/WritingPrompts/comments/15bjxaq/wp_in_a_neglected_ancient_library_rests_a_cursed/",
 "score": 5,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bjxaq/wp_in_a_neglected_ancient_library_rests_a_cursed/",
 "comments": [
  {
   "comment_id": "jtqwsp0",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690508469,
   "score": 1,
   "submission_id": "15bjxaq"
  },
  {
   "comment_id": "jtrbtzl",
   "message": "The demon lord let out a shrill scream as tendrils of darkness burst out from his wounds. Before him, the four adventurers remained wary – they had fallen for too many tricks in the past. But the demon lord paid them no attention as he clutched at his wounds, trying to keep the energy from escaping.\n\n“No! He promised me this was the last! I was supposed to be free!” Fear seeped into the once-proud king’s voice as he fell to his knees. “Please! Give me another chance! I can do it! I can beat them!”\n\nThe adventurers tensed as their faces turned grim. They were in no state to fight the demon lord again should he get a second wind. Their trials had already sent them through a gauntlet of enemies and traps. Even this very opportunity was a result of many years of struggles. They had surmounted every obstacle set to prevent them from winning. Now, their fate, as well as the fate of the demon lord, were at the discretion of the entity that oversaw it all.\n\nAnd the entity said, “No.”\n\nIts word was law. And with a final wail, the demon lord crumbled to dust. The dark energies that once empowered his body dissipated into nothingness.\n\nThe entity then addressed the adventurers. “Congratulations. You four are the first to have made it this far. And I’ve existed for far longer than you can imagine.”\n\nTheir leader, Norm, stepped forward and asked, “So, can we leave?”\n\n“Certainly.” But the entity had one last condition to impose. “To free yourself from this tale, there must be an equivalent exchange. To leave my tome, something must be given in return.”\n\nWinnie, the youngest of the group, teared up at the entity’s words. “I told you it was a trick!”\n\nEven the unflappable Aika sank to her knees in defeat. Roderick cursed as he flung down his battleaxe. The metal clattered across the uneven stone tiles. He had long since given up on returning to his family. But the new family he had found deserved better than being stuck in a tome for eternity.\n\nNorm’s face reddened in anger. “What do you want from us? We haven’t anything left to give!”\n\n“But I do.” The author spoke for the first time during the adventure.\n\nHe had waited until the opportunity presented itself. A reasonable bargain earned through overcoming nigh impossible challenges. These four strangers – now companions – had earned their rest. They deserved to live for themselves now, rather than on the whim of another.\n\nThe entity writhed in a fit of anger. “This is entirely inappropriate. The narrator stays behind his screen of safety, ever watching, ever helpless.”\n\nThe author took a breath and looked around the dusty attic. Books long forgotten lay covered in dust. Even the very pages he wrote on had yellowed with time. In the modern era, only the truly unfortunate fell into such an arcane trap as this tome. The author had bought the house on a whim to recapture his fading inspiration. And the tome had provided him with an entirely new writing experience.\n\nSo, he said, “I’ve lived long enough writing stories for others. It’s time for a change. I’ll cede my claim over the pen of this tome in exchange for the souls of these four that you’ve kept for so long. Time within this tome only flows when one is penning the words. I’ve already gotten my affairs in order. What I’ve left behind for them should help ease them into the twenty-first century.”\n\nThe entity rippled in as anger slowly faded into amusement. “I could make you do anything. Just as you’re putting words in my mouth now, I would have the same power over you.”\n\n“Yes.” The author was fully aware of what would become of his soul.\n\nHe had, after all, been party to the fates of four souls already.\n\n“Very well. I’ll accept this exchange. I’ve grown tired of these four anyway.” The entity waved a hand. “You may begin.”\n\nThe four had little say in this matter – the author had not allowed it. But their existence was a mockery of life, and they had worked for their freedom.\n\n“I’m curious what tales you’ll tell with me.” The author grinned as he wrote. “Don’t let me down now.”\n\nA light shined, engulfing the four adventurers as the spell began to take hold. But it would only be complete once the author relinquished his claim to the tome’s sordid tale. The entity that ruled over it would accept no other compromise. And so, as energies surged to enact the exchange, the author penned his final words.\n\n*The End.*\n\n...\n\nI got a bit weird with this one, but I like where it went. It was very fun to write.\n\nIf you're interested in my works, the archive of my various writing responses can be found in my writing portfolio, link through my profile. There's also an original story, The Crossroads.\n\nThanks for reading.",
   "created_utc": 1690515855,
   "score": 1,
   "submission_id": "15bjxaq"
  }
 ]
}