{
 "submission_id": "15bli1c",
 "title": "[WP] The first thing aliens translated were the works of H. P. Lovecraft. Now all the aliens are freaking out.",
 "selftext": "",
 "created_utc": 1690513088,
 "permalink": "/r/WritingPrompts/comments/15bli1c/wp_the_first_thing_aliens_translated_were_the/",
 "score": 244,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bli1c/wp_the_first_thing_aliens_translated_were_the/",
 "comments": [
  {
   "comment_id": "jtr6i22",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690513088,
   "score": 1,
   "submission_id": "15bli1c"
  },
  {
   "comment_id": "jtrnhes",
   "message": "[Following an unusual radio silence from the Korbaxian scouting ship The Horizon, her sister ship The Vista embarked on a journey to locate her. The former had been deployed to scout the planet “Earth” to learn more about its inhabitants and geography, under the command of Commander Vervan.]( https://www.reddit.com/r/WritingPrompts/comments/159dd1w/piyouve_been_abducted_by_aliens_it_doesnt_take/) He might have been a young, inexperienced commander, but he was first and foremost an excellent explorer who wouldn’t be flouting basic protocol.\n\nThe radar indicated The Horizon had landed on Earth, a blatant move that broke the Korbaxian rule of never establishing contact without express permission. The instructions given back then had been to only observe, and to return all abductees with their memories wiped clean once studies and research had been complete.\n\n“Commander, shall we attempt to establish communications with The Horizon?”\n\nBaraklis nodded and gave the permission to proceed.\n\n“This is The Horizon reporting in.” This was not Vervan, but a legion of foreign, reverberating echoes of a thousand voices.\n\n“Where’s Commander Vervan?” he inquired through the communication lines.\n\n“He is wrapped up in foreign matters,” came the poisonous reply, dripping with metaphorical venom that could corrupt minds if one were careless.\n\nThe alien commander furrowed his brow ridges and asked, “What kind of foreign matter? Can you elaborate?”\n\n“Tentacles, fellow commander,” The sniggering voices were beginning to unsettle him, sending shivers down his spine even though they were physically thousands of miles away. “Vervan has granted me command of this ship in his absence. If you wish, I am able to transmit transcripts and reference documents he has gathered prior to his personal matters taking precedence.”\n\nBaraklis was very certain he wasn’t speaking to one of the crew members of the Horizon. Nobody in Korbax conversed as though they were a hivemind with many voices, yet still used singular pronouns. After some dodgy attempts at evading his questions, the strange legion of voices called themselves “Lord Elvari of Innsmouth”, a local deity who protected Earthlings in his territory.\n\n“This is the new interim commander Elvari speaking. The reports you have requested will reach you via warp drive transference. Pardon my unfamiliarity with your native language, as such you will have to translate the documents before you can comprehend them.”\n\nHe turned to his scribes and gave them the instruction to start transcribing and translating the incoming reports. Bestial mocking laughter filled the entire command room of The Vista the instant the document transfer was complete.\n\nThe first one that came in was titled “The Shadow over Innsmouth”, speaking of monstrous creatures known only as Deep Ones who worshipped a fathomless eldritch god of the seas. The main character spent most of his time running from these monsters, only to discover he was one of them and joined them in their unholy civilization beneath the dark depths.\n\nThe mirthless cackling only continued to disturb the ears of everyone present as the second report came in, titled “At the Mountains of Madness”. It recorded the disastrous expedition of a Dr. William Dyer of Miskatonic University, uncovering ancient ruins and dangerous secrets of powerful entities. As if the Elder Things were not sufficiently frightening that intel on them on were traumatizing to some of his scribes, the report also covered terrifying things like the Star-spawn of Cthulhu, Mi-Gos, and the traitorous Shoggoths. They were fiendish things that lacked empathy, the kind that would casually present mind-shattering forbidden knowledge to educate mortals, in the same way, an ignorant child would hang a wet kitten over an open fire to dry them.\n\nThe third report that accompanied raucous howls was titled “The Call of Cthulhu”. It came in three parts, one on a clay bas-relief that haunted humans with Cyclopean nightmares, the second of a terrible sect that practiced depraved cannibalism and blasphemous orgies, and the third of the madness within the seas of the Earth.\n\nHis scribes were sobbing wrecks, huddled in the corners of the room, begging not to read the next reports that rapidly poured in. “The Dunwich Horror” which mentioned Yog-Sothoth the All-Knowing, the One Who Exists in All Points of Time and Space. “The Dream-Quest of Unknown Kadath” which covered ‘Hunting Horrors’. “The Shadow Out of Time”, “Nyarlathotep”. They wouldn’t stop, the downloads kept piling up despite his demands for them to cease.\n\nBaraklis had always thought humans to be the dominant race on Earth, the most common kind of sapient Earthlings. Never had he imagined that this planet would be populated by such incomprehensible aliens who could destroy entire worlds in the blink of their many eyes.\n\n“BACK! We’re going back to Korbax and never coming back to this god-forsaken Earth! NOW! We leave NOW!” he was screaming at the top of his lungs, his fists slamming onto the control panel in a bid to terminate the transmission of such repulsive reports.\n\n“Commander Baraklis, what do you mean by ‘god-forsaken Earth’? I am a god who has anything but abandoned this earth, if anything I am doing my part to —”\n\nHe shut off the communications before Elvari could finish, yet the grotesque chortling of a thousand voices wouldn’t stop. Soon, he had joined the shivering masses of scribes, pleading for the insanity to end before the brains of everyone on board the Vista was grinded to mush by the relentless horrors.\n\n“Have you finished reading my reports? I hope they have proven to be incredibly useful in educating you of the dangers on this Earth.”\n\nBut the communications line was terminated, how was this Elvari still contacting them?\n\n“Shut up! Leave us alone!” Baraklis yelled at nowhere in particular. If he ever managed to be free of the presence of this horrifying eldritch horror, he knew he would be shouting warnings of a dangerous Earth to all in Korbax at the top of his lungs.\n\n“Now, now, don’t be such a wet blanket. Being alone is a terrible feeling. Shall I beam myself over to keep you company? I can bring tea and cheesecakes,” Elvari asked, his voices resonating all around the command room.\n\n\n“NO no no! Attention all crew members of the Vista, we are going far far away from Earth, activating light-speed travel to Korbax NOW!”\n\nThis entry is a sequel to the [following prompt here](https://www.reddit.com/r/WritingPrompts/comments/159dd1w/piyouve_been_abducted_by_aliens_it_doesnt_take/).\n\n------------------------\n\n[Thanks for reading! Click here for more prompt responses and short stories featuring Elvari the eldritch god.](https://www.reddit.com/r/TregonialWrites/comments/11tkt9w/eldritch_god_elvari_series/)",
   "created_utc": 1690522613,
   "score": 104,
   "submission_id": "15bli1c"
  }
 ]
}