{
 "submission_id": "15bn74j",
 "title": "[SP] Still in my bathroom, I have now been staring at my own reflection for 14 hours straight. Each time I look away, it's trying to climb out of the mirror.",
 "selftext": "",
 "created_utc": 1690518350,
 "permalink": "/r/WritingPrompts/comments/15bn74j/sp_still_in_my_bathroom_i_have_now_been_staring/",
 "score": 9,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bn74j/sp_still_in_my_bathroom_i_have_now_been_staring/",
 "comments": [
  {
   "comment_id": "jtrgg0x",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690518350,
   "score": 1,
   "submission_id": "15bn74j"
  },
  {
   "comment_id": "jtrizld",
   "message": "It was a normal Saturday. I get up, splash water on my face, look in the mirror. My reflection's eye twitches, but I didn't twitch mine. Weird. I tilt my head. My reflection remains still. This isn't right. Am I hallucinating? I go to get my phone, to record whatever the hell is going on. I look away from the mirror in the process. I see a sharp movement in my peripheral vision, and turn my attention back to the mirror. It appears that my reflection was somehow reaching out of the mirror, trying to pull itself into my world. It had already made significant progress in the moment I looked away. I feel that something terrible will happen if it gets out of the mirror. That a demon will entrap me in the mirror it was once trapped in, and take my place in the world. That I will look on in horror as it destroys my life, and uses my identity to do monstrous things.\n\nI have now been in a standoff with my doppelganger for 14 hours. I am tired. I cannot leave it unattended for the time it would take to reach a communication device. My only hope is that someone will come to check on me after realizing that I have gone dark. I'm already tired, and I probably have days of this standoff to go before help arrives. I worry that I will fall unconscious, perhaps only for ten seconds, and this thing will take all that I hold dear. I can leave no trace or warning that my doppelganger could not just as easily erase. I must not sleep. I must not sleep.",
   "created_utc": 1690519820,
   "score": 1,
   "submission_id": "15bn74j"
  }
 ]
}