{
 "submission_id": "15bugt9",
 "title": "[WP] Death Row Inmates can have their sentence abolished if they can handle a single night in the same cell as you; the most innocent looking person they've ever seen.",
 "selftext": "",
 "created_utc": 1690542711,
 "permalink": "/r/WritingPrompts/comments/15bugt9/wp_death_row_inmates_can_have_their_sentence/",
 "score": 223,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bugt9/wp_death_row_inmates_can_have_their_sentence/",
 "comments": [
  {
   "comment_id": "jtsetot",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690542711,
   "score": 1,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtt2fgk",
   "message": "The last time Brad had come close to meeting death was when he was ten. His uncle tried to kill him because he couldn't bear the thought of Brad's father having children while his own were dead. \n\nHe could say that he became a monster because that moment. It would be a lie. Even at ten, he wasn't scared. He was curious. What happens when a person dies? How much pain would he feel? Did the rats he stabbed felt the amount of pain? But his father had saved him. \n\nBully for him. He became Brad's first victim. If he really wanted to live then he wouldn't have killed Brad's mother. His mother was a nice woman. She treated Brad like he was just a child who was curious. She kept his curiosity from getting too out of control. \n\nThen a spree began. It was bullies at first, he should know how annoying bullies were. He was one. \n\nThen one day the killings became too boring. It was the same 'Please don't kill me' and 'I'll do anything' were getting tiresome. They bled the same. They cried the same. They even died the same. \n\nLike he said. Boring. \n\nBrad knew it was time to find a new thing. He was always fascinated with Death and since his father robbed him of that opportunity, he decided to give the law a chance. \n\n*\n\n\"Your death penalty will be pardoned if you spent a night with Inmate 204.\" The officer said. \n\nBrad didn't really want to get his death penalty pardoned but he was intrigued now. And it had been a while since he had been intrigued. \n\n\"Sure.\" He said shrugging. \"How bad can it be?\"\n\nThe officer snorts. \"That's what they all say.\" \n\n*\n\nBrad walked down the isolated corridor. There was nothing but a single bulb that illuminated the area. It was creepy. He loved it. \n\n\"You think you are so different that one night would change nothing. They all thought that too. None of them made it to the morning.\" The guard escorting him said. \n\n\"How many have been there?\" He asked. \n\n\"Too many.\" Then he remembers who he's escorting. \"Not enough.\" \n\nHe rolled his eyes. Brad knew he was a monster but some of the people here were actually good. If he could feel then he would've felt bad for them. \n\nThey stop in front of a severely locked door. He banged his baton against the door. \"Step back.\" \n\nThe guard opened the door and all but shoved him inside. Then closed it. He laughed. He was the worst thing to walk the Earth and the Guard was scared of whatever was in this room? Idiot. \n\n\"Hey.\" A soft voice said. A familiar voice. \n\nHe turned back and looked at the most innocent looking man he had ever seen. He was supposed to be afraid of this? He looked like a man the prison ate up.  \n\nBut why did he sound so familiar? \n\n\"Trying to avoid death row?\" He said. \n\nA shock ran through him. It looked like a man but its voice, he sounded like his mother. His sweet, innocent mother. \n\n\"I'm not avoiding it. I was just curious what was here.\" He said feigning indifference. \n\nThis was obviously some sort of mind game. The prison designed this cell to drive people crazy so that they took their own life. He was too logical to go crazy. \n\n\"Hmm.\" He sat on the cot looking at Brad with his green eyes. \n\nThe same shade as his mother's. \n\nBrad gulped. \"What's your name?\" \n\n\"I have many.\" He shrugged. \"The most common among them is Death.\" \n\nBrad couldn't help it. He laughed. \"Sure you are.\" \n\n\"No one believes me, at first.\" He sighs. \"You will.\" \n\n\"Okay, weirdo. Let us assume you are death then why are you in prison?\" Brad asked. \n\nIf this what everyone faced then he had no idea why everyone died before morning. This was ridiculous. \n\n\"Why do you think this is real?\" He asked instead. \n\nBrad frowned. \"The guard just escorted me here. It's the underground floor of the prison.\" \n\n\"Have you seen the layout of prison?\" \n\nAn image flashed in his mind making him freeze. He looked at the man, his face was unnatural. Yes, he looked innocent but now Brad could see beneath the mask. The darkness that swirled inside him.\n\n\"I have been waiting to meet you since I was ten.\" Brad breathed out. \n\nDeath laughed. The cold sound made a chill run down his spine. \"You thought you waited for me. You got caught because you were bored. You thought meeting death would be as easy as the noose around the neck or an injection.\" \n\nBrad started at him. He had waited to meet death, to know what the life beyond held. \n\n\"But I am going to die.\" He said. It's not a question. He had known this ever since he stood on trial.\n\n\"You think it would be easy?\" Death asked, a small smile playing on his lips. \n\nYes. \"No.\" He lied. \n\n\"You don't have to lie. You think you don't feel.\" Death said stepping closer to me. The stench of decaying bodies makes him want to escape. \"You will feel when I start.\" \n\n\"Start what?\"\n\n\"Your death, of course.\" \n\n\"So, you kill everyone that walked in here?\" \n\nDeath laughed. \"Of course not. I fucked with their head first.\" \n\nBrad felt weirdly proud. \"And you can't fuck with mine.\" \n\n\"Of course, I can.\" Death scoffs. \"I just prefer not to waste my time. I have something special planned for you.\" \n\nBrad felt pressure on his neck like someone was choking him. He looked at Death, who hadn't moved from his place. \n\n\"What are you doing?\" Brad choked out. Tears were rolling down his cheeks. \n\n\"You always tested the best method to kill someone on rats.\" Death smiled cruelly. \"You are my rat.\"\n\n**\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690553994,
   "score": 86,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtt241f",
   "message": "***Warning: Explicit description of phycological attacks and mention of previous murders. Viewer discretion is advised.***\n\n\\-----\n\n\"... And think of your mother. Your poor mother, who cried until she fainted in your trial. Do you know how she's doing now?\"\n\n\"S-Stop. Stop it!\"\n\n\"She locked herself in the room all day and night, refusing to eat or drink. She cried and screamed and wished it was all but a bad dream, that her sweet child didn't do anything wrong. Then, one day, she started puking blood and collapsed on the floor. Oh, the unbearable pain is crushing her fragile form. You are killing her from the inside. You did this to your own mother.\"\n\n\"No, you're lying...\"\n\n\"Your mother is becoming a mad woman because of you. You are the one who is causing her all this suffering, you disgraceful scumbag. Your neighbors are avoiding your house like the plague, but they can still hear her screams at midnight.\"\n\n\"Stop- Stop! I said *STOP!!!*\"\n\nThe yell echoed in the cell room, and I'm sure the guards hear it from outside too. I sit cross-legged on the bench, eyeing the man who had crumbled to the floor, hands holding his head. This man had gotten knocked down to his knees, trembling like a leaf. How cute.\n\n\"People are whispering, you know? They said, 'Look at that old hag, her son is a murderer,' 'He got the death sentence this morning,' 'I'm glad I've kept my kids away from those barbarians.' And your mother heard it all, every single word, and she's at the end of her wits now. Maybe a noose seize tight around the neck wouldn't be so bad.\"\n\n\"Please... stop...\"\n\n\"Relax, pal. It's not even past eight yet,\" I laughed, \"Now, where were we?\"",
   "created_utc": 1690553869,
   "score": 61,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtsiidc",
   "message": "Long ago, I made a deal with the humans...\n\nAs an immortal shapeshifter, I was feared, and I loved it. Centuries of terrifying screams and wails of despair.\n\nIt lasted only so long, however. One day, I learned that several of my victims would end up in various different states of health, physical *and* mental. All of a sudden, it made sense why some people were trying to find a way to destroy me. The guilt spanning centuries weighed so heavily, my body ached.\n\nI could never be destroyed, but I could no longer live how I had been. The deal was simple: they can contain me in whatever manner they wished, but in return they were to find humans for me to terrify. I knew they'd accept; there are some very vile people out there.\n\nI'm kept in a spacious cell underneath a prison designed to hold the worst of the worst - there were 'death row' inmates, but this particular prison was known as 'death row' prison because if you weren't sentenced to death, you were locked up for life.\n\nEver since I arrived, my hidden corner of the world became a part of the tour, right at the end of it. The inmate would be given a choice: spend one whole night in the same room as me, or their sentence is carried out.\n\nAll the inmate would see is a young-looking girl, about ten years old, smiling sweetly and reading her books. She was always met with sceptical looks, a few 'aww's', but it always led to the same set of questions:\n\n\"Why is such an innocent girl locked away?\"\n\n\"What is she?\"\n\n\"Is this a joke?\"\n\nThe guard would simply shrug and say \"Will you spend a night in the same room as her, or carry out your sentence?\"\n\nSome would catch on that behind those wide, innocent brown eyes, lurks something horrific and would be desperate to get away; others would scoff and say 'that's not even a challenge'. My favourite ones are the ones who are obviously trying to convince themselves that it's just a little girl.\n\nIf an inmate were to accept the conditions, they'd be stripped, put in a straight jacket and chains, and have something placed over their mouth so that the only thing they can do is scream. At this point, some would try to back out, realising something is up, but once the challenge has been accepted, it's too late. Others would buy the explanation that they don't want the inmate to try to hurt the girl.\n\nThat moment when my next victim is locked in with me... I always relish it. My job is to get them to squirm, to scream, to want to beg to be rescued. They only succeed if they make it through the whole night without screaming loud enough for the guards to hear.\n\nOnly two people have made it through the ordeal. Because they were able to avoid screaming, that meant they also had strong wills and minds, and were able to resist any long-term effects. One of them admitted they were scared shitless and thanked me for showing them what kind of monster they were; I took it as a compliment. The other one was on their knees to the guards, sobbing, apologising over and over, promising to **never** cause trouble again.\n\nRight this moment, I'm waiting for another prisoner to make their decision. \"You have a choice: stay in that cell with her for one night, and be granted a pardon... or wait for your turn on death row. Which will it be?\"\n\n\"That tiny little girl? Really?\" He looks at my smiling face. He's an angsty teenage boy who killed his mate in cold blood for harassing his sister. \"I don't know what game you're playing, but I didn't do anything *wrong*. I'll do it.\"\n\nI wait in anticipation as he's being 'prepared'. Once the mouth thing is on, he's shoved roughly into the cell. I can sense his unease already... my grin stretches all the way to my ears...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThank you for reading! More stories [here!](https://www.reddit.com/r/Crystal_Chronicles/comments/15a7np7/oneoff_stories/?utm_source=share\u0026amp;utm_medium=web2x\u0026amp;context=3)",
   "created_utc": 1690544857,
   "score": 13,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtsp9cp",
   "message": "Ah yes, another toy enters the playpen. It was lured in by my smile and a dark deal, one night with me, or the rest of their lives in prison. Personally, I've only ever had one toy pass up the opportunity to play. Of course, I had my favorite toys, those monsters with bad jackets, and little regret. I always got to browse the toys before they came to my door, a booklet on what they had done to get to where they were. Most of them were hand-picked by me.\n\nFirst, it would start off normal. The toys always loved talking about themselves like they were people. I let them talk as much as they liked, most for quite a long time. The toys never knew just how well I knew them. My mouth never moved, but they heard my voice regardless. \n\nThat's when the fun truly begins. The toy would always go to the fountain and get a drink, not knowing what they were consuming. The guards knew not to look into my playpen after the toy began to drink. They'd turn around after satiating their thirst, only to see me as I truly am. \n\nAll my mouths in a lewd smile, all of the pairs of eyes gazing directly into the toy, I'd always ask the toy what's wrong. They'd never get the chance to answer coherently. It's like they've never seen a monster before. \n\nWell, unless they looked in the mirror.",
   "created_utc": 1690548340,
   "score": 94,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jttgklb",
   "message": "\"One night with a random dude? Easy!\" The guard shook his head as they walked down the corridor towards the elevator. \"You're fucked bro. You have no idea what I'm gonna do when I get out!\" The guard remained stoic as the inmate insulted and threatened him. He knew. He knew exactly what was about to happen. He was just glad it wasn't him. The inmate kept arrogantly talking about how he would get revenge on everyone who put him here. Even as they walked down the darkened corridor. They stopped in front of a concrete door covered by a large steel door. It looked rusted and had no window. Silently the guard turned to him. \"Hands out.\"  The convict smirked as Guard uncuffed him before opening the door. \"Good luck.\" The convict stepped in to the cell. It was illuminated with a single dim lightbulb. From a darkened corner the inmate dwelling within stepped forward. He stood about 5'9 with long worry looking black hair and a Scraggly looking beard. His skin was pale, and his ribs clearly visible beneath his skin as though he'd been down here a while. He had some muscle but was rather scrawny looking. Hardly a threat to anyone. \"You're here to... Be absolved?\" The man asked. The convict smirked. \"That's right toothpick. Let's get one thing clear. You annoy me, and I'm gonna kick your ass, then I'm going to shove your head up your ass, understand?\" The man smiled. \"Perfectly. But you have no power here.\"\n\n\"Don't test me you little-\" The man stepped fully into the light. He wore no shoes but and only a pair of ragged pants. \"Apologies.. My last Guest tore my shirt trying to escape. They haven't given me a new one yet. So.. What are you in for?\" The man held a pleasant smile. \"Killed a cop. Allegedly.\" The man cocked his head a moment before asking. \"Sentence?\" The convict glared at him. \"25 years.\" The man held his pleasant smile. \"A quarter of your life. How long have you been here?\" The convict rolled his shoulders. \"About 4 years now. And I'll be put tomorrow.\" The smile seemed to grow on the man. \"Confidence... I like it. Well let's begin. I too have some ground rules. You can do anything to try to survive. Beat me, stab me, do whatever you feel necessary to survive. Use anything in this room. However, if you fail I will-\" He was cutoff as a fist slammed into his jaw sending him sprawling on the ground. Within seconds the convict was on top of him, raining blows into his face. As another blow landed on the man, the man laughed. The convict sat confused for a moment before a punch from the man sent him flying across the cell. \"Well done! Well done... You understand that I was serious... But now.. It's my turn.\" The convict looked up as the man smiled again, exposing his teeth. Each one slowly began sharpening to a point before his eyes, the mans own eyes getting wilder as he stood motionless. \"What the fuck... What are you?!\" The man laughed crazily as he took a step forward. The convict was quickly to his feet and threw a punch. Within a millisecond the man caught it and with a small twitch a loud crack was heard as pain exploded through his arm. He screamed as he glanced down and saw an obviously broken arm. \"Try again!\" the man crazily laughed as the convict rushed past him and grabbed a wooden chair. With a hard swing it broke over the man's head. The man laughed again before gripping the convict by his neck and lifting him up. The Convict gasped for air before plunging the splintered end of the broken chair leg into the neck of the man. An unholy screech erupted from the Man's mouth as he dropped the convict. Quickly the Convict began pounding on the door. \"Let me out of here you bastards! HEY LET ME OUT! HELP!\" A maniacal chuckle sounded behind him. \"No one is going to let you out until tomorrow...  But..\" The bloodied splintered chair leg dropped at his feet. \"...You won't make it that long.\" A set of sharpened teeth clamped down on his neck as he screamed, then was no more. \n\n\nThe next day the guards opened the cell to find the man sitting in the corner. His musculature far more defined now, his body now had far more weight to it. His skin a healthier tan. His hair now more voluminous. \"He smiled at the guard. Wonderful meal last night. You can take the scraps if you want.\" He motioned to a bloodied tattered prison uniform and a set of bones. The guard shuddered a bit before collecting the remains and stepping to the door. \"See you next month Officer....\"",
   "created_utc": 1690559350,
   "score": 74,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jttjxq2",
   "message": "He couldn't believe the offer was real. \"A single night with a well dressed, friendly looking man? How hard could it be?\" That's what they all think. He agreed to the deal and the guard brought him up to my cell.\n\n\"It does seem a lot creepier coming closer\" the new inmate thought, \"and you can't even see the back of the cell\". I slowly stood up and walked towards them as the guard opened the door. \"Why isn't it locked?\" the inmate thought?\n\n\"Because it's not needed\" I said to him. Confused he looked back, but the guard was already gone. \"What is going on here?\" he mumbled. \"You're here to get what you deserve.\"\n\nThe voice didn't seem to come from anywhere. It just formed in the inmates mind. He spun around, looking directly into my face. I still smiled politely, while my face slowly started to melt. He took a step back, looking at me in horror. \"What's the matter Robert? You seemed to enjoy this sight, when you poured acid over your victims\"\n\n\"Who told you?\" he cried out \"Who told you my real name? Not even the police know my real name!\"\n\n\"Oh, I know so much more, Robert. For instance how you tortured some of your victims, before you finally gave them the killing blow.\"\n\nI laughed as his face grimaced in terror. In the blink of an eye, I burst into a mixture of flesh and blood, completely engulfing him in just a few moments. His screams got soon replaced by the sound of gargling. He fought as hard as he could, but he didn't stand a chance.\n\nJust as he thought it was over, he found himself lying on the floor of a warehouse. He looked around and he seemed to remember this place. This is where he committed his first murder. In the corner of his eyes, he saw a man wearing a hoodie come closer. He recognized the hoodie as well. It was himself. He tried to talk, but the voice was not his own and the man didn't listen anyway\".\n\nWhen the guard arrived at the cell at the next day, I was already up, waiting at the bench, with the same smile as the day before. In the back of the cell, there was a person cowering. The guard almost didn't recognize him. His skin turned pale and his hair turned grey. Big bald spots where visible where he had ripped his own hair out.\n\nA shiver went down the guards spine as he entered the cell to collect the inmate. \"You wont need them.\" I said, as he tried to get his cuffs out.\n\"It's protocol\" the guard said. \"But his soul already left.\" I said, sounding real proud of my work.\n\"What do you mean, his soul left?\" the guard asks.\n\nI smiled. \"Most souls don't come back, after being tortured for eternity!\"\n\n\"For eternity?\" the guard asked confused?\n\n\"Well, I condensed it into a few hours. Nothing you would understand, mortal. Let's just say, everyone gets what they deserve in the end. They don't call me the devil for nothing!\"",
   "created_utc": 1690560580,
   "score": 64,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jttiag6",
   "message": "*Open to a person, INNOCENT, sitting in a prison cell staring at the ceiling. After some time PRISON GUARD brings another person, PRISONER, to the cell. PRISON GUARD opens the cell door, uncuffs PRISONER, and motions.*\n\n\n*INNOCENT stares at PRISONER as they enter the cell and sit across from INNOCENT. The two exchange short greetings. PRISON GUARD walks away.*\n\n\n*INNOCENT’s eyes are wide open.*\n\n\nPRISONER: So...I just have to survive a night with you? What's special about you?\n\n\nINNOCENT: [staring at PRISONER] Nothing. I'm just...just broke the law.\n\n\nPRISONER: Are you some sort of monster? A vampire? Going to eat me or something?\n\n\nINNOCENT: [looks away from PRISONER, partially towards audience, still unblinking] What? No. No. I'm...human I guess? [beat] [quietly] Vampires?\n\n\nPRISONER: There has to be some catch. What's the deal? What're you in for?\n\n\nINNOCENT: [turns to face PRISONER, eyes wide open] Drugs. \n\n\n[PRISONER closes their eyes and faces the ceiling and sighs. Some time passes, and PRISONER turns to look at INNOCENT]\n\n\nPRISONER: You're weird. What's wrong with your eyes?\n\n\nINNOCENT: I need glasses. They took them cause I'm not too nearsighted.\n\n\nPRISONER: No. You...why aren't you blinking?\n\n\nINNOCENT: My eyes aren't dry yet.\n\n\nPRISONER: Yeah, but...people blink.\n\n\nINNOCENT: Yeah.\n\n\n[a pause, PRISONER stares hard at INNOCENT. PRISONER blinks very noticeably]\n\n\nPRISONER: Blink.\n\n\nINNOCENT: I don't need to yet.\n\n\nPRISONER: Blink!\n\n\nINNOCENT: I don't want to. I...I'm very good at keeping my eyes open.\n\n\nPRISONER: [closing their eyes, shaking their head] You're a freak.\n\n\nINNOCENT: I'm sorry...my eyes are getting dry.\n\n\nPRISONER: Big deal!\n\n\n[INNOCENT very noticeably closes their eyes. 'Hey, Mickey!' by Toni Basil starts playing]\n\n\nPRISONER: [confused] What...what the hell is that?\n\n\nINNOCENT: 'Hey, Mickey!' by Toni Basil.\n\n\nPRISONER: Yeah, I know. I know the damn song. Who the hell is playing it?\n\n\nINNOCENT: Sorry. It...it happens when I blink.\n\n\nPRISONER: The song...starts playing...after you blink?\n\n\n[INNOCENT looks down and away from PRISONER, nods]\n\n\nPRISONER: That's it? I just have to hear this song a few times and I'm good? This is gonna-\n\n\n[INNOCENT turns away, eyes shut. 'Hey, Mickey!' starts from the beginning]\n\n\nPRISONER: [eyes widen] No...\n\n\n[INNOCENT opens their eyes and with a solemn look on their face looks to PRISONER, and nods. Some time passes.]\n\n\nPRISONER: So what? My brothers used to beat me up. I can handle a stupid so-\n\n\n[INNOCENT puts their head in their hands and closes their eyes. 'Hey, Mickey!' starts from the beginning. INNOCENT groans]\n\n\nPRISONER: [visibly panicking] Just...just keep your eyes closed! That'll...just keep your eyes closed!\n\n\nINNOCENT: It just repeats. If my eyes are closed...it repeats.\n\n\n[PRISONER stares at INNOCENT with shock. A longer pause.]\n\n\nINNOCENT: I'm sorry. I...got something in my eye. I need to blink.\n\n\n['Hey, Mickey!' starts from the beginning.]\n\n*Edit: Had the wrong artist. I’m not up to date on recent music it seems*",
   "created_utc": 1690559975,
   "score": 44,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jttv38u",
   "message": "The Challenge was simple, the prize was high. One night with me for their freedom; eight hours without sleep, eight hours of listening to me talk. Many had taken the offer, none succeeded. Most begged for release after I opened my mouth; deciding prison, even death row, was preferable to my company. Those who lasted longer were never the same, one man imprisoned for tax evasion lasted three hours without expression before quietly standing up, walking to the wall and attempting to put his face though the brick. Hours of reconstructive surgery were required to give him the semblance of a face, and after the local news ran the story, it was decided the offer would be limited to only the worst criminals; those that would be unmissed by society.  \n\nI was sitting at my computer when I received a call from police chief O’Connell about the latest inmate to take the deal. He began droning about the man’s offenses, multiple murders or some such, and I checked the time, ten forty-five pm. I was unhappy with the interruption because I was a man of structure. Every day from nine o’clock to eleven o’clock I found a forum that had not yet banned me and spread my word. Looking at the replies to my post I decided cutting my social time short would not have a significant impact. Dozens of replies screaming obscenities, threatening harm to myself or themselves, messages of hate and malice filled the screen. I shook my head in disappointment, I assumed ‘Cute Puppies FTW’ would be more civil. “I’ll be there” I replied, cutting off the chief who immediately hung up the phone. Most hated my voice; one man described it as monotonous, slightly louder than a whisper, with the power to bore into your head like angry hornets.  \n\nI drove to the station five miles under the speed limit, as was my habit. When I walked to the gate I was ushered in, no ID was necessary. All here knew my face, and none wished to speak to me. Chief O’Connell led me to the interrogation room the prisoner was held in; his voice shook slightly as he went over the prisoner’s record. “ The name, please.” I muttered, but the chief jumped as if I had shouted.  \n“K-Kevin Miller.” He stammered, clearing his throat. “Right here sir. I know he’s a murderer, but… be kind please.” He opened the door and I walked into a room that time forgot. Harsh fluorescent lighting and white brick walls gave no indication of the time outside. There was no clock, no pitcher of water, nothing that could be used as a weapon. Kevin sat with his hands folded, handcuffed to the steel table in front of him. He smirked at the handcuffs, then at me, not realizing they were for his own protection, for multiple men had attempted to carve out their own eardrums rather than listen to me. O’Connell started a timer “Eight hours Kevin, God be with you.” and walked out.  \n\nI sat across from the accused and steepled my fingers. “Kevin, is it?” I asked softly. He nodded, the first sign of worry wrinkling his brow. “Excellent, let's begin. I would like to talk to you about an exciting opportunity, how much do you know about cryptocurrency?”",
   "created_utc": 1690564688,
   "score": 40,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jttqolf",
   "message": "“Now it is time for the biggest decision of your life,” the prison guard, Steve, said, after I’d been admitted to the so-called “death row” of this maximum-security prison.\n\n“You have a choice: Serve your sentence until death, or spend just one night with the occupant of Cell 042.”\n\n“What’s the deal with this person, Steve?” I asked. “Why does that get me out of jail after…after what I did?”\n\n“If you make that choice, you’ll see for yourself. Just so you are aware, only a few people have successfully spent the night in Cell 042.”\n\nAfter considering the situation for a few minutes, I answered, “Why not? I don’t have anything to lose anyway. With no real hope of getting out early, I have no chance. I’ll spend the night in Cell 042.”\n\n“Are you certain?”\n\n“Yes. Put me in.”\n\n“Alright. Just remember, you asked for this.”\n\nSteve opened the door, ushered me in, then closed and locked it behind me. I looked around the room, and the only other occupant was an ordinary man, in his mid twenties to early thirties, sitting calmly in a chair. He had an open, even friendly expression, and smiled at me when he entered. “What is your name?” He asked.\n\n“Michael. What’s yours?” I returned nervously.\n\n“Stephen.”\n\n“So, what’s the big deal with staying in this room for one night? It seems a rather easy escape from a lifetime in prison.”\n\n“You’re right. It is easy. All you have to do is to have a conversation with me.”\n\n“What’s so bad about this conversation?” I asked with increasing anxiety.\n\nIt is just a normal conversation, that you may have had before. Now, before I begin, I will warn you: Keep in mind that you entering the room means that you cannot escape or avoid this conversation. Do you understand?”\n\n“Yes. So, what do you want to talk about?”\n\n“I have been trying to reach you concerning your car’s extended warranty. If you could give me your name and address so that I can give you relevant information for your location, that would help.”\n\n“I…I’m right here with you.”\n\n“Ah; in prison. That makes it simpler. Very few prisoners have cars available to them. Now, would you like your warranty to cover theft, accidental damage, or collision?”\n\n“I would like to go with collision insurance.”\n\n“Alright. One car with a collision warrant, coming right up.”\n\nThere was an abrupt crunch, and the front end of a car broke through the wall in front of me. It stopped across the room from me, but its impact with the wall launched a chunk of stone that hit me in the head, and I collapsed to the floor.\n\n—————————————————————\n\nI woke up, feeling a dull, throbbing pain in my head. Strangely, it felt as though I was sitting at a table, and holding a phone in my hand. As I came to, I made a decision: Never again would I slam my head on the desk as hard as I could when frustrated by telemarketers.",
   "created_utc": 1690563057,
   "score": 29,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtu6q8a",
   "message": "TW: Both descriptions of and allusions to crime (especially murder), self-destructive tendencies.\n\n\u0026amp;#x200B;\n\n\\---\n\n\u0026amp;#x200B;\n\nThe chair was visible through the bullet resistant glass where the witnesses would be brought in, looming and terrible in its own right as it was being prepared for *him* to be electrocuted to death in; a horror that was too large to really grapple with and as a resulted seemed distant despite being very very close. He'd already met with a priest asking for one last confession, a man much younger than he was and clean-shaven, eager to save his soul he supposed.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\nThis was different, there was a table in the middle of the otherwise empty room and a full five armed guards standing near the door that led into the more unsecured parts of the facility as a women with sharp grey eyes and a steady jaw in an even sharper suit stepped past them to lay a single pen and a thin manila envelope on the table.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\"Inmate #209845, Barnes, Peter,\" she was reading from a single page still in her hands. \"Convicted of thirty-seven murders, eight of them familicide, two suspected to be carnal in nature, if this were still within the court room or any kind of official record I suspect I would be reprimanded for calling you a piece of shit,\" her tone went from crisp and professional to a certain thick disgust that seemed like she wanted to snarl and take one of the weapons to finish him off herself. \"Unfortunately I'm here to offer a choice instead, you may walk into that room and embrace the execution you so richly deserve, or...\" she paused and picked up the pen, stepping closer even as two of the guards spread out and raised their weapons to point right at him.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\nHe tentatively took it, making no sudden moves but approaching the table as she gestured, what could this possibly be about? Peter stayed silent as she finished, he'd been in a cell for nearly fifteen years, a little patience before his sentence was carried out wouldn't hurt — and though he was a big man over six feet tall and with arms like a lumberjack, he knew he couldn't overcome five guards ready to catch him in a crossfire either.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\"...or you can sign this document, you will then be transported to fenced-in manor just outside of the prison complex, if you remain within the building for the entirety of the night then your sentence will be waived. Stricken from the record, you will be allowed to return to society as if your crime had never happened under a new identity, subject to monitoring and an implanted tracker,\" she pushed the envelope over, where it only had a single page inside it detailing the exact nature of the proposal and a lack of liability for anything that happened over the ten hours he would be inside the building in question.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\"Fine,\" he could read the disappointment on her face as he scribbled his name, she clearly wanted to watch him die and if anything that only motivated him more, he'd learned more about guilt in the 15 years within the walls than the 20 he'd had outside of them, and yet it was still an incredibly distant regret on even of the best of days; he was a monster and no more likely to apologize for that than he'd expect anyone calling for his blood to feel sorry either.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\"Very well,\" the scorn and disappointment were muffled as she put on a gas mask, and all the guards did the same as fumes suddenly flooded into the room through the vents, dizziness driving him to his knees as the last thing he saw was the floor rushing up like a freight train and then everything was pitch darkness for a moment suspended in eternity as if he was floating in a pool, lost in dreamless sleep until he coughed awake and found himself on his knees in front of a building that could have been said to be brooding. Tall, imposing, every window barred with iron and the surrounding fence more imposing than the one around the prison, barbed wire visibly sparking with a current that would both shred and electrocute anything trying to climb over it.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\nThat there were *three* mounted fifty caliber guns pointed towards a gate barely wide enough for anyone to walk through single file didn't escape his notice as it was slammed shut behind him and locked with enough steel bars that he didn't think even a tank would get through, one of the guards raising a megaphone to his mouth to deliver instructions. \"Inmate, you will enter the building, we will give you instructions when you are allowed to leave the building. If you leave the building before receiving our instructions, you be collected and executed at dawn. If you refuse to enter the building, you will be collected and executed at dawn. If you successfully survive the next ten hours, you will be collected and freed, if you attempt to speak to us or even reply to this announcement now, you will be summarily executed here,\" he lowered the megaphone and pushed up ear protection from his neck to cover his ears, as did the others nearby.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\nIt was tempting to ask, but he took them seriously and he steeled himself for the unknown. It could have been just a prank right? Step through the door into the unknown or die? That was a fable about taking a risk and most chose execution, even though there was nothing on the other side but freedom. It couldn't be that simple, right? He'd been killed nearly a hundred times from the other inmates in his stay and he had the scars to prove, no one wanted him to survive.Peter pulled open one of the heavy mansion doors and stepped through into an expansive foyer, flowering with hundreds of green plants as the door slammed shut behind him, a single beam propped nearby that seemed to fit against slats in the door... to block it from opening again? That was an easy choice, he wasn't leaving, and it was easy to lift and settle into place, leaving him still able to leave if he just removed it, but at least not in a moment of panic or by falling into the doors and pushing them open with his weight alone.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n**\"Hello,\"** the voice wasn't his, and he spun to find the foyer just... gone, leaving him stepping back and bumping into the door. There was only darkness above the floor that seemed to stretch out into infinity along with the white and black checkered tiles. Standing in the middle was a young man dressed in an orange jumpsuit, but where the numbers should have been there was only a scrambling mess of color that seemed to change on a whim. He was pale-faced with a shock of spiky dark hair and hazel eyes that almost seemed to glow in the surrounding inky darkness... something clearly illuminated his outline, and despite how almost-normal he was, Peter felt a horror sinking into his gut as if he had been impaled through and paralyzed from the waist down in a single painful moment.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n*\"Hello,\"* what else was he to say? Peter knew his tone was stiff from forcing trepidation out of it, not at all like the other man's — barely more than a kid from age, early twenties at best — tone, which seemed to come from everywhere and carry a faint amusement, as if he had been whispering despite the normal volume.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n**\"My my, Peter, you have been busy,\"** the other spoke; Peter coming to a realization that it wasn't human in the same moment something seemed to scrabble around in his brain, like claws, as if a crab had taken up residence in his skull and was picking through thoughts and memories without any hesitation. **\"More than 70 kills, you snuffed out over twice the number you were convicted for, like a cheap cigarette, oh the sights I'm going to show you would make those guards outside tremble if they knew,\"** the tone changed to smug, anticipating, as the world seemed to tilt and Peter slid closer, only to stop as suddenly as he started and the floor leveled... leaving him circled by the otherworldly boy like a seal bleeding in the water.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n*\"What do you mean?\"* It was impossible to deny the lurking sense of terror now, it was close and yet not touching, more like a spider than a shark; he could see why people might run before being trapped in the invisible web that seemed to be growing closer with every moment, but his was a cold soul and it was the only reputation he had, sometimes a lie was good enough, especially one you believed about yourself.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\nThe boy stopped, spreading his arms and shaking his head. **\"It wouldn't be fun to warn you. Did you know sometimes they send someone truly innocent here? Those survive far easier than people like you, true evil has an almost crippling weakness, allow me to show you,\"** pure cold erupted on Peter's forehead where the boy touched fingers to his skin suddenly, and he was falling... pulled down and landing heavily on the floor only to open his eyes and realize he was somewhere else entirely. Somewhere familiar, a distant fuzzy realization beginning to sink in as he looked down and saw everything had changed.\n\n\u0026amp;#x200B;\n\n\\---\n\nEdit: [put the entire thing in a self-post because my replies here aren't working.](https://www.reddit.com/user/ApocryphaJuliet/comments/15c5uoy/death_row_writing_prompt/)",
   "created_utc": 1690568990,
   "score": 6,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtux5u1",
   "message": "\"it's just one night, it's just one night, it's just one night, it's-\"\n\n\"By my count, you have 3,008 nights left, are you sure you want to spend them all in one place?\"\n\nI can't see it, I'm curled up into a ball as tightly as possible. Despite the blanket, I hear him perfectly.\n\n\"Y-yes, I know what I did, but I can't stay here, people are relying on me.\"\n\n\"They wanted you there, yes, but the show goes on. Your part has ended\"\n\n\"But you can help me, right? I'm ready, do whatever you must.\"\n\n\"Bite the leather, you will scream\"\n\nSomething hot slithers under the blanket, around my head. It's wet. Gently it slips into my ear, and then not so gently it begins to probe into my brain. It jiggles random memories and experiences, leading further and further down. Barely perceptible is the sound of a man wailing endlessly.\n\n\"Thank you\"",
   "created_utc": 1690579004,
   "score": 3,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtvlo1w",
   "message": "\\~ A Night in Hell \\~\n\n\"A night with this guy?\" Billy \"The Butcher\" sneered at the cell in front of him, where a scrawny little man sat looking owlishly back up at him through his thick glasses. \"What's the catch?\"\n\n\"No catch,\" said the warden. \"Just one night in his company, from sundown to sunrise the next morning, and no violence.\"\n\nThe little man blinked up at Billy and rubbed his nose, and Billy scoffed. \"That's it? What is he, the next Charles Manson or something? Gonna hypnotize me and make me go out and stab a bunch of people? 'Cause, I don't need to be hypnotized for that.\" He shot the little man a contemptuous look.\n\n\"We're familiar with your track record,\" the warden said dryly. \"There's no trickery involved here. You just spend one night in his cell — no violence — and the next morning, you're free to go.\"\n\nBilly scoffed. The warden must've been taking stupid pills this morning. Still, Billy was no fool. He was due to be executed a week from now. The jury hadn't even had to deliberate at the end of his trial, but had delivered a resounding, \"Guilty!\" the instant the judge had stopped talking. He knew he had no other options. He just didn't understand why they were so eager to reverse their decision.\n\n\"Sure,\" he said at last. He smirked down at the owlish little man, who hadn't moved the entire time. \"Why not?\"\n\nThe warden unlocked the cell door and stood back to let Billy in. Once Billy was standing inside the cell, the warden locked it behind him and turned to leave. \"Sweet dreams,\" he said to Billy, not even bothering to hide his amusement.\n\nAfter the warden had left, Billy turned back to his new cellmate. The little man smiled up at him. A naïve, trusting smile. \"Hello,\" he said to Billy. \"Nice to meet you. My name is Arthur.\" He held out a hand for Billy to shake.\n\nBemused, Billy took Arthur's hand, forcibly reminding himself to just shake it and not crush it in a show of dominance. \"You can just call me The Butcher.\"\n\n\"I'm very pleased to meet you, Mr. Butcher,\" said Arthur, pushing his glasses up his nose. \"I'm just waiting here for a lift. I expect someone'll be by any minute to take me away from here, and I'm all ready to go.\" For some reason, he held up a towel he must've swiped from the bathroom.\n\n\"Uhh, that's great.\" This guy clearly had a few screws loose, Billy thought. Was this supposed to be some kind of test? If Billy could make it through the night without strangling him, he'd prove he was reformed and be free to go? That kind of made sense.\n\nNow Arthur started looking around, a small frown creasing his forehead. \"Do you know my friend Ford? I thought I might run into him before I left, but I haven't seen him, have you?\"\n\n\"Uh, no,\" said Billy, pretending to look around as well. Yep, this guy was nuts, all right. \"Sorry.\"\n\n\"Oh, well,\" said Arthur. \"I'm sure he'll turn up. Anyway, I don't mind waiting. It gives me time to work on my poetry. Would you like to hear some?\"\n\nBilly tried not to laugh. This had to be good. \"Sure,\" he said.\n\n\\*\t\\*\t\\*\n\nFrom a desk just outside the cellblock, the warden looked at his watch. Fifteen minutes. He cocked his head in the direction of Arthur's cell and listened. Any minute now . . .\n\nAs if on cue, screams of horror began echoing down the cellblock. Whistling, the warden opened the door and strolled down to where Billy stood just inside the bars, clutching his ears in agony. \"No more!\" he screamed. \"No more! Kill me right now, but don't make me listen to one more second of that!\" He let go of his ears long enough to rattle the bars of the cell.\n\nAs the warden locked a sobbing Billy back in his own cell, one of the night guards walked by, raising a curious eyebrow. \"What's going on?\"\n\n\"Oh, just a little bet we have going,\" said the warden. He explained the deal he'd made with Billy. \"So far, no one's lasted more than twenty minutes with this guy.\"\n\nThe guard looked more curious than ever. \"What does he do in there?\" he asked in a hushed voice.\n\n\"We're not quite sure,\" said the warden. \"We just know that he's obsessed with *Hitchhiker's Guide to the Galaxy* and thinks he's about to be beamed out of here any moment. Even writes his own Vogon poetry.\"\n\nThe guard winced. \"Don't you think that's a little harsh?\"\n\n\"Maybe,\" said the warden. \"But this is the first time we've ever had people *volunteering* for the death penalty.\"\n\n\\~ The End \\~\n\nThanks for reading!",
   "created_utc": 1690589278,
   "score": 6,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtvo5st",
   "message": "The cell door slammed shut, leaving five inches of steel between the rest of the world and the two Orange clad inmates.\n\nEric had taken the bargain, a single night with the cells inhabitant in exchange for his freedom, and like every inmate who had taken the deal before him, he couldn’t wrap his head around it.\n\nHe expected some hulking monster of a man, some animal that would tear his throat out with its teeth as soon as he turned his back. \n\nInstead, sitting at the back of the cell was a rail thin man with a bushy beard and long black hair that covered his shoulders. He looked more like a yogi than some hardened criminal, and something about that made him more uneasy than anything else.\n\n“So, what’s the real deal here? What’s the trick?” Eric turned to the man, straightening his back in an effort to feel bigger, safer. \n\nThe man met Eric’s eyes with his, shining a bright blue, and Eric could barely manage to keep from looking away. \n\n“There’s trick Eric.” The man’s voice was young and silky, not at all matching his weathered face. “If you stay here until tomorrow morning, you’re free to do with your life what you please. Of course you can leave at any time, you’re no more a prisoner in here than out there.”\n\n“Then how come no one else has stayed?”\n\nThe man’s face, young and old at the same time, fell into a gentle but sad smile.\n\n“That was their choice. They came to it after we talked.”\n\nEric slid down the wall, sitting directly across from the man.\n\n“And what did you talk about?”\n\n“Life. Death. Choices and their effects.” \n\nEric felt a knot form in his stomach that he just couldn’t unwind as the man continued.\n\n“Why’d you end up in here Eric?”\n\nThe way the man spoke was soft, but more a command than a question, one that couldn’t help but be obeyed.\n\n“I killed a man during a robbery.” Eric admitted through gritted teeth. “I didn’t want to, didn’t mean to pull the trigger either, but he’s dead and now I’m here.”\n\n“I know that. You still meant to steal from him, and you were willing to use force to do it. Why?”\n\nEric felt sweat run down his back, his heart quickening with a fear that he thought died so he could survive in prison. \n\n“I needed the money. I made too many mistakes when I was young, ran out of options. It seemed like the only way out.”\n\nEric looked up from his feet to see the man staring into the ceiling, hands resting palm up at his sides. A dreadful weight seeped into his stomach before the man could speak again.\n\n“He had two daughters and no wife to leave them too. What options did you leave to them?”\n\nEric wanted to clench his jaw. He wanted to stand up and force the man to shut his mouth. He wanted to not think about what he had done, but that was all that he could do.\n\n“I know that. I know.” Eric swallowed, his voice falling to a whisper. “Will they be okay?”\n\nEric looked at the man, trying to read something, anything in his face. There was only some flicker of light in his eyes that he couldn’t make any sense of.\n\nThe man gave another sorrowful smile. “Only tomorrow can tell.”\n\nThere was a long moment of silence, an overwhelming weight to it that threatened to smear Eric into the smooth concrete floor.\n\n“What would you do with your freedom Eric?”\n\n“What?” Eric asked.\n\n“If you were to walk free tomorrow, your life entirely your own, what would you do?”\n\nEric looked at his hands, trying to determine an answer from the many callouses and scars that decorated them. \n\n“Honestly? I hadn’t ever thought of it. I thought this was the end, that this was it. I don’t know if I ever could be a part of the world, live and not just survive off what I could take from others, but I can’t go back to that life either. I never killed a man before, and the longer I’ve been in here the less I think I can live with being a murderer. I don’t know if there’s anything out there for me.”\n\nEric looked up to where the man sat, only to find his spot empty. Eric bolted to his feet and looked around the cell. \n\nIt was empty.\n\n“Then what brought you to my cell?”\n\nThe man’s voice came from behind Eric, now strong and imperial. Eric froze, unable to move a muscle.\n\n“Why Eric?” The voice demanded in a voice like thunder. “Why do you want to live?”\n\nEric began to choke with tears as he struggled to find the words, the true words, to answer the question.\n\n“WHAT LIFE DO YOU THINK YOU DESERVE”\n\n“I don’t!” Eric threw the words from his mouth, stumbling to his knees as if he had just toppled a mountain. “I know I don’t deserve to live after what I’ve done. I know I can’t live with it. I just didn’t want to die as just a murderer. I don’t want to leave this world as an animal. I want to know that for at least one moment of my life I was a man, a better man than I’ve ever been.”\n\nEric crumbled to the floor and began to sob for the first time in years, all the pain and sorrow he had hidden away and ignored flooding back in a moment of complete and utter despair and torment. He felt a hand on his shoulder, and there was a calm to the storming in his head and heart.\n\n“You will die a murderer Eric, there’s no absolving you of that. You will always be known for your crimes, and you will never escape them.” The voice gradually eased into something soft and gentle as rain. “But if you chose to, you can live your remaining days making up for them.”\n\nThe hand on his shoulder lifted, and Eric fell into a deep and immediate sleep.\n\nWhen he woke up, it was to two guards shaking him awake and dragging him to his feet. Still delirious, Eric didn’t bother struggling against the manhandling, only trying to spot the man inside the now spinning cell.\n\nIt was empty.\n\n\n\n\nAfter his release from death row, Eric spent his life penniless and alone. He cleaned streets, helped feed the needy and worked day and night; every cent he made going to the orphans he had created. In his final days, after years of poverty and starvation, he dreamed of the cell and the man within it. With his final breath, Eric left the world as a man.",
   "created_utc": 1690590401,
   "score": 7,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtwf4ge",
   "message": "“Okay, so the game is called Magic the Gathering,\" I said to the confused-looking inmate. After a few moments of explaining the rules, the look of confusion slowly changed into one of concern. \"Don't worry,\" I said, attempting to alleviate their fears. \"The game sounds more complicated than it actually is... well, that's not entirely true, it probably is more complicated than it sounds at first, but you should be able to catch on pretty quickly.\"\n\nI had been invited to this prison as part of an \"enrichment\" program to share tabletop games that I love with inmates. Magic was my personal favorite, and since these events were usually one-on-one, I felt it was the perfect game to share. The first few minutes of teaching the rules were always the hardest. However, those who gave it a chance had really picked up the game better than I could have dreamed! I had a feeling that tonight was going to be another good one.\n\n\"I am sorry about the cuffs,\" I said. \"There was an incident during a previous gaming session, and the guards felt it prudent to take precautions.\" In retrospect, it was my fault the incident had happened. I made the unfortunate decision to include a card named \"Prison Sentence\" in one of my decks and played it on one of their creatures, causing them to lose the game. Understandably, they had gotten upset, but I had not expected them to attempt to strangle me in response. I rubbed my neck, remembering the bruises that had taken weeks to fade following the altercation... I had since removed cards from my decks, including one named \"Strangle,\" that I thought were tactless given the circumstances. The last thing I wanted was to upset these people; they were dealing with enough as it was.\n\n\"Okay,\" I said after demonstrating how the first few turns of a game would work. \"I think we are ready to play your first game. Do you have any questions before we start?\" The inmate took a deep breath and reached out to take the deck that I offered them. Nervously, they asked, \"How many games do we have to play?\" \"As many as you want!\" I responded brightly. \"The warden says we can use this cell until sunrise, but you are free to leave and go back to your own cell whenever you want. I am not going to force you to stay here and play with me, no matter how much fun I think it would be.\" The inmate paused, \"Do you usually play all night?\" they asked after a moment. \"Oh no,\" I said reassuringly. \"We have never played all night. Most people run out of steam after around 10 hours or so.\" The inmate looked shocked by this news. \"Who knows, though, maybe tonight will be the first!\"",
   "created_utc": 1690603745,
   "score": 2,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtwqcyx",
   "message": "\"Hi, I'm Jack,\" I said.\n\nFlicking my curls a little, I smiled at him as warmly as I could.\nThe brute eyed me up and down, seemingly confused. They all started that way. I didn't bother reaching to shake his hand. These burly types didn't exactly do basic decency.\n\n\"What are you in for?\" His voice was deliciously gruff. Perfect.\n\n\"Murder.\" No sense in hiding it. \"You?\"\n\n\"I'm innocent,\" he said. Adorable.\n\n\"Indeed,\" I replied. \"Have any family?\"\n\n\"If I do, they'll pay for letting me rot in here when I get out.\"\n\nExcellent.\n\n\"You say you're innocent.\" I shifted on my cot. He tensed, staying near the door. \"You've never done anything wrong in your life?\"\n\n\"That's not what I meant. I-\"\n\n\"Oh yes, gumdrop, I know. The way I see it, we're all guilty of something. What that something deserves depends on who's asking.\"\n\nThe man-child took a step forward, fist clenched.\n\n\"Gumdrop? Maybe you should watch your mouth, little thing. Before someone puts it to better use.\"",
   "created_utc": 1690610702,
   "score": 2,
   "submission_id": "15bugt9"
  }
 ]
}