{
 "submission_id": "15bugt9",
 "title": "[WP] Death Row Inmates can have their sentence abolished if they can handle a single night in the same cell as you; the most innocent looking person they've ever seen.",
 "selftext": "",
 "created_utc": 1690542711,
 "permalink": "/r/WritingPrompts/comments/15bugt9/wp_death_row_inmates_can_have_their_sentence/",
 "score": 64,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bugt9/wp_death_row_inmates_can_have_their_sentence/",
 "comments": [
  {
   "comment_id": "jtsetot",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690542711,
   "score": 1,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtt2fgk",
   "message": "The last time Brad had come close to meeting death was when he was ten. His uncle tried to kill him because he couldn't bear the thought of my father having children while his own were dead. \n\nHe could say that he became a monster because that moment. It would be a lie. Even at ten, he wasn't scared. He was curious. What happens when a person dies? How much pain would he feel? Did the rats he stabbed felt the amount of pain? But his father had saved him. \n\nBully for him. He became Brad's first victim. If he really wanted to live then he wouldn't have killed Brad's mother. His mother was a nice woman. She treated Brad like he was just a child who was curious. She kept his curiosity from getting too out of control. \n\nThen a spree began. It was bullies at first, he should know how annoying bullies were. He was one. \n\nThen one day the killings became too boring. It was the same 'Please don't kill me' and 'I'll do anything' were getting tiresome. They bled the same. They cried the same. They even died the same. \n\nLike he said. Boring. \n\nBrad knew it was time to find a new thing. He was always fascinated with Death and since his father robbed him of that opportunity, he decided to give the law a chance. \n\n*\n\n\"Your death penalty will be pardoned if you spent a night with Inmate 204.\" The officer said. \n\nBrad didn't really want to get his death penalty pardoned but he was intrigued now. And it had been a while since he had been intrigued. \n\n\"Sure.\" He said shrugging. \"How bad can it be?\"\n\nThe officer snorts. \"That's what they all say.\" \n\n*\n\nBrad walked down the isolated corridor. There was nothing but a single bulb that illuminated the area. It was creepy. He loved it. \n\n\"You think you are so different that one night would change nothing. They all thought that too. None of them made it to the morning.\" The guard escorting me said. \n\n\"How many have been there?\" He asked. \n\n\"Too many.\" Then he remembers who he's escorting. \"Not enough.\" \n\nHe rolled his eyes. Brad knew he was a monster but some of the people here were actually good. If he could feel then he would've felt bad for them. \n\nThey stop in front of a severely locked door. He banged his baton against the door. \"Step back.\" \n\nThe guard opened the door and all but shoved me inside. Then closed it. He laughed. He was the worst thing to walk the Earth and the Guard was scared of whatever was in this room? Idiot. \n\n\"Hey.\" A soft voice said. A familiar voice. \n\nHe turned back and looked at the most innocent looking man he had ever seen. He was supposed to be afraid of this? He looked like a man the prison ate up.  \n\nBut why did he sound so familiar? \n\n\"Trying to avoid death row?\" He said. \n\nA shock ran through him. It looked like a man but its voice, he sounded like his mother. His sweet, innocent mother. \n\n\"I'm not avoiding it. I was just curious what was here.\" He said feigning indifference. \n\nThis was obviously some sort of mind game. The prison designed this cell to drive people crazy so that they took their own life. He was too logical to go crazy. \n\n\"Hmm.\" He sat on the cot looking at Brad with his green eyes. \n\nThe same shade as his mother's. \n\nBrad gulped. \"What's your name?\" \n\n\"I have many.\" He shrugged. \"The most common among them is Death.\" \n\nBrad couldn't help it. He laughed. \"Sure you are.\" \n\n\"No one believes me, at first.\" He sighs. \"You will.\" \n\n\"Okay, weirdo. Let us assume you are death then why are you in prison?\" Brad asked. \n\nIf this what everyone faced then he had no idea why everyone died before morning. This was ridiculous. \n\n\"Why do you think this is real?\" He asked instead. \n\nBrad frowned. \"The guard just escorted me here. It's the underground floor of the prison.\" \n\n\"Have you seen the layout of prison?\" \n\nAn image flashed in his mind making him freeze. He looked at the man, his face was unnatural. Yes, he looked innocent but now Brad could see beneath the mask. The darkness that swirled inside him.\n\n\"I have been waiting to meet you since I was ten.\" Brad breathed out. \n\nDeath laughed. The cold sound made a chill run down his spine. \"You thought you waited for me. You got caught because you were bored. You thought meeting death would be as easy as the noose around the neck or an injection.\" \n\nBrad started at him. He had waited to meet death, to know what the life beyond held. \n\n\"But I am going to die.\" He said. It's not a question. He had known this ever since he stood on trial.\n\n\"You think it would be easy?\" Death asked, a small smile playing on his lips. \n\nYes. \"No.\" He lied. \n\n\"You don't have to lie. You think you don't feel.\" Death said stepping closer to me. The stench of decaying bodies makes him want to escape. \"You will feel when I start.\" \n\n\"Start what?\"\n\n\"Your death, of course.\" \n\n\"So, you kill everyone that walked in here?\" \n\nDeath laughed. \"Of course not. I fucked with their head first.\" \n\nBrad felt weirdly proud. \"And you can't fuck with mine.\" \n\n\"Of course, I can.\" Death scoffs. \"I just prefer not to waste my time. I have something special planned for you.\" \n\nBrad felt pressure on his neck like someone was choking him. He looked at Death, who hadn't moved from his place. \n\n\"What are you doing?\" Brad choked out. Tears were rolling down his cheeks. \n\n\"You always tested the best method to kill someone on rats.\" Death smiled cruelly. \"You are my rat.\"\n\n**\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690553994,
   "score": 1,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtt241f",
   "message": "***Warning: Explicit description of phycological attacks and mention of previous murders. Viewer discretion is advised.***\n\n\\-----\n\n\"... And think of your mother. Your poor mother, who cried until she fainted in your trial. Do you know how she's doing now?\"\n\n\"S-Stop. Stop it!\"\n\n\"She locked herself in the room all day and night, refusing to eat or drink. She cried and screamed and wished it was all but a bad dream, that her sweet child didn't do anything wrong. Then, one day, she started puking blood and collapsed on the floor. Oh, the unbearable pain is crushing her fragile form. You are killing her from the inside. You did this to your own mother.\"\n\n\"No, you're lying...\"\n\n\"Your mother is becoming a mad woman because of you. You are the one who is causing her all this suffering, you disgraceful scumbag. Your neighbors are avoiding your house like the plague, but they can still hear her screams at midnight, like a mad woman.\"\n\n\"Stop- Stop! I said *STOP!!!*\"\n\nThe yell echoed in the cell room, and I'm sure the guards hear it from outside too. I sit cross-legged on the bench, eyeing the man who had crumbled to the floor, hands holding his head. This man had gotten knocked down to his knees, trembling like a leaf. How cute.\n\n\"People are whispering, you know? They said, 'Look at that old hag, her son is a murderer,' 'He got the death sentence this morning,' 'I'm glad I've kept my kids away from those barbarians.' And your mother heard it all, every single word, and she's at the end of her wits now. Maybe a noose seize tight around the neck wouldn't be so bad.\"\n\n\"Please... stop...\"\n\n\"Relax, pal. It's not even past eight yet,\" I laughed, \"Now, where were we?\"",
   "created_utc": 1690553869,
   "score": 1,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtsiidc",
   "message": "Long ago, I made a deal with the humans...\n\nAs an immortal shapeshifter, I was feared, and I loved it. Centuries of terrifying screams and wails of despair.\n\nIt lasted only so long, however. One day, I learned that several of my victims would end up in various different states of health, physical *and* mental. All of a sudden, it made sense why some people were trying to find a way to destroy me. The guilt spanning centuries weighed so heavily, my body ached.\n\nI could never be destroyed, but I could no longer live how I had been. The deal was simple: they can contain me in whatever manner they wished, but in return they were to find humans for me to terrify. I knew they'd accept; there are some very vile people out there.\n\nI'm kept in a spacious cell underneath a prison designed to hold the worst of the worst - there were 'death row' inmates, but this particular prison was known as 'death row' prison because if you weren't sentenced to death, you were locked up for life.\n\nEver since I arrived, my hidden corner of the world became a part of the tour, right at the end of it. The inmate would be given a choice: spend one whole night in the same room as me, or their sentence is carried out.\n\nAll the inmate would see is a young-looking girl, about ten years old, smiling sweetly and reading her books. She was always met with sceptical looks, a few 'aww's', but it always led to the same set of questions:\n\n\"Why is such an innocent girl locked away?\"\n\n\"What is she?\"\n\n\"Is this a joke?\"\n\nThe guard would simply shrug and say \"Will you spend a night in the same room as her, or carry out your sentence?\"\n\nSome would catch on that behind those wide, innocent brown eyes, lurks something horrific and would be desperate to get away; others would scoff and say 'that's not even a challenge'. My favourite ones are the ones who are obviously trying to convince themselves that it's just a little girl.\n\nIf an inmate were to accept the conditions, they'd be stripped, put in a straight jacket and chains, and have something placed over their mouth so that the only thing they can do is scream. At this point, some would try to back out, realising something is up, but once the challenge has been accepted, it's too late. Others would buy the explanation that they don't want the inmate to try to hurt the girl.\n\nThat moment when my next victim is locked in with me... I always relish it. My job is to get them to squirm, to scream, to want to beg to be rescued. They only succeed if they make it through the whole night without screaming loud enough for the guards to hear.\n\nOnly two people have made it through the ordeal. Because they were able to avoid screaming, that meant they also had strong wills and minds, and were able to resist any long-term effects. One of them admitted they were scared shitless and thanked me for showing them what kind of monster they were; I took it as a compliment. The other one was on their knees to the guards, sobbing, apologising over and over, promising to **never** cause trouble again.\n\nRight this moment, I'm waiting for another prisoner to make their decision. \"You have a choice: stay in that cell with her for one night, and be granted a pardon... or wait for your turn on death row. Which will it be?\"\n\n\"That tiny little girl? Really?\" He looks at my smiling face. He's an angsty teenage boy who killed his mate in cold blood for harassing his sister. \"I don't know what game you're playing, but I didn't do anything *wrong*. I'll do it.\"\n\nI wait in anticipation as he's being 'prepared'. Once the mouth thing is on, he's shoved roughly into the cell. I can sense his unease already... my grin stretches all the way to my ears...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThank you for reading! More stories [here!](https://www.reddit.com/r/Crystal_Chronicles/comments/15a7np7/oneoff_stories/?utm_source=share\u0026amp;utm_medium=web2x\u0026amp;context=3)",
   "created_utc": 1690544857,
   "score": 1,
   "submission_id": "15bugt9"
  },
  {
   "comment_id": "jtsp9cp",
   "message": "Ah yes, another toy enters the playpen. It was lured in by my smile and a dark deal, one night with me, or the rest of their lives in prison. Personally, I've only ever had one toy pass up the opportunity to play. Of course, I had my favorite toys, those monsters with bad jackets, and little regret. I always got to browse the toys before they came to my door, a booklet on what they had done to get to where they were. Most of them were hand-picked by me.\n\nFirst, it would start off normal. The toys always loved talking about themselves like they were people. I let them talk as much as they liked, most for quite a long time. The toys never knew just how well I knew them. My mouth never moved, but they heard my voice regardless. \n\nThat's when the fun truly begins. The toy would always go to the fountain and get a drink, not knowing what they were consuming. The guards knew not to look into my playpen after the toy began to drink. They'd turn around after satiating their thirst, only to see me as I truly am. \n\nAll my mouths in a lewd smile, all of the pairs of eyes gazing directly into the toy, I'd always ask the toy what's wrong. They'd never get the chance to answer coherently. It's like they've never seen a monster before. \n\nWell, unless they looked in the mirror.",
   "created_utc": 1690548340,
   "score": 1,
   "submission_id": "15bugt9"
  }
 ]
}