{
 "submission_id": "15bvyca",
 "title": "[WP] You’ve been suffering from Alzheimer’s for years now. You are having a rare moment of lucidity and clarity. Describe what you do with it.",
 "selftext": "",
 "created_utc": 1690546916,
 "permalink": "/r/WritingPrompts/comments/15bvyca/wp_youve_been_suffering_from_alzheimers_for_years/",
 "score": 4,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bvyca/wp_youve_been_suffering_from_alzheimers_for_years/",
 "comments": [
  {
   "comment_id": "jtsmdxe",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690546916,
   "score": 1,
   "submission_id": "15bvyca"
  },
  {
   "comment_id": "jtss7pb",
   "message": "The fog is gone. \n\nThis small room is unfamiliar. Drab. Smells of cleaning materials. The bed is at least slightly comfortable. Faded stains criss cross the bedding. My own and others? No idea. A sad plastic plant adorns the bedside table. A solid layer of dust covers the mimic.\n\nGet up. No one’s here to stop you. The sun is peaking through the clouds. Just briefly. The grey blanket will soon envelop the sun again, making it a dreary day. \n\nThe door won’t budge. Try. Try again. My hands start to shake. It’s not locked. It finally moves to the side clunking with the extra force to get it to budge. Not opened in years. \n\nMy bare feet touch concrete. It feels hard, but liberating. A rusty chair is nearby, but it feels better to stand. \n\nThe breeze blows against my clothes. It’s cold, but comforting. The trees wave back in the breeze.   The grass is still green and hasn’t faded to brown yet. \n\nHow long has it been? Has it been that long? How is Jason doing? My son, how I miss him. The phone, I should call. I head back inside. It’s an old yellow phone that sits on a table. It’s dial tone sounds so foreign, a sound I haven’t heard in years. \n\nJason, are you there? It’s Dad. I’m so happy to hear your voice. Are you able to stop by today? I’m feeling well. \n\nThe clouds close around the sun. The light fades. A sad grayness sweeps the sky.\n\nDial tone. No one picked up. I’ll try again. My fingers shake, the phone fails to call again. Please John, it’s dad. \n\nI can’t stop the tears. The phone falls to the table. I can’t remember the number anymore.\n\nWhy? \n\nA knocking at the door starts. \n\nBack to bed.",
   "created_utc": 1690549706,
   "score": 1,
   "submission_id": "15bvyca"
  }
 ]
}