{
 "submission_id": "15bvjbi",
 "title": "[WP] Giant squid squid stay drunk for centuries. That’s why no one has seen them—they’ve all been sleeping off the high from eating rum-filled pirate ships in the 1600s. Today, the first giant squid in centuries sobered up.",
 "selftext": "",
 "created_utc": 1690545793,
 "permalink": "/r/WritingPrompts/comments/15bvjbi/wp_giant_squid_squid_stay_drunk_for_centuries/",
 "score": 82,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bvjbi/wp_giant_squid_squid_stay_drunk_for_centuries/",
 "comments": [
  {
   "comment_id": "jtsk8qw",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690545793,
   "score": 1,
   "submission_id": "15bvjbi"
  },
  {
   "comment_id": "jtvo7ln",
   "message": "There were three aboard the vessel. It cut through the crests with an unsurprising determination, a squat whale of steel and wood. The sick man was trying to vomit again. He belched and groaned, staring into the bucket, little left to expel, occasionally spitting goblets of phlegm that mingled with the remains of his last meal. He was unaware now of his stink. The vessel groaned in response, continuing to rock incessantly as if personally tormenting the man. The two others had tied scraps of their vests around their mouths and noses and eyed him with distain. Had he not been competent in English he may have been forced off the craft.\n\nLittle was said on their journey, the sick man was preoccupied, and the captain had nothing in common with the other. He had left the pride and bravado of youth behind, and the second man reminded him of his past arrogance. This arrogant man was cleaning his gun. Its diamonds glinted in the dim light, likely faux but indicative of his character. Occasionally he would try to engage in conversation with the captain, when drunk, which was often, he would rant and rave of his conquests, his killings and women he’d fucked. The captain would grunt in response, to ignore him and enrage someone of his character would be a mistake. He was likely too stupid to realise that shooting aboard the vessel would almost certainly send all three men down into the void. Even when choking on saltwater it was unlikely he’d feel any regret. \n\nFor three weeks they had skimmed through the water, previous journeys had been faster, but they’d been haunted by the rage of the North Atlantic, disorientating the already inadequate vessel. The captain - called that for his prior experience on such trips rather than specific nautical prowess, was impatient. Waiting for him were his woman and child, and it would be another three weeks yet until he returned. The rag across his face did little to oppress the air, thick with vomit and oil, sweat and liquor, from forcing its way down his throat. The freezing waters engulfing them often appealed to the captain, at home he would refuse to share his food or drink with the two others but here he had to share his most precious commodity – his oxygen, and the men contributed to the humidity that snaked its way amongst them like a rotting blanket. Illogically, he felt jealousy for the creatures that writhed outside, miserable, hungry and hunted, but free and cool.\n\nThe men did share many traits with the fish. Their vessel, not quite a submarine, yet not quite a boat, was almost certainly prey on account of their cargo. Their weeks had consisted of paranoid diving and surfacing, each dive threatening to crush the occupants and their jungle-made craft. In a previous era, they and their cargo may have soared through the sky, but nations were increasingly wise to their ways, requiring new ingenuity for successful passage. The voracious appetite of the world for that contained in the vessels belly meant ingenuity was only a matter of time. On the first day the arrogant man had tried opening a package and sampling the product only to be sternly rebuked by the captain. He had reacted violently and only backed down when threatened with annihilation at the hands of those waiting on land.\n\nIn the blackness below, the kraken awoke. If the stupor it had been experiencing could be described as sleep, then it had slept for over 400 years. The feeling had begun as a pleasant warmth, a respite from the harsh waters, evolving into an ecstasy not understood by a being that understood little of its world, seeking but never deliberating, feasting but not questioning why it had to feast. The ecstasy had given way to a numbness then a blackness, and now the monster was awake, and it was in pain. It needed what it had before.\n\nThere was an irony in the fact that the captain, who’d been so paranoid of predators above the waves was the last to notice the initial hints of discrepancies below. The sick man was the first to feel it, so sensitive to every lurch of the craft, the slight jolt sent him reeling, another wave of dread forcing his stomach lining out of his throat. The arrogant man had felt it too, stumbling a little though it was the renewed retching of his seasick accomplice that had really captured his attention, inciting a new wave of hatred for the wretched man. The captain was too preoccupied with the surface to feel it. Sleep deprivation had stripped him of any valuable mental faculties. The second jolt was harder. The arrogant man was thrown to the floor, and he clattered over the bucket, emptying its contents over his hands and forearms. He roared, drawing his pistol from his belt and pressing it to the sick man’s head, his arms still dripping with vomit. The captain, reaching for his own gun, turned from his seated position at the front of the vessel and pleaded for calm. Was he stupid? Did he want to kill them all? The answer was likely yes. The sick man pleaded pathetically, blubbering about his family, his seven children. This man had too killed those in the same circumstances and was not convincing. As if to seal his fate he retched again, spittle splattering over his attacker’s shoes. The arrogant man, convinced of the necessity of killing him but sufficiently calm to realise a bullet was not the correct method, hauled his victim up by his armpits, dragging him to the ladder that led out of the vessel.\n\nThe creature – the kraken – had sought the craft much as it had sought prey in a previous life. Propelled by its appendages through the water and the pain, it hurtled upwards towards the light and the warmth, seeking that greater warmth it had found before. 400 years ago, it had found it in a towering construction, not prey, better than prey, on the surface of the water. The hulking hard shell had contained hundreds of squirming creatures who spluttered and gasped as it had engulfed them. They had satiated its hunger, and though they thrashed and slashed with sharp appendages they were swallowed easily enough. The beast had prepared to skulk away, to shrink back into the depths when the warmth first overcame it. It seeped from smaller hard shells leaking and intoxicating the water with a delight never felt before by creatures of the waves. This delight was once again within its tentacled grasp. A harder shell, but one still easily broken. The creature had not known that the squirming creatures it devoured 400 years ago were pirates, and it did not know that the men it was about to devour were analogous to them in many ways. It did not even know what ‘men’ were. Perhaps, if it knew these things it would have found it amusing. Perhaps, alcohol exists to tempt all of god’s creatures, not just man.\n\nThe quarrel amongst the crew continued for several minutes. Both the arrogant man and the captain fought viciously for control of the hatch above, though surprisingly each was aware of the danger of discharging a gun. This did not prevent the arrogant man from striking the sick man repeatedly across the face with the butt of his pistol, grasping his hair to pull him up for beating after beating. Vomit, oil, sweat and now blood, driving him further and further into a frenzied relief - a violent ecstasy. Amongst the commotion, the men had forgotten the lurching and grinding of their craft, but it continued unabated, as if responding to the violence inside. Outside, their death thrashed impatiently, clutching and driving the vessel into the depths. The ultimate release for the kraken was near. \n\nThe sick man felt nothing, for his skull had been split and splintered, draining his consciousness and soon his life, though the other two men became aware of the diving sensation. Enormous hands clasped the sides of their heads and squeezed; all fell to the left side of the vessel as it lurched. The arrogant man cracked against a metal cabinet but did not cry out. The captain’s fall was buffered by the arrogant, limp body. He lay amongst the congealed blood and filth, as the craft was pushed ever deeper, his eyeballs feeling as though they may burst. In this moment he did not think of his woman or child. He thought of his fury at the other men for the commotion that caused this pain, imaging himself killing those who were already dead.\n\nThe creature writhed and squeezed, desperate now. It ripped with its beak, consuming, feeding, but still no relief. It could feel the vessel giving in, growing smaller and tenser, ready to burst. Finally: ecstasy. Vomit and oil, sweat and liquor, blood. All dispersed in the cold blackness, engulfing the squid in a cacophony of delights. It feasted on the men, relishing their flesh but soon it grew agitated. The warmth was there, it could sense it, but it felt small, insignificant. Not enough. Despondent, it thrashed wildly, its tentacles seeking and crushing all the disparate parts of the vessel. Hard, soft all was toyed with, all destroyed. Its hunger was satiated but its desire grew ever stronger. The beast had not noticed, amongst the debris, a novel sensation. If it were a man, it would have said it felt a rising in spirits, not dissimilar from what it had felt 400 years ago. It thrashed faster and harder, feeling a rising, a building of something excellent. It was no longer searching for anything, just relishing the tearing and swirling and devouring. It thrust away from the debris upwards, building speed faster and faster, swirling and writhing with an intensity never before seen amongst the beasts of the earth. Ecstasy.\n\n\nThe kraken had developed a taste for cocaine.",
   "created_utc": 1690590424,
   "score": 1,
   "submission_id": "15bvjbi"
  }
 ]
}