{
 "submission_id": "15bz3da",
 "title": "[WP] Write a paper on the mythology of an extraterrestrial society.",
 "selftext": "",
 "created_utc": 1690554662,
 "permalink": "/r/WritingPrompts/comments/15bz3da/wp_write_a_paper_on_the_mythology_of_an/",
 "score": 9,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15bz3da/wp_write_a_paper_on_the_mythology_of_an/",
 "comments": [
  {
   "comment_id": "jtt45en",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690554662,
   "score": 1,
   "submission_id": "15bz3da"
  },
  {
   "comment_id": "jttlaok",
   "message": "*Introduction*\n\nZurghubs are creatures native to the planet Nagud in the Solar System XR-2641, about fifteen light years from our Solar System. Nagud’s climate is comparable to Earth’s and inhabitable for humans. It’s discovery in 2096 excited scientists of all disciplines. Chemists and biologists were interested in Nagud’s nature and anthropologists had a field day as they could suddenly found a whole new culture to study.\n\nMany papers have already been published on the topic of Zurghub’s mythology. Most authors used these tales to argue that Zurghubs are not so different from humans by comparing earthly mythology and drawing comparisons. This paper is not aimed at justifying these conclusions nor will I try disproving them. I merely would like to offer a new perspective. Thus far the Zurghubs have always been compared to humans: both species communicate, have a sense of culture and belonging. They wage war and form friendship as humans do. I would like to see them in their own right and move away from this human-centred view. Much can be gained from this approach as this comes closer to how Zurghubs themselves experience mythology.\n\nOptimally you’d hear the story for traditionally, these stories have passed down generations by telling them. Alternatively you read them, not with the objective to study them and in-depth analyse parts, but from beginning to end to enjoy them. After all, entertainment, optionally mixed with a moral lesson or two, has historically always been the goal of mythology and legends.\n\nZurghub’s mythology is too vast to share all the stories – and that’s without regarding all the regional folktales and variations on widely known-stories. Therefore I decided to focus specifically on the myth around Wu’h’lak as this oldest story to be written down and the details remain mostly the same around all of Nagud. Consequently it’s one of the most well-known stories and thus suitable for the purpose of my paper. First I will provide a translation, made with the help of Gjaisk, a fellow cultural scientist and native to Nagud.\n\n*Wu’h’lak*\n\nA long, long time ago, when Nagud was still under construction and only a semicircle, the Gods\\* discussed what creatures should inhabit the new planet. Together they brainstormed different designs. The first suggestion was simply a perfectly round stone, brought forward by Nastl. She argued that this creature would be very mobile. She created a small population and put them on Nagud.\n\nIndeed they rolled terrifically, but they were unable to do anything but rolling around all day. Thus came the idea to give them a small pocket in which they could hold small items.\n\nThus the Gods experimented and through trial-and-error they became more creative with their inventions. They gave mouths to eat, fruit to be eaten. Faces gave unique features to otherwise indistinguishable individuals. Every being was given a chance to live on the half-finished Nagud and they all peacefully lived together.\n\nThat is until Ghalfi designed a wicked being: monstrously large and hideous to look at. Legs the length of trees, teeth the size of Draijns\\*\\*. The other Gods rejected the suggestion. Fuelled by anger, as this was the first rejected idea, he secretly created the figure in the middle of the night while the other gods lay to rest.\n\nWhat Ghalfi and the other gods weren’t aware of, is that they didn’t just shape a creature’s form, but also their spirit. Some of their own emotions were always infused in the newly created being. So far, everything was made with glee and curiosity. But Ghalfi unwillingly infused the wretch with anger. When set loose on the world, it stumbled through Nagud, wreaking havoc on nature and animals alike. He took more than he needed and destroyed what was left over.\n\nIn distress, Ghalfi awoke everyone when he saw the damage. But their powers were confined to creation: destruction wasn’t possible for them. So they set to work to make a new being, smarter and more agile than any other. One that could fight.\n\nThey imbued him with their own feelings: focused on achieving the goal, compassionate for the weak and resentful to bullies. Cautious to use violence only as a last resort, but unafraid to do what was necessary.\n\nThey called it Wu’h’lak, The Fighter. For three days and three nights, Wu’h’lak followed the wretch’s trail. The Fighter didn’t sleep or stop to eat but relentlessly pursued it until it caught up. The beast was nibbling on a Rajziz, a defenceless creature that was cloudlike. Liquid in a semi-solid form. It swallowed the poor rajziz and let out a burp that stank and immediately made the nearby plants rot.\n\nWithout fear Wu’h’lak stepped forward and gave the monster a choice: behave or be killed. But the monster, whose very soul was driven by anger, could never learn to behave and live peacefully.\n\nWith a roar that scared the very Gods themselves it launched itself to Wu’h’lak, who dodged and hit the monster in its leg. A fight ensued and both fought vigilant. Wu’h’lak realized that he could only kill the beast by cutting of the head, but that meant that he’d come dangerously close to the mouth, with teeth that could crush him with just one bit. However, he had no choice.\n\nHe dived under the monster’s legs, climbed up on them, on its back until he reached it’s neck. With a single blow, he executed the beast by embedding his arm – sharp and from the strongest material the Gods could find – in its neck. The monster buckled and then fell backwards, crushing Wu’h’lak under him.\n\nIn honour of Wu’h’lak, the Gods created more of his kind. Thus, the Zurghub were born.\n\n\\*Zurghub Gods are not considered to be concrete figures, but rather abstract minds without a physical body, like a cloud.\n\n\\*\\*Draijns are flying creatures, in size about crows. Invisible to humans as their colour of their fathers don’t fall in our spectrum.\n\n*Questions of life*\n\nThis story clearly shows that the Zurghub are trying to explain their origin. It gives an answer to the question “Where do we come from”. Additionally, the moral lessons in the mythological story give purpose and direction to their lives. Protect the weak, fight the evil. It also contains an idea on how to live: in balance, with respect to nature. Everyone deserves their place on Nagud, even the simplest of organisms (perfectly round stones), because all were given live by the Gods themselves.\n\nFinally, the Gods aren’t perfect creatures. They aren’t all-knowing (they have to experiment to create new beings and they don’t know that they pass on emotions), they have flaws (they feel anger – other stories tell of jealousy as well) and they aren’t all powerful (they can put creatures on Nagud, but can’t interfere once they’re made). This is telling for their religions: they believe in higher-beings but not in an almighty, perfect god.\n\n*Conclusion*\n\nBy translating an ancient myth and superficially evaluating it, without comparing it to human counterparts, I have hoped to encourage future scientists to look at Zughrub culture through an objective view. I believe this will be beneficial for increased understanding of their culture and more respect for their history and differences from human-normative standards.\n\n*Acknowledgments*\n\nI'd like to thank Gjaisk for providing feedback on the translation to make it as accurate as possible. I also express my gratitude to Prof. Dr. Kayden for her own suggestions on this paper.",
   "created_utc": 1690561078,
   "score": 1,
   "submission_id": "15bz3da"
  }
 ]
}