{
 "submission_id": "15c05gx",
 "title": "[WP] A lowly castle maid tries on one of the princess's dresses in secret. Unluckily, a dragon mistakes her for the princess and kidnaps her. Turns out...the dragon doesn't have half-bad ideas regarding treatment for rich jerks.",
 "selftext": "",
 "created_utc": 1690557081,
 "permalink": "/r/WritingPrompts/comments/15c05gx/wp_a_lowly_castle_maid_tries_on_one_of_the/",
 "score": 77,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c05gx/wp_a_lowly_castle_maid_tries_on_one_of_the/",
 "comments": [
  {
   "comment_id": "jttagyo",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690557082,
   "score": 1,
   "submission_id": "15c05gx"
  },
  {
   "comment_id": "jtw8r0t",
   "message": "**\\[WP\\] A lowly castle maid tries on one of the princess's dresses in secret. Unluckily, a dragon mistakes her for the princess and kidnaps her. Turns out...the dragon doesn't have half-bad ideas regarding treatment for rich jerks.**\n\nIn an unexpected twist of fate, I found myself captured by the infamous Elder Dragon - Sh'Avana.\n\nBased on the legends, this majestic yet terrifying creature had lived for over five thousand years. It often wreaked havoc upon our lands, striking fear into the hearts of all who crossed its path. No other dragons commanded such terror, as it had slain many noble knights and veteran adventurers who dared to challenge its might.\n\nAmong all the dragons that roamed the continents, Sh'Avana was infamously known to be a ruthless apex predator, ranked as a Supreme Threat by the Adventurer's Guild.\n\nYet, here I was, trapped deep inside the cavern of this formidable danger.\n\n*I can't believe things ended up like this.*\n\nWorry filled my heart as the Elder Dragon took a step forward.\n\n*Am I going to die?*\n\n*Having achieved nothing in my life?*\n\nDressed in the Princess's lavish red gown, I found myself amidst the opulence of the wide cave, surrounded by various treasures, magic items, ancient tomes, gold coins, next to a tranquil pond with colorful koi fishes I had never seen before. Sh'Avana stood watch across from me, blocking the cave's entrance with its colossal midnight-black body, leaving no room for escape. Soft glowing crystals adorned on the walls provided an enchanting illumination to the dark interior.\n\n\"So human, you claim you're not the Princess Madi?\"\n\nHis voice was surprisingly well-spoken, echoing the cavern with a deep, charismatic tone.\n\n\"That's right,\" I stammered and felt my heart racing. \"I... I just wanted to see if her dress would look good on me...\"\n\n\"Reason?\"\n\nThe dragon's predatorial-yellow eyes narrowed, demanding an explanation.\n\nI instantly averted my gaze, feeling overwhelmed by the powerful being's aura.\n\n\"Speak or else.\"\n\n\"I-It's because I know I'll never have the opportunity to attend one of those lavish parties,\" I confessed. \"Her Royal Highness would never allow someone like me to be in that setting. I-I... just wanted to know what's it like to be happy for once...\"\n\n\"Perhaps, you may be Princess Madi pretending to be a maid for survival,\" he huffed, his suspicion evident in his voice. \"I've grown accustomed to humans and their constant deceptions.\"\n\n\"What have I got to do to prove it to you?\"\n\n\"Remove the dress,\" he demanded firmly.\n\nI widened my eyes in disbelief.\n\n\"What?!\"\n\n\"The splendor of a princess's fair skin is renowned across the lands, extolled in the verses of courtesans and immortalized in the verses of bards. Your hair, though not resplendent, boasts a certain understated charm. However, I must closely examine your complexion to ascertain the truth, for appearances do not deceive.\"\n\nI felt a mix of emotions being complimented by a dragon, but it seemed like I had no other choice. This was a situation regarding life or death.\n\n*What have I got to lose at this point?*\n\nI reluctantly unzipped the back of the gown and revealed my bare back, bearing the physical mark of shame inflicted upon me.\n\nAs my hands were about to reveal the rest of my vulnerable body, Sh'Avana waved its claws.\n\n\"That shall be enough.\"\n\nI was surprised by the sudden change of mind.\n\n\"Even after many generations, the Wrigh Household never change,\" the Elder Dragon lamented with a heavy sigh, his ancient eyes unexpectedly filled with a mix of sadness and anger. \"These nobilities are truly despicable beings, inflicting pain upon their own kind without remorse. When did you receive those marks? They appear both deeply scarred and yet some seem disturbingly recent.\"\n\n\"Ever since I was born,\" I said softly, feeling the weight of my past surging in my heart. \"My Mother was the head maid for the Queen. So it was already fate since birth that I serve Princess Madi. Except she doesn't like me very much and often takes her anger out on me. But I'm used to it at this point.\"\n\n\"You lived a challenging life, human.\"\n\nTo my surprise, the Elder Dragon displayed an unexpected empathy for my struggles.\n\n\"You may leave,\" he said with a regal air and moved aside.\n\nDespite having permission, I found myself hesitating.\n\n\"I'm not sure if I should go back. If they know about the dress, she will probably take her frustrations out on me again. I don't want to be locked in a basement again.\"\n\n\"Then live a free life,\" the Elder Dragon declared, gracefully extending its formidable claws to gather a generous handful of treasure and placed it in front of me. \"Use this to cover your expenses and forge a path of your own choosing.\"\n\nI was taken aback by this unexpected act of benevolence from a creature that history had painted as fearsome and cruel.\n\nThis was the first time since forever I felt genuine warmth in my heart.\n\n\"Why are you helping me? You're supposed to be evil.\"\n\nSh'Avana's hazel eyes glinted with an unexpected hint of melancholy.\n\n\"History is a matter of perspective,\" its deep voice resonating with a mix of nostalgia and worldly weariness. \"Centuries ago, dragons are mystical creatures that coexisted with humans. We were regarded as guardians of knowledge, protectors of the land, and allies to those in need. But corruption in the kingdom eventually distorted the truth, and the Wrigh Household slaughtered my children and branded me as an evil creature of destruction.\"\n\n\"That's awful... I'm sorry to hear that.\"\n\n\"I have also made a sacred promise to an old friend of mine, \" the Elder Dragon's gaze turned toward the distant horizon. \"Thus, as long as I remain on this continent, the destruction of the kingdom is a must. For her sake.\"\n\n*I wonder who she is.*\n\n*I can tell how much the promise means to the Dragon.*\n\nWith my heart thumping rapidly, I wanted to make an irreversible decision.\n\nDeep down, I had enough of the oppressive treatment of commoners in the kingdom. Even as I ventured out into the bustling Capital, many homeless filled the streets while the privileged indulged in their opulent desires without a care in the world. But there was no opportunity to fight back... until this moment.\n\n*This is crazy.*\n\n*But I'll never know if I don't ask it.*\n\nTaking a deep breath, I steeled my resolve and declared my proposition to Sh'vana:\n\n\"How about I help you bring about the destruction of this kingdom?\"\n\nThe Elder Dragon seemed taken aback by my response, clearly surprised by my audacity.\n\n\"You wish for the destruction of your own people?\"\n\nSh'vana's deep voice resonated in the cavern as fate started to change its course.\n\n\"I never considered the Wrigh Household as my own people. My Mother was treated as a slave, tossed aside due to exhaustion and left to die without medical care. If they were my own people, none of that would have happened to her. I wouldn't bear these scars.\"\n\nRaising my hand into a fist, I continued:\n\n\"As the current maid for Princess Madi, I know all the ins and outs of the kingdom. I can provide you with every insider's information and reveal the layout of the castle. I am also familiar with the military and current weaponry. My knowledge with your power.\"\n\n\"An interesting proposal...\" The Elder Dragon tilted his head in contemplation before puffing a breath of approval. \"Very well, human. I will consider it for now.\"\n\n\"Call me Arella. That's my name.\"\n\n\"Then Arella, let us indulge in the utter destruction of Wrigh Household's long-held decadence. We shall decide on a plan tonight.\"\n\nLittle did I know at the time, this unexpected encounter with the Elder Dragon marked the beginning of a chain of events that would set in motion the fall of the prestigious royal kingdom.\n\nAnd it was all because I stole the princess's dress.",
   "created_utc": 1690600328,
   "score": 5,
   "submission_id": "15c05gx"
  }
 ]
}