{
 "submission_id": "15c0w9g",
 "title": "[WP] You go to bed as usual and wake up in the year 3000. Everyone you knew is dead and there's a completely different world outside.",
 "selftext": "",
 "created_utc": 1690558789,
 "permalink": "/r/WritingPrompts/comments/15c0w9g/wp_you_go_to_bed_as_usual_and_wake_up_in_the_year/",
 "score": 91,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c0w9g/wp_you_go_to_bed_as_usual_and_wake_up_in_the_year/",
 "comments": [
  {
   "comment_id": "jttf1d8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690558789,
   "score": 1,
   "submission_id": "15c0w9g"
  },
  {
   "comment_id": "jttqdzp",
   "message": "\"What will you have to drink?!\"\n\nThe gun pressed against my temple only increases my confusion by the strange question and the rude awakening. I look at the intruders in my apartment, taking careful notice of the shade of red adorned by the strange material of their coats. \n\n\"Coke?\"\n\nThe two of them exchange a glance. \n\n\"Is Pepsi ok?\"\n\nMy eyes dart between them. \n\n\"Uh, I'll just have water.\"\n\nThe one holding the gun lets out a sigh of relief and I hear the weapon power down as he removes it. \"Sorry about that,\" he says. \"Had to make sure you're not one of *them.*\" \n\nI raise an eyebrow. \"One of who? Who are you? Why are you in my apartment.\" The other man opens his mouth to answer, but before he can, a shower of projectiles mow both of them down, spraying me in their blood. \n\n\"What in the fuck?!\"\n\nThree men in swat like gear storm in. \"Come with us, quickly!\" It didn't seem like a suggestion. They toss me through the window of my apartment and I land in a large rectangular cell. My legs tremble as they follow me inside and I feel the cabin lift off the ground. \n\n\"You're lucky we got here in time. They would have assimilated your brain into the Coke hivemind.\" \n\nI blink. \"What the fuck is going on?\" The lead man pushes a button and I shield my eyes as light spills in from a window that appears. I walk up to it and gasp. My apartment is not connected to the building. The building is nowhere in sight. It's in the middle of a field of dead, grey grasses. \n\n\"You were kidnapped by people from an alternate dimension a thousand years into the future.\"\n\n\"Why?\"\n\nThe man hits the button to close the window. \"The tech they used to snatch you from your time can be used for interstellar travel, only people can't survive the dimensional transit.\" \n\n\"Not unless they're already from another dimension.\"",
   "created_utc": 1690562950,
   "score": 21,
   "submission_id": "15c0w9g"
  },
  {
   "comment_id": "jtun6xj",
   "message": "The last thing Simone remembered was incredible pain. Her skin on fire, eyes popping from her sockets. The force of a sea pressuring her ears and every muscles was pulled apart, the bones pulverized. Her stomach was stretched like chewing gum and turned inside out. She might have puked, but can’t remember.\r  \nSlowly she opened her eyes, adjusting to the bright light in the room. The pain was gone now, but dizziness lingered, like she had just spend a week on the sea and her balance organs thought she was still on the waves instead of a solid bed.\r  \nA door opened and a woman glided in. She wore wheels beneath her feet that reminded Simone of miniature hoverboards.\r  \n“Hello Simone, I’m doctor Havanna and I am your caretaker. How are you feeling today?” She spoke English with a thick accent, one that Simone didn’t recognize. Only after the woman repeated herself did she decipher the words.\r  \n“I’m fine.” Simone pushed herself upright. “What happened?”\r  \nThe woman grabbed a chair and sat down by the bed. She grabbed Simone’s hand and pressed it reassuringly. “As a medic I know it’s best to just remove the bandage at once.”\r  \n“Rip of the band-aid you mean?”\r  \n“Yes, exactly that. Brace yourself. You are in the year 3091. More than a millennium has passed for you.”\r  \nSimone tried to make sense of the words. Obviously she misheard the year, maybe it was 2039 and Dr. Havanna confused decade and millennium as she clearly wasn’t a native speaker.\r  \n“I have been in a coma for sixteen years?” Immediately the doctor shook her head.\r  \n“No, you were not in a coma. You time travelled more than a thousand year into the future.”\r  \nThoughts flew through Simone’s head, knocking each other over until there was only a scrambled chaos left. One word screamed hardest of all.\r  \nPrank\r  \n“This is not funny,” she said grumpily and scanned the room for hidden cameras. “You can come in, whoever it is. It’s an obvious prank, couldn’t you have made it at least somewhat realistic?”\r  \n“I don’t know what a prank is,” said Havanna, “but although your situation must sound bizarre and unrealistic, it is true. If you are up for it, I would like to show you the city.”\r  \nSimone didn’t seem to have a choice but to play along, so she got up and followed the woman. Her legs could barely hold her weight and she walked around wobbly, leaning against the wall to maintain her balance.\r  \n“I’ll get a rolling chair.” Hastily Havanna left the room. Simone followed her with baby steps, the effort took her energy and soon she was panting like a hundred year old asthmatic. The doctor returned, pushing a wheel chair. Grateful, Simone plopped in the chair which was far more modern than any she’d ever seen before. There was a motor build in and she could speed up by pushing the right footrest and brake with the other.\r  \n“You can steer by leaning right or left,” Havanna explained. She led her patient through the corridors. The floor was smooth white, the walls a soft green with many doors. It reminded Simone of a hospital, albeit a silent one, devoid of patients and hurried nurses and doctors.\r  \nAfter a couple of turns the arrived at an elevator. They went up all the way to the roof, which was the 43th floor. Simone had never liked heights and the mere thought of being this high up created a feeling of dread in her stomach. \r  \nThe moment the doors opened, Simone’s mouth fell open and her heart skipped a beat. The hospital wasn’t even close to being the tallest building in the vicinity. Many towered over it, the tops hidden in between hovering clouds. There were bridges and pathways hanging in the air, with strange vehicles speeding over them like a blur.\r  \n“The top suits are very popular,” Havanna explained. “It’s always sunny up there, while the streets on the bottom are always covered in the shadows. It’s better to avoid those streets and take the highways instead.” She pointed to the hovering roads. “The bottom is dominated by the poor who cannot afford to pay for the highways and criminals cast out by the Leaders.”\r  \nSimone said nothing. She had no idea where to start asking. Just taking in the view, the sounds of horns blaring, wheels scraping over the roads, it overwhelmed her. Panic tightened her chest, it became difficult to breath and sweat covered her hands. Gently, the doctor escorted her back inside where the feeling swelled a bit. She gave Simone something to sleep and turned off the lights. The tablet did its work and despite all the thoughts raising through her head, Simone fell asleep.\r  \nThe next morning, Simone’s body had finally adjusted to the reality of being on steady ground and it no longer felt like they were swaying. After a little breakfast of poached eggs, bacon and toasts that all tasted amazing but nothing like Simone had expected. \r  \nSimone refused to use the wheelchair again – she was only 24 and had always been health – and supported by Dr. Havanna they made their way to a meeting room. The person at the end of the room got up and shook Simone’s hand and spoke some words she didn’t understand.\r  \n“They welcome you, Ms. Littles,” Havanna translated. “This is Leader Vogala, one of the six Leaders.”\r  \n“Thank you,” Simone had no idea what she was expected to say. “What language do they speak?”\r  \n“We speak Cibray. English is a dead language these days. I am one of the few who still speaks it.” She smiled proudly. “That is why they assigned me as your caretaker.”\r  \nVogala began a long monologue directed at Simone while Havanna translated their words. Simone felt everyone’s eyes prying at her and wiggled uncomfortably in her seat.\r  \nThe gist of Vogala’s words was that Simone was now in the future. A team of scientists had discovered time travel, but since time is linear, it is a one way ticket. From the past to the future, but no turning back. As Leader of Technology, Medicine and Development, Vogala took responsibility for testing. Finally they concluded and beamed an enthusiastic smile at Simone. She didn’t return it.\r  \n“Why me?” She asked in a harsh tone. The question needed no translation.\r  \n“You were a carefully selected subject. We found records detailing that you’d die during a fire. We pulled you from the past a die before your death. Luckily, there was a digitalized article from a newspaper. You were described as a smart student. Graduated university at 20, about to finish your PhD at 24 and you played in a hockey team. We needed someone who was intelligent and healthy as we didn’t know what time travel over such a long time would do to the body and mind. And to add my own observations,” she continued, “Besides a loss of muscle mass there appear to be no effects on your physical or mental health.”\r  \n“But why me? Why not someone closer to your time? I didn’t ask to be dragged a thousand years into a future I don’t know and don’t understand!” She was shouting by the time she got to the end. The Leader’s smile was replaced by a frown and Havanna reprimanded her, though her calm demeanour didn’t match the severity of her words.\r  \n“Don’t use that tone in his presence. The Leaders are the highest authority and don’t tolerate conflicts caused by someone much lower in rang.”\r  \n“So what’s he going to do about that,” Simone teased angrily. “Send me back to my own time?”\r  \nHavanna didn’t respond but instead rapidly spook to Vogala in an apologetic voice. Eventually he nodded and the doctor exhaled with relief.\r  \n“I said you were angry because you simply couldn’t comprehend what was going on and I promised to explain everything. I will also tell you the rules of communication with him. Now let us go, before you get yourself banned to the streets.”",
   "created_utc": 1690575173,
   "score": 15,
   "submission_id": "15c0w9g"
  },
  {
   "comment_id": "jtthdlw",
   "message": "You wake up to a cyclops trying to implant you with a career chip to be a delivery boy again. You run away as fast as you can.\n\nYou meet a robot in line for a suicide booth that you think is a pay phone. The cyclops finds you and as you run away, his antenna breaks a light bulb and he suddenly gains free will. The robot bends the grates so you can climb away and escape the cyclops.\n\nYou run into your great great great great grand nephew that is a science professor. He owns a delivery company and an interstellar space ship. He offers you a job as a delivery boy and you gladly accept. Your adventure in the stars now awaits…",
   "created_utc": 1690559642,
   "score": 14,
   "submission_id": "15c0w9g"
  },
  {
   "comment_id": "jtv5qzn",
   "message": "The dream breaks, and you bolt upright in your bed. Your thoughts decelerating from panic and chaos. Whatever you were dreaming... It wasn't pleasant at all. As your eyes take in the familiar room around you, a smothering feeling settles on your chest that something is very wrong.\n\nYour legs work as they should, lifting you from your bed. Each breath comes naturally. Nothing seems wrong with your body. So your thoughts begin racing once more to find out why you feel this way.\n\nYou don't have to travel further than your window to find out. As you part the dark grey blackout curtains, a blinding light floods the room. It takes several second of blinking before you can finally see the landscape beyond the glass. Miles and miles of white ash, only occasionally broken by shapes jutting from the earth where you would expect buildings to begin.\n\nThe thought settles in your head, that thisust be where the feeling comes from. A ruined world surrounds you. A future where the only hope that lives, is the hope you can create yourself. And so you move to keep creating that hope. There has to be a way to fix this.\n\n You raid your closet and find your clothes right where they should be. A long brimmed hat was on the shelf and clothes to shield from the blazing light that coated the earth were not hard to find. So you dress, don the backpack you find on your table, right where you left it, and move outside, taking a better look at your surroundings to try to find anything that would indicate a good direction to explore in.\n\nEverything looks the same as far as the eye can see.\n. But rather than give up, you pick a direction and move. One foot after the other. There has to be something out there somewhere. Other people maybe. Other shelter for sure. You keep reminding yourself of that. Refusing to let despair win. What if you are the last human? Will you let the race die without a fight? And if you aren't? You have to find the others then. There's no excuse, you must keep going.\n\nHours drag by, and you don't see anything on the horizon. At this point you've forgotten which direction you even came from, but you press onward anyways. Eventually hunger catches up to you, and you sit on one of the small shapes that litter the ground regularly. Thankfully you had packed plenty of water and food the night before. You eat a couple nutrient bars, and some jerky, until the hunger fades.\n\nUp you go, onwards once more. And as the light softens slowly, the sun finally dipping towards the horizon, you swear you see a building standing in the distance. Your thoughts race as you you pick up the pace towards the progress you've been hoping for this whole time. Your lungs burn as you push yourself to reach it before it's lost to darkness.\n\nAs you approach, there are clear signs that someone had been living here! The thought of meeting someone else after a day of total isolation fills you with determination. You find a small room in the basement where meats were drying, but no one was there. You need food to survive though, so you take just what you think you'll need and pack it in your bag. When you come up, you see a well outside, and refill your water bottles from it.\n\nThe sun is just sitting on the very edge of the horizon, the last of the light streaking across the sky. Surely the survivor here must be home soon, unless they have a way to survive the nothingness out there in the night. You can already feel the heat draining from the air, and decide you'll just have to wait inside.\n\nYou leave your bag on the table, and explore the house a bit. Waiting around, sitting on the bed and looking out the window. After another hour you decide it's pointless to look out at a sea of black, and close the dark grey blackout curtains. You won't be able to meet anyone exhausted, so you decide sleep will be the best idea, so you can be at your best. You hope that whoever lives here is still okay. You hang your clothes in the closet and set your hat on the top shelf. Finally you lay in bed, closing your eyes and drifting to sleep, where the nightmare of being totally alone settles in to grip your dreams.",
   "created_utc": 1690582462,
   "score": 3,
   "submission_id": "15c0w9g"
  },
  {
   "comment_id": "jtvl0vx",
   "message": "\"Whoa, so this is just like that song!\" , I yelled.\n\nThe short man looked at me, his skin metallic, making him beam in more than just one way.\n\n\"You know.. that song by Busted, except you don’t live underwater, which honestly.. kind of disappointed\".\n\n\"Hm, who did you say you were again?\", the man looked at me as if I were some kind of alien, with fascination and curiosity. \n\n\"I’m Tom\", I said and put out my arm, but retreated it, unsure if it still were a custom. The man simply stared, confused. \n\n\"Ton?\"\n\n\"Tom\", I corrected him.\n\n\"I don’t understand.\" \n\n\"What do you mean? It’s my name.\"\n\n\"It’s very odd\", he glared at me. I felt his sass was uncalled for.\n\n\"Oh, well.. what’s your name then?\", I asked. Probably something containing Xs and Zs, I thought.  \n\n\"Ton.\"\n\n\"Oh right…So I bet you think I’m some kind of wack job, claiming to be from the past and all.\"\n\n\"No, I’ve met many of your kind.\" \n\n\"Whoa! Really? From my year?\"\n\n\" Different years, personally I like the folks from 1920s the most, they can’t stand the 2030s  people though, had to separate them, then of course there’s the 1740s folks, now they’re the real wack jobs. But don’t tell anyone I said that\"\n\n\"Whoa, so are you an OG or ..well an old timer?\"\n\n\"OG? I’m thirty and I was born in the year 2970, if that’s what you’re asking\"\n\n\"Cool, so what’s food like?\"\n\n\"Food?\" , he gave me a bewildered look.\n\n\"Oh yeah, so we had this thing called food, gives you nutrients and vitamins and stuff and it can be really good, you put in in your mouth, chew and swallow, and then it goes in your belly and comes out well, later, in a different format if you will. Anywho my favorite is mac and cheese, and pizza, pepperoni pizza, pepperonis are these round little-\"\n\n\"I know what food is.\"\n\nI stared at him, and he stared back. What the hell was this guy’s problem?\n\n\"Just of all the questions you could have asked, it’s odd you went for that one\".\n\nI was liking this place less and less. \n\n\"So is there any chance of me getting back or am I stuck here?\"\n\n\"Unfortunalty your time has passed, and this is your new home time. We provide training, information and housing for all time refugees, helping you adjust to the new culture and customs of our time.\"\n\n\"What about my family? And my friends?\"\n\n\"Oh they’re all long dead, here is your new address, you’ll be picked up in 241 seconds\"\n\n\"What?\"\n\n\"In approximately 4 minutes, a man will pick you up\", he said slowly, as if speaking to an idiot.\n\n\"They’re all dead?!\"\n\n\"Yup!\"\n\nIt seemed obvious, and yet it hadn’t hit me. I refused to accept it, I knew there had to be a way to fix this.\n\n\"Are you telling me none of my friends and family are here and they’re all dead?!\"\n\n\"Of course I am\" the man smiled, and handed me the piece of paper with an address.\n\n\"Wait a minute - How do I know this isn’t all just a dream?\"\n\n\"Because that would be terrible writing\"\n\n\"Huh?\"\n \n\"Nevermind\"\n\nMoments later I was picked up by a man named Jimmy, he was originally from the 1970s, and had ended up here while he was heading to a restaurant.  \n\n\"Do you ever miss home, Jimmy?\", I felt relieved to meet a fellow time traveler, even though we weren’t from the same time. \n\n\"No.\"\n\nWe finally arrived at the time-refugee centre. Jimmy led me down a long corridor and pointed at a large white door. \n\nIt was my new home, the room was bare, with few things, there was something that looked like a floating cloud in the middle of the room, Jimmy said this was my bed. \n\n\"Hey, I bet that’s like sleeping on a cloud!\", I roared with laughter at my own hilarious joke, Jimmy shrugged and left. Clearly comedy was dead too, I thought. There was a small table floating next to the cloud, with a pair of glasses on it, with a note saying \"MOVIES!\"\n\nI put them on, and the whole room transformed into a blank blue color.\n\n\"PROMPT REQUIRED\" a voice said out of nowhere.\n \n\"What?\"\n\n\"The system requires a prompt to play\"\n\nIt took me a moment to understand, okay fine, took 35 minutes, whatever.\n\n\"PROMT: So there’s a guy named Tom, 26 years old, the year is 2023, the 29th of July, and he’s at home, in Minnesota, in his yellow house on Wilmington Lane where he lives with his two friends. He goes to bed and wakes up, and everything is normal and his life continues just as it were. Length of movie 613606 hours. PLAY.\"",
   "created_utc": 1690588992,
   "score": 3,
   "submission_id": "15c0w9g"
  },
  {
   "comment_id": "jtvof3v",
   "message": "I couldn't believe it. Those magic beans the stranger sold me actually worked. Although contrary to their instructions, I did in fact cook them. \n\nI think I'm ready to go out, James would be the first person I'll call. My phone had to be somewhere around here. Ah there it is, under the pillow. The number's not connecting. odd. Maybe Sarah, odd that one didn't work either. Maybe the cell service crashed? Or maybe I just forgot to pay the bill. I could always ask to borrow someone's phone.\n\nI ran up the stairs and opened the door onto the street.\n\nBut it wasn't a street. It was just dirt, a dirt road. \n\nI ran and ran. I didn't know if I was heading towards more dirt, but I didn't care. It started to get dark but I saw some lights. I pushed on and on. I thought I saw people, but as I got closer I realized that they were indeed robots. I dragged myself throughout the city. But there was nothing but robots.",
   "created_utc": 1690590520,
   "score": 1,
   "submission_id": "15c0w9g"
  }
 ]
}