{
 "submission_id": "15c2wco",
 "title": "[WP] When you woke up, you found yourself in the world of your most famous novel. However, given your series is famous for its depressingly bleak and hopeless setting, you’re very worried about what would happen if the characters found out who you are.",
 "selftext": "",
 "created_utc": 1690563464,
 "permalink": "/r/WritingPrompts/comments/15c2wco/wp_when_you_woke_up_you_found_yourself_in_the/",
 "score": 54,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c2wco/wp_when_you_woke_up_you_found_yourself_in_the/",
 "comments": [
  {
   "comment_id": "jttrt4l",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690563464,
   "score": 1,
   "submission_id": "15c2wco"
  },
  {
   "comment_id": "jtuy4dm",
   "message": "„This can’t be real“\n\nBut here I am, starring at three moons. And, as if to mock me, I spot the fourth moon, which is only rarely visible.\n\nYep, this is definitely the novel I wrote, no fucker besides myself would get such weird ideas. Which is why I’m in trouble.\n\nI recognize the buildings around me, or better, what was left of them. I saw them daily in my head, the ruins of Towen.\n\nNo matter the time, Towen was since the thirteenth chapter a place known for despair. I also quickly realized the time.\n\nThe second novel of my series was the most famous, as it had *her* death. But she wouldn’t go down without resistance and Mika wouldn’t take it without destroying half the city.\n\nAnd I was five minutes prior to her death here. If they knew that it was me who planned her death and every other, I would be lucky if they only drunk my brain.\n\nReally, why did I have to give the „*villains*“ the ability to liquify their victims brains to drink them?\n\nI ran, just ran away. I killed Pascal, killed Lycoris, Alex died a few seconds ago, Hino will die and many more.\n\nI put Hino through hell, even if that was something readers would get to know in volume three, the second most popular. Amary had to see the only person who wanted him for who he was brutally die. I made so many people suffer and there would be more.\n\nAwilix will die a death more than gruesome, same as Jamie. The whole pack will sacrifice themselves for their Alpha Alice, who isn’t even a werewolf. Ra will also die, same as Finel. \n\nMany will lose their homes, their loved ones and, worst, their hope in life.\n\nI heard her cries and stopped. I felt nothing, when the other characters were in pain, but only imagining her cries would make me normally cry. Everything was different when it came to her.\n\nShe started as only a rude cat. I only knew that she should have a dark past. In endless sleepless nights, she was on my mind. Whenever I felt fear, she made a joke in my head, cheering me up.\n\nWas that the reason why I made her the first friend of my heroine? Why I told how her story continued, now in hell? It all connected. She was the only one, who came back from the dead, in this helpless world, she was the light.\n\nThe brighter the light, the darker the night.\n\nI could die, no, I will. Everybody will. You, I, we can’t stop dying every second we „*live*“. But When I wrote her name for the first time.\n\nI ran back.\n\nShe saved Mika from suicide.\n\nI saw large craters.\n\nShe accepted Amary.\n\nI saw a man with skin like paper, dark plants with berries on it.\n\nShe gave the freaking devil a second chance. Well, she will in the third volume.\n\nShe lays on the ground, her body barely recognizable as one. But those eyes. How many times did I saw those eyes, a wonderful disaster, beauty in such pain, will to survive despite being hopeless? It didn’t matter.\n\nBerry wanted to kill her and I used the last ounce of strength in my legs to jump in front of Hino. He was confused.\n\n„What are you fly doing here?“\n\nHino was also confused, but like always her eyes had this foreign wisdom.\n\n„Believe my please. This world is a book and I’m the author. I know anything and can help you, but please let her life!“ \n\nI cried, while he had a look of disbelief. „Any proof?“\n\n„I-I can tell you about the legacy, how Awilix and Gukumatz meet, how Chrys lost his sight and“ I gulped, knowing that this was a dumb thing to even think in this world, „I know who built the first magic wand. It was Galaxy, the fourth sister and I know where she is“\n\nThat day, there were no further deaths. But a victory in battle is nothing when the war is lost. I told them everything and as I knew everybody better then themselves, we were always a step ahead.\n\nMy condition was clear, certain people just couldn’t die. Instead, they were in magical prisons, having the illusion of some comfy places.\n\nThe bad guys won for good, but I couldn’t care less. Hino one day came to me and asked, if it was true. I said yes, making her cry.\n\nShe heard how she could have been, how her parents maybe could have survived, how she could had a childhood away from that witch.\n\nShe dragged Mika to me, both following me. The world was doomed, but I had them. Since I was young, I wished my friends were real and could answer my questions. Never would I have thought that I had to become fictional for my dreams to come true.",
   "created_utc": 1690579375,
   "score": 2,
   "submission_id": "15c2wco"
  },
  {
   "comment_id": "jtv0j7f",
   "message": "Blood thirsty creatures roam the streets. They make blood curdling groans as they absent mindedly roam the streets in search of their next unlucky victim.\n\nThat was the scene I woke up to today. In an abandoned building site forgotten by humanity no less. Moss hung off the walls in intricate patterns. They were the only sign of colour left in this place. \n\nIt didn't take me long to realise. My most famous novel, my magnum opus. Appraised around the world for it's loveable albeit deeply flawed characters and unforgiving storyline accompanied by a harsh and hostile world.\n\nWhat it was most famous for was its plot twists. Anyone could die at anytime. \n\nAnd upon seeing one of those monsters bolting headfirst towards me with a taste for flesh, that time seemed to be soon. I closed my eyes. \n\nBlood sprayed everywhere. The main character of my novel had come to save me. He slashed through the monsters throat as it's body thrashed into the ground.\n\n\"Hey, are you OK?\" he said nobly extending a hand towards me. I took it as I watched the comforting, if not slightly uneasy smile painted across his face.\n\n\"Another survivor, huh? It's tough in this world, that's for sure.\" All I could do was nod.\n\nI always had a profound desire of seeing your very own novel come to life. My blood, sweat and tears being turned into something bigger, seen by millions. It was one of my biggest dreams. I had thought about a TV series or maybe even a movie.\n\nThis was certainly not something I had expected. \n\nThoughts ran through my head as he kept on talking, I knew the ending of this plot and one thing was for sure.\n\nIt wasn't going to be a happy one.\n\nThe world was going to end soon. The whole novel was about how characters react when life as they know it is turned over. What they do when everything they have is lost, who they turn into. The things that they do.\n\n\"Are you... okay?\" he asked showing a clear tone of concern that made me snap out of it. \n\n\"Yeah... just adjusting.\" I stuttered out. \n\nThe main character was known for being noble and courageous until the end. Except... the end was nearing soon. You see, the characters didn't know what fate was waiting for them. \n\nBut when they did... the world got even worse.\n\n\"Hey, I think I should take you to my friends, we can help you out!\" he said in an attempt to comfort me.\n\nMy heart nearly stopped. This was the moment. The heartbreaking finale when they all find out that the world was ending.\n\nAnd when they all lose their sanity. \n\nI tried to run, look for somewhere to go. I knew how meeting up with their friends was going to pan out and I didn't want to be there for it. \n\nI had no choice. There were zombies roaming the streets everywhere, ready to tear into my flesh at a moments notice and... I was pretty defenseless. \n\nI reluctantly walked alongside him. Was this really it? My death was going to be at the hands of my own creation. My love and joy, the book that propelled me into success was soon going to be the end of me.\n\nThen I realised.\n\nI knew how this book was going to end, and I had a way to stop it. I could tell them, explain what was going to happen. None of them would want to descend into insanity.\n\nAt least, that's what I thought.\n\nThey weren't exactly going to love the idea but I didn't have an alternative.\n\nI walked and walked, until I saw them. The group of friends at the centre of this story. The ones who were going to show their true sides real soon if I didn't stop it.\n\nWith my racing heartbeat, I took a deep breath, ready to explain. \n\n\"I have something to tell you. You're not going to like it, but I feel that it's necessary. You're all in a book. The world is going to end soon.\" \n\nI looked around at all of them. Their expressions were filled with confusion, disbelief and denial.\n\n\"How do we even know if that's true? I mean, were in a book? And the world is going to end soon?\" one of them said.\n\n\"Because I was the one that wrote that book.\"\n\nTheir faces were even more confused. If not slightly enraged. \n\n\"It's important to calm down now.\" I stammered out, feeling the heat if five sets of angry eyes on me.\n\n\"You're all soon going to... become insane. When you find out the world will end. You won't like it, as I'm sure you're all aware of.\" \n\nI wasn't sure if it worked or not. I thought it did, at first. None of them seemed to be starting their downward journey into insanity just yet. \n\nUntil I heard the screaming. \n\nShe fell down on her knees. She let out bloodcurdling screams. \"I can't take it! I went through all of this, just for us to all die? It's not fair!\" She was hysterical. She screamed until she lost her voice.\n\nThe main character tried to comfort her with his encouraging words of hope, as he had done many times before. \n\nIt didn't work. And it only got worse. The speakers started blaring. This was it. The moment when they all found it out. \n\nThe speakers began telling them that their world was being destroyed in an attempt to eradicate all human activity. The end as they know it. \n\nIn the book, they all look around at the city falling around them. Their world becoming even more destroyed than it already was. They turned to insanity, delusions and denial in the desperate hope of it not coming true. However, this time was different.\n\nNow they had someone to blame it on.\n\nTo torture, to harm, to hurt, to abuse, to scream at, to stab, to shoot. To *murder.*\n\nIn the end, my book did eventually come to life.\n\nEven if it was at the end of mine.\n\n---------\n\n**Writing Prompt #12**\n\n**Please let me know if you have any thoughts on this story or if you enjoyed it, it means a lot to me!**",
   "created_utc": 1690580328,
   "score": 1,
   "submission_id": "15c2wco"
  },
  {
   "comment_id": "jtvo9oi",
   "message": "I am a god. Well not *really* a god but that’s the closest thing to what I am that you’ll understand. Now I’m telling you this in the hopes that you won’t run to The Godseekers and have me killed.\n\nI’m not asking you for protection or anything like that: you can just kill me if you want given I lack the kind of powers you would expect from a god. But I also lack the implicit malice of a god so maybe wait on the whole “killing me” thing for a bit ok?\n\nNow I, like the rest of the gods, lack The Current of Tazh. This means two things: number one is that, like with other gods, any test you do will *say* I’m a god and number two, like they do with each other, the gods want me dead. However, unlike the other gods, I am less a god of suffering or war or death or some awful combination thereof and more a god of knowledge \n\nNow you, Bartal, are supposed to die a gruesome death in 5 days time at the hands of The Godseekers for being suspected of harboring Dhan, the fugitive god of mystery and truth, but with my help not only can you avoid that but we can find Dhan and maybe prove to The Solarch and His Brightness’s Shining Tribunal that it’s The Godseekers who killed all the good gods in the first place.\n\nAnd those are the exact words he told me. \n\nAnd you *believed* him. \n\nOf course. I mean he *has* survived this long plus the people suddenly speak of two gods, not one, that are said to recognize His Brightness’s Shining Tribunal, not to mention no one but gods call you fugitive",
   "created_utc": 1690590451,
   "score": 1,
   "submission_id": "15c2wco"
  },
  {
   "comment_id": "jtvvk4y",
   "message": "It was so dark when I woke up. And it smelled too. You would think I would catch on by then but no. I don't know how much time I spend there. But I wouldn't be surprised if it was years. A few hours after walking up in my dirt cell, a green goblin came to my cell before running off. A few hours alter a similar, but much much larger. They had smaller beings, but no humans, like me moving huge wheels with rods sticking out of them. On top of each wheel was a set of gears. I never did figure out what the machine did. \n\nBut one day the place was invaded by more humanistic looking knights and the ogres, that's what I decided to call the larger goblins, were pushed back. They did take some of their slaves with them, but I was one of the ones that managed to escape. \n\nI live with the knights, who still looked more human, in comparison to the goblins, under their armor. They lived in a bunker some days away. Most of their species was wiped out. And they were running lower and lower on supplies. The goblins could persist longer because they could eat almost anything and had no morals. \n\nIt dawned on me halfway through that this was one of the stories I created. I thought it was a nightmare at first, but it never ended. I always had this odd thought at the back of my mind, like they would somehow know that I created this world.",
   "created_utc": 1690593847,
   "score": 1,
   "submission_id": "15c2wco"
  }
 ]
}