{
 "submission_id": "15c5shc",
 "title": "[WP] You are slated to be burned at the stake for the crime of witchcraft. You committed no such crime, but as the flames rise you remain completely unharmed, much to the surprise of both you and the mob that gathered to watch your execution.",
 "selftext": "",
 "created_utc": 1690570293,
 "permalink": "/r/WritingPrompts/comments/15c5shc/wp_you_are_slated_to_be_burned_at_the_stake_for/",
 "score": 141,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c5shc/wp_you_are_slated_to_be_burned_at_the_stake_for/",
 "comments": [
  {
   "comment_id": "jtua8c4",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690570294,
   "score": 1,
   "submission_id": "15c5shc"
  },
  {
   "comment_id": "jtvaivq",
   "message": "She didn't feel an ounce of pain. The flames were truly harmless, one could even call them soothing. She knew they were real, it wasn't an illusion, because a cold autumn night such as that was not meant to be so warm and pleasant.\n\n\nYes, the night was unnaturally pleasant, the mob that had gathered to watch and warm themselves by the fire was left silent. Instead of purging the witch bound to the pyre with divine justice, the flames did no more than evaporate the tears that were streaming down her cheeks.\n\n\nSome people would be in awe at such an event, they would see such surpassing of the natural order of things and fall to their knees in prayer. Perhaps they would think their own judgements were foolish, that the woman they condemned was in fact innocent. But these were hardly such people.\n\n\nAs soon as it was clear that she was not in pain, that the blaze did not gnaw at her clothes or skin or hair, the mob was unhappy. It took just one town drunkard screaming \"THE DEVIL'S MAGIC\" at the top of his lungs for those gathered there to reach an agreement. That the devil is protecting her, and that she must die. The night was now drowning in screams about devils, justice, evil and the like.\n\n\nAny attempt of the one tied at the center of the gathering to defend herself was, of course, unheard. So were her tearless sobs, mourning that the inferno had not seen it fit to take away her life, that she would have to face the people that surrounded her. The people she grew up with, who now looked at her with such hatred in their eyes that the flames paled in comparison. Unheard still was the smallest whisper: \"I'm sorry it turned out this way\" coming from the blaze.\n\n\nAs would naturally follow the fanning of the flames of fear and hatred within the crowd, someone, somewhere, picked up a pebble and threw it towards the woman, perhaps trying to remind the fire of its purpose. Normally that would be the start to a hail of stone raining upon the unfortunate soul on the pyre.\n\n\nBut things didn't quite work out that way. The villagers' understanding of the situation might not have been that far from the truth, for before the first pebble even reached its target, the inferno had grown in size and ferocity enough to fit its title. As it nearly engulfed the people closest to the fire, it answered a question that had been on the mind of many: \"is the fire harmless to all?\" No. The screams of those burnt by it answered as such. It might be worth mentioning that the people weren't killed, they were merely given a little insight into what burning alive felt like. Some entity considered it an important lesson for them to learn.\n\n\nStill, the chaos that ensued in the mob after this sudden development ceased to matter for the so-called witch and the devil.\n\n\nThe belly of the inferno that they found themselves in was far quieter and less chaotic than the world outside. The devil was the first to break the silence:\n\n\n\"A pity, my dear, that this is how we meet again.\" her voice tinted with regret. Recognition filled the woman's mind as the devil came closer. \"I apologize for not freeing you sooner\" she said, embers undoing the rope that tied the woman to the pyre. Yet, as soon as she was free she clinged to the wooden stake, fearing the raging flames bellow. The smallest hint of a chuckle escaped the devil's lips. \n\n\n\"You will not fall Alice, let go of that awful thing.\" she said gently, her lips curled into a smile and her hand outstretched in front of her.\n\n\nThe human was baffled, yet finally starting to grasp what had happened that night. She, too, smiled, although it was the smile of one who was fighting back tears. \"So this was the secret you thought was too much for me to handle?\" The situation suddenly became incredibly funny to her. The friend she thought had disappeared was finally back, as full of surprises as ever. She hardly noticed letting go of the stake and falling into her arms, her laughter turning into sobs.\n\n\n\"I still stand by that, you know. Your town seems just as welcoming of devils today as it was in the past.\" she muttered, gently rubbing Alice's back. She hated seeing her cry like that.\n\n\n\"This place is hardly appropriate\" the devil whispered, then hugged the woman to her chest. The two of them disappeared, the fire disappeared, the pyre disappeared, all in an instant. Some people dropped their pitchforks, others spilled their holy water, but enough about them.\n\n\nSomewhere on a patch of damp grass overlooked by the moon sat two women. One was crying and the other was trying to comfort her. Eventually the crying stopped. The human pulled away, looked at her surroundings, looked at the devil then put her head right back to her friend's chest.\n\n\n\"I'm sorry I didn't get you out of there sooner. I won't let you go through anything like that again.\" the devil was serious now, remorseful.\n\n\n\"Well, at least I'm still alive, aren't I? Genuine question, with the things that just happened, nothing would surprise me any more.\" the woman said, her voice slightly raspy.\n\n\nThe devil pinched her cheek to confirm, and a loud \"OW\" followed. \"There's your answer\" she said with a slight grin.\n\n\nThey laughed for a moment, but it didn't take long for the human to ask: \"What now?\" and for the devil to sigh in response. \"Good question. We'll figure something out, I suppose. Try not to worry about it for now though, whatever happens, I'll make sure you will be safe.\" she said, petting her head.\n\n\n\"Could I ask you for a favor?\"\n\n\n\"Asking the devil for favors? Sure thing. What is it you seek, mortal?\" she said in mock grandeur.\n\n\n\"Please don't dissappear again. I don't care what happens so long as you're with me. I missed you Lucy.\"\n\n\n\n\n********************\n\nThe end. That's it folks, hope you enjoyed. Feedback is always appreciated.",
   "created_utc": 1690584465,
   "score": 22,
   "submission_id": "15c5shc"
  },
  {
   "comment_id": "jtuxty6",
   "message": "A wrongful execution most foul. As was the tradition of the time. Benita found herself at the mercy of an angry mob for the third time in her life. With the word 'mercy' putting it mildly.\n\nShe cried and pleaded with the crowd, as she'd seen others sent to the same fate do before. Many even begged for her release. For her safety, for anything. But to no avail. She was tied to the post in the town square, and the fire below was set alight. The flames rising higher as the crowd cheered and gasped all the same. The consequences of sins such as Benita's laid bare.\n\nFlames licked at her feet. Her legs, and finally the rest of her as her clothes took, turned black and ignited. There she was. Burning at the stake. Except as her cries died out, so did that of the crowd. Because despite the morbid routine they had committed to, so eagerly.\n\nBenita herself was not burning.\n\nIt was as if the woman was untouched. Her garments and all around her burned fiercely. She herself had stopped fighting, and just like the crowd, seemed to watch the fire in awe.\n\n\"...It doesn't hurt.\" She mumbled in alarm. Her words inaudible in the fire. \"I'm alive. How??\"\n\n\"How is she still alive?!\"\n\n\"She doesn't burn!\" Someone else panicked. \"She doesn't burn!!\"\n\n\"She really is a witch!\"\n\nAmongst the shouts from the crowd, she became aware of one of the people leading the proceeds. A local farmer, Gaspard, was known for his gregarious nature. And as a self appointed crusader against witchcraft, he'd made himself known for leading such bloody spectacles.\n\n\"No matter!\" He assured the crowd. \"If she shall not burn, perhaps we shall have to get creative! There is more than one way to destroy the wicked.\"\n\nBenita couldn't agree more. If she could free herself right now, leave this post, she'd find a way to take care of him herself. She'd make sure of that.\n\n\"Yes! We shall!\" He promised. \"Yes. We... I, uh... Yes-\"\n\nGaspard fell over; rigid, pale. The crowd stepping back a little. His wife, a crude yet meager woman, kneeling at his side now. His veins distended. Foam bubbling at the corners of his mouth. Eyes bulging. Another involuntary click of the jaw drew forth a fountain of red.\n\nHis wife yanked the town's doctor over, in an attempt to save him. But Gaspard died choking on his own blood.\n\nThe ropes gave around this time, having finally burned through. As the crowd paid more attention to Gaspard's last breaths, Benita winced as what was left of the kindling poked at her. She clawed her way forward, through the ash and heat. Eventually, she found herself back on unburnt earth. The dirt pleasingly cool to the touch.\n\nShe considered Gaspard's body from a distance. Was it just coincidence? Was she responsible? Was it the judgement of a god?\n\nOne of the other townsfolk turned to face her. A rather portly fellow, seemingly undaunted by this turn of events. Ernesto, if she remembered right. She never liked him either. One day, someone would gut him like the pig he-\n\nThe pitchfork of the person nearest him sunk deep into his stomach, with such force he stood on his tip toes for a second. The combined shout and noise causing others to look. Ernesto silently tried to put himself back together now, with no real luck.\n\n\"What is going on here?\" Someone asked as the others began to accuse each other. Shove. Fall to their knees and pray.\n\nBenita knew the truth. She'd done this. And it was glorious. She wondered now about Gaspard's wife. She had been exceptionally eager to see Benita burned alive. Well, the wind was blowing in the right direction.\n\n\"Hmmm...\" She whispered. \"Lovely.\"\n\nWhile she didn't know her personally, seeing her dance around the square catching others and some stands alight gave her pause.\n\nFollowed by relief.\n\nShe'd never really liked this town. Or living here. She stood to watch bits of it burn. Just like they had tried to burn her.\n\nIt wasn't like she knew any spells or anything. After all, she wasn't a witch. She didn't know the first thing about witchcraft. But she knew what she could do. With their minds, their bodies, the environment. Before too long, there weren't many people left. A few of them that had wanted her released didn't make it either.\n\nIn hindsight; Benita reminded herself that she'd gotten carried away. Those were on accident. She didn't mean to involve them, but in their attempts to escape, they ran into the path of death all the same.\n\nShe finally came back to her senses somewhere on the opposite side of the village. The night sky tinged orange now as embers floated by. It was just her, and some poor soul like herself. A simple farmhand who'd been roped into this ordeal all the same as so many others.\n\n\"To whom do I owe the pleasure?\" She asked him sternly now.\n\n\"...Um... H-Helio, your majesty.\" He said as he backpedaled in the mud.\n\n\"Helio?\" She asked him as she glanced at the flames. \"Do you live here?\"\n\n\"No. No, miss. I-I just was selling my wares. My crops.\"\n\n\"You have a farm?\"\n\n\"Just a day's journey or so.\" He breathed and pointed. \"That way.\"\n\nBenita studied him as she cinched a robe she'd stolen shut. Screams still echoing up from the town. His fate in her hands.\n\n\"Shall we go then?\"\n\n---\n\nr/Jamaican_Dynamite",
   "created_utc": 1690579264,
   "score": 14,
   "submission_id": "15c5shc"
  },
  {
   "comment_id": "jtvflgh",
   "message": "\"God will judge whether or not you are innocent.\" The priest sneered with a self-righteous glower.\n\nIt had only been one month since I'd arrived, and in that month, strange things had begun to occur. First, a frmer's mare had gone lame, then the milk of a cow had soured. then little Timothy... that poor soul.\n\nThey had regarded me, the stranger, with suspicion even before then, now it was with hatred and fear, fear that I was a witch, fear that I had come specifically to cause them harm.\n\nMy pleas of innocence fell on deaf ears, my claims that I was a true believer were silenced by the priest's promise that if that were true, God would save me.\n\nAs I was tied to the stake, as the pyre beneath my feet was lit, I sang one of the few hymns I knew, only for them to be drowned out by the flames.\n\nYet in spite of the intense heat, my skin remained whole. In spite of the smoke that choked the air, what I breathed was as fresh and clear a the morning wind.\n\nA miracle had been delivered unto me, so I sang all the harder, my voice carried out through the flames, until all at once the flames guttered out- save for the flames that had ignited within my heart, my bonds- singed beyond any and all strength to contain me- broke apart.\n\nI strode from the fire, compelled to approach the priest who gawked at me, and a question came unbidden from my lips.\n\n\"Has God judged you?\"\n\nAs I spoke these words, fire erupted from my mouth and wreathed him in flame- and though he fled from me, screaming, flesh sizzling and popping and every agony that had been promised to me instead laid upon his shoulders.\n\nI looked at the villagers, who stared at me in wonder, and I asked them of my own volition.\n\n\"Has God judged you?\"",
   "created_utc": 1690586616,
   "score": 13,
   "submission_id": "15c5shc"
  }
 ]
}