{
 "submission_id": "15c7fz9",
 "title": "[PI] A witch tried stealing the soul of the princess. Nothing went as planned.",
 "selftext": "[original post](https://www.reddit.com/r/WritingPrompts/comments/159dz27/wp_a_witch_tried_stealing_the_soul_of_the/?utm_source=share\u0026amp;utm_medium=ios_app\u0026amp;utm_name=ioscss\u0026amp;utm_content=2\u0026amp;utm_term=1)\n\n The room was lit by a single candle. It was blood red, with thick veins of wax that dripped down the side. The flame flickered with a life of its own.\n\n“Good, That’s everyone!” Orthleo announced, “Introductions! I’m Orthleo, the fae who put this operation together. This is the mighty Bruckus, our resident Druid. Let’s see, Bridget the Witch, who will do the switch. Haha. We have Samantha, not exactly corporeal right now, but very helpful all the same. And we have… well… they don’t have a name, but I know they will also be very helpful!”\n\nDespite his playful act, Bridget knew Orthleo was the most dangerous around the table. Bringing in a new face for a job like this was an unwelcome surprise for the witch. The newcomer looked like a tall man in the dim light, but every breath they took made a low rattling. And from time to time, they made a small unnatural movement that would be impossible if they had bones like the human they were pretending to be.\n\n“The plan follows thus;”Orthleo pointed to a map sprawled across the table. “Bruckus has informed me that there is a crack wide enough to squeeze through, if you have the means. So he and our nameless friend will go through. Bruckus will go to this servants entrance where he will wait, while his companion… finds a suitable disguise.” Orthleo nodded towards the newcomer. “Using that disguise they will go to this wall here and drop a rope once the coast is clear. Bridget, Samatha, and I will climb up undetected. I will leave you to make a suitable distraction by the front gate while the rest you rendezvous with Bruckus. Then, make your way to the top of Northwest tower where you’ll find the princess and make the switch. Once your done, go back to the wall, and leave from there. Samatha will be the scout, Bruckus and nameless will be our muscle. Bridget has a few potions that will be helpful at times, but her main job is to keep herself and Samatha’s candle safe. Any questions?”\n\n“What’s this ‘suitable distraction’ you’ll make?” Bridget asked.\n\n“You’ll know when you hear it.” Orthleo chuckled.\n\nHours later, when darkness fell on the castle, Sligthor slid into the water with his companion and started swimming to the castle. The other team snuck through the trees\n\nBridget carefully held the candle in the darkness, making sure to cover the light with her free hand so they wouldn’t be seen. The shadow of a girl flicked onto the hand. \n\n“I don’t like this,” She whispered to the candle. “I don’t like how Orthleo brought in someone new. I would have left if I wasn’t so desperate.” \n\nThe candle flickered.\n\n“Yeah, I guess this is a big payday for you too. I just don’t trust Orthleo and I’m scared something will go wrong.”\n\nA new moon drifted unseen through the night sky as the group settled into the brush nearest the edge of the castle. The wall was stationed by just a few lone sentries that passed by every two minutes. For some time, nothing happened, but then a rope dropped down the side.\n\n“Go! Go! Be quick!” Orthleo whispered.\n\nBridget strapped the candle to her waist and ran to the rope. She made it on first, and was quickly followed by the fae. When they made it to the top, they saw the face of the sentry staring at them. For a moment Bridget thought they were caught, but when she heard the telltale rattling she understood. \n\n“Ok, I’m off! You three have fun!” Orthleo said quietly.\n\nShe looked at the skinwalker before her, and looked back to see that the fae was already gone. A shadow burst forth from the candle and attached itself to the wall ahead. \n\n“Hello!” The yell was followed by a deafening boom and terrified screams from people far away.\n\n“Ok. That’s our cue.” \n\nThe skinwalker made a rattling breath, and led the way forward. As we walked, the shadow darted from wall to wall in all directions. We walked down stairs and walked along the edge of a courtyard to where Bruckus was supposed to wait.\n\nWhen we approached, a snake slithered out from\n\n“I’m sorry to do this to you guys on such short notice, but I have somewhere I need to be.”\n\n“You’re coming with us, that’s the plan.”\n\n“Unfortunately, there’s been a change of plans. And when nature calls, you have to drop everything.” Bruckus said giving a sad short chuckle.\n\nBridget was not amused. She was reluctant to leave her only true friend in the group, and the only ally she trusted. But she knew that when he got like this, it was impossible to change his mind. She couldn’t shake the feeling of betrayal when he abandoned her. When he saw her expression he went to comfort her, but he thought better of it and quickly ran off.\n\nThe skinwalker made a loud rattle, seemingly annoyed with this development but continued to the servant door that led inside. A boom followed by loud crazed laughter echoed across the courtyard. It was the last thing they heard before they walked into the castle.\n\nAlthough it seemed like a maze of corridors to Bridget, the skinwalker had no trouble finding their way. She watched as the shadows drifted frantically before her and felt increasing powerless as they delved deeper inside the castle.\n\nSuddenly the candle flared up and the shadow retreated back slowly. I stopped and found a hiding spot under a chair nearby. A guard came running through the room toward who he thought was another guard.\n\n“Do you know what the hell is going on out there? Are we being attacked?”\n\nThe answer was a deep rattling that grew louder and faster. Suddenly, all the light had been snuffed out except for the single candle strapped around Bridget’s waist. She peaked her face out from under the table to see the dull light glinting off ever expanding rows of churning teeth. She heard a dull thud as the guard fell from his feet. \n\nBridget reached to to her bag and found a potion of lethargy. She tossed it into creature’s growing mouth and stepped out from under the table. As shadows receded, she saw the guard clutching his knees into his chest next to a horrible toothy mass.\n\n“Do you know the way?” Her voice quivered as she spoke but the words came out.\n\nA shadow extended from the candle to a door in the corner of the room. She walked through the door trying to leave her fear behind. Inside she found a spiral staircase leading upwards. She ran up the stairs, trying to prepare herself for what comes next. At the top, she found a locked door that opened after a splash from a vial of acid.",
 "created_utc": 1690574166,
 "permalink": "/r/WritingPrompts/comments/15c7fz9/pi_a_witch_tried_stealing_the_soul_of_the/",
 "score": 24,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c7fz9/pi_a_witch_tried_stealing_the_soul_of_the/",
 "comments": []
}