{
 "submission_id": "15c73tr",
 "title": "[OT] Fun Trope Friday, Writing with Tropes: Resurrection \u0026amp; Dramedy",
 "selftext": "#Hello r/WritingPrompts!\n\n###Welcome to **Fun Trope Friday, our feature that mashes up tropes and genres!**\n\nHow’s it work? Glad you asked. :)\n\n\u0026amp;nbsp;\n\n\n-\t**NEW!! Every two weeks we will have a new spotlight trope. (unless otherwise advised)**\n\n-\t**Each week, there will be a new genre assigned to write a story about the trope.**\n\n-\t**You can then either use or subvert the trope in a 600-word max story or poem.**\n\n-\t**NEW!! To qualify for ranking, you will need to provide ONE actionable feedback. More are welcome of course!**\n\n\u0026amp;nbsp;\n\nThree winners will be selected each week based on votes, so remember to read your fellow authors’ works and **DM me your votes** for the top three. \n\n\u0026amp;nbsp;\n***\n\nFor the fourth week of July…\n\n\u0026amp;nbsp;\n\nDrumroll please, it’s: \t**(Too Convenient) Resurrection**\n\n\u0026amp;nbsp;\n\nNext up this month is: **Dramedy**\n\n\u0026amp;nbsp;\n\n\nSo, have at it. Lean into the trope heavily or spin it on its head. The choice is yours!\n\u0026amp;nbsp;\n\n\nHave a great idea for a future topic to discuss or just want to give feedback? This is a new feature, so it’s all about what you want—so please let me know! **Please share in the comments or DM me on Discord or Reddit!** \n\n\u0026amp;nbsp;\n***\n\n**Last Week’s Winners**\n\nPLEASE remember to give feedback—this affects your ranking. PLEASE also remember to DM me your votes for the top three stories via Discord or Reddit—both katpoker666\n\nSome fabulous stories this week! Winners include:\n\n-\t[Lothli]( https://www.reddit.com/r/WritingPrompts/comments/15601hf/ot_fun_trope_friday_writing_with_tropes_kill_your/jt2h6vp/?context=3) \n\n-\t[john-wooding]( https://www.reddit.com/r/WritingPrompts/comments/15601hf/ot_fun_trope_friday_writing_with_tropes_kill_your/jt0pchl/?context=3)\n\n-\t[Carrieka23]( https://www.reddit.com/r/WritingPrompts/comments/15601hf/ot_fun_trope_friday_writing_with_tropes_kill_your/jt2uhg3/?context=3)\n\n\n\u0026amp;nbsp;\n***\n\n\n###**NEW!! (IT’S HERE!!!): Want to read your words aloud? Join the upcoming FTF Campfire**\n\nThe next FTF campfire will be **Thursday, August 3rd from 6-8pm EST**. It will be in the Discord Main Voice Lounge. Click on the events tab and mark ‘Interested’ to be kept up to date. No signup or prep needed and don’t have to have written anything! So join in the fun—and shenanigans! 😊\n\n\u0026amp;nbsp;\n***\n\n###Ground rules:\n\n- Stories must incorporate both the trope and the genre\n- Leave one story or poem between 100 and 600 words as a top-level comment. Use wordcounter.net to check your word count.\n-  Deadline: 11:59 PM EST next Thursday\n-  No stories that have been written for another prompt or feature here on WP—please note after consultation with some of our delightful writers, new serials are now welcomed here \n-  No previously written content\n-  Any stories not meeting these rules will be disqualified from rankings\n-  Does your story not fit the Fun Trope Friday rules? You can post your story as a [PI] with your work when the FTF post is 3 days old!\n-  Vote to help your favorites rise to the top of the ranks (DM me at katpoker666 on Discord or Reddit)!\n\n\u0026amp;nbsp;\n***\n\nThanks for joining in the fun!\n\n***",
 "created_utc": 1690573348,
 "permalink": "/r/WritingPrompts/comments/15c73tr/ot_fun_trope_friday_writing_with_tropes/",
 "score": 4,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c73tr/ot_fun_trope_friday_writing_with_tropes/",
 "comments": [
  {
   "comment_id": "ju00ek0",
   "message": "\u0026lt;Fantasy\u0026gt;\n\n***Bored to Life***\n\nThe infinite void I found myself in was more disappointing than disquieting.  The fae realm had been so vibrant and full of delights that it was hard for anything to compare.  This afterlife?  It was not beautiful.  It was not ugly.  It was not even terrible.  It was the worst thing imaginable; it was *boring*.\n\n*So this is death?  It's not really as interesting as I would have hoped.*  \n\n\"Hmmm, no, not quite.\"  I did not 'hear' the high voice that spoke so much as feel it.  \"This is more of a waystation.  You are on your way to whatever lies beyond, but I opted to check in with you and see if you wanted to continue.\"\n\n*What?  Are you a guiding angel?*\n\n\"Hahahahahahahahahaaaaaaa!  What an interesting question.  No, I am not here to *bring* you to wherever it is you are going.  I am just offering to *stop* your trip.  My hand is in the stream, keeping you from flowing downriver.  I can push you back up into the pond if you like.\"\n\n*Well...that is a tempting offer.  But I was pretty damn sick and it wasn't a good experience.*\n\n\"Oh dear, sweet human, did you think I would go through all of this effort for you to just die again in five minutes?  Of course, I will remove that which ails you!  You will continue to live for as long as you desire...\"  A pair of bright, red points of light appeared, growing into eyes of burning cinder and flame, \"*If* you agree.\"\n\n---\n\nI felt the cool, welcoming sensation of air filling my lungs.  My eyes opened and, for a moment, the light was blinding.  That moment passed and my surroundings came into focus.  Elina was on her knees by my bed, looking at me with shock through tear-filled eyes.  Just behind her was her friend Ophelia; the pallid elf had one hand on Elina's shoulder and the other was up covering her mouth, looking equally surprised.\n\n\"How is this-\"\n\n\"Sarah!\" Elina all but jumped up off the floor and wrapped her arms around me in a hug.\n\n\"Oof!\" I grunted. Though elves were light as a feather it was still more than my old bones enjoyed being jumped like that.  \"Take it easy dear or you'll squeeze the breath back out of me.\"\n\n\"Oh! Sorry! Sorry! I just...w-we thought...y-you...\"\n\n\"You were dead, Sarah,\" Ophelia's soft voice finished what Elina could not.\n\n\"Oh? I thought I was just sleeping,\" I said with a chuckle.  My lungs were free of the raspy burn from before, and nothing hurt except my neck, which was quickly relieved by shifting in the bed a little, \"Just kidding, just kidding.  I feel *amazing* though.  Whatever you did worked, thank you.\"\n\n\"But I did not administer anything,\" Ophelia said, looking back over at the cauldron she had been working diligently at.  Her brew was still bubbling and steaming.\n\n\"It's a miracle,\" Elina said, and I could not argue.  All I remembered was fading away in pain and feeling tired.  And now I felt *amazing*.\n\n\"It sure is something,\" I said, \"I'm starving though...any chance that medicine you made would go well with dumplings?\"\n\n\"I do not think it wise to administer anything just yet,\" Ophelia said, \"We need to-\"\n\n\"I'll make some dumplings,\" Elina said, cutting Ophelia off, \"Whatever you want Sarah.  Ophelia, thank you so much,\" she gave her friend a hug.  Something in the way Ophelia looked at me over her shoulder made me worry.  How *was* I alive?  My stomach rumbled and I decided that could wait until after snacks.\n\n\\----------------  \nWC: 600/600  \nAll crit/feedback welcome!  \nr/TomesOfTheLitchKing  \nFollow my Summer Challenge progress [Here](https://www.reddit.com/r/TomesOfTheLitchKing/comments/14c22dj/ot_summer_challenge/)\n\nNotes:  \n- This is a sequel to last week's [Kill Your Darlings \u0026amp; Fantasy](https://www.reddit.com/r/WritingPrompts/comments/15601hf/comment/jt254ng/?utm_source=reddit\u0026amp;utm_medium=web2x\u0026amp;context=3)",
   "created_utc": 1690669119,
   "score": 1,
   "submission_id": "15c73tr"
  }
 ]
}