{
 "submission_id": "15c73tr",
 "title": "[OT] Fun Trope Friday, Writing with Tropes: Resurrection \u0026amp; Dramedy",
 "selftext": "#Hello r/WritingPrompts!\n\n###Welcome to **Fun Trope Friday, our feature that mashes up tropes and genres!**\n\nHow’s it work? Glad you asked. :)\n\n\u0026amp;nbsp;\n\n\n-\t**NEW!! Every two weeks we will have a new spotlight trope. (unless otherwise advised)**\n\n-\t**Each week, there will be a new genre assigned to write a story about the trope.**\n\n-\t**You can then either use or subvert the trope in a 600-word max story or poem.**\n\n-\t**NEW!! To qualify for ranking, you will need to provide ONE actionable feedback. More are welcome of course!**\n\n\u0026amp;nbsp;\n\nThree winners will be selected each week based on votes, so remember to read your fellow authors’ works and **DM me your votes** for the top three. \n\n\u0026amp;nbsp;\n***\n\nFor the fourth week of July…\n\n\u0026amp;nbsp;\n\nDrumroll please, it’s: \t**(Too Convenient) Resurrection**\n\n\u0026amp;nbsp;\n\nNext up this month is: **Dramedy**\n\n\u0026amp;nbsp;\n\n\nSo, have at it. Lean into the trope heavily or spin it on its head. The choice is yours!\n\u0026amp;nbsp;\n\n\nHave a great idea for a future topic to discuss or just want to give feedback? This is a new feature, so it’s all about what you want—so please let me know! **Please share in the comments or DM me on Discord or Reddit!** \n\n\u0026amp;nbsp;\n***\n\n**Last Week’s Winners**\n\nPLEASE remember to give feedback—this affects your ranking. PLEASE also remember to DM me your votes for the top three stories via Discord or Reddit—both katpoker666\n\nSome fabulous stories this week! Winners include:\n\n-\t[Lothli]( https://www.reddit.com/r/WritingPrompts/comments/15601hf/ot_fun_trope_friday_writing_with_tropes_kill_your/jt2h6vp/?context=3) \n\n-\t[john-wooding]( https://www.reddit.com/r/WritingPrompts/comments/15601hf/ot_fun_trope_friday_writing_with_tropes_kill_your/jt0pchl/?context=3)\n\n-\t[Carrieka23]( https://www.reddit.com/r/WritingPrompts/comments/15601hf/ot_fun_trope_friday_writing_with_tropes_kill_your/jt2uhg3/?context=3)\n\n\n\u0026amp;nbsp;\n***\n\n\n###**NEW!! (IT’S HERE!!!): Want to read your words aloud? Join the upcoming FTF Campfire**\n\nThe next FTF campfire will be **Thursday, August 3rd from 6-8pm EST**. It will be in the Discord Main Voice Lounge. Click on the events tab and mark ‘Interested’ to be kept up to date. No signup or prep needed and don’t have to have written anything! So join in the fun—and shenanigans! 😊\n\n\u0026amp;nbsp;\n***\n\n###Ground rules:\n\n- Stories must incorporate both the trope and the genre\n- Leave one story or poem between 100 and 600 words as a top-level comment. Use wordcounter.net to check your word count.\n-  Deadline: 11:59 PM EST next Thursday\n-  No stories that have been written for another prompt or feature here on WP—please note after consultation with some of our delightful writers, new serials are now welcomed here \n-  No previously written content\n-  Any stories not meeting these rules will be disqualified from rankings\n-  Does your story not fit the Fun Trope Friday rules? You can post your story as a [PI] with your work when the FTF post is 3 days old!\n-  Vote to help your favorites rise to the top of the ranks (DM me at katpoker666 on Discord or Reddit)!\n\n\u0026amp;nbsp;\n***\n\nThanks for joining in the fun!\n\n***",
 "created_utc": 1690573348,
 "permalink": "/r/WritingPrompts/comments/15c73tr/ot_fun_trope_friday_writing_with_tropes/",
 "score": 4,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15c73tr/ot_fun_trope_friday_writing_with_tropes/",
 "comments": []
}