{
 "submission_id": "15cb4pe",
 "title": "[WP] Everyone has sleep debt, some more than others. But now the banker is coming to collect.",
 "selftext": "",
 "created_utc": 1690583045,
 "permalink": "/r/WritingPrompts/comments/15cb4pe/wp_everyone_has_sleep_debt_some_more_than_others/",
 "score": 93,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cb4pe/wp_everyone_has_sleep_debt_some_more_than_others/",
 "comments": [
  {
   "comment_id": "jtv759a",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690583045,
   "score": 1,
   "submission_id": "15cb4pe"
  },
  {
   "comment_id": "jtvqis6",
   "message": "\"Fuck you, you can't repossess my waking hours!\" An angry, wobbly man in a disheveled suit belowed' \"I need them to-\"\n\nAnd he was asleep. The target of his deprived rant already walking back out the door, locking it behind it. As it walked out, It slipped something not quite a shadow and not quite a mist into Its briefcase before latching it tightly. \n\nThe brief case holder calmly walked to the next apartment, knocking politely on the door. A woman quickly opened it, a small smile of greeting on her face, \"Oh, hello. How can I-\"\n\nThe smile slid off her face and she opened the door the rest of the way, stepping inside and allowing It inside. It wordlessly stepped in, polished black shoes clicking smartly on the floor. It sat at the diner table and set its briefcase infront of It.\n\n\"How- how can I help you...\" the woman trailed off, unsure how to refer to the finely dressed thing in front of her.\n\n\"Your sleep debt. It needs paid. I have come to collect,\" It said, the voice both a soft, high, whisper and a deep, rattling rumble at the same time. \n\nThe woman gulped nervously, \"How much debt do I owe?\"\n\n\"Seven hundred hours.\" It replied, no hesitation in Its voice. \"I expect payment in full.\"\n\n\"What?! But I need to be awake. Surely I can work out a payment plan of some kind,\" the woman cried, eyes wide.\n\nIt adjusted Its seat, before opening Its briefcase. It then reached towards her temple with Its other hand, the fingers slowly  stretching out, growing longer and longer until it made contact, \"I'm afraid the time for negotiations is over, Miss Madiline Park. The bank is repossessing all sleep debt, no exceptions.\"\n\nIt plucked up with Its impossibly long fingers, and the instantly snapped back to their normal length. Another of that strange not quite shadow, not quite mist material in Its hand, warbling softly and trying it escape. It placed it neatly in the black void inside the briefcase and stood. It calmly walked out of apartment and began to walk towards the next, for every second everybody's sleep debt grew larger, It must comeplete Its duties as Sleep Banker.",
   "created_utc": 1690591490,
   "score": 13,
   "submission_id": "15cb4pe"
  },
  {
   "comment_id": "jtvjasu",
   "message": "Our bodies are designed for sleep they say, at least that's what the books and scientists say. But throughout our entire lifetime we never had any problems not needing to fall asleep. Most people stay up for days, weeks ir even months at a time. What's the point of going to sleep when you can stay up playing video games or research a cure for a life ending disease.\n\nHowever, I'm not one of those people. I always stayed consistent with my bedtime, wake up at 12 and end my day at 12. Every day with no exceptions. Then there was a announcement on the news, well it was tooken over. They called themselves Sanyos, the debt sleep collector. She explained that everyone that took advantage of her blessing to stay awake will have to pay it back with interest.\n\nThe pastel purple skinned woman with curly white hair spoke, \"I say you pay it back...\" she giggled mischeviously, \"Right now!\"\n\nThat's when the great sleep or the great whatever you wanted to call it. The name is a work in progress.\n\n------\n\nreally scuffed story but Inhioenuou guys enjoyed, and sorry for improper format wanted to do it quick on mobile while I was on break!",
   "created_utc": 1690588225,
   "score": 6,
   "submission_id": "15cb4pe"
  },
  {
   "comment_id": "jtvbpjq",
   "message": "[Poem]\n\n*The Sandman Comes*\n\nWho's awake?    \nWho's asleep?    \nWho is the one the Sandman seeks?\n\nHe creeps along,    \nAlone at night,    \nLooking to find the ones in debt.\n\nNot debt of money,    \nNot debt of favours,    \nDebt of the bed is what he seeks.\n\nThe Sandman runs,    \nThe Sandman stalks,    \nThe Sandman will make his debt come due.\n\nAwake for little,    \nAwake for long,    \nThe Sandman cares not your reasons for.\n\nHis patience is gone,    \nHis forgiveness is spent,    \nHe comes for all in determined ascent.\n\nLay down your head,    \nShut your eyes,    \nPay off your debt,    \nFor the Sandman comes.",
   "created_utc": 1690584961,
   "score": 16,
   "submission_id": "15cb4pe"
  },
  {
   "comment_id": "jtwc07l",
   "message": "There’s a rickity old dock and it bobs up and down as the group walks down it. They pass the middle step and then they’re stepping down a walkway. A boardwalk on a beach. Then one of them’s heads expand, the others turn, a few jump back. The ones that are closer are sucked into the heaping mass of flesh.  \nSomewhere in the realword, the one we consider reality, someone wakes up. Vaguely recalling the notion of having been sucked towards something. It was an unpleasent dream they decide. Not knowing the details. They try to remeber but they can’t. A few minutes later an alarm clock goes off.  \nThe young man rolls over, crossing their single bed to hit snooze. He sighs, tired. Feeling like he needed another 3 or so hours to functions. He’d already gotten eight as it was. He couldn’t understand how so many people got by on so much less.   \nEventually he got up, sliping into the shower and then back to the room. Drying and dressing himself. He sent a mornful look at his Tv as he grabbed a granola bar from the tiny kitchen that was crammed into the shoebox apartment. He was so tired. He rubbed his eyes and tried to collect himself. He was an adult, and all the things he liked doing required money. He had to work to for that money.  \nHe parked his car at a lifeless office building about 30 mintues later. Forcefully closing the door behind him. He’d have slammed if if he were more awake.   \nHe eventually settled into a bland cubicle and went to work providing customerservice for comcast and other types of broadband. Over the course of half an hour and 140 minutes later he slowly dozed off. Slouching down onto his desk and laying his head down.   \nThe next thirty mintues were rather hectic. Of course all the young man remembered was falling blissfully unconcious. He was much more energized too, and couldn’t help the lazy grin that graced his face.  \nFor a second he recalled a crazy dimension hopping human blob which him and a team of sorts banded together to stop. But then the details faded away.",
   "created_utc": 1690602063,
   "score": 0,
   "submission_id": "15cb4pe"
  }
 ]
}