{
 "submission_id": "15ccjyl",
 "title": "[WP] \"The Hero always wins and the Villain always loses. That is their curse.\"",
 "selftext": "",
 "created_utc": 1690586619,
 "permalink": "/r/WritingPrompts/comments/15ccjyl/wp_the_hero_always_wins_and_the_villain_always/",
 "score": 10,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15ccjyl/wp_the_hero_always_wins_and_the_villain_always/",
 "comments": [
  {
   "comment_id": "jtvflqu",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690586619,
   "score": 1,
   "submission_id": "15ccjyl"
  },
  {
   "comment_id": "jtvmfht",
   "message": "The Fort shook, dust and debris falling from the ceiling. The walls of Lady Lilitu's laboratory were holding, as she desperately tried to gather her research notes, but she knew they wouldn't hold for long. Nearby, a man in a white lab coat was carefully packing vials of bubbling, noxious green ooze into a steel case. They exchanged a sad glance and a smile, before resuming their frantic packing. \n\nUpstairs, she could hear gunshots. Gunshots, followed by screams, as her security proved unable to stop whatever hero had invaded her sanctum. Then more gunshots from another wing of her home. Heroes, plural. \n\nShe grimaced, wondering why she had attracted the ire of the heroes league over a year after she had retired. No doubt crime was at a low, and some D-lister was desperate to get some coverage in tomorrow's tabloids. Ever since the great curse, even the lowest of heroes had been emboldened, so an attempt to capture the femme fatale behind the greatest heist of the last decade was perhaps an inevitability.\n\nJust as she finished packing the last of her notes, the room shook. Then time seemed to slow as the walls buckled, then detonated in a spectacular show of screeching metal and shattered concrete. \n\nInferno floated in, flames flooding off his deep red suit and covering the room as his cape whipped dramatically behind him. It was all Lilitu could do to withstand the supernatural heat with a hastily raised wall of force that buckled under the onslaught. Following him was  a hulking brute clad in emerald and black garb that barely contained his rippling muscles. Lilitu didn't know his name, but he reminded her of a gorilla on steroids.\n\n\"It's hopeless L,\" Inferno smiled, triumphant. \"You know the final spell the Great Sage cast: The heroes always win, the villains always lose. There is nothing you can do to change that. Now surrender!\" \n\nLilitu looked around the devastated laboratory. Her research was ruined, but there was worse to see. Her lab assistant, her husband, the man who had spent the last year desperately trying to research a cure for their son, was dead. His body was a charred remnant; his arms covering his face as he'd clearly attempted to shield himself from the heatwave. \n\nTears were streaming down her face as she stood, then prepared to fight, her voice barely above a whisper. \"That may be true, but you just murdered an innocent. Today, you are no hero.\"",
   "created_utc": 1690589621,
   "score": 1,
   "submission_id": "15ccjyl"
  }
 ]
}