{
 "submission_id": "15cc7e1",
 "title": "[WP] when you were just a kid, your father left the house to go get your birthday cake, only to never come back. Ten years later, you leave to go buy yourself a cake, only to see your father, wearing fantasy armor and covered in scars, was about to knock on your door.",
 "selftext": "",
 "created_utc": 1690585739,
 "permalink": "/r/WritingPrompts/comments/15cc7e1/wp_when_you_were_just_a_kid_your_father_left_the/",
 "score": 138,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cc7e1/wp_when_you_were_just_a_kid_your_father_left_the/",
 "comments": [
  {
   "comment_id": "jtvdjdr",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690585740,
   "score": 1,
   "submission_id": "15cc7e1"
  },
  {
   "comment_id": "jtvs0kp",
   "message": "I whistled as I tied my shoes. \n\nI wasn't *that* happy, but it seemed the thing to do. It was my birthday, after all. Even if no one gave a shit.\n\nTo be fair, it was entirely possible that no one even knew I turned 28 today. I wasn't what you'd call gregarious. People were mostly garbage, so why bother? My own dad had abandoned me the second I was of age.\n\nNo reason why I couldn't celebrate myself, though. Self-care, right? So I whistled the birthday ditty as I yanked my shoelaces into bows and considered whether I wanted chocolate or vanilla frosting on the cake I was about to buy myself. 28 years is a long while to persevere in an ugly world alone. I deserved a reward. \n\nI wondered if I could fit 28 candles onto one confection without creating a fire hazard as I pulled open the front door.\n\nAnd that is when the lunatic on the front step punched me briskly in the forehead.\n\n\"Dude, what the f--\" I slapped one hand to my head and threw the other up defensively.\n\n\"Oh my God, I'm sorry!\" yelped the lunatic.\n\nHe was dressed in what looked like a bad medieval cosplay, ragged and dirty. An ugly scar seamed the two halves of his grimy face. Cradled in one burly, sunburnt arm was a battered cardboard box.\n\n\"I was trying to knock,\" he nervously explained.\n\n\"What for? I don't give to the Salvation Army or whatever, they're homophobic,\" I told him coldly.\n\n\"Are you gay?\" he asked with surprising interest.\n\n*\"I* don't know, weirdo,\" I replied. \"I'm trying to leave my home. Would you mind *stepping aside?\"*\n\n\"Yeah, sure,\" he mumbled, visibly crestfallen. He chewed his ragged, graying moustache. \"Um, uh...here.\" He shoved the battered box in my direction. \n\nI took it, mostly out of surprise.\n\n\"Happy birthday,\" said the lunatic, beginning to turn away.\n\n\"Thanks,\" I said, breezing past. Then I turned to look sharply at the lunatic. *How did he know it was my birthday?*\n\nSomething about him seemed awfully familiar. \n\nThe lunatic looked at the ground. The asymmetrical furrow in his brow was the same shape as mine.\n\nSlowly, I opened the box. \n\nInside, there was a cake. It was a little dented. Melting slightly in the heat, the piped frosting read, \"Happy 18th Birthday, Son.\"\n\nI remembered a time-blurred figure, walking out the door ten years ago.\n\n\"Dad?\"\n\nHis face turned toward me, eyes aglow.\n\nI punched *him* in the forehead.\n\n\"I'M TWENTY FREAKING EIGHT! WHERE HAVE YOU BEEN?\"\n\n\"About that. I can explain,\" he said sheepishly.\n\nI took a second look at the bizarre armor. The scars. The sunburn.\n\n\"This better be good,\" I warned, but I accepted the birthday hug.",
   "created_utc": 1690592174,
   "score": 83,
   "submission_id": "15cc7e1"
  }
 ]
}