{
 "submission_id": "15cdqub",
 "title": "[WP] Many years ago, the crown prince disappeared. When he returned, he came with a bride, although he never spoke of how they met or why he disappeared. Today, a talking toad has come to the castle to demand what they claim is their birthright.",
 "selftext": "",
 "created_utc": 1690589789,
 "permalink": "/r/WritingPrompts/comments/15cdqub/wp_many_years_ago_the_crown_prince_disappeared/",
 "score": 54,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cdqub/wp_many_years_ago_the_crown_prince_disappeared/",
 "comments": [
  {
   "comment_id": "jtvmt1y",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690589789,
   "score": 1,
   "submission_id": "15cdqub"
  },
  {
   "comment_id": "jtvxnf5",
   "message": "“They’ll never believe it.” Rulien sighed as he looked to the toad in the passenger seat of his wagon. “They’ll think I’m a wink away from insanity.” Scowling out of his window at the slow-moving scenery beyond, he mulled over his life’s direction.\n\n“Nonsense!” The toad spoke! Perfectly clearly. “As soon as my mother hears my voice she will know who I am.” His tiny front left leg kicked up to rub his eye so naturally. “You did.” There was a familiar sideways glance as the toad’s face turned to the opposite direction.\n\n“I suppose… this dream has not crumpled alas, so I must be stuck in some sort of sleeping paralysis because this is lunacy!” A shake of his head in frustration. “You’ve been gone for almost two decades… yet, you haven’t. You’re already King… with an heir.” The madness of the moment kept him reeling.\n\n“Bah!” The toad barked out with husky disgust. “That son of a snake will rue the day he decided to steal my life! I am the one and only Crown Prince Evering! Their only mistake was allowing me to be able to talk… and I guess not simply killing me.” He grumbled tiredly.\n\n“Indeed.” Rulien looked to the toad again, as full of disbelief as the first day he had found the prince in that horrendously dangerous marsh. “If it wasn’t for the former Queen's suspicions, I would not have been in that region.” He said simply. “However, she’s hardly going to believe what’s happened.” There was hardly even a way to explain what happened outside of mentioning magick.\n\n“A mother always knows her child.” Evering’s voice was sad, a moment of silence filled the wagon as it tottered along. “At least I made it home before she died.” It would still be half a day before they arrived to the castle walls, and already they had been on their way home for nearly a fortnight.\n\n“Had you not told me you were going to Werchenist, there would have been no way of knowing where to begin our search.” Rulien yawned, the sun had dipped below the horizon, and night had enveloped the onwardly winding way. It wouldn’t be long.\n\nDawn would come soon, and soon the region as a whole would be reeling… or rebelling.",
   "created_utc": 1690594854,
   "score": 1,
   "submission_id": "15cdqub"
  }
 ]
}