{
 "submission_id": "15ci76x",
 "title": "[WP] Since time immemorial humans have referred to their navels as “belly buttons,” but little did we know that every time we poked them they behaved as multidimensional doomsday buttons! Now beings from other dimensions have shown up to keep us from doing it again BY ANY MEANS NECESSARY.",
 "selftext": "",
 "created_utc": 1690602949,
 "permalink": "/r/WritingPrompts/comments/15ci76x/wp_since_time_immemorial_humans_have_referred_to/",
 "score": 157,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15ci76x/wp_since_time_immemorial_humans_have_referred_to/",
 "comments": [
  {
   "comment_id": "jtwdnxm",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690602950,
   "score": 1,
   "submission_id": "15ci76x"
  },
  {
   "comment_id": "jtxdjw8",
   "message": "\"They are necessary, every time you boop the button a reality is smothered\" said Marvin.\n\nI rolled my eyes, not that I expected it to notice, the Keplers were presumably intelligent, they just didn't always come across that way. \n\nI held up my hands shaking them at the spheroid floating opposite me at the kitchen table \"I understand that. I understood when you told me yesterday, same as the time before that. It still doesn't answer how you want me to eat my cereal wearing boxing gloves.\"\n\nI once more picked up the spoon with my mouth and stuck it into my boxing glove. Reaching out slowly I dipped the spoon in the milk, being careful not to submerge my glove in the process. Slowly, carefully I scooped up some cereal, bringing it towards my mouth.\n\nCLANG\n\n\"God damnit! How do you expect us to function like this? We don't all get our nutritional requirements from the sun\"\n\n\"Your nutritional requirements can be met with a liquid supplement should this prove easier. You continue to remain an anomaly with your insistence on feeding yourself in such a primitive manner.\" Replied Marvin\n\nThis had been going on for months and truth be told I was getting a little bit frustrated. The cereal was a challenge, yes, but have you ever tried eating a steak like this?\n\n\"So I've been told, but I still have yet to see anything that proves your bellybutton nonsense\"\n\n\"They are necessary, every time you boop the button a reality is smothered\" replied Marvin.\n\n\"Alright marv look, I don't care anymore. I'm taking these damn gloves off and making myself a proper breakfast\"\n\n\"They are\"\n\n\"Ya ya, necessary, you said this already\" I interjected, waving a gloved hand at him. \"Right, well I'm stuffed, if you'll excuse me I need to make a deposit at the porcelain depository\".\n\nI got up making my way to the washroom. \"Don't follow me in this time, I've got the bidet figured out thanks\"\n\nSitting down and getting comfortable I began inspecting those damned gloves again. \"How do I get just a finger out, I am so god damned itchy\". Weeks ago I had originally tried pulling them off but something kept them from releasing my skin. I began biting into the leather of the glove, it was tough and unyielding at first, but days using my bathroom breaks to chew in the same spot had yielded some progress.\n\n\"Pfft\" I spat, emptying my mouth of the gloves padding. I was finally making some decent progress and could almost see a finger. There! Freedom, my index finger poked through the hole I had been working on for so long.\n\nReaching up, I scratched at the tip of my nose \"thank god, finally! That had been bothering me for weeks. I really need to come up with a better way to handle this, not that I'd need to if it weren't for that fat floating foul fuck. As if simply poking my belly button would cause any harm\".\n\nI looked down at my stomach. \"Screw him, imma poke it and when nothing happens I'll finally be able to take these damn things off and get a moment's peace\". Reaching to my belly button I yelled through the doorway \"I told you nothing bad would happen if I touched my damn stomach, now I'm gonna pr-\".\n\n\nedit: just realised my italics didn't come across for internal thoughts. Sorry about that.",
   "created_utc": 1690628781,
   "score": 7,
   "submission_id": "15ci76x"
  }
 ]
}