{
 "submission_id": "15cjkfx",
 "title": "[WP] You're a superhero in a popular television show. The network executives just demanded drastic changes to the show to improve demographic appeal.",
 "selftext": "",
 "created_utc": 1690607425,
 "permalink": "/r/WritingPrompts/comments/15cjkfx/wp_youre_a_superhero_in_a_popular_television_show/",
 "score": 14,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cjkfx/wp_youre_a_superhero_in_a_popular_television_show/",
 "comments": [
  {
   "comment_id": "jtwle0f",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690607426,
   "score": 1,
   "submission_id": "15cjkfx"
  },
  {
   "comment_id": "jtxacaz",
   "message": "A caped silhouette of a man stood on the edge of a rooftop on an abandoned and dilapidated hotel at night. A SuperYou corporation advertising blimp shined a light in his general area revealing a young man wearing a bloodied red, yellow, and blue superhero costume staring at the city below clutching with his gloveless right hand a faded and crumpled photo of himself signed with a childish scribble of the names “Simon” and “Ultra-shot,” and clutching with his left hand a shiny black and chrome walkie-talkie with a scratched out bullet emblem. A staticky voice speaks on his walkie talkie saying \r  \n\r  \n“It would be good for the people, this change in your character presentation is… well it’s necessary to appeal to a larger demographic! You’ve been wearing that old suit for 3 years now and your performance has been falling flat! Do you need me to remind you of the most basic things? You come back to the studio right this moment or we will revoke your contract! At this rate your ratings will drop lower than Agent knight–”\r  \n\r  \nHe turns off his walkie-talkie. With his eagle-eyed vision he stares blindly at all the various crimes down below in the neon lit city and turns around, letting a portion of his heels go over the edge as he starts to look up to the monolithically tall SuperYou corporation tower. As the light of the advertising blimp faded away from him, he stood under the shadow of the building to shed a single tear that he went to wipe using the old photo. He began clasp his hand tighter and tighter, pushing the photo onto his skin as his nails sunk into his cheek. \r  \n\r  \n“I was all a lie... All of them died. I am sorry.” \r  \n\r  \nHe took two steps away from the edge of the building and threw his walkie-talkie away, ripped off his cape and dropped it off the building. He stared at the tower with blood starting to pour down his cheek as he clasped harder and harder, his fingers began to sink into his face as he screamed louder and louder. Strange thin black shadowy veins began to emerge from the blood, wrapping his face as his tears began to float, as skin began to tear off his cheek and form into small metal bullets that floated and pointed around his skull like a halo. The shadowy veins spread down his neck, all the way to his feet and into the rooftop of the hotel as chunks of wood, concrete, and bricks all began to rip into pieces and spark with black shadowy lightning to form hundreds of bullets. The sound of the hotel breaking into pieces and now thousands of metallic clanks began to alert the sleepy neighborhood of this incident. Soon the SuperYou blimp returned to the site, aiming all its lights at him, momentarily making him lose focus as some of the bullets began to fall. A single name echoed from him as thousands of bullets fired at the tower, many of which hitting the blimp.  \r  \n\r  \n“SIMON!!!”\r  \n\r  \nTime slowed down and hundreds of bullets started to press against his scarred head as he fell off the hotel. The hotel collapsed with him, but instead of dying the man found himself floating in a dark liquid. Something grabbed his arm and pulled him out of this puddle. The man stared at the masked figure, even with his vision clouded he could tell who had just rescued him due to his signature gray and white hockey mask with black liquid oozing out of it and the ripped black trench coat and he asked\r  \n\r  \n“Why? Why won’t you just let me die Grayman?…”\r  \n\r  \n“Because you haven’t even begun to live Ultra-shot. But from this day on, you are a free man. I did not want you to die, I only wanted you to be reborn” says the man in the gray hockey mask as he starts to bandage Ultra-shot’s face and inspect his various wounds. \r  \n\r  \n“Reborn?” asks Ultra-shot as he slowly wipes his eyes and painfully looks around the area seeing the dark puddle he came out of and observing the abandoned subway station they are in that is lit up by the dim rays of light coming from the small hole he fell through that is partially covered by the debris of the hotel. \r  \n\r  \n“How can you say that when my life has just ended. With this stunt I pulled off.. they will revoke my contract… They will do what they’ve done to all of them and spin some tale to bury me dead.. Ha.. go figure, all my life for them just for me to be thrown away like trash.. I have no power.. They taught me that, and you– you showed me that… my mother, all of them, and Simon.. Poor Simon.. Even if I do somehow survive this, they will hunt me down and kill me later– aw shit my costume is all messed up. Your power is disgusting you know that” whispers Ultra-shot as he looks up at the hole he fell through \r  \n\r  \n“Power is not given to those worthy, it is stolen by those willing. You always had power in you Ultra-shot, but you just gave it all away to them, don’t make that same mistake now.”\r  \n\r  \n“You think I had a choice?... They recruited me when I was six.. And raised me to be their perfect soldier, their fucking poster boy..”\r  \n\r  \n“You do have a choice now. You can either go back to them and die a coward, or come with me and die trying to stop them.”\r  \n\r  \n“And how are we going to fucking stop them? Just the two of us really? You are damn delusional! I mean even right now, if they find us… we. are. Dead!” angrily whispers Ultra-shot  as he winces in pain and tries to sit up.\r  \n\r  \n “You gonna show me that I was responsible for my mother’s death? That everything I’ve done was all a lie– that all those crimes I ‘stopped’ were just facades setup by them? I am done..” says Ultra-shot as he takes a deep breath and closes his eyes. \r  \n\r  \nGrayman re-adjusts his mask and says “What if I tell you that Simon is still alive and he might hold the keys to stopping them?”\r  \n\r  \nUltra-shot leans over to the side as he clenches his fist and bites his lip and pushes himself up from the ground to face Grayman and speak at the level of his face.",
   "created_utc": 1690626420,
   "score": 1,
   "submission_id": "15cjkfx"
  }
 ]
}