{
 "submission_id": "15clfkf",
 "title": "[WP] You are The Immortal. Every civilization has their great gods, and once every thousand years or so, you come up with a new story and fake friends to convince an eras worth of people you are their gods. Now that humanity has conquered the stars, they’ve caught on to your game.",
 "selftext": "",
 "created_utc": 1690613950,
 "permalink": "/r/WritingPrompts/comments/15clfkf/wp_you_are_the_immortal_every_civilization_has/",
 "score": 54,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15clfkf/wp_you_are_the_immortal_every_civilization_has/",
 "comments": [
  {
   "comment_id": "jtwutgb",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690613950,
   "score": 1,
   "submission_id": "15clfkf"
  },
  {
   "comment_id": "jtwzjgg",
   "message": "She's angry. \r  \n\r  \nI don't blame her. I'd be angry, too. Looking back on all of it, I'll admit that I made mistakes. In the beginning, the smallest things get ignored. You don't see the ripple effect. You can't fathom how one little lie will grow and grow until it's beyond your ability to contain it. \r  \n\r  \nBack then I thought, *I have all the time in the world to fix this.*\r  \n\r  \n100,000 years into things I thought, *it's not that big of a deal. They don't understand; they're such simple creatures. I know better.*\r  \n\r  \n3,000 years ago, I just didn't know how to change it all. I didn't know how to be anything else. \r  \n\r  \nIt's a lot of history to explain to someone, and she doesn't care to hear it. She's found me. Soon the rest of her species will descend upon me like a swarm. They're human now. I wonder what they'll be when I die. \r  \n\r  \nShe screams, \"you're not a god. You're not holy. You're not divine.\" \r  \n\r  \nI deserve the screams. I deserve the hatred. She's taking off the helmet from a space suit her people have been perfecting for a thousand years. They finally made one good enough to reach me. \r  \n\r  \n\"You have twisted us into knots,\" she says. \"You have played with us . . . toyed with us. Told us to sacrifice each other. Then kill each other. Then love each other. Made us believe in eternal suffering if we don't follow whims that change every time you put on a new face. The sun god? Zeus? Venus of Willendorf? Some shitty painting on a cave wall in who-knows-where? You pretended to be all of them. And we know it now.\" \r  \n\r  \nI should be ashamed. The problem is, she isn't saying anything I haven't tortured myself with since I was almost a child. I am *made* of shame. I am compromised, beyond measure, of guilt. I have no words suitable enough to say I'm sorry. \r  \n\r  \n\"You have pulled the strings of humanity for longer than we have record.\" \r  \n\r  \n\"Yes. I have.\" \r  \n\r  \n\"You tricked us.\" \r  \n\r  \n\"Yes. I did.\" \r  \n\r  \n\"You lied to us! Over and over again.\" She says it with tears in her eyes now. \r  \n\r  \n\"Countless times,\" I confess. \r  \n\r  \nShe stares at me. \"What. Are. You?\" \r  \n\r  \nWe gaze at each other for a long time. For having lived so long and having experienced so many lives, you'd think I'd be better with my words. \r  \n\r  \nShe repeats, \"What are you?!\" \r  \n\r  \n\"Lonely.\" \r  \n\r  \nAnd there it is. Out in the open. My deepest pain, that gnawing hole in the center of my soul - it's all hers to see now. \r  \n\r  \nShe is silent for a long time. The sound of our breath is the only thing that fills the air. Around her neck is a silver chain, and on the end of it is a cross. I remember the beginnings of that symbol. I also remember how that all went so wrong, too. \r  \n\r  \nIt's the cross that she picks up now, holding it between her index finger and thumb. And she trembles as she says, \"your words tell me to forgive you.\" \r  \n\r  \n\"I don't deserve that.\" \r  \n\r  \n\"Maybe not,\" she says. \"But . . . I forgive you anyway.\" \r  \n\r  \nThey aren't words I expect. When she yanks the necklace from her body, she throws it on the ground between us both. And as she walks away, I can see that she is made of better things than I ever pretended to be.",
   "created_utc": 1690617638,
   "score": 17,
   "submission_id": "15clfkf"
  },
  {
   "comment_id": "jtxf0ay",
   "message": "1969, New York City.\n\n“It’s been hard. Not just this year, it’s been hard for a while now- I’ve taken blows before. As Zeus I was able to tell them I created lightning. They figured out it was just electrostatic discharges. In Egypt I told them I brought the sun- now they know it’s just a burning ball of gas… but the thing is with those I was already long gone- I established my canon and moved on- sometimes I would return later, just to see how things turned out, and after long enough I faded out or they collapsed themselves. Let me tell you though, when I went to Rome for the first time- that was great. They conquered everything and yet plagiarized me completely- I could start off right where I left- they extended it years. But things might be breaking down far enough- people have no want for a god anymore.”\n\n“So wait…” He said, “you created every religion?” \n\n“Not all of them- just the interesting ones. And technically I’m only immortal- I couldn’t travel the whole earth- the Mayans and Aztecs- they came up with that themselves. Pretty close to what I was going for- most of them have been lost to time, the ones you know are called myth. None of the big ones you’ve probably heard today were me- some of those are so boring, it’s like- if you’re gonna believe in something, believe in something cool, you jive?”\n\n“Ah. So therein lies the rub. Everyone either believes there’s no god or already believe in a different one too strongly to ever believe you.”\n\n“Half-right.” I told him, “you’re right about this: in order to become a god, someone must want a god- or fear you enough to believe you are one. That’s just common sense- and yes, that is my problem- and why I’m still scraping for a win since Scientology didn’t pan out as well as I’d hoped.”\n\n“But you said I was wrong about something?”\n\n“You’re wrong about people not believing in a god- they have their gods- they still have their gods. And that’s what I’ll do next- I’ll become those gods.”\n\n“What are you talking about?”\n\n“You know good well what I’m talking about- sex, drugs, pleasure in general. That’s what you’re here for- I need to build a pantheon.”\n\n“You’re more talking about a crime ring than becoming gods…”\n\n“It doesn’t matter, does it? I started this because it was a way to survive, no- live. Live the best I possibly could, with people begging me and offering me anything because I was their lifeline- they thought I was responsible for giving them their life. But then, it became a game- make it entertaining to myself, see how far I can go… how much incest can I make a part of the canon before the Greeks stop respecting what I’ve built? Whatever- childish, I’m sure you think- and you’re right. I’ve outgrown it. I want that rush back again. The rush of dependence- and that’s what I’ll get- it doesn’t need to be a large amount, but people will rely on me as they descend further and further into a spiral- because they’ll need me- because everyone needs something to fill them, and even though nothing I do will EVER truly satisfy, they’ll have no other choice… because they refuse to get it from a god.”",
   "created_utc": 1690629741,
   "score": 9,
   "submission_id": "15clfkf"
  },
  {
   "comment_id": "jtxnv9d",
   "message": "\" They're here.\" \n\nThe sky dark, dusted with motes of pink and violet lay aflame with the bright flare of the  far ship breaking into the atmosphere, a flaming machine of action... of vengeance, tearing it's path groundward. Low over the hills it flashed with the brilliance of a thousand stars.\n\nFor a moment the air was silent, all except the lonesome wind that howled softly over the high plateau, the soft murmur of my breathing eternal, the rattle of scree tumbling out of sight.\n\nThen it came. A snarling thunderous roar that rumbled the earth and me to my core... a questioning was coming.\n\nWould I answer?\n\nGliding softly, I descended my mount of olives. My mount Olympus. Me. My cloak of starthread undulating softly as my feet grounded on solid terram.\n\nThe crash site lay steeped in a thin smoke. A display of mechanical fury, the bright curve of metal melded deep to the chocolate soil, great heaps of scorched ground pillared into haphazard sentries, bodies strewn at awkward angles, charred and smouldering. The scent of the dead and of the richness of this dying planet ensnaring the senses.\n\nYet not all had journeyed beyond.\n\n\" Ego tu Deus!\" I called proudly. Coldly. The men scrambled back abandoning the wounded who writhed and cried at my approach and as I swept past them, clutching the hem of my robes.\n\n\" I am that I am\" I answered my voice as fury-driven as their engine of destruction.\n\n\" You.\" \n\nThat voice was tired and hard. \n\nI had seen a thousand planets. Twenty thousand moons. A million people's. Still there it was, burning hotly upon his sweaty, awe-struck face. \n\nThe universal expression of revenge.\n\nHis hand snapped up, the dark bore of a plaster pistol glimmering deadly-like. Without a second of hesitation, the flashing beam of plasma struck me all the way through.\n\n\" I do not die as a mere mortal man does... \" I hissed striding solidly toward the aggressor. Towards my cringing subject. The strings of flesh pulsing in my wound, a speck of sky peeking from that gore-lined window.\n\n A window to a soulless man.\n\n\" How? You are not divine, cannot be, How!... H-\" His eye's widened in their terror, mouth flapping like some common carp, eye's darting looking for an escape from my fury. Finding none.\n\n\" I have lived for fourty four deco-tides, seen all, experienced all, gained all... I am closer to a god than any other man or beast!\"\n\nI swept around to the blast debris. Searchinh, for his men had not all died.\n\n\" I suggest your people come from their hidden places, lest I destroy them... \n\nAnd you\"\n\nMy final words brought the well-timed break of thunder, the brief slash of lightning illuminating each of them as they stepped fearfully from cover.\n\n\" I know you shall not be satisfied till you have exacted revenge thus...\n\nI challenge you all to combat, not with I but with your mind\" \n\nwith my words final and complete. I raised my arm's tilted my head skyward, the first flecks of rain cooling my inner fire, shutting the twittering of Fauna, the thrum of life from hidden flora. Focusing.\nComplete.\n\nI fixed my gaze on the boldest.\n\nAt once his arm began to jitter, prickling as it jerked the pistol to his head, his fingers fluttering trying to escape. \n\nMy will. \n\nYet with one final convulsion, a last face of knowing terror, the barrel flashed red and death joined us there.\n\nI cast my terrible way to the rest, as under the haze of the slashing rain they had begun to run.\n\nNo matter. In the end I would prevail as I had since time long ago.",
   "created_utc": 1690634246,
   "score": 4,
   "submission_id": "15clfkf"
  }
 ]
}