{
 "submission_id": "15cm2ti",
 "title": "[WP] First Contact with aliens is achieved, but when we see them, they look exactly like us in every way.",
 "selftext": "",
 "created_utc": 1690616198,
 "permalink": "/r/WritingPrompts/comments/15cm2ti/wp_first_contact_with_aliens_is_achieved_but_when/",
 "score": 10,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cm2ti/wp_first_contact_with_aliens_is_achieved_but_when/",
 "comments": [
  {
   "comment_id": "jtwxpjw",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690616198,
   "score": 1,
   "submission_id": "15cm2ti"
  },
  {
   "comment_id": "jtx3o1z",
   "message": "As the appointed hour approached, excitement and dread crept through the assembled delegates. Today was the day: the first contact with beings from beyond our world. What wonders would they reveal? What perils might they bring?\n\nA hush fell over the room as the alien envoys entered, each footstep echoing like the tolling of some celestial clock. Time itself seemed to stand still as all eyes fell upon the newcomers. Murmurs rippled through the stunned crowd, for these were no bug-eyed monsters or tentacled oddities from the stars. No, the historic moment found us gazing upon our own reflections, for the visitors looked just like us...\n\nTheir human forms were but masks concealing unknowable secrets from beyond the void, ambassadors from realms past imagining. As they greeted us with familiar smiles and outstretched hands, I shivered, wondering if their innermost thoughts were as like to ours as their outward appearances.\n\n\"Greetings, friends,\" said their leader in perfect English. \"We come in peace from the planet Zargon. Let us forge a new era of trust and cooperation between our peoples.\"\n\nOur ambassador stepped forward hesitantly. \"You honor us with your visit,\" she began. \"I'm quite surprised, though; we didn't expect you to appear so...similar to us.\"\n\nThe Zargonian smiled. \"Nor did we expect such resemblance to you. But though we may look alike, much yet separates us. In time, we have much to learn from each other...\"\n\nAs the envoys exchanged polite greetings, I continued to wonder: were these beings truly like us at heart? Or did their familiar faces conceal minds utterly alien? Humanity stood on the brink of a new age: wonders... or terrors? The future remained unwritten.",
   "created_utc": 1690620993,
   "score": 1,
   "submission_id": "15cm2ti"
  }
 ]
}