{
 "submission_id": "15cm4uu",
 "title": "[WP] Humans are 1000x more sensitive to the smell of petrichor (that smell you get with rain) than sharks are to blood, to no apparent evolutionary advantage. You're privileged to be a part of the first welcoming committee to meet our new Non-Human arrivals in person. They smell like petrichor.",
 "selftext": "",
 "created_utc": 1690616416,
 "permalink": "/r/WritingPrompts/comments/15cm4uu/wp_humans_are_1000x_more_sensitive_to_the_smell/",
 "score": 164,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cm4uu/wp_humans_are_1000x_more_sensitive_to_the_smell/",
 "comments": [
  {
   "comment_id": "jtwxzjg",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690616416,
   "score": 1,
   "submission_id": "15cm4uu"
  },
  {
   "comment_id": "jtx9o0r",
   "message": "Maya hops excitedly from foot to foot, much to the annoyance of the team of scientists watching her.\n\n\"Please calm yourself, miss Vance. Your elevated heart rate will lead to skewed results.\" The loudspeaker pops when the connection to the watch chamber drops. They have so much new technology, yet a decent pa system on a spaceship shared with another race is too large an investment. \n\nMaya takes a deep breath and attempts to calm herself down. It's hard. Who wouldn't be nervous in her position? She's going to be the first human to ever face an alien without some kind of barrier between them. They've been talking to the Levinan for years already, but this is the first time they'll be able to shake hands with them, skin to skin. \n\nAnd Maya was chosen for this honour. She's just the right combination of expendable and educated to qualify. Not to mention the fact that her mother is one of the lead scientists in the biology department. That's probably the biggest reason Maya got the job, but she likes to think she has other qualities too. \n\n\"That's better. Prepare for first contact in five - four - three - two -\" the speaker cuts out before the one, and then the door slides open. \n\nIt opens into a white room filled with a table, two chairs and two large windows on opposing sides of the room. Across the room, in a doorway that's a little bit taller than Maya's, stands Pjetr, her Levinan counterpart.\n\nHe's as tall as any other Levinan. Meaning he's three heads taller than Maya. He's wearing a similar medical jumpsuit as Maya, which looks just as tight and uncomfortable as Maya's suit feels. His pale grey skin reflects the light in a way that looks like glitter, and his large black eyes look like galaxies inside a head that's too small for them. \n\nHe smiles and waves a four-fingered hand at Maya. Maya grins back and enters the room. The door slides closed behind her without a sound. Of course the people in charge made that piece of equipment work right.\n\nMaya sticks out her hand when she reaches the table, as the scientists behind her side's window planned.\n\n\"Hello Pjetr. Nice to finally meet you in the flesh!\" Pjetr approaches the table too, his smile widening into a toothless grin.\n\n\"Likewize!\" All Levinan have the same lisp. Pjetr takes her hand in his, his skin cool and overly smooth to the touch. \n\nEvery movement he makes is accompanied with a whiff of a fresh scent. Maya cocks her head and inhales deeply. What is that scent?\n\n\"Zjall we zit?\" Maya nods, and sits on her chair. The smell is sooo familiar, and it becomes stronger the longer she can smell it. She just can't remember what it is. Maybe Pjetr knows it.\n\n\"I don't want to be rude, but I'm directing a very distinctive scent. Is that something your people did?\"\n\nPjetr glances at the window on his side of the room. \"I didn't think humans would be susceptible to the smell.\"\n\n\"What smell?\" \n\nPjetr's eyes widen to a comical size as his head whips back to Maya. He starts cursing in Levinian - which Maya studied, so she knows exactly what he's saying. She ignores the cursing until he says 'This was a horrible idea.'\n\nExcept his mouth didn't move. Maya gasps, more of the smell entering her nose. He didn't speak out loud, and she heard him. Fuck. Pjetr looks taken aback at her thought.\n\n'Shit. You can hear me too?' \n\n'This is not supposed to happen.' That thought was focused on her, because one, it was in English, and two, the thoughts that come after sound muted somehow.\n\n'All of our testing said the humans were psychically deaf. How is she tuning into our frequency? Do you think she's influenced by fresh Miasma?' Maya carefully doesn't think at them. Given that Pjetr isn't looking at her all surprised, it's working. \n\n'We sent samples of Miasma to their scientists. Both of our tests showed no interaction between our Miasma and their DNA.' That thought came from behind their window. How rude. They can communicate without humans overhearing but they can't do the same!\n\nPjetr's eyes snap towards her again, eyes narrowed. What feels like a fog descends over Maya's mind. Her thoughts slow, she can't hear their conversation anymore, and the smell intensifies. \n\n\"Petrichor.\" Her mind clears as she remembers where she smelled this before. It's the smell that comes with rain. The idea of rain clears up the fog, and she can see everything crystal clear. She can see the connection between Pjetr and his colleagues as a physical thing. She can see herself connecting with him too. The tiniest of threads reach from Maya to her own. Team, but they don't connect to anything. \n\nShe's sure that means something, but the moment of clarity disappears. The lights dim, the scent dims, and the floor moves up. The last thing Maya remembers before her head smacks into the floor is Pjetr's horrified look.",
   "created_utc": 1690625910,
   "score": 1,
   "submission_id": "15cm4uu"
  }
 ]
}