{
 "submission_id": "15cmtww",
 "title": "[WP] Lunch with a billionaire.",
 "selftext": "",
 "created_utc": 1690618912,
 "permalink": "/r/WritingPrompts/comments/15cmtww/wp_lunch_with_a_billionaire/",
 "score": 13,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cmtww/wp_lunch_with_a_billionaire/",
 "comments": [
  {
   "comment_id": "jtx14oi",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690618913,
   "score": 1,
   "submission_id": "15cmtww"
  },
  {
   "comment_id": "jtx1tq9",
   "message": "\"So I told, Diedre,\" the man in front of me droned on for the twentieth time in as many minutes. \"I told her that we just couldn't pay for those taxes. After all, how were we to afford to stay in the market - well, of course she saw reason and that's why we're exempt.\"\n\nHe cut through his steak with swift, practised strokes - a smug look on his face as he launched into yet another story of avoiding paying taxes.\n\nFinally, finally, he reached for his glass and took a healthy drink of the murky concoction he'd selected from the menu.\n\nFifteen seconds was all it took before he clutched his throat and slumped forwards.\n\n\"Thank fuck for that.\" I said to myself as I stood, pushed my chair in and walked away. The waiter looked over at me, askance.\n\n\"Oh, don't mind him - he just can't take his drink.\"",
   "created_utc": 1690619473,
   "score": 4,
   "submission_id": "15cmtww"
  },
  {
   "comment_id": "jtxg190",
   "message": "As I puncture the lid of our last can of tuna, the high pressure inside our tin can of a tomb rushes through, giving a fizzling cry like the pop of a soda tab. The can inflates a slight amount, back to its factory form. I can't help thinking of the contamination by the odors that hang in this air, sucked down into the shreds of fish, injecting little pockets of our own stink into our last shared meal.\n\nI say our last *shared* meal because I am not so naive to believe that this rat-faced personification of greed will actually hold to our oath. He will not hesitate, as soon as my strength leaves me, to cannibalize what little nutritional value I still carry.\n\nThe self-described innovative genius shoves his brown-stained fingers right into the tuna and begins picking out the best chunks to stuff into his cheeks. At somewhere between 8,000 and 9,000 feet below the surface, we may be near death, but I have not forsaken myself to such depths as to forgo self respect. So I wipe off the spoon end of my make-shift utensil, the shard of molded plastic that used to be the outer shell of the billionaire's Bluetooth controller.\n\nSo stupid.\n\nSo unreasonably and excessively cost-saving, as if all the money of this voyage would be wasted on a keyboard.\n\nHe's taken more than half the tuna. I pull the can away from his pinching fingers and whisper, \"Enough.\"\n\n\"But I left you all the juices,\" he wheezes before falling into a coughing fit.\n\n\"You can have the juices,\" I tell him. Not like I'm all that thirsty anyway for the tea of his nose-pickings and fecal grains stewed in tuna brine.\n\nThe billionaire rolls back on his feet and crouch-waddles backwards to the other end of this narrow hull. He's a primitive beast. Bits of fish stick to the stubble on his pointed chin. His sleepless eyes shine red in the dim light, both suffering from popped blood vessels, probably due to the pressure changes in the infrequent upward lurches as his *fail-safes* fail to save us.\n\nI wonder if I look the same. I hope I'm not so terrifying, but this man is as close to an insect as they come, so maybe he's as frightened of me as I am of him.\n\n\"You're disgusting, you know that?\" He hugs his knees and falls back into the curve of the yawning walls. \"I can't believe you can stomach that crap. We could die at any moment and here you are dining on a fish that's probably been canned longer than you've been alive. You rolling around in your own filth, sweating through your clothes, getting all crusty around your lips...\"\n\nThis behavior has become expected whenever I cut him off from our shared meals. The projection probably stems from some food insecurity he suffered as a child, combined with the bullying of an older sibling, or possibly a parent, I don't know, and I've stopped caring enough to bother asking. I just ignore the rant and then pass him the can of grey water when I'm done eating.\n\nHe snatches it from my hand and slurps the brine down like mother's milk. The last of it drips down his chin and falls to the cracks between his bare toes. When he's done, he throws the empty can back at me.\n\nI catch it, and because I have nothing left, I rub a finger around the inside of the can for a while, feeling the smooth damp surface, free from that suffocating, sweaty meat that it held for who knows how long. I look around the curved walls of our metal hull and rub my palm against the surface. I can't describe the difference, but the sensation of the metal's finish seems to feel somehow even cheaper than that of the inside of this tuna can.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThanks for reading! Find more at r/FarFetchedFiction",
   "created_utc": 1690630350,
   "score": 4,
   "submission_id": "15cmtww"
  }
 ]
}