{
 "submission_id": "15cm4uu",
 "title": "[WP] Humans are 1000x more sensitive to the smell of petrichor (that smell you get with rain) than sharks are to blood, to no apparent evolutionary advantage. You're privileged to be a part of the first welcoming committee to meet our new Non-Human arrivals in person. They smell like petrichor.",
 "selftext": "",
 "created_utc": 1690616416,
 "permalink": "/r/WritingPrompts/comments/15cm4uu/wp_humans_are_1000x_more_sensitive_to_the_smell/",
 "score": 75,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cm4uu/wp_humans_are_1000x_more_sensitive_to_the_smell/",
 "comments": [
  {
   "comment_id": "jtwxzjg",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690616416,
   "score": 1,
   "submission_id": "15cm4uu"
  },
  {
   "comment_id": "jtx9o0r",
   "message": "Part 1 \n\n\\----\n\nMaya hops excitedly from foot to foot, much to the annoyance of the team of scientists watching her.\n\n\"Please  calm yourself, miss Vance. Your elevated heart rate will lead to skewed results.\" The loudspeaker pops when the connection to the watch chamber drops. They have so much new technology, yet a decent pa system on a spaceship shared with another race is too large an investment.\n\nMaya takes a deep breath and attempts to calm herself down. It's hard. Who wouldn't be nervous in her position? She's going to be the first human to ever face an alien without some kind of barrier between them. They've been talking to the Levinan for years already, but this is the first time they'll be able to shake hands with them, skin to skin.\n\nAnd Maya was chosen for this honour. She's just the right combination of expendable and educated to qualify. Not to mention the fact that her mother is one of the lead scientists in the biology department. That's probably the biggest reason Maya got the job, but she likes to think she has other qualities too.\n\n\"That's better. Prepare for first contact in five - four - three - two -\" the speaker cuts out before the one, and then the door slides open.\n\nIt opens into a white room filled with a table, two chairs and two large windows on opposing sides of the room. Across the room, in a doorway that's a little bit taller than Maya's, stands Pjetr, her Levinan counterpart.\n\nHe's as tall as any other Levinan. Meaning he's three heads taller than Maya. He's wearing a similar medical jumpsuit as Maya, which looks just as tight and uncomfortable as Maya's suit feels. His pale grey skin reflects the light in a way that looks like glitter, and his large black eyes look like galaxies inside a head that's too small for them.\n\nHe smiles and waves a four-fingered hand at Maya. Maya grins back and enters the room. The door slides closed behind her without a sound. Of course the people in charge made that piece of equipment work right.\n\nMaya sticks out her hand when she reaches the table, as the scientists behind her side's window planned.\n\n\"Hello Pjetr. Nice to finally meet you in the flesh!\" Pjetr approaches the table too, his smile widening into a toothless grin.\n\n\"Likewize!\" All Levinan have the same lisp. Pjetr takes her hand in his, his skin cool and overly smooth to the touch.\n\nEvery movement he makes is accompanied with a whiff of a fresh scent. Maya cocks her head and inhales deeply. What is that scent?\n\n\"Zjall we zit?\" Maya nods, and sits on her chair. The smell is sooo familiar, and it becomes stronger the longer she can smell it. She just can't remember what it is. Maybe Pjetr knows it.\n\n\"I don't want to be rude, but I'm detecting a very distinctive scent. Is that something your people did?\"\n\nPjetr glances at the window on his side of the room. \"I didn't think humans would be susceptible to the smell.\"\n\n\"What smell?\"\n\nPjetr's eyes widen to a comical size as his head whips back to Maya. He starts cursing in Levinian - which Maya studied, so she knows exactly what he's saying. She ignores the cursing until he says 'This was a horrible idea.'\n\nExcept his mouth didn't move. Maya gasps, more of the smell entering her nose. He didn't speak out loud, and she heard him. Fuck. Pjetr looks taken aback at her thought.\n\n'Shit. You can hear me too?'\n\n'This is not supposed to happen.' That thought was focused on her, because one, it was in English, and two, the thoughts that come after sound muted somehow.\n\n'All of our testing said the humans were psychically deaf. How is she tuning into our frequency? Do you think she's influenced by fresh Miasma?' Maya carefully doesn't think at them. Given that Pjetr isn't looking at her all surprised, it's working.\n\n'We sent samples of Miasma to their scientists. Both of our tests showed no interaction between our Miasma and their DNA.' That thought came from behind their window. How rude. They can communicate without humans overhearing but they can't do the same!\n\nPjetr's eyes snap towards her again, eyes narrowed. What feels like a fog descends over Maya's mind. Her thoughts slow, she can't hear their conversation anymore, and the smell intensifies.\n\n\"Petrichor.\" Her mind clears as she remembers where she smelled this before. It's the smell that comes with rain. The idea of rain clears up the fog, and she can see everything crystal clear. She can see the connection between Pjetr and his colleagues as a physical thing. She can see herself connecting with him too. The tiniest of threads reach from Maya to her own team, but they don't connect to anything.\n\nShe's sure that means something, but the moment of clarity disappears. The lights dim, the scent dims, and the floor moves up. The last thing Maya remembers before her head smacks into the floor is Pjetr's horrified look.\n\n\u0026amp;#x200B;\n\n\\---\n\n[Part 2](https://www.reddit.com/r/WritingPrompts/comments/15cm4uu/comment/ju1qe5k/)",
   "created_utc": 1690625910,
   "score": 168,
   "submission_id": "15cm4uu"
  },
  {
   "comment_id": "jty5rhj",
   "message": "Rain is one of my favorite things. Raindrops on roses, or on my shoulders in a storm, or rolling over flat desert to envelope my home town, each feels like a gift just for me.\n\nI wasn’t exactly “chosen” to be on this committee. Scientists, biologists, doctors, and linguists huddle together preparing to enter the next room. They will be much more useful than a math major with a kickboxing hobby, but they insisted I be here.\n\nA day ago, I had walked outside of my home staring up at the sky, the smell of rain on the air. The empty sky lacking rain clouds was confusing, until something crashed in the middle of my garden. \n\nI had tried to help the creature. The hull of the ship was torn and blazing hot. I reached into the darkness, scalding myself when I heard muttered, helpless sounding cries. I managed to remove one of the creatures while it groaned. \n\nI was unsure if moving them was safe, until the hull caught fire. I ran back into my house for a fire extinguisher. Just as the fire subsided and I had my arms around another being, a dozen black SUVs arrived and spirited me and the ship away.\n\nNow here I was after a battery of tests. They know that I managed to touch the ship and the creatures while they were unconscious, and now I was the designated “toucher” should the scientists themselves have trouble.\n\nWe all wore protective gloves, so I wasn’t entirely sure why I was necessary, but I had to admit my heart was pounding with anticipation.\n\nPetrichor; the smell of rain filled the hallway as the door swung open. The familiar beings were large, larger than I remembered and I wondered how I had managed to pull them from the ship.\n\nTwo beings, one white and ten feet tall, one black and seven feet tall, regarded us. They were birdlike, with large heads and folded forearms that reminded me of deer. Their giant eyes regarded the people in front of them.\n\n“Hello,” one of the linguists began. It was startling when one of the beings fixed their eyes on me, strange noises filling the room and a forelimb extended in my direction.\n\nI was nudged forward by the committee head. *Bait, I feel like bait.*\n\nThe creature that had motioned was the white being, so I approached them with shaking legs. The smell of rain was so strong, I couldn’t help but fight a smile and feel myself relaxing. \n\nI stood in front of the being, the whole room frozen. The large white head bent down to me, fixing me with its fist sized golden eyes. I couldn’t move. \n\nI felt a vibration in the air like a hum. A ringing filled my ears, and my back locked ramrod straight. Ow.\n\nA pop, then silence, and I wondered if my eardrums had just burst. \n\n“Hello,” said a voice in my head. “Human, thank you for your assistance.”\n\n“You’re welcome,” I answered and the men and scientists in black behind me came forward immediately. \n\n“Please, this is a civilian,” someone grabbed my arm and pulled me back, roughly. \n\n*So now that the bait has survived them, I’m back to being disposable,* I thought with a bitter laugh. \n\n“We have politicians and scientists here, linguists and historians who would love the opportunity to speak with you. I’m Agent-“\n\nBut I didn’t want to leave, I realized. I didn’t want the most important thing I’d ever been a part of to end here. But it was ending here, I was being shuffled very sternly to the back door by a beefy soldier with a neutral expression. \n\n“That human doesn’t leave.” The unearthly voice filled the room. The soldier beside me froze, and I knew everyone must have heard that.\n\nI raced back to the front of the group, standing in front of the aliens. It looked like my couple days of excitement weren’t over yet.",
   "created_utc": 1690642061,
   "score": 123,
   "submission_id": "15cm4uu"
  },
  {
   "comment_id": "jty5uuy",
   "message": "The creatures were all smiles. A bunch of tall, pale, ghostly things with these dark smiles. The creature’s lips looking stitched on, sliding high up their cheeks. They were sluggish, their long arms dragging close to the floor as they shifted down their ramp, eyes following my group. We expected things to be weird, but not this weird. You can prepare a group for the first arrival scenario as many times as you want. Sadly, that preparation goes out the window when you’re finally face to face with the real thing.\n\nWe rallied ourselves, recounting our training. Deep breaths, firm smiles, and make sure your hands are always visible. Look as innocent as you can and do nothing that might cause offence or fear. As we took our breaths, that shared anxiety heightened when the smell wafted through our nostrils. It was so familiar and haunting at the same time.\n\nWhy were we so sensitive to the smell? How could we already smell it? They hadn’t even gotten halfway down the ramp and our senses were flaring. I turned to Max, the youngest researcher in our group. He was looking to me for answers and I had nothing to offer him, only giving him a polite nod, letting him know we would get through this. I couldn’t tell what he was thinking, but I had to assume it was similar to what was currently going through my mind.\n\nWhere had I smelled this scent before?\n\nThat’s right. I had smelt it on that rainy day when we found the first deceased alien body. It must have been the rain. That didn’t make any sense, though. We were inside the building; I shouldn’t have been able to smell the rain from inside. Even if someone had brought their wet clothes in, it shouldn’t have affected the area that much. Which meant the smell wasn’t really rain, it was the alien itself. Why would we be sensitive to that smell? Something felt off. I had too many questions and not enough time to make a hypothesis about any of them.\n\nI gulped, trying to gain some courage before the first stepped off the ramp. I went to step forward, only to watch as Max took the first steps, pointing a finger at the lurching aliens.\n\n“MONSTERS. We need to run.” He screamed, turning to us, shaking as he found himself unable to move from the spot. Max’s voice going into a soft whimper as he made it to the last word.\n\n“MAX. We need to greet our new friends with respect. I apologize. We are under a lot of stress.” Could they even understand us? I made some gestures, tapping my chest before holding my hands in the air, hoping they knew we meant no harm. It was meant to be a sign of surrender or neutrality, but would they interpret it that way?\n\n“The smell. Can’t you smell it? It’s getting stronger. They didn’t land here; they’ve always been here. Waiting.”\n\n \n\n“What if he’s right?” Fiona said, sharing that panic. She had already stepped back, leaving a larger gap between her and the aliens.\n\n \n\n“We are panicking. Remember. We need to breathe. This is for the good of humanity.” I struggled to believe my own words, instinctively stepping away. The scent growing fouler. That pleasant sensation that one usually got with the rain turning sour. The smell stinging my nose, causing me to cover it. Alarms were going off through my body, my flight response kicking into gear as I took more steps back. “RUN MAX.” The words forced their way out of my throat, trying to warn him of the dangers, only for him to hear my warning too late. It’s stitched mouth splitting, revealing a row of tendrils. The tendrils having circular suckers that quickly latched onto his head, pulling him into the mouth of the creature. I couldn’t see what was happening in the mouth. Only able to hear the sickening squelching noise as the suckers fed.\n\n \n\nFiona and I ran, not attempting to save Max. Even if he could have been saved, neither of us were brave enough to face the unknown. The sluggish creatures suddenly sprang to life, their long, stilt-like legs breaking into a sprint.\n\n \n\n“CODE 31034. NEED URGENT ASSISTANCE. HELLO? We need urgent assistance, please.” I begged, tapping at the microphone sitting on my shirt. If they were listening in, they had to know the situation was bad. They didn’t need me to tell them that, did they? Fiona wasn’t quick enough, getting grabbed by one of the creatures, buying me a few precious seconds of life. I didn’t even turn to look, continuing to sprint with no destination in mind. I was in a field. There was nowhere to run to. I would eventually be caught, yet I couldn’t stop running.\n\n \n\nMy legs burned, and it felt like I had pulled a muscle, but my legs refused to stop. Until I died, they would keep carrying me. I reached down for a moment, trying to touch the aching muscle, mid sprint, only to fall flat onto my face. The collision rocked me, leaving me exhausted on the grass. The world around me an exhausted haze of blurs and shadowy figures. I could see the blurred alien blob charging, and I accepted my fate. My legs had done their best.\n\nThe ground rocked, and the blob stopped. My ears rang and a deafening sound dribbled through my eardrum. The ground continued to shake, and my vision returned. Help had arrived. Far too late for the others. I didn’t have time to see if they had killed any of the aliens, getting dragged by my shirt towards a helicopter. I’m sure the helmeted soldier was talking to me, but I couldn’t make out a single word. When he figured that out, he didn’t bother communicating. Instead, he pushed me into a seat and we were up in the air.\n\n \n\n“How are you feeling today? I heard your hearings returned. That’s great news. We will have to keep monitoring it, but it doesn’t look like you have any long-term damage.” It was nice to see a friendly face. Angie smiling at me as she gave me a look over, checking the results of my recent tests. It had been two days since the incident and the doctor was doing her best to get me fit. Mainly so I could help with their plans for a defensive effort.\n\n \n\n“Have Max and Fiona returned?”\n\n \n\n“They’re dead. You were there. You remember that, don’t you?” She grew concerned, taking a seat on the chair beside my bed. People kept telling me they had died, but I couldn’t remember seeing it. Everything was a blur of sweat, pain, and running. Running. My leg tried to kick, only being held still by the tight restraint that kept my left leg hooked to the bed.\n\n \n\n“I hurt my leg.”\n\n \n\n“You did. Very badly. You went through a traumatic event. It’s normal for people to have issues remembering details. You’ve been through something that no other human has experienced. It’s ok. Take your time. I’ll make sure they don’t press you for questions.”\n\n \n\n“NO!”\n\n \n\n“No?”\n\n \n\n“I’m not the first one. That smell. You’ve smelt it, we all have. They were always here. Waiting for something. Not sure what. They killed Fiona and Max. They killed them.” The machine by my side screeched out metallic grunts as Angie rushed to my side. A cold sensation rushed through my veins as I slouched into my pillow, my head returning to its fog.\n\n \n\n“Easy. You’re safe. You’re safe.” She stroked my hand, though I was finding it hard to feel anything now. The longer she touched it, the less I noticed. As I started to fade into sleep, I could hear her speak. “Something about them always being here? Why? Sir, we can’t. Look at him. He nearly went into shock earlier; we can’t push this.” Was there someone else in the room? It didn’t matter. I wanted to rest.\n\nA hard slap forced my eyes open, a swirling face staring down at me. He looked human. I think. Everything in the room was moving a little too quickly for me to tell. He opened his lips, but no words came out, causing me to giggle. Another slap followed that, with a hand pushing against my shoulder.\n\n \n\n“What did you mean, they were always here?” He said, his words clear for the moment. When he spoke, the only feature of his I could focus on was his thick blonde moustache. The curls wet from either being licked or a recent drink.\n\n \n\n“Hiding. We could always smell them. The rain carried their scent. Water. Drip… Drop…” I laughed again, this time not getting slapped for it.\n\n \n\n“Water? What else do you know?”\n\n \n\n“You need to let him rest. Doesn’t that help you? If he dies, you won’t get anything out of him. They aren’t attacking at the moment. He has time to rest.” Angie said.\n\n \n\n“Every minute he rests is another minute they get to plan their attack. We need all the information we can get to even the playing field. I want him awake in five hours. I’ll use what information we have for now.” He grunted and wandered off. I tried to wave, only for my hand to rub against the mattress, unable to lift itself up.\n\n \n\n“Rest. I’ll get a nurse to help with the bruising.” Again, that chilly feeling went through my veins. This time dragging me into a slumber, unable to escape its grasp.\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)",
   "created_utc": 1690642102,
   "score": 83,
   "submission_id": "15cm4uu"
  },
  {
   "comment_id": "jtzm8hb",
   "message": "A broadcast heard around the world.\n\nA year of panicking, politicking, and planning. \n\nA month of preparation. \n\nAll for a single visit.\n\nA group chosen by the alien visitors to meet with their representatives. A top biology scientist. A linguist fluent in the major world languages. A historian, specialising in ancient history. A grave keeper. And me, a truck driver. All gathered in Switzerland. The grave keeper and I had no idea why we were chosen. We started to talk and a good acquaintanceship started forming between us two.\n\nThe time for the visit was approaching quickly. We all gathered in the conference room in the specially constructed retractable roof hanger. We wouldn't witness the arrival of their ship, but we would be the9 first to meet them. We heard the roof retracting. Almost show time. There was a not quite whisper of the absence of sound, then the sound of the roof moving back into place.\n\n\"I think it's time,\" the linguist said.\n\nWe all stood and turned to face the door. \n\nI sniffed the air, the grave keeper sniffed the air as well and we looked towards each other. \n\n\"It smells like petrichor,\" I whispered.\n\nThe grave keeper nodded.\n\nThe door opened and in walked 6 Roman god-like statuesquely beautiful beings, 3 male like and 3 female like. They arranged themselves on the opposite side of the table in a male like, female like pattern. \n\nThe male like and the female like in the center spoke in harmonious unison, \"Hello, we wish to thank you for agreeing to meet with us.\"\n\n\"On behalf of the Earth, we welcome you.\" The linguist smoothly replied.\n\nThe grave keeper looked calm, but kept glancing at me as I stared at the aliens with a look of puzzlement. I wasn't paying attention at all to the discussion going on.\n\nThe pair seated nearest me turned in unison to me and asked, \"What troubles you?\"\n\nStartled at this I blurted out, \"Why do you all smell of petrichor?\"\n\nThe aliens looked at each other and the pair nearest me said, \"That is a question with a not happy answer. Do you really wish to know?\"\n\nI looked at the rest of our side of the table, the linguist and the grave keeper were shaking their heads, but the scientist and historian were nodding.\n\n\"I personally would like to know,\" I responded firmly, as much to the aliens as to the others on my sode of the table.\n\nThe aliens looked at each other again and nodded.\n\n\"This planet is the site of our last and biggest battle. Trillions died and were never recovered. This is the first time our species has visited in the 2.5 billion of your years since.\"",
   "created_utc": 1690663200,
   "score": 22,
   "submission_id": "15cm4uu"
  }
 ]
}