{
 "submission_id": "15cplwl",
 "title": "[WP] You have been tasked to write a children's book to help kids deal with the aftermath of the apocalypse.",
 "selftext": "",
 "created_utc": 1690628801,
 "permalink": "/r/WritingPrompts/comments/15cplwl/wp_you_have_been_tasked_to_write_a_childrens_book/",
 "score": 5,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cplwl/wp_you_have_been_tasked_to_write_a_childrens_book/",
 "comments": [
  {
   "comment_id": "jtxdkyo",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690628801,
   "score": 1,
   "submission_id": "15cplwl"
  },
  {
   "comment_id": "jtxmwiu",
   "message": "***Captain Hughes, Editor's notes on draft - 7/29/33***\n\n\u0026amp;#x200B;\n\n***Working Titles:***\n\n~~Your gas mask buddy and you!~~\n\n~~Listen to your new Daddy~~\n\nKeep your chin up!  ***\u0026lt;--*** ***use this one***\n\n~~Don't die for nothing!~~\n\n\u0026amp;#x200B;\n\n***Pages 1-6:***\n\nThe world looks funny sometimes. This is because not everything today works how it was made to yesterday.\n\nSomethings used to have lights that could turn on at the press of a button.\n\n*(illustration 1, apple store with shining tv screens along the walls)*\n\nMany water containers only had to be made to hold water. They were made from materials that had no guard against radiation. This is why so much water that looks safe to drink is not safe to drink. ***\u0026lt;-- emphasize 'looks' and 'not' with bold font***\n\n*(illustration 2, water tower and 50 gal. water drums)*\n\n***Pages 7-18:***\n\nOut of every new change our world faces today, the biggest of them all is the air we breathe.\n\nWhen most trees were still green, the air in our sky could touch your eyes, your nose, and even you tongue without leaving a stain. People and animals used to breathe outside and without any face-coverings. Because of this, the planet was able to hold many hundreds of hundreds of hundreds of hundreds of different men, women, children, and animals.\n\n*(illustration 3, blue and green planet with circle of humans and animals holding hands all around)* ***\u0026lt;-- don't include cougars in hand-holding circle, gives kids the impression that these animals are/were safe to interact with***\n\nThere were so many people that, sometimes, we all had fights. Even when these fights were over little problems, they could get pretty big and scary.\n\n*(illustration 4, bloody warfare)* ***\u0026lt;-- but nicer.***\n\nWe had air in a can that was a lot like the air outside today. It hurt. And in our fights, we would throw these air cans at each other.\n\n*(illustration 5, mustard gas victims)* ***\u0026lt;-- but happier.***\n\nThis is where the masks we use today come from. They were made to keep us safe from the pain in the cans, and they still work today to stop the pain outside from getting into our lungs.\n\n*(illustration 6, array of gas masks that are still used today)* ***\u0026lt;-- remove this second mask as the seal has been shown ineffective on children's faces***\n\nSometimes we fought fair. Sometimes we fought mean. But we always agreed that only grown ups should fight grown ups, and so almost all of our masks were made for grown up faces.\n\n*(illustration 7, baby crawling in an enormously oversized gas mask)*\n\nA mask that stops the pain in the air from getting inside will only work when the entire mask snuggles to your cheeks. If even a little bit is hanging away from your face, or if the mask is cracked, the pain can sneak in.\n\n*(illustration 8, cloud of green gas with a scary face slipping into the cracks in a mask)*\n\nThe best way to keep your mask snug is to keep your up, and the best way to keep your chin up is to keep looking forward. Don't look at your shoes. Don't twist your neck over your shoulder.\n\n*(illustration 9, line of children marching proud, one lingering child looking down, a big red X over this bad child)*\n\nA chin up attitude is good for you. It feels good to looks forward. It only hurts to look back. Be brave and always wear your mask as your new Daddy tells you to, but never keep it secret from your new Daddy if the mask is letting the pain in.\n\n*(illustration 10, Captain Hughes surrounded by happy children)* ***\u0026lt;-- I DON'T LOOK LIKE THIS!!! give me the rest of my hair back and take away that ridiculous double chin!***\n\n***Pages 19-20:***\n\nA happy child is a child who follows the rules. Always wear your mask when you go outside. When it's hard to keep your chin up, remember that you will be grown up someday. Then the mask will fit perfectly. Look forward to that day, and smile!\n\n\u0026amp;#x200B;\n\n***Editorial notes: use less yellow tones in all illustrations, we do not have enough white material to waste on this stupid children's book.***\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThanks for reading! Find more at r/FarFetchedFiction",
   "created_utc": 1690633786,
   "score": 1,
   "submission_id": "15cplwl"
  }
 ]
}