{
 "submission_id": "15cssr8",
 "title": "[WP] You’re a mythology college professor. One day, you decide to show your class how people used to “summon” gods. Yo your surprise, the ritual works.",
 "selftext": "",
 "created_utc": 1690638547,
 "permalink": "/r/WritingPrompts/comments/15cssr8/wp_youre_a_mythology_college_professor_one_day/",
 "score": 43,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cssr8/wp_youre_a_mythology_college_professor_one_day/",
 "comments": [
  {
   "comment_id": "jtxxdo5",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690638547,
   "score": 1,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtylhvx",
   "message": "\"Every religion in the world has specific rituals for summoning deities. Some religions do this by offering sacrifices while the others chant some sayings while offering gifts.\" Harvey looked at his class, unusually attentive. \n\n\"In some of the Hindu scriptures it is said that to seek blessings from God Shiva, Munis, sages, used to meditate for long periods of time. The only thing they concentrated on was the chant 'Om Namah Shivay'. These meditative states lasted years or sometimes decades. They didn't move, stories of anthills being formed on them are usually circulated.\" \n\n\"Did they succeed?\" Gary asked. \n\nNormally, it was difficult to keep his mind off his phone but today he looked excited. Harvey was glad that one his lecture always brought such a level of enthusiasm. \n\nHarvey nodded. \"Many did.\"\n\n\"What blessing did Shiva give them?\" Drea asked. \n\n\"It was upto the sage who undertook the severe meditation. God Shiva blessed them with whatever they asked.\" \n\n\"Like a Genie!\" Someone yelled. \n\n\"That is an oversimplification, but yes.\" Harvey shook his head. \"You have to understand, Genie was a prisoner bound by laws of magic whereas God Shiva is considered one of the most powerful gods in Hinduism. He is considered the part of the Holy Trinity, Bramha-Vishnu-Mahesh, but that is another lecture.\"\n\n\"Can we see the summoning ritual?\" Someone asked breathless. \n\n\"Since it takes years of severe meditation, no.\" He laughed. \"But there are some deities that we can see the summoning rituals of.\" \n\n\"Isn't it true that any Gods true form can lead to a person's demise or them losing their mind.\" Garima said. \n\n\"There has been various debates on this. It is widely considered that most of these stories are fictional to scare people from performing the rituals. But, yes,  some consider it true.\"\n\n\"Which summoning ritual should we perform?\" Theo asked excitedly. \n\n\"Since we are studying and Goddess Saraswati is considered the Goddess of Knowledge, among many things.\" Harvey said. \n\nIt was always expected of him to perform at least one summoning ritual in class. He always brought the required things. It never worked, of course, but it was nice to see his class excited for something. \n\nHe placed the Goddess's idol then drew a chowk (a design used before starting prayer) with flour on the floors. Placing an earthen lamp in the center of it. Offering white rose and yello marigold to the idol, he started chanting Saraswati Mantra. \n\nA few minutes went by and nothing happened. He heard someone tut making him smile. \n\n\"These things don't usually work, you know. These require very specific-\" \n\nHe stopped short. A woman wearing a white Saree was standing in his classroom. Just by looking at her, he felt he had gained the knowledge of the universe, that music flowed through his veins. She- she glowed. She was ethereal. \n\nShe was a GODDESS! \n\nHe joined his head and bowed. \"Maa-\" \n\n\"You don't need to do that.\" She said warmly. \n\nNot a single soul moved in his class then he realised why. They were frozen in time. \n\n\"Do you why I showed up today?\" She asked smiling softly. \n\n\"The- the ritual.\" He gasped. It worked. The ritual worked! \n\nShe laughed and everything inside him found peace. \"No. That is not the ritual. You have been doing it wrong. In fact, there is no ritual. You just need to find a place for us in your heart and there we appear.\"\n\n\"Then-\" He left the incomplete question hang between them. \n\n\"Because you never give up. You work and you never expect anything except these children to learn and that, my child, is more powerful than any non-existent ritual. That is true devotion.\" \n\nHe felt a warm glow inside him and he realised it was satisfaction, and happiness. \n\nShe gave him a warm smile then said. \"May your knowledge shine brightly upon everyone. May your knowledge and happiness only increase. May the music of happiness fill your life. Tathastu.\"\n\nHe felt a tear slip down his cheeks. A sudden noise filled the room. \n\n\"Damn! I really thought something would happen.\" Gary grumbled. \n\n*\n\nMaa is Hindi for mother. \n\nMahesh is another name for God Shiva.\n\nTathastu means this will happen or so be it. (or yk, Amen.)\n\n\n*\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690648427,
   "score": 1,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtydtrr",
   "message": "(I only remembered the college professor part when I was nearly finished the story. So, enjoy this from the perspective of a teacher.)\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n\n“WOOOO, FINALLY. Who’s ready to sacrifice a heretic?” The god shouted, ecstatic to be alive again. He danced around the classroom, his heavy body shaking before he stopped, clapping his hands together, scanning the class. “That one with the glass eyes. Let’s sacrifice that heretic. Does anyone have some horses and a rope?”\n\nThe class was silent. They hadn’t expected the summoning spell to work. Even if they had expected it to work, they didn’t think this was the god that would appear. They expected Apollo, not whoever this guy was. Everyone remained silent except Jimmy, who was cowering behind his pencil case. The god picking him out as the class sacrifice.\n\n“Who are you? How did you get into my class?” Mr. Fredan held his wooden ruler out, as if he was a shining knight from the medieval times and this ruler was his silver sword. “You need to leave, now.”\n\n“Leave? You summoned me. I appreciate it too. It’s been… What year is it?” He asked, scratching his waist as he tried to make sense of the world around him. It didn’t look that different from how he remembered it. Well, except for the clothes, strange metal devices, glass eyes and lack of plagues.\n\n“2019?” Mr. Fredan said, watching as the god tried to figure out where he was.\n\n“Dax time or New Dax?”\n\n“What?”\n\n“You don’t know Dax time? It’s been a while then. So, can we sacrifice glass eyes already? I’ll give you four sheep if you do.”\n\n“We aren’t sacrificing anyone. They are called glasses. They aren’t glass eyes.” Mr. Fredan didn’t know how to handle this. He had procedures for school fights, alien invasions, and even the unlikely event that a kid gets possessed by the spirit of a vengeful janitor. Yet, mythological deities didn’t fit anywhere in there.\n\n“Then no sheep for you. They are nice sheep too. You look like a man that could use some sheep. You have twenty sacrifices; you can spare one.” The god really had it out for Jimmy. Something about him earning the anger of the god.\n\n“I don’t want any sheep. These are students, not sacrifices.”\n\n“Then they can leave and go wherever they please?” The god asked, rubbing his chin.\n\n“No. They’re dismissed when I say they’re dismissed.”\n\n \n\n“That sounds like sacrifices. Fine. If we aren’t doing that, what am I doing? Need me to smite someone? Want me to set fire to a village?”\n\n \n\n“No, no. Why would I want that? I want you to tell the class about yourself. We are studying you.” Mr. Fredan lowered his ruler, watching as the god grinned, taking a seat on the edge of the teacher’s desk.\n\n \n\n“Ah, you wish to worship me. I’m flattered, people usually only ask me for things. Ok, I’ll tell you whatever you want to know.”\n\n \n\n“Ok, class. Raise your hand if you have any questions. Remember, we have a test on this next week. If you don’t mention this to your parent’s, you all pass.”\n\n \n\nA few children raised their hands, included Jimmy. The god glared at Jimmy, staring him down until he lowered his hand. He pointed to a girl with a pink butterfly hair clip. “Yes?”\n\n \n\n“If you’re a god. Why don’t you have a church?” Her words caused Mr. Fredan to panic. The teacher making an X motion with his arms, expecting the god to get angry. Instead, he leaned back, knocking Mr. Fredan’s papers on the floor.\n\n \n\n“It’s a long story. I made a few bad investments in warring nations. I focused on getting followers in cities that were bloodthirsty and while it was effective for some time. The lack of hygiene and medicine caused their downfall. So, if you’re ever a deity, don’t focus on promoting yourself only in places that fight wars. They usually end up dying off. I am planning to make a comeback. I just need to wait until my godly suspensions up. In a few thousand years, I’ll be allowed to promote myself again. So, make sure to let your great, great, great, great, great, great…” He kept going for a good five minutes before finishing. “Grandkids know.” A boy chewing gum was next to ask a question, raising his hand.\n\n \n\n“Can I have a new bike?”\n\n \n\n“Do you have anyone to sacrifice?”\n\n \n\n“I have a little sister.” He offered. The god leaning forward as the boy made the offer. Before the god could accept the deal, Mr. Fredan interjected.\n\n \n\n“NO ONE IS SACRIFICING THEIR SIBLINGS FOR NEW STUFF. Does anyone have any better questions?” When no one raised their hands, Mr. Fredan let out a sigh, wondering why he even started teaching. “How about you tell us some of your grand gestures? I’m sure you have performed miracles or done significant acts during your time.”\n\n“I once convinced a town that the floor was lava.” He said proudly, revealing the true origin of the childhood game.\n\n \n\n“How did you convince them the floor was lava?” Mr. Fredans asked.\n\n \n\n“By making the ground lava.”\n\n \n\n“Ok. I think you need to return to your realm. Come on.” Mr. Fredans grabbed the gods’ hand, dragging him back towards the book he had summoned him from. As he passed Jimmy, he stopped, staring at his reflection in the glasses.\n\n \n\n“You disgust me. Mocking me with my own image. What are you trying to say? That you have me trapped in your eyes? That I am a bug in your caged mind?” The god was ready to fight, only to get dragged away by the teacher.\n\n \n\n“It’s a pair of glasses. Things can reflect in them. It’s your reflection, not an act of mockery.” Before the god could respond, Mr. Fredans said the ancient spell, sending him back into the book. The book shut itself, allowing the teacher to take a breath. “Ok, class. I’ve decided that mythology is stupid and not worth studying. We will be watching Shrek for the next week and pretending this never happened. I will also be holding a pizza party. Please don’t tell your parents.”\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)",
   "created_utc": 1690645457,
   "score": 1,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jty5zd6",
   "message": "Professor Bargue closed the old soiled manuscript and placed it next to his neatly stacked pile of papers. He gazed at the newcomer in the front seat that was perpetually vacant.\n\nA muscular man with long braided hair and beard sat beside a three-headed dog that was licking its posterior region.\n\nProfessor Bargue broke the silence by asking his guest his name.\n\n“I need no introduction, my name is known throughout the world.”\n\nThe visitor’s dog howled at the student tapping his foot beside him. The boy promptly wet his pants, and ran out of the room.\n\nThe visitor roared with laughter. “Well then, you are really confused, so I will dispel your ignorance. I am Hades, god of the Underworld. Pleased to make your acquaintance.”\n\n“And this is the cerebus? He is much… smaller than I imagined.” \n\nHades laughed again. “Myths tend to enlarge reality. But I am more powerful than you might think…” Hades pointed to a girl next to him and pushed his hand downward. The girl fell through the floor screaming. “Don’t worry, she shall return in another form. Perhaps as an insect or bird next time…”\n\nProfessor Bargue leaped up, shaking with rage. “That’s not how you will comport yourself in my classroom! Return her at once!”\n\nHades clicked his fingers, and a stunningly beautiful woman rose in the girl’s seat. “Oh Zeus, what are YOU doing here?”\n\nThe beautiful woman swept her hair to the side, sending a warm vapor of botanical fragrance through the room. Professor Bargue forgot all about the lost girl, and felt totally, helplessly in love.\n\n“Your tricks don’t work on me, Aphrodite,” said Hades. Cerebus barked it’s many heads off at her.\n\n“I just wanted you to know the big guy is on his way.”\n\n“Liar. You just want to get me back in that underground hell again.”\n\nAphrodite smiled, and an apple appeared in her hand. She took a bite, then threw it at Hades’ head, sending chunks flying in all directions.\n\nThe room started to shake, and a booming voice reverberated from the ceiling.\n\n“I don’t think that’s the principal,” said Aphrodite. “You’re in trouble.”\n\nCerebus whimpered, and tried to hide under Hades’ chair. The students in the room started to shift in consternation.\n\nThe voice above bellowed, “three…” \n\nHades swallowed something dry and hollow in his throat.\n\n“Two…”\n\nCerebus quivered with dread.\n\n“One!”\n\nHades jumped down into a bottomless hole that closed up behind him.\n\nThe voice above chuckled.\n\nAphrodite pranced up to Professor Bargue, whose mouth was agape. “Zeus does like to play with his food. Now are you going to dismiss the class so I can get some private tutoring?”\n\n“Cla-class dismissed!” Bargue was hot and sweating now, and this goddess he’d somehow summoned into his classroom was looking at him the way his cat looked at a can of sardines. And he didn’t mind that, not one bit.",
   "created_utc": 1690642158,
   "score": 1,
   "submission_id": "15cssr8"
  }
 ]
}