{
 "submission_id": "15cssr8",
 "title": "[WP] You’re a mythology college professor. One day, you decide to show your class how people used to “summon” gods. Yo your surprise, the ritual works.",
 "selftext": "",
 "created_utc": 1690638547,
 "permalink": "/r/WritingPrompts/comments/15cssr8/wp_youre_a_mythology_college_professor_one_day/",
 "score": 11,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cssr8/wp_youre_a_mythology_college_professor_one_day/",
 "comments": [
  {
   "comment_id": "jtxxdo5",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690638547,
   "score": 1,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtylhvx",
   "message": "\"Every religion in the world has specific rituals for summoning deities. Some religions do this by offering sacrifices while the others chant some sayings while offering gifts.\" Harvey looked at his class, unusually attentive. \n\n\"In some of the Hindu scriptures it is said that to seek blessings from God Shiva, Munis, sages, used to meditate for long periods of time. The only thing they concentrated on was the chant 'Om Namah Shivay'. These meditative states lasted years or sometimes decades. They didn't move, stories of anthills being formed on them are usually circulated.\" \n\n\"Did they succeed?\" Gary asked. \n\nNormally, it was difficult to keep his mind off his phone but today he looked excited. Harvey was glad that one his lecture always brought such a level of enthusiasm. \n\nHarvey nodded. \"Many did.\"\n\n\"What blessing did Shiva give them?\" Drea asked. \n\n\"It was upto the sage who undertook the severe meditation. God Shiva blessed them with whatever they asked.\" \n\n\"Like a Genie!\" Someone yelled. \n\n\"That is an oversimplification, but yes.\" Harvey shook his head. \"You have to understand, Genie was a prisoner bound by laws of magic whereas God Shiva is considered one of the most powerful gods in Hinduism. He is considered the part of the Holy Trinity, Bramha-Vishnu-Mahesh, but that is another lecture.\"\n\n\"Can we see the summoning ritual?\" Someone asked breathless. \n\n\"Since it takes years of severe meditation, no.\" He laughed. \"But there are some deities that we can see the summoning rituals of.\" \n\n\"Isn't it true that any Gods true form can lead to a person's demise or them losing their mind.\" Garima said. \n\n\"There has been various debates on this. It is widely considered that most of these stories are fictional to scare people from performing the rituals. But, yes,  some consider it true.\"\n\n\"Which summoning ritual should we perform?\" Theo asked excitedly. \n\n\"Since we are studying and Goddess Saraswati is considered the Goddess of Knowledge, among many things.\" Harvey said. \n\nIt was always expected of him to perform at least one summoning ritual in class. He always brought the required things. It never worked, of course, but it was nice to see his class excited for something. \n\nHe placed the Goddess's idol then drew a chowk (a design used before starting prayer) with flour on the floors. Placing an earthen lamp in the center of it. Offering white rose and yello marigold to the idol, he started chanting Saraswati Mantra. \n\nA few minutes went by and nothing happened. He heard someone tut making him smile. \n\n\"These things don't usually work, you know. These require very specific-\" \n\nHe stopped short. A woman wearing a white Saree was standing in his classroom. Just by looking at her, he felt he had gained the knowledge of the universe, that music flowed through his veins. She- she glowed. She was ethereal. \n\nShe was a GODDESS! \n\nHe joined his head and bowed. \"Maa-\" \n\n\"You don't need to do that.\" She said warmly. \n\nNot a single soul moved in his class then he realised why. They were frozen in time. \n\n\"Do you why I showed up today?\" She asked smiling softly. \n\n\"The- the ritual.\" He gasped. It worked. The ritual worked! \n\nShe laughed and everything inside him found peace. \"No. That is not the ritual. You have been doing it wrong. In fact, there is no ritual. You just need to find a place for us in your heart and there we appear.\"\n\n\"Then-\" He left the incomplete question hang between them. \n\n\"Because you never give up. You work and you never expect anything except these children to learn and that, my child, is more powerful than any non-existent ritual. That is true devotion.\" \n\nHe felt a warm glow inside him and he realised it was satisfaction, and happiness. \n\nShe gave him a warm smile then said. \"May your knowledge shine brightly upon everyone. May your knowledge and happiness only increase. May the music of happiness fill your life. Tathastu.\"\n\nHe felt a tear slip down his cheeks. A sudden noise filled the room. \n\n\"Damn! I really thought something would happen.\" Gary grumbled. \n\n*\n\nMaa is Hindi for mother. \n\nMahesh is another name for God Shiva.\n\nTathastu means this will happen or so be it. (or yk, Amen.)\n\n\n*\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690648427,
   "score": 82,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtydtrr",
   "message": "(I only remembered the college professor part when I was nearly finished the story. So, enjoy this from the perspective of a teacher.)\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n\n“WOOOO, FINALLY. Who’s ready to sacrifice a heretic?” The god shouted, ecstatic to be alive again. He danced around the classroom, his heavy body shaking before he stopped, clapping his hands together, scanning the class. “That one with the glass eyes. Let’s sacrifice that heretic. Does anyone have some horses and a rope?”\n\nThe class was silent. They hadn’t expected the summoning spell to work. Even if they had expected it to work, they didn’t think this was the god that would appear. They expected Apollo, not whoever this guy was. Everyone remained silent except Jimmy, who was cowering behind his pencil case. The god picking him out as the class sacrifice.\n\n“Who are you? How did you get into my class?” Mr. Fredan held his wooden ruler out, as if he was a shining knight from the medieval times and this ruler was his silver sword. “You need to leave, now.”\n\n“Leave? You summoned me. I appreciate it too. It’s been… What year is it?” He asked, scratching his waist as he tried to make sense of the world around him. It didn’t look that different from how he remembered it. Well, except for the clothes, strange metal devices, glass eyes and lack of plagues.\n\n“2019?” Mr. Fredan said, watching as the god tried to figure out where he was.\n\n“Dax time or New Dax?”\n\n“What?”\n\n“You don’t know Dax time? It’s been a while then. So, can we sacrifice glass eyes already? I’ll give you four sheep if you do.”\n\n“We aren’t sacrificing anyone. They are called glasses. They aren’t glass eyes.” Mr. Fredan didn’t know how to handle this. He had procedures for school fights, alien invasions, and even the unlikely event that a kid gets possessed by the spirit of a vengeful janitor. Yet, mythological deities didn’t fit anywhere in there.\n\n“Then no sheep for you. They are nice sheep too. You look like a man that could use some sheep. You have twenty sacrifices; you can spare one.” The god really had it out for Jimmy. Something about him earning the anger of the god.\n\n“I don’t want any sheep. These are students, not sacrifices.”\n\n“Then they can leave and go wherever they please?” The god asked, rubbing his chin.\n\n“No. They’re dismissed when I say they’re dismissed.”\n\n \n\n“That sounds like sacrifices. Fine. If we aren’t doing that, what am I doing? Need me to smite someone? Want me to set fire to a village?”\n\n \n\n“No, no. Why would I want that? I want you to tell the class about yourself. We are studying you.” Mr. Fredan lowered his ruler, watching as the god grinned, taking a seat on the edge of the teacher’s desk.\n\n \n\n“Ah, you wish to worship me. I’m flattered, people usually only ask me for things. Ok, I’ll tell you whatever you want to know.”\n\n \n\n“Ok, class. Raise your hand if you have any questions. Remember, we have a test on this next week. If you don’t mention this to your parent’s, you all pass.”\n\n \n\nA few children raised their hands, included Jimmy. The god glared at Jimmy, staring him down until he lowered his hand. He pointed to a girl with a pink butterfly hair clip. “Yes?”\n\n \n\n“If you’re a god. Why don’t you have a church?” Her words caused Mr. Fredan to panic. The teacher making an X motion with his arms, expecting the god to get angry. Instead, he leaned back, knocking Mr. Fredan’s papers on the floor.\n\n \n\n“It’s a long story. I made a few bad investments in warring nations. I focused on getting followers in cities that were bloodthirsty and while it was effective for some time. The lack of hygiene and medicine caused their downfall. So, if you’re ever a deity, don’t focus on promoting yourself only in places that fight wars. They usually end up dying off. I am planning to make a comeback. I just need to wait until my godly suspensions up. In a few thousand years, I’ll be allowed to promote myself again. So, make sure to let your great, great, great, great, great, great…” He kept going for a good five minutes before finishing. “Grandkids know.” A boy chewing gum was next to ask a question, raising his hand.\n\n \n\n“Can I have a new bike?”\n\n \n\n“Do you have anyone to sacrifice?”\n\n \n\n“I have a little sister.” He offered. The god leaning forward as the boy made the offer. Before the god could accept the deal, Mr. Fredan interjected.\n\n \n\n“NO ONE IS SACRIFICING THEIR SIBLINGS FOR NEW STUFF. Does anyone have any better questions?” When no one raised their hands, Mr. Fredan let out a sigh, wondering why he even started teaching. “How about you tell us some of your grand gestures? I’m sure you have performed miracles or done significant acts during your time.”\n\n“I once convinced a town that the floor was lava.” He said proudly, revealing the true origin of the childhood game.\n\n \n\n“How did you convince them the floor was lava?” Mr. Fredans asked.\n\n \n\n“By making the ground lava.”\n\n \n\n“Ok. I think you need to return to your realm. Come on.” Mr. Fredans grabbed the gods’ hand, dragging him back towards the book he had summoned him from. As he passed Jimmy, he stopped, staring at his reflection in the glasses.\n\n \n\n“You disgust me. Mocking me with my own image. What are you trying to say? That you have me trapped in your eyes? That I am a bug in your caged mind?” The god was ready to fight, only to get dragged away by the teacher.\n\n \n\n“It’s a pair of glasses. Things can reflect in them. It’s your reflection, not an act of mockery.” Before the god could respond, Mr. Fredans said the ancient spell, sending him back into the book. The book shut itself, allowing the teacher to take a breath. “Ok, class. I’ve decided that mythology is stupid and not worth studying. We will be watching Shrek for the next week and pretending this never happened. I will also be holding a pizza party. Please don’t tell your parents.”\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)",
   "created_utc": 1690645457,
   "score": 41,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jty5zd6",
   "message": "Professor Bargue closed the old soiled manuscript and placed it next to his neatly stacked pile of papers. He gazed at the newcomer in the front seat that was perpetually vacant.\n\nA muscular man with long braided hair and beard sat beside a three-headed dog that was licking its posterior region.\n\nProfessor Bargue broke the silence by asking his guest his name.\n\n“I need no introduction, my name is known throughout the world.”\n\nThe visitor’s dog howled at the student tapping his foot beside him. The boy promptly wet his pants, and ran out of the room.\n\nThe visitor roared with laughter. “Well then, you are really confused, so I will dispel your ignorance. I am Hades, god of the Underworld. Pleased to make your acquaintance.”\n\n“And this is the cerebus? He is much… smaller than I imagined.” \n\nHades laughed again. “Myths tend to enlarge reality. But I am more powerful than you might think…” Hades pointed to a girl next to him and pushed his hand downward. The girl fell through the floor screaming. “Don’t worry, she shall return in another form. Perhaps as an insect or bird next time…”\n\nProfessor Bargue leaped up, shaking with rage. “That’s not how you will comport yourself in my classroom! Return her at once!”\n\nHades clicked his fingers, and a stunningly beautiful woman rose in the girl’s seat. “Oh Zeus, what are YOU doing here?”\n\nThe beautiful woman swept her hair to the side, sending a warm vapor of botanical fragrance through the room. Professor Bargue forgot all about the lost girl, and felt totally, helplessly in love.\n\n“Your tricks don’t work on me, Aphrodite,” said Hades. Cerebus barked it’s many heads off at her.\n\n“I just wanted you to know the big guy is on his way.”\n\n“Liar. You just want to get me back in that underground hell again.”\n\nAphrodite smiled, and an apple appeared in her hand. She took a bite, then threw it at Hades’ head, sending chunks flying in all directions.\n\nThe room started to shake, and a booming voice reverberated from the ceiling.\n\n“I don’t think that’s the principal,” said Aphrodite. “You’re in trouble.”\n\nCerebus whimpered, and tried to hide under Hades’ chair. The students in the room started to shift in consternation.\n\nThe voice above bellowed, “three…” \n\nHades swallowed something dry and hollow in his throat.\n\n“Two…”\n\nCerebus quivered with dread.\n\n“One!”\n\nHades jumped down into a bottomless hole that closed up behind him.\n\nThe voice above chuckled.\n\nAphrodite pranced up to Professor Bargue, whose mouth was agape. “Zeus does like to play with his food. Now are you going to dismiss the class so I can get some private tutoring?”\n\n“Cla-class dismissed!” Bargue was hot and sweating now, and this goddess he’d somehow summoned into his classroom was looking at him the way his cat looked at a can of sardines. And he didn’t mind that, not one bit.",
   "created_utc": 1690642158,
   "score": 34,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtz1ukk",
   "message": "Look, in my defence, the summoning had never worked before. Why should it have been any different now? Each semester, for the past--what, ten years?--in Classics 102, I recited the same Greek script. The same summoning of the god of the sea--just a little artifact from some old script. It was only ever meant to be a little bit of trivia; it never should have been anything serious. It wasn’t real as far as I could tell. It would be the modern day equivalent of thinking you could actually shift realities and become Draco Malfoy’s girlfriend or whatever the hell kids where up to on TikTok. \r  \n\r  \nBut that’s beside the point. I added the little chant that first year I had the class because it was an 8 a.m. lecture and only a third of the students, at best, ever turned up and the script sounded cool and whenever I spoke Greek few heads might perk up from their online shopping, or facebooking, or whatever the was popular that year. Plus I liked showing off my skills. Unbearably lame, I know, can you blame a guy for trying? \r  \n\r  \nOver the summer, though, something must have shifted. Somehow. You’d think a dead language is, you know, dead, but somehow it must’ve evlolved. It sure as shit wasn’t me who’d done something different. \r  \n\r  \nBut there, on the other side of the lectern, in the dingy gray basement of the underfunded humanities building, a grey cloud started to form. Swirls of mist swirled around in a funnel. Wind rippled through the room. My stack of papers fluttered up in the air and went spinning toward the back wall.\r  \n\r  \nThe students’ interested was piqued. My eyes flickered between the brewing storm inside this small room to the dozen-odd students who were finally, finally, all paying attention. They leanded forward. A few shut their laptops and another looked up from her phone. One guy in the front, though, he started to frown.\r  \n\r  \nThe storm crescendoed. As quickly as the cloud had started to form, it vanished with a resounding crack that rattled my chest. \r  \n\r  \nI blinked and rubbed at my eyes. Where the clouds had been gathering now stood a man, about my age, with a dark beard, wavy hair, and a healthy tan. \r  \n\r  \n“You called for me?” he asked. \r  \n\r  \nIt took me a moment to realize that he was talking to me. “I suppose I did.” I straighted my windswept tie. “You--you’re--”\r  \n\r  \n“Poseidon. God of the sea.” He held out his hand and I shook it. “Nice to meet you.” \r  \n\r  \nMy mind realed as I tried to catch up with what was happening. It was early in the morning, sure, but I was more or less used to it at this point. “Nice to, uh, meet you too.” I wasn’t entirely sure this wasn’t an elaborate prank. No one had their cameras out, though. \r  \n\r  \nThe man--Poseidon--clasped his hands behind his back and turned around the room. “So this is your domain?”\r  \n\r  \n\r  \nI cleared my throat. “This is a classroom in the basement of the humanities building.”  Last year, a pipe broke in the winter and I’d arrived to two inches of water covering the floor. Maintenance fixed the issue, but they’d never replaced the ceiling tile they cut out and on cold days it still dripped. My domain--sure. \r  \n\r  \n“Hm.”  He peered at the notes on my lecture slide. “And you’ve been teaching this course for how long?”\r  \n\r  \nThe guy sitting in the front row made a strangled noise. “He’s a good prof.” \r  \n\r  \nI was flattered, a bit, mostly because I didn’t think that guy had ever payed attention. He never wrote notes, never typed anything. \r  \n\r  \nThe man--Poseidon--raised his hands in mock surrender. “I never said he wasn’t.”\r  \n\r  \nThe student rolled his eyes. “Why are you here?”\r  \n\r  \n“I was summoned.”\r  \n\r  \n“Buy why are you here? Now?”\r  \n\r  \n“Perseus.” The man-god shook his head. “Am I not allowed to check in with my son?”\r  \n\r  \nI cocked my head to the side. Surely, I hadn’t heard that right. Son? \r  \n\r  \nThe student’s face turned pink and he ducked his head. “Dad,” he muttered. “You’re embarassing me in front of my friends.”\r  \n\r  \nI blinked. What the hell was going on?",
   "created_utc": 1690654770,
   "score": 26,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtyyjaq",
   "message": "“Hello, room full of young humans, who’s ready for alternate history classes with me?” the cheery god waved at the students in the lecture hall. “But first, I have a price.”\n\nProfessor Gideon sighed, flipping through his notes to see where he had gone wrong. This ritual was supposed to have been outdated and no longer in use by any god. Supposed to have been an ideal demonstration that was harmless. It was just his first day conducting an introductory class into religious and mythological history as a guest lecturer, and it started with a black portal tearing through the room. And a familiar face he wasn’t expecting to drop in, sporting a grin a little wider than normal human range.\n\nGary raised his trembling hand, nervous beads of sweat trickling down his face. “When you say price… you don’t mean human sacrifices…do you, tentacle guy?”\n\n“Tentacle guy? Have you not been paying attention in this class? You should know and address me as Lord Elvari of Innsmouth.” \n\n“Elvari, please. This is their first lesson,” Gideon said, one palm on his forehead. “Why are you here? I swear this isn’t one of the rituals to summon you.”\n\n“Right. Anyway, what do you take me for? Some savage barbarian who consumes human flesh? If you’ll excuse me, I’ll be taking that box of donuts you’re hiding beneath your chair.” He extended a tentacle, snaking around the legs of the students until he grasped Gary’s box of donuts. “Consider that my price,” he declared, as he helped himself to a chocolate donut. “Now, any questions for me?”\n\nGideon rapped the lectern in the hall to pull attention back to him. “I’m the one conducting the class here, please don’t hijack it. And—” he stopped himself, deciding there was little point in asking what brought Elvari here. Considering his history of teleporting into rooms and phasing out of cars with no warning, the likely answer was going to be “because I can” or something to that extent.\n\nAnother student raised his hand. “What kind of god are you?”\n\n“Class, remember this is an introductory lecture to religious and mythological history, not an interview session with this mad god who randomly teleported himself in,” Gideon interjected, this time tapping the lectern with his ruler.\n\n“I’m a nice god who grants wishes. Would you like to make a wish?” he asked. “Please prepare the appropriate offering in exchange for my blessing. If you don’t have any suitable offerings, you have until three working days for your offering to reach me.”\n\n“Shelley, please don’t,” Gideon warned. “It’s a toss-up as to whether a blessing from him is actually beneficial or the blursed sort. Class, a fair warning, you are dealing with the Eldritch God of Madness, so do watch your words.”\n\n“Now, now, Gideon, I do have the madness within me mostly under control. You didn’t have to make it sound like I’m some kind of ticking time bomb.”\n\n“Can I have a happy meal?” she asked. \n\nGideon breathed a sigh of relief, confident this wish was simple enough that Elvari wouldn’t mess with it or produce some horrifying result that was awesome only in his eyes.\n\nA black portal appeared just above her desk and dropped a Happy Meal.\n\n“Frivolous, but I have purchased and teleported it in as you wished. Please remember to pay me back after class. No offering is required, only payment. Next question?”\n\n“If you’re an eldritch god just like prof said, why do you have a human face?” the next student asked.\n\n“I call it my ‘safe for your sanity’ face. It would be easy for me to drop this guise, but it wouldn’t be easy for any of you to recover after that. My former enemies could tell you more, but most of them killed themselves.”\n\n“Hi, Mr. Elvari, I’m Betty. You said something about alternate history classes with you earlier. Could you elaborate, maybe give a short introduction on the historical knowledge you possess? I really want to know what a god thinks of human history. I want to hear your account of our history.”\n\nGideon coughed loudly and announced that he would be resuming his lecture. This was his lecture, not Elvari’s. Enough of the delay from this unannounced surprise visit. He would be covering how humans and gods first established contact, then discussing the most common forms of rituals that were used to summon the gods. Rituals of old before the gods revealed themselves many years after the God Wars, and walked freely among mortals. Gods may now be contactable through modern technology and social media much like humans, but it was still important that humans never forgot the old ways.\n\n“I have a question.” A tentacle wiggled in the air.\n\n“Alright…Elvari, you can ask your question.”\n\n“Am I covered in this lesson?”\n\n“No. As I said, this is an introductory lesson.”\n\n“Am I part of the syllabus?”\n\n“No! It was forbidden to worship, summon or pray to you for a thousand years! You were only recently reinstated and allowed back into the Annals of the Gods, so you’re not in any learning materials here!”\n\n“I should go. I have critical feedback to write to your dean as your historical consultant. [After all the times I have verified ancient tablets, artifacts, and inscriptions for your faculty]( https://www.reddit.com/r/WritingPrompts/comments/156063r/wp_you_are_finally_awoken_from_a_long_long/jsyekzx/) and I don’t even get a single mention in your textbooks? I’m a little miffed, Gideon.”\n\nGideon did a little fist pump under the lectern when Elvari finally left through the portal he conjured in the lecture hall. Finally, he could run the lecture as intended, albeit a little rushed after the delay. When it was over, he dismissed the class, but not before telling all his students not to breathe a word about what happened today.\n\n----\n\n*\n\n“Gideon, I trust your first lecture with our university went well? Our students have generally submitted positive reviews and we’d like to know how you did it.”\n\n“It was nothing, I just ran through the slides I submitted for your approval…”\n\n\n“No, not that. The students are saying you summoned an actual god in the lecture hall. And they want him back again.”\n\n------------------------\n\n[Thanks for reading! Click here for more prompt responses and short stories featuring Elvari the eldritch god.](https://www.reddit.com/r/TregonialWrites/comments/11tkt9w/eldritch_god_elvari_series/)",
   "created_utc": 1690653416,
   "score": 17,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "jtytwl9",
   "message": "There are something about rituals that memorize the average person. A lot of people that take my class thinks it's easier to use chatgtp to write there stories for them.\n\n\nBut today is a long lab on summons. There are good and bad gods to try to convince. Some people think that all that they have to do to kill people with a sacrifice. \n\nOr need to get rare or expensive ingredients. Human flesh books are funny as a lot of preservation is needed to keep them from rotting with our current climate.\n\nThere are a ton of God's that have fallen down to our modern world. Gods of wilderness as we have explored places across the world are out.\n\n Gods of blood required gallons of blood is impossible along with some war gods. \n\nNeil Gaiman had it right that gods move as we bought them from our past societies. Gods that have too many locations of power are also out as they are shard's spread out and trapped. The Roman nameed of one of the best gods during the end of Roman city-states was OwO aka Thoth but the internet has transformed and trapped them.\n\nBut then it leaves us only gods with sacred animals. Well the expensive animals are out along with animals that need an aquarium to store. Well owls are out but oddly cats and some Raven's are safer than trying to get a coyote.\n\nThis means that we have a limited amount of God's to try. Everything can mostly be done with a cell phone as it supplying the power required to keep them on our plane of really. It's that or renting Tesla coils even with my savings that is out.\n\nIt leaves us with Fraya, Bastet , Morgan and Raven. And maybe more.\n\nA barbeque is like one big ritual with a ton of participation. This is why for a long lab. If we fall trying to summon we all get a good meal out of this.\n\nThe ritual worked but not in the way we intended. A limo pulled up. It was like a sorority came out of there. Modern day depiction can and do chang God's appearances... \n\nI never posted anything into the general listing of the class or that we were having a barbeque for a lab...........",
   "created_utc": 1690651587,
   "score": 4,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "ju0ba8l",
   "message": "If the university thought I was going to smile and keep teaching class as usual after this year's \"raises\" they had another thing coming. Don't get me wrong, I love anthropology. But two fuckin percent? Two percent to keep grading 200 papers a week and talking to a lecture hall that was half asleep and half thumbing through whatever the latest trendy app is.\n\nI already had my resignation letter written and ready to go for the end of the week. Figured its time to have some fun on my way out. I had the class spend the last few days comparing creation myths across the world and writing about how these stories differentiated cultures and societal structures. It was pretty common for many religions to have some kind of superstitious practice to yield better crops or provide protection against invaders etc. Today's task for the students was to bring in items related to the rituals they'd chosen to write about. My tight-lipped response to questions wasn't making the students any less confused. As far as I can tell, most of them figured there'd be a test today where they'd be asked to match the items brought in to the different civilizations they were a part of.\n\nHow boring.\n\nI mean, sure. Maybe if I was sticking around after this week it wouldn't be a bad idea. Honestly I was looking forward to seeing Nathan's reaction more than anything. Being a TA for my class was already one of the more laid back positions you could have. I graded most papers myself, so when I told him there wouldn't be any tests or papers this week he just nodded. Business as usual.\n\n\u0026amp;#x200B;\n\n\\--------------------------------------------------------------------------------------------------------------------------------\n\n\"I don't understand\"\n\nWho was this again? I didn't recognize her face so she must have been one of the students who was usually sleeping in the back of class.\n\n\"I want you to recreate the ritual you wrote about using the items you brought in.\"\n\n\"But..how am I getting graded on this?\" She still had the same puzzled look on her face.\n\nI gave her an encouraging smile.\n\n\"Don't worry about that. I'm sure you'll do fine.\"\n\nShe didn't do fine. By all accounts, it was an odd task but she clearly hadn't actually done the research on this particular ritual or even the civilization she was writing about. I'll give her credit though: I have no idea where you would even get horse hooves. The class listened to her stumble through a clearly ad-libbed explanation of what this ritual entailed and its purpose before awkwardly coming to a pause.\n\n\"..and that's how the Mexicans thought you could get more daylight hours\". She quickly grabbed her items and shuffled to her seat. At the back of class.\n\nHa, knew it. I stopped myself from smirking and jotted down a quick \"2/10\" in her column after Nathan pointed out her name to me. Her presentation was offensively inaccurate and clearly made up but you get some leniency for going first in my book.\n\nWe sat through a dozen more of these, some of which were actually shockingly detailed and accurate. I started feeling a little guilty about phoning it in but those thoughts were pushed to the side as our main event made his way to the front of class. Nathan leaned forward in his chair, putting his phone back in his pocket. Like everyone else he knew this would probably be the highlight of the day.\n\nJordan had always been a strange kid. A bulk of the students in this class were from other majors and just fulfilling one of their humanities requirements, but Jordan was part of the group of students that actually was an anthropology major. Even amongst that group he stood out. At some point Nathan and I just started giving him perfect scores without reading his papers. It was clear from the first few he submitted that he went into excruciating detail about each topic and delivered far beyond the requirements. His passion for the subject basically leapt off the pages, but unfortunately in person he was rather poorly adjusted.\n\n\u0026amp;#x200B;\n\n\\--------------------------------------------------------------------------------------------------------------------\n\n*Thud*\n\nJesus how much did that sack weigh?\n\nJordan grabbed some smaller bags out of the sack and then pulled the sack down to the ground revealing what had essentially caused a minor earthquake.\n\nIt looked like a classic witch's cauldron from a campy 80s horror movie. The black exterior was shiny but also clearly quite old with plenty of dents and scratches. The entire thing must have weighed at least fifty pounds. Jordan started reaching for one of the smaller bags he set aside before I interrupted him.\n\n\"Uh Jordan do you mind giving us some background before diving in?\"\n\nHe stared blankly back at me for a solid ten seconds.\n\n\"Ok. Zoroastrianism is believed to have originated in around 2000 B.C. It has evolved over the millennia but at its core, there is Ahura Mazda who is the supreme God that is in conflict with the embodiment of evil Angra Mainyu. Because of his destructive nature, some groups would make offerings and rituals to Angra Mainyu in hopes of using him as a weapon on their enemies.\"\n\n\"...now we're talkin.\" I heard Nathan mutter. He craned his neck trying to get a better look at what was in the other bags.\n\nJordan went to work, describing the various ingredients he brought as he poured them into the cauldron. Nothing particularly creepy, at least by ritual standards. It was your standard mix of bone powder, feathers, flower petals and the like.\n\n\"Woah hold on what's that?\" Nathan interjected as Jordan poured a liquid coming out of what looked like an IV bag into the cauldron.\n\n\"This is a key ingredient. Peacock blood. Angra Mainyu is said to have been the creator of peacocks while Ahura Mazda created all other forms of life.\"\n\nThe lecture hall perked up in a mix of disgust and curiosity at the same time. Some of the students in the back woke up their sleeping classmates so they wouldn't miss out on the freak show happening below. Undoubtedly, Jordan would be getting another perfect score here but this was starting to get a little unnerving.\n\n\"This ingredient isn't  listed in any of the rituals I studied, but my grandmother is one of the few practitioners in modern day and insists that there are mistranslations and that it should be included.\"\n\n\"Is that uh....ethically sourced?\" I asked, only half-joking.\n\nJordan either ignored me or pretended not to hear as he finished pouring the rest of the blood into the cauldron. He brought out a small notebook and started reading from it in some presumably ancient language. As he finished he took out a pair of scissors, grabbed a fistful of his overgrown hair and snipped. Several of his classmates laughed in disbelief as he dropped his hair into the cauldron.\n\nEverything went dark in the lecture hall.\n\n\"Looks like it worked!\" Nathan jibed. The class started snickering and I couldn't help smiling to myself as well. Several moments passed before the lights flickered back on.\n\n\"Okay everyone lets move on to the next presenta---WHAT THE FUCK?!!\"\n\nA long yellow talon reached out of the cauldron as the class watched in disbelief. The talon grabbed onto the edge of the cauldron and pushed itself and its owner out onto the floor. The thing shook itself, spraying the blood it was covered in onto students in the front row who yelped. As the blood was removed it revealed a deep blue body. The bird's feathers then fanned out revealing the unmistakeable \"eyeball\" pattern of a peacock.\n\nAnd then each of the eyes moved.\n\nBlack tendrils shot out from each of the thousand eyes as students ducked behind their desks or ran towards exits. Several of those who were too petrified to move were impaled by the tendrils. The shrieking began immediately after. Ducking behind my podium, I looked over at the TA's desk and saw a lifeless bloody hand sprawled out. A thunderous stomping shook the ground as the being grew in size and made its way to the exit, giving off a deep malevolent laugh that echoed.\n\nEventually the laughter and stomping grew fainter and ceased entirely. Trembling, I looked out over the podium. Bodies were strewn everywhere. A few students were seemingly unharmed but all of them had the thousand-yard stare of someone who would never fully recover. It took me an eternity to start processing and planning what to do next.\n\nJordan. Jordan should have some answer.\n\nI scanned across the room and found him amongst the dead.\n\n\"Any chances one of you was going to try to summon Ahura Mazda?\"",
   "created_utc": 1690674091,
   "score": 1,
   "submission_id": "15cssr8"
  },
  {
   "comment_id": "ju0mf8m",
   "message": "“Alright, run this by me one more time” Said the very annoyed Apollo, taking another swig of wine. “You assholes pulled me out of my retirement by *complete fucking accident,* because you thought that the ancient traditions of my worshippers just… weren’t real?”\n\n“Uh… yeah. I guess so…” I say, embarrassed, and not a little terrified. \n\nThe god lets out an exasperated sigh. “Whatever.” He says. “But I’m not leaving here without taking an offering for the inconvenience. Dionysus was about to break out the good stuff before you guys called me here.”\n\n“Well…” I say, “I don’t really have anything.” I look to my students, “Does anyone else have something for our guest here?”\n\nOne student, Jeremy, raises his hand. “Question!” he says.\n\n“What’s your question, Jeremy?”\n\n“Can *I* be the offering?”\n\n“No Jeremy, you cannot be the offering.”\n\n“Damn…” Jeremy says under his breath. \n\nA few awkward moments of silence pass before another student speaks up, Sarah. \n\n“I’ve got a bag of Cheetos, would that work?”\n\nThe god of the sun stared at her for a moment, perplexed, and then answered. \n\n*”What the fuck is a Cheeto?”*\n\nSarah stood up, walked towards Apollo, and handed him the bag. The god picks one of the Cheetos out of the bag, and eats it. \n\n“Hmm… yeah.” He says as he pops another into his mouth, “These’ll work.”\n\nSuddenly there’s a bright flash, and the god disappeared back to Olympus.",
   "created_utc": 1690679312,
   "score": 1,
   "submission_id": "15cssr8"
  }
 ]
}