{
 "submission_id": "15csg7m",
 "title": "[WP] \"Why do you always do things the hard way? Just cast a spell or something!\" \"Unfortunately for me, I don't have that kind of luxury.\"",
 "selftext": "",
 "created_utc": 1690637568,
 "permalink": "/r/WritingPrompts/comments/15csg7m/wp_why_do_you_always_do_things_the_hard_way_just/",
 "score": 24,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15csg7m/wp_why_do_you_always_do_things_the_hard_way_just/",
 "comments": [
  {
   "comment_id": "jtxv607",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690637569,
   "score": 1,
   "submission_id": "15csg7m"
  },
  {
   "comment_id": "jtxyvaf",
   "message": "“Why do you always do things the hard? Just cast a spell or something!” \n\nUnfortunately, I don’t have that kind of luxury. The man I front of me unknowingly taunting me, speaks from ignorance. They all do. I’m an anomaly in this world, void of magic and any ability to harness it. \n\nWhen I first appeared here after my accident I thought I had hit the jackpot. I’d read so many stories of people on earth reincarnating into worlds like this, places so full of magic and adventure that they practically burst at the seems. Though, after aging up a few I quickly realized how different I was. The creatures here have a natural connection with internal and ambient mana. It allows them to do wondrous things, perform miracles with a few short sentences. \n\nMy issues was something unheard of in this land. For whatever reason, I have absolutely no connection with mana. As if this world can tell I’m artificial, a foreign infection, I hold no natural connection with mana and subsequent magical systems. I’d tried everything up until this point, I’ve seen healers, studied the arcane until my eyes felt like souring in my skull, to no avail.\n\nThis was all about to change, soon. \n\nOver the last decade I had gathered arcane artifacts in the form of mana crystals. These devices house excess mana and, with the right spells and architecture, allow for miraculous things. Having no magical ability to assist me, I slowly searched these foreign lands, mining, purchasing, stealing as many as possible.\n\nTonight was the night that my years long plan would bare fruit. Though my connection to mana is non existent, I’ve learned ways around the natural system of mana circulation, both Internally and externally. I’ve paid a few freelance mages to recite some script that I’ve developed.\n\nIf all goes well tonight, I won’t just have control over internal and ambient mana, I’ll access to all of it. I’ve suffered enough in this world. Watching people live out my fantasy day after day, taking this god like power for granted. No longer. After tonight, I’ll hold all the power. I’ll leave none of it for them. \n\nI will be their god. \n\n\nNote: sorry for typos, wrote this on mobile.",
   "created_utc": 1690639186,
   "score": 1,
   "submission_id": "15csg7m"
  }
 ]
}