{
 "submission_id": "15cucfe",
 "title": "[WP] You're a ghost who fell in love with a living person who lives in the house you haunt. One day, their ex breaks in.",
 "selftext": "",
 "created_utc": 1690642704,
 "permalink": "/r/WritingPrompts/comments/15cucfe/wp_youre_a_ghost_who_fell_in_love_with_a_living/",
 "score": 37,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cucfe/wp_youre_a_ghost_who_fell_in_love_with_a_living/",
 "comments": [
  {
   "comment_id": "jtz0nor",
   "message": "\r  \nI’ve been dead for years, quietly watching over this house that I used to call home. I guess some would call it “haunting”, but I simply never felt the urge to leave this place full with fond memories of my life. The faint sharpie lines on the kitchen door frame that recorded my height as I grew, the worn down floorboards that still squeak when stepped on. I know every nuance of this place, every scuff on the walls, every hiding spot that would secure victory in hide and seek.\n\nIt’s comfortable, safe, and a place I want to spend the rest of eternity. I don’t get bored, as new people move in and I get to observe them in their everyday lives. Just because I’m a ghost doesn’t mean that I have to be writing messages with blood on the walls or knocking things over randomly. I don’t see the point in bothering the living, they just want to live in these walls like I did some years ago. \r  \n\n\nThe newest resident in my home was a woman named Sunny, and as cliché as it may seem, she lives up to her name perfectly. Her bouncy curls that would move with every step she took, her wide toothy smile that exuded kindness and even the way she decorated my home with bright colors. I’ve watched her family try and persuade her to update the house, repaint the walls, redo the floors… The whole works. She always refused, saying she enjoyed the coziness and history of the house. Maybe that’s why I grew so fond of her so quickly. In the past people have tried to renovate my home, and it was in those cases I have to admit I got up to some “haunting” that would eventually drive them out. \n\n\r  \nBut she never wanted to change anything, of course she put up her own decorations and filled the shelves with small trinkets, but nothing that would ever drastically change the house itself. It’s like she knew I was here, and understood I just wanted my home to stay my home. Every minute I would observe her, the more my “heart” would grow warmer. I’m not entirely sure if ghosts have hearts, but regardless I was filled with such warmness. Sunny was special in so many ways, that slowly I began to fall in love with her. I hadn’t felt this way since I was alive, but once I realized that warmth was affection, I couldn’t go back to how I was before. \n\n\r  \nI tried to communicate with her eventually, to let her know how I felt and to show how special she was, but that proved to be difficult. Any message I would try to leave, I wouldn’t have enough courage to actually let her see it. Small notes I wrote would be torn up and thrown away in her trash can, and I didn’t have the bravery to try and reveal myself to her. \n\nI died in a fire, just outside my home, and it left even my ghostly appearance to be disfigured and “ugly”. My transparent skin was full of imperfections, my hair mostly burnt off. I’ve tried for years to warp and change my appearance, hoping that some ghostly power would allow it, but alas I never came up with a solution.\r  \n\n\nIt felt like torture, this woman that I loved would never even know I existed. I should’ve driven her out then, to escape the helplessness I felt and the overwhelming feelings I hadn’t had to deal with since I was alive. Every moment I watched her was filled with warmth, and when she left the house I felt terribly cold. I decided I needed to distance myself, if only to protect my sanity. \r  \n\n\nIt was a cold and rainy autumn night when I heard the front door being broken down. Alert, I went to investigate only to find Sunny being threatened by a strange man I had never seen before. He was yelling at her angrily, and through context clues I realized he must be her ex. I remembered a conversation she and her mother had almost two years prior, about the reason Sunny had moved here in the first place. Her abusive ex. I watched him get closer to her and angrier before she bolted away from him. I knew I couldn’t let anything happen to her, the woman I loved from a distance, separated by the barrier of death. \r  \n\n\nAs he chased after her I tightly grabbed his shoulder and threw him into a wall. Confused, he looked around to see who had done that to him, and his blood ran cold when he saw me. Disfigured, floating, and enraged. It took less than a second for him to turn and bolt out of the house, cursing me as he ran away terrified. Sunny, having heard the commotion, was watching from afar and spotted me. I felt my heart sink to my stomach, as her face morphed into another terrified look as she fled the house. Thankfully, her ex was already gone as she hopped into her car, but I regretted that that was the last time I ever saw her face. Terrified, disgusted and horrified. That look has been burned into my mind for the many years that have passed now.\r  \n\n\nI am alone in my house, it is barren and nobody has lived here in quite some time now. Sunny’s family were the ones to move everything she owned out of the house, and I hope she’s doing well wherever she ended up. I still love her, even if she will only know me as the terrifying ghost that forced her to leave her home. I know I should leave this place, move on to the great beyond, but it’s the hope of her coming back that keeps me here. Just to see her smile one more time, I will wait an eternity for her.\r  \n\n\n(Note, I haven't written in a while so I hope this is alright!!!)",
   "created_utc": 1690654279,
   "score": 5,
   "submission_id": "15cucfe"
  },
  {
   "comment_id": "ju010ti",
   "message": "Alice often wondered if she had in part contributed to the breakup between Lisa and Ben. After they had moved in, their relationship became strained. The house belonged to Alice – or at least it did once upon a time. It was her duty to protect it by driving out the living. As a result, arguments broke out more often, and Ben started spending more time with his friends than at home.\n\n“No, Mom. I’m doing alright. Work is stable and the mortgage is manageable. The agent was eager to close, and I got a good deal out of it. Ben had his hands full with other bills at the time, so the house is under my name.”\n\nLisa sat in the dimly lit living room talking on her phone. The television flickered as the evening news played, but the speakers were muted. There were a few papers scattered on the coffee table before her – bills. The more Alice learned about living in the modern age, the more she was content with being a ghost.\n\nLisa let out a huff. “No, I didn’t call the plumber. The leaking stopped and the lights went back to normal. I talked to some of my neighbors, and they think it was just due to the old house. I’ll get the pipes fixed when I have a bit of extra cash. Not much I can do about the powerlines though.”\n\nThose ‘issues with the utilities’ were a result of Alice’s hauntings. While Lisa saw them as aesthetic and part of the house’s charm, Ben hated them. He was the type to want to fix everything himself and got angry when he couldn’t. Those frustrations latched onto Lisa as she was the one responsible for the move. But in the end, Ben’s departure wasn’t entirely Alice’s fault. She had merely unearthed what was already hidden beneath the loving veneer.\n\n“I promise, I’ll call you if I need help paying for any renovations. But for now, everything seems to be working fine. Goodnight, Mom.” Lisa ended the call.\n\nIt was strange. Once Ben had moved out, the urge to disrupt Lisa’s life faded. She couldn’t even remember the last time she had thrown anything. They were certainly very different in Alice’s eyes. Lisa had a fondness for the gothic architecture of the house other owners didn’t have. And Ben, at the time, was simply Lisa’s lover. His incessant need to fix Alice’s attempts to drive them from the house only irritated her further.\n\n*Lisa, though… she’s… nice.*\n\nAlice had watched Lisa for months now. Lisa worked in banking and was fairly well off, as far as she could tell. Yet despite having the money and the means, Lisa hadn’t pushed through any major changes to the home. At this point, Alice wondered if she would mind. The old place needed maintenance after years of neglect.\n\nA sigh from Lisa broke Alice out of her thoughts. “I’ll deal with this tomorrow.”\n\nLisa turned in for the night, leaving Alice to wander the darkened halls of her home. Around midnight, a noise caught her attention – someone had opened the front door. Alice was there in an instant. Two figures crept through the darkened hallway.\n\nOne whispered, “Are you sure this is a good idea?”\n\n“This place is falling apart. Too easy to get inside. And I know I saw an expensive-looking clock. Besides, Lisa goes to bed early.”\n\nAlice bristled as she recognized the second voice.\n\n*Ben. What are you doing back here?*\n\nThe hatred for the living that had abated in the past couple of months returned with a vengeance. She reached out and pulled on the coat rack next to the front door. It fell with a clatter, catching Ben’s friend in the back.\n\n“What the hell!”\n\nBen hissed back, “Shut up!”\n\n“Something hit me!”\n\n“I told you the place was falling apart. The coat rack fell on you.” Ben kicked the offending piece of furniture aside. “Now, shut up and come on!”\n\nAlice nearly snarled as they moved into the living room and began rummaging around.\n\n“Is that the clock?” Ben’s friend pointed to the fireplace.\n\nBen glanced over. “Yeah, put it in the sack. I found the medals that her old man owned as well.”\n\nAs Ben’s friend reached for the clock, Alice acted again. This time, the heavy appliance toppled off the ledge. One corner of the base cut into the man’s forehead, eliciting a painful cry.\n\n“Mikey! I said shut up!”\n\nBut Mikey was delirious. “My head! I’m bleeding. What the hell hit me?”\n\nAlice pushed over a stack of books, further battering the injured man.\n\n“I’m being attacked! There’s something here, man!” Mikey tried to run only to trip over the rug and bash his head into the brick wall. “I didn’t sign up for this!”\n\n“Mikey! Get back here!”\n\nBut Ben’s angry hisses were to no avail as Mikey stumbled out the front door. Without even waiting for Ben, he got in their car and swerved down the street. A few seconds later, there was a faint crash in the distance.\n\n“Shit!” Ben kicked the wall. “This stupid building’s been nothing but a curse!”\n\n“Ben?”\n\nThe commotion had woken Lisa, who had crept downstairs in the interim. She held a bat in one hand, accusatory eyes watching Ben warily.\n\n“Uh… hey, babe. Can’t believe you’re still living in this hovel. I, uh, just came to pick up something and – ”\n\nLisa did not look impressed, and Alice’s patience had just about run thin.\n\nShe leaned in and whispered in his ear. “Leave.”\n\nBen’s face turned white as a sheet. His limbs trembled as his eyes darted around the room. The living tended to see the supernatural out of the corners of their eyes. And for a split second, he saw Alice. With a strangled yelp, he turned and fled after his friend. A moment later the hallway was silent.\n\nLisa squinted through the darkness directly at Alice. “Is someone there?”\n\nAlice froze. In her anger, her voice had slipped out and revealed her presence. She had spent years wandering this earth in utter loneliness. Now, the mere thought of Lisa’s rejection left her paralyzed. She stayed frozen even as Lisa inched forward.\n\n“Hello?” Lisa swiped her hand through the air.\n\nBut the living could not interact with the dead, and Lisa’s hands passed through Alice’s torso. Despite this, Lisa let out a tiny shudder as if chilled. Alice’s eyes widened, but she did not reply. After a moment, Lisa shook her head and relocked the front door. She then wedged a chair under the handle to prevent Ben from getting back inside. Alice watched Lisa move through the darkened hallway in silence.\n\n*What if she moves? People usually move when they’re attacked in their homes. That was what I wanted... right?*\n\nAfter making sure the windows were also locked, Lisa went to make a phone call to report the break-in. Alice was still in the entryway when Lisa returned. There was still a suspicious look on Lisa’s face as she tried to see something that wasn’t there.\n\nThen she said, “For what it’s worth… thank you.”\n\nWith that, Lisa went back to bed. Though she was dead, Alice let out a breath she didn’t know she was holding.\n\n*I hope she stays.*\n\nFor now, she’d be content watching over the target of her love.\n\n...\n\nDawdled a bit too long and noticed someone else had responded with a similar idea. Hopefully this is distinct enough.\n\nIf you're interested in my works, the archive of my various writing responses can be found in my writing portfolio, link through my profile. There's also an original story, The Crossroads.\n\nThanks for reading.",
   "created_utc": 1690669395,
   "score": 1,
   "submission_id": "15cucfe"
  }
 ]
}