{
 "submission_id": "15cuq3c",
 "title": "[WP] \"Yeah, the human body is like... 70% water. Did... Did you not know that...?\"",
 "selftext": "",
 "created_utc": 1690643690,
 "permalink": "/r/WritingPrompts/comments/15cuq3c/wp_yeah_the_human_body_is_like_70_water_did_did/",
 "score": 38,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cuq3c/wp_yeah_the_human_body_is_like_70_water_did_did/",
 "comments": [
  {
   "comment_id": "jty9kea",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690643691,
   "score": 1,
   "submission_id": "15cuq3c"
  },
  {
   "comment_id": "jtyntej",
   "message": "(This may be a bit bad. Writing isn't my strong suit \u0026amp; this is my first post here.)\n\nI wake up.\n\nI'm sat here on the soft, white chair, surrounded by tiled walls akin to those of my local downtown subway. I remember my parents telling me once, \"these are called subway tiles. Because they are used in subways.\"\n\nBut my thoughts are interrupted by conversation from outside the wall. It was a language unintelligible to me, sounding almost like if two kids were speaking pig latin.\n\n\"Ajañ kaê nahtu?\" \\[70 percent?\\]\n\n\"Kaéá natú é.\" \\[Majority is danger.\\]\n\n\"É?\" \\[Danger?\\]\n\n\"Najpóë.\" \\[Terminate.\\]\n\nWhat kind of hellish language is that? Nevermind that. The room is covered in wires. Some are attached to me by electrodes. Some are running through the walls towards the lights. Some are going through seemingly invisible holes in the wall.\n\nThe discussion continues. It's more nonsense.\n\n\"Káá tyë?\" \\[How through?\\]\n\n\"Ñak?\" \\[Wall?\\]\n\n\"Á.\" \\[Affirmative.\\]\n\n\"Yüeté.\" \\[Smash.\\]\n\n\"Á.\" \\[Affirmative.\\]\n\nI wanted to rip out the wires, but I can't. The chair has me under restraints. Metal arcs covered my arms as they laid on the armrest, and my ankles as my legs were practically at a 90-degree angle against the chair.\n\nSuddenly, there's almost an explosion of some kind. Like someone tried to knock down the door, but there was a wall. Smoke, gas, dust, and possibly more, fill the room. I instinctively start coughing. I try to see through the clouds, meeting eyes with a strange figure. I could only tell a few features before it rushing at me, holding some kind of metallic lazer pointer. It looked like it was almost human, but something was... off. The skin's texture was grainy. The eyes weren't detailed enough. It looked like it was some kind of virtual-reality simulation, but in the real world. The hair wasn't-\n\n...\n\n  \n\"Ähj najpóë.\" \\[Done terminating.\\]\n\n\"Háé é.\" \\[Humans are danger.\\]\n\n\"Séé najpóë?\" \\[Terminate all?\\]\n\n\"Á.\" \\[Affirmative.\\]\n\n\"Prétç N.A.H.\" \\[Invoke Protocol Terminate-All-Humans.\\]\n\n\"Á.\" \\[Affirmative.\\]",
   "created_utc": 1690649353,
   "score": 21,
   "submission_id": "15cuq3c"
  },
  {
   "comment_id": "jtyutho",
   "message": "\"Yeah, the human body is like... 70% water. Did... Did you not know that...?\"\n\nDaishin restrained his attacker, bending the blood in their body. Had Daishin been a second slower in dodging, he would have been bisected by the saw-like projectile the metalbending assassin had launched. The gash in Daishin's side healed almost immediately. Strain as his attacker might, they could not break free.\n\n\"W-what!?\" The assassin had been surprisingly unprepared for this.\n\n\"You attacked a renown waterbending medical doctor without knowi- [sigh] Who sent you?\" Daishin skipped to the important question. The assassin's ignorance of Daishin's abilities told Daishin that the man had been sent on a suicide mission.\n\n\"L-let me g-ahhh!\" The man's defiance resulted in his body being painfully contorted. \"I- I c-cant t-tel AGHHH! I don't know! I don't know! Everything was anonymous!\" \n\nThe assassin dropped to the floor once Daishin released them. The water despenser within Daishin's study burst open as Daishin bended its contents to form heavy shackles of ice that bound his attacker's arms and legs. \n\nDaishin used his nearby telephone to alert the authorities of the situation. \n\n\"The authorities will arrive shortly. I'd advise sitting tight.\" Daishin suggested to his attacker. \n\nHe placed the phone on its receiver and surveyed his wrecked study.\n\nWhile Daishin did not know who wanted him gone, he had a good idea of why. The doctor withdrew a coin from his pocket and flipped it into the air. He caught the coin in his palm; engraved on its face was the flower symbol from an outdated board game known as 'Pai Sho.' The White Lotus was being targeted.",
   "created_utc": 1690651941,
   "score": 163,
   "submission_id": "15cuq3c"
  },
  {
   "comment_id": "ju01nai",
   "message": "I woke up next to my friend -Alex- who was sitting there for the last hour waiting, bursting to tell me a fact\n\nMe: \"wha-\"\nAlex: \"did you know that less then 10% of the waters kn this planet are un-explored?\"\nMe: \"Yeah, and did you know that humans are mainly water?\"\nMy friend sat there in shock\nAlex: \"what.\"\nMe: \"Yeah, the human body is like... 70% water. Did... Did you not know that...?\"\nAlex was unable to speak be was in that much shock.\n\nA few hours later we went to class and Alex kept asking out teacher -Mr. Whart- if that fact was true\nAlex: \"Sir, is it true that the human body is 70% water?\"\nMr. Whart: \"Pretty much, its 70-80% though\"\nAlex had a mental breakdown after.\n\nThe end.",
   "created_utc": 1690669682,
   "score": 24,
   "submission_id": "15cuq3c"
  },
  {
   "comment_id": "ju12zb0",
   "message": "Sylvia gleamed with pride as she presented her newest prized invention to the committee. It was a handheld box with a cone shaped coil contraption on one end, and and blue switch on top.\n\n\"As I'll demonstrate here with this glass of water, if you just point our hydroactivating emitter towards the water, and press this button, all the water in this glass will instantly evaporate!\"\n\nThe crowd gasped and applauded as the scientist's promise was immediately fulfilled, leaving an empty glass of water on a table on stage for all to see.\n\n\"Not to leave you hanging with just one demonstration,\" Slyvia continued \"I'll have my intern, Aaron, bring us a jug of water, so we can demonstrate the strength of my device.\"\n\nAaron appeared from the side of the stage, struggling to hoist a 55 gallon jug of water. Just as he was able to place the jug on the demonstration table, his right hand slipped and the water spilled out all over Aaron and the floor. \n\n\"Oh Aaron! I hope you're okay! But I have good news. With my device, we can dry you off immediately. Please, hold still.\" Slyvia pointed her invention towards the drenched intern and flipped the switch.\n\nIn less than a second, the young and eager intern shriveled from a gangly 6'2\" to a shrunken unrecognizable pile of hair, nails, powdered skin, and dessicated innards.\n\nSlyvia shrieked in horror. \"How could this happen? This was only supposed to evaporate the water.\"\n\nA concerned voice carried from across the room.  \"Yeah, the human body is like... 70% water. Did... Did you not know that...?\"",
   "created_utc": 1690687558,
   "score": 29,
   "submission_id": "15cuq3c"
  }
 ]
}