{
 "submission_id": "15cucfe",
 "title": "[WP] You're a ghost who fell in love with a living person who lives in the house you haunt. One day, their ex breaks in.",
 "selftext": "",
 "created_utc": 1690642704,
 "permalink": "/r/WritingPrompts/comments/15cucfe/wp_youre_a_ghost_who_fell_in_love_with_a_living/",
 "score": 21,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cucfe/wp_youre_a_ghost_who_fell_in_love_with_a_living/",
 "comments": [
  {
   "comment_id": "jtz0nor",
   "message": "\r  \nI’ve been dead for years, quietly watching over this house that I used to call home. I guess some would call it “haunting”, but I simply never felt the urge to leave this place full with fond memories of my life. The faint sharpie lines on the kitchen door frame that recorded my height as I grew, the worn down floorboards that still squeak when stepped on. I know every nuance of this place, every scuff on the walls, every hiding spot that would secure victory in hide and seek.\n\nIt’s comfortable, safe, and a place I want to spend the rest of eternity. I don’t get bored, as new people move in and I get to observe them in their everyday lives. Just because I’m a ghost doesn’t mean that I have to be writing messages with blood on the walls or knocking things over randomly. I don’t see the point in bothering the living, they just want to live in these walls like I did some years ago. \r  \n\n\nThe newest resident in my home was a woman named Sunny, and as cliché as it may seem, she lives up to her name perfectly. Her bouncy curls that would move with every step she took, her wide toothy smile that exuded kindness and even the way she decorated my home with bright colors. I’ve watched her family try and persuade her to update the house, repaint the walls, redo the floors… The whole works. She always refused, saying she enjoyed the coziness and history of the house. Maybe that’s why I grew so fond of her so quickly. In the past people have tried to renovate my home, and it was in those cases I have to admit I got up to some “haunting” that would eventually drive them out. \n\n\r  \nBut she never wanted to change anything, of course she put up her own decorations and filled the shelves with small trinkets, but nothing that would ever drastically change the house itself. It’s like she knew I was here, and understood I just wanted my home to stay my home. Every minute I would observe her, the more my “heart” would grow warmer. I’m not entirely sure if ghosts have hearts, but regardless I was filled with such warmness. Sunny was special in so many ways, that slowly I began to fall in love with her. I hadn’t felt this way since I was alive, but once I realized that warmth was affection, I couldn’t go back to how I was before. \n\n\r  \nI tried to communicate with her eventually, to let her know how I felt and to show how special she was, but that proved to be difficult. Any message I would try to leave, I wouldn’t have enough courage to actually let her see it. Small notes I wrote would be torn up and thrown away in her trash can, and I didn’t have the bravery to try and reveal myself to her. \n\nI died in a fire, just outside my home, and it left even my ghostly appearance to be disfigured and “ugly”. My transparent skin was full of imperfections, my hair mostly burnt off. I’ve tried for years to warp and change my appearance, hoping that some ghostly power would allow it, but alas I never came up with a solution.\r  \n\n\nIt felt like torture, this woman that I loved would never even know I existed. I should’ve driven her out then, to escape the helplessness I felt and the overwhelming feelings I hadn’t had to deal with since I was alive. Every moment I watched her was filled with warmth, and when she left the house I felt terribly cold. I decided I needed to distance myself, if only to protect my sanity. \r  \n\n\nIt was a cold and rainy autumn night when I heard the front door being broken down. Alert, I went to investigate only to find Sunny being threatened by a strange man I had never seen before. He was yelling at her angrily, and through context clues I realized he must be her ex. I remembered a conversation she and her mother had almost two years prior, about the reason Sunny had moved here in the first place. Her abusive ex. I watched him get closer to her and angrier before she bolted away from him. I knew I couldn’t let anything happen to her, the woman I loved from a distance, separated by the barrier of death. \r  \n\n\nAs he chased after her I tightly grabbed his shoulder and threw him into a wall. Confused, he looked around to see who had done that to him, and his blood ran cold when he saw me. Disfigured, floating, and enraged. It took less than a second for him to turn and bolt out of the house, cursing me as he ran away terrified. Sunny, having heard the commotion, was watching from afar and spotted me. I felt my heart sink to my stomach, as her face morphed into another terrified look as she fled the house. Thankfully, her ex was already gone as she hopped into her car, but I regretted that that was the last time I ever saw her face. Terrified, disgusted and horrified. That look has been burned into my mind for the many years that have passed now.\r  \n\n\nI am alone in my house, it is barren and nobody has lived here in quite some time now. Sunny’s family were the ones to move everything she owned out of the house, and I hope she’s doing well wherever she ended up. I still love her, even if she will only know me as the terrifying ghost that forced her to leave her home. I know I should leave this place, move on to the great beyond, but it’s the hope of her coming back that keeps me here. Just to see her smile one more time, I will wait an eternity for her.\r  \n\n\n(Note, I haven't written in a while so I hope this is alright!!!)",
   "created_utc": 1690654279,
   "score": 1,
   "submission_id": "15cucfe"
  }
 ]
}