{
 "submission_id": "15cwe6p",
 "title": "[OT] SatChat: How did you find WritingPrompts? (New here? Introduce yourself!)",
 "selftext": "[**SatChat! SatChat! Party Time! Excellent!**](https://gfycat.com/FirsthandMadBeardedcollie)\n\nWelcome to the weekly post for introductions, self-promotions, and general discussion! This is a place to meet other users, share your achievements, and talk about whatever's on your mind.\n\n## Suggested Topic\n\n**How did you find WritingPrompts?**\n\n(*Repeat topic. Have any suggestions for new ones?  Let us know below!*)\n\n## More to Talk About\n\n* New here?  Introduce yourself! See the sticky comment for suggested intro questions\n* Have something to promote? (Books, subreddits, podcasts, etc., just no spam)\n* Suggest topics for future SatChats!\n\n *Avoid outright spam (don't just share, chat) and not for sharing full stories*\n\n---\n\n[**Summer Challenge!**](https://redd.it/156ob1j) | [**Apply to be a Mod**](https://redd.it/8zifl5) | **r/WPCritique** | [**Discord Server**](https://discord.gg/writingprompts) (Weekly campfires every Wednesday at 6 pm CST!)",
 "created_utc": 1690647965,
 "permalink": "/r/WritingPrompts/comments/15cwe6p/ot_satchat_how_did_you_find_writingprompts_new/",
 "score": 7,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15cwe6p/ot_satchat_how_did_you_find_writingprompts_new/",
 "comments": [
  {
   "comment_id": "jtykb2z",
   "message": "**Tell us about yourself!**\n\n* Where do you live (State / Country)?\n* Preferred pronouns?\n* How long have you been on Reddit?\n* How long have you been on r/WritingPrompts?\n* Do you use r/WritingPrompts to read or write?\n* Writers:\n * How long have you been writing?\n * What is your writing motivation?\n * What programs do you use to write?\n * How fast can you type? [Try 1 minute on Aesop's fables](https://www.typingtest.com/PromoD/select.html)\n* Readers: \n * How do you find prompt responses to read?\n * Do you also write?\n * if not, why haven't you tried?\n* Want to share a photo? [See our Photo Gallery!](http://www.reddit.com/r/WritingPrompts/wiki/pics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690647965,
   "score": 1,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtylbm5",
   "message": "I think it was a default sub at the time we joined. So we were here a lot four years ago. We moved away for a while cause we were struggling with writing, then returned after we purged a lot of our other subs.",
   "created_utc": 1690648355,
   "score": 7,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtylhgl",
   "message": "I've got a super simple answer for this one:\n\nI googled \"Writing Prompts\" and scrolled down the list a bit :D\n\nA bit more depth, I suppose, comes from me having some experience with Reddit due to the Warframe fandom and D\u0026amp;D, so when I saw a reddit result pop up I thought \"Oh this could be helpful!\"\n\nI'd been trying to get back into writing for a bit and was using various online prompt generators and whatnot to stoke ideas.  Most of them were fairly fleeting or mundane so I just kept going down the list of results until this sub popped up.  The first prompt I saw was about [harvesting giant spider silk](https://www.reddit.com/r/WritingPrompts/comments/11ga1le/wp_it_was_a_lucrative_business_spider_silk/) and so I *ran* with it :P  Then I looked at more prompts, found the discord, and the rest is history!\n\n**Summer Challenge Progress (83.26%)**",
   "created_utc": 1690648423,
   "score": 3,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtypq9x",
   "message": "I saw a few of the really popular prompts end up on the front page and that got me started reading the stories on occasion. It took quite a while before I actually started seeking it out to do my own writing though.",
   "created_utc": 1690650059,
   "score": 3,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtyrw1m",
   "message": "I stumbled across [this prompt](https://www.reddit.com/r/WritingPrompts/comments/lwgj8d/wp_as_a_former_chosen_one_you_saw_the_signs_when/) while browsing Reddit's popular feed, and that interested me enough to take a look at the subreddit. And then while I was scrolling a few days latter for stuff to read, I saw a prompt that I just *had* to write for, even though I hadn't tried writing any fiction in seven or eight years.",
   "created_utc": 1690650823,
   "score": 3,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtyyhid",
   "message": "I was bored. I wish I could say it was something deeper or more interesting. I was bored - waiting for one of the kids at an activity or something. \n\nI use to write short stories in high school. I did like 5 or 6 of them but nothing more. Now, in my late 40s, I have started writing again. I am loving it. \n\nI think my first one was:\n\nhttps://www.reddit.com/r/WritingPrompts/comments/re6jm8/wpyou_never_knew_why_but_the_shadow_creature_at/?utm_source=share\u0026amp;utm_medium=ios_app\u0026amp;utm_name=ioscss\u0026amp;utm_content=1\u0026amp;utm_term=1\n\nI did 80 stories in all of 2022. I think I am over a 100 this year. \n\nIt is my secret guilty pleasure. Almost no one knows I write. Find a prompt and get lost in a made up world for an hour or two then back to reality.",
   "created_utc": 1690653395,
   "score": 3,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtz0n6l",
   "message": "When i was first making my Reddit account, it told me i had to subscribe to a minimum of five subReddits.  I poked around the list for a bit, and this looked like a logical one to take, given that i joined Reddit at all to do some writing over on r/HFY.",
   "created_utc": 1690654273,
   "score": 2,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtz2j4w",
   "message": "An amazing-writer-friend of mine recommended prompts to help me practice, and linked me here. \n\nAmusing prompts really inspire me to respond, so I'll be here a while, self-improving!",
   "created_utc": 1690655053,
   "score": 3,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtz4ex1",
   "message": "I was reading through stories on r/HFY and one mentioned it was inspired by a prompt from here so I hopped on over and started reading. A year or so later I got back into writing short stories and this seemed like the logical place to go for some good inspiration.",
   "created_utc": 1690655837,
   "score": 2,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtz9qmv",
   "message": "You see, I daydream a lot and I have been daydreaming a lot since I was quite young. Before going to bed, in the shower, or while walking from place to place.\n\nSo at some point I kind of run out of premises/what-ifs I could think about and I thought would enjoy exploring. For this reason one day I just searched for premises, then prompts, and so found this sub.",
   "created_utc": 1690658084,
   "score": 2,
   "submission_id": "15cwe6p"
  },
  {
   "comment_id": "jtzdtuj",
   "message": "It was so many years ago, I couldn't even say. I likely searched on \"writing\" and saw several subreddits and jumped into this one. \n\nSome of my earliest responses were tossed off quickly and maybe a paragraph or two long. Few were more than a couple hundred words. \n\nSome of the earliest ones that I reposted in r/xwhy date back to early 2018, but when I discovered how to search reddit for anything that I'd posted earlier (I joined in 2009) I came across a few earlier things going back to, I think, 2015. I have a file saved offline somewhere. I should look for it.  \n\nMost of that early stuff (particularly the constrained writing) is much good for anything, even in my collection of prompt responses. They're just too short or too jokey or too constrained. (Really, no one will care about how you wrote a story without repeating a word or without using the letter 'e' unless it's a \\*good\\* story to begin with.)\n\nIf anyone wants to criticize my early works, feel free to click out r/xwhy. But look at some of the more recent ones, too. I've gotten better. And I'm hoping by next year that some of these responses with be published in book (or ebook) form.",
   "created_utc": 1690659774,
   "score": 2,
   "submission_id": "15cwe6p"
  }
 ]
}