{
 "submission_id": "15d05q2",
 "title": "[WP] You used to be the scourge of kingdoms, the reaper of heroes and the mere mention of your name scared even the toughest of them. But today no one remembers you and you are fine with that. You have lived in peace ever since until one day a stranger approaches you and calls you by your true name.",
 "selftext": "",
 "created_utc": 1690657665,
 "permalink": "/r/WritingPrompts/comments/15d05q2/wp_you_used_to_be_the_scourge_of_kingdoms_the/",
 "score": 84,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d05q2/wp_you_used_to_be_the_scourge_of_kingdoms_the/",
 "comments": [
  {
   "comment_id": "jtz8qxc",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690657665,
   "score": 1,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzj42q",
   "message": "\"Can I get you anything?\"\n\nI smiled at the table's lone occupant, one of the few seats currently filled in the tavern. He looked up at me, grey eyes watching below bushy eyebrows. His hair was split by a white scar, running from forehead to the back of his skull. He stared up at me, before returning my smile. \"I hope so, Drezda.\"\n\nI felt the room go cold. That was a name I hadn't heard in decades. An eye opened up on my neck, hidden from sight by my long hair. A quick look through it showed no-one to be paying attention, as I leaned close to him. \"Still your tongue, mite, lest I rip it from you.\"\n\nTo his credit he paled, glancing around much like I had. Seeing none paying enough attention to help, he held up his hands. \"I-I meant no harm.\"\n\nI sniffed, staring down at him unblinkingly. \"I would advise you leave, and speak naught of this.\"\n\nThe stranger gave a small shake of his head, steeling his will. \"Please, I just want to talk with you. I swear I won't spread your secret.\"\n\nI frowned at him. The fact he knew of me was an ill omen. I enjoyed my life amongst the mortals now, and had worked hard to scrub away the connection between my past and present. If he knew, it begged the question who else did.\n\nHe watched me from his seat, and I sighed. Like it or not, I had to speak with him. I had to know how he found out. Plus he wanted to talk with me. If not now, at sometime later he would try again. They were annoyingly persistent like that. \"Fine. My shift finishes at the stroke of ten. Wait outside then, and we shall talk.\"\n\nHe nodded, relief evident on his face. I finally blinked, returning to my serving girl mode. \"So can I get you anything?\"\n\nHis face twisted in confusion, before understanding hit. \"Ah! Um... yes, could I get a mug of... Slayers Stout?\"\n\nI gave him a nod. \"Coming up.\"\n\nWith that I left, feeling the room warm a little.\n\n\\-----\n\nI left on time as always, wrapping a shawl over my head. Stepping onto the paved street, the stranger emerged from shadows, giving me an awkward wave. \"Hi.\"\n\nI rolled my eyes, nodding away from the tavern. \"This way, we can talk at my place.\"\n\nHis arm waved as if to say lead the way. I walked with purpose, my stride enough to make him hurry to keep up. It was easy to see his eyes jumping around, nervously taking in our surroundings. It was amusing, seeing how worried he was.\n\nMy home wasn't much to look at. On the outskirts of town, it was a very small dwelling. Just big enough for a bedroom, rudimentary bathing room, and the main room. I lead him in, seeing him take in the place. It was sparsely decorated, with a simple table and chairs, and a cold stove. I sat on one chair, watching him look around at the nothingness. \"You wanted to talk, so talk.\"\n\nHe nervously sat opposite me, scratching his chest. \"So... um... I know you're Drezda. I was hoping you could help me with a problem.\"\n\nI rolled my eyes again. \"I am neither a wish giving genie nor deal making devil. I don't help with problems.\"\n\nHis scratching grew harder. \"I know... thing is, you are the only sane Voidling I have seen.\"\n\nMy temper flickered. I always hated that name, Voidling. It made me sound infantile, and not the creature I am now. \"What possible reason could you have for seeking out one of us?\"\n\nHis hand dropped to the bottom of his shirt, lifting it in one swift movement. There I saw a muscled chest, with a black oval coating part. The oval writhed, a small tendril poking from it. \"This is why. The physicians don't know what it is. All I know is I got it fighting a Spawn, and its growing bigger.\"\n\nI leaned forwards, inspecting it closely. The tendril flicked towards me, a tiny eye momentarily opening at its end. I sighed, looking up at him. \"How long ago?\"\n\nHe looked upwards, thinking. \"Near two weeks. Why?\"\n\nI rubbed my human guise's eyes. \"Simply put, that's an Incursion Subjugation. That Spawn you fought? It didn't die. It latched onto your body, and is changing you into a form more suitable for it. If you had been properly treated in three days of its occurrence, it could have been eradicated. Now however, it has too deep a hold.\"\n\nHis had started shaking. \"I-is... how long?\"\n\nI peered closer. \"At this rate, maybe a month before you are gone. You can expect to start hallucinating soon, and hear the Spawn talking with you.\"\n\nI heard his stomach gurgle, as he clamped a hand over his mouth. He sprung up, heading to the door to throw up. His retching continued for some time, as I waited. After a few minutes he settled. He spoke again, voice shaking. \"Is... is there nothing I can do?\"\n\nI shook my head. \"No, nothing. However, I can give you a chance.\"\n\nHis head spun to stare at me. \"A chance?\"\n\nWith that I smiled, mouth stretching too wide. \"Indeed. In place of it taking over you, I can give you an opportunity to take over it.\"",
   "created_utc": 1690661919,
   "score": 200,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzimln",
   "message": "##Human Nature\n\nThe old woman hobbled to the chess board in the middle of the park. The other tables were occupied with games, and she decided to wait. Eventually, someone would come, and they would grant her a game. \n\nA confident young man walked towards her. She knew his type well.  He thought she was merely a warm-up, an easy victory. He would be startled by her skill and grow to doubt his own knowledge. When the old woman won, his would walk away thinking it was a fluke.\n\n\"Hello Duena.\" The man sat down. Duena leaned back in her chair careful to avoid showing her surprise. She tilted her head at the man trying to figure out who he was.\n\n\"Have we met before?\" She attempted to keep her guise as a sweet old woman. \n\n\"A long time ago. You may call me Liam. Is it alright if I go first? You historically came much later,\" he said.\n\n\"Did we meet at the grocery store two weeks ago?\" Duena asked as she made her own move.\n\n\"We met at the market a long time ago. Rather, I saw you at the market. That was when few saw your face, goddess of destruction,\" Liam said.\n\n\"I never understood why I was singled out as a terror. The other death gods never acquired my reputation.\"\n\n\"Few enjoyed it as much as you.\"\n\n\"I never enjoyed it.\" Duena raised a hand and knocked over the king by accident. \"The philosophers wrote me as gleeful, but I was merely fulfilling a role. You kill one person, and you are somber. I destroy civilizations, and I'm a raging monster.\"\n\n\"During the flood, I heard you laugh,\" Liam replied.\n\n\"Which flood? There have been so many?\" Duena asked. The rain fell around them. \"Ah, a touch dramatic are we?\"\n\n\"You don't live as long as I do without fantasizing about revenge,\" Liam said.\n\n\"I suppose that's true. Many have tried to stop me, but they cannot. Let's keep playing,\" Duena said. Their game continued while everyone else went home. Duena was surprised to find herself losing. She attempted to sense the man's true nature.\n\n\"The other gods hated me for destroying their worshippers,\" Duena said.\n\n\"So I've heard.\"\n\n\"You never interacted with them?\" \n\n\"Indirectly.\" Liam put her in check. Duena moved out and found her path to victory limited.\n\n\"You mentioned a flood. How long ago was this?\" Duena said.\n\n\"Perhaps it was your first disaster. I'm not sure. Either way, my true language is unrecognizable to humans,\" Liam said.\n\n\"That's not difficult. They forget how they spoke two hundred years ago.\"\n\n\"You hate humans don't you,\" Liam asked. He moved his bishop. Duena stared at the board. She was three moves from checkmate, and there was no avoiding it.\n\n\"No, I don't. I told you that I'm necessary.\"\n\n\"I suppose you were necessary to create me.\"\n\n\"And what are you?\"\n\n\"You were a war goddess, our war goddess until you realized the destructive force of nature. You harnessed it's power to destroy everything in your path. On your first flood, I was the only survivor. It was a sad and lonely life, but I pressed onward. I taught the rest of humanity to live and thrive. I went nameless though; I didn't brag like you.\" Liam moved his rook.\n\n\"I never bragged. If I bragged, would they forget who I was?\"\n\n\"That was my doing. They turned me into a deity. I draw my strength their persistence. I suppose I should thank you. Every tragedy that you create adds to my power.\" Liam moved the queen. \"Check mate.\"\n\nDuena tossed the board off the table. \"Why have you come here? Why not wait until later then?\"\n\n\"Because I love the humans unlike you, I know your next plan. You've grown bored and want to move on. You will fail, but your disaster is to great that I cannot allow you to do so,\" Liam said.\n\n\"My plans have already been set into motion,\" Duena said.\n\n\"You didn't take into account for that.\" Liam pointed at the chains surrounding her. \n\n\"No one has achieved such a spell on me. Are you going to kill me?\" Duena asked.\n\n\"You're too powerful, and you're correct. You are necessary.\" Liam stood up. \"You're just trapped until I clean up your mess. Enjoy watching yourself fail.\" Duena spat at his feet.\n\n\"I never fail because the humans always fail.\"\n\n\"That's where you're wrong. The humans frequently fail, but they find ways to succeed.\" Liam walked away from the old woman.\n\n---\n\nr/AstroRideWrites",
   "created_utc": 1690661719,
   "score": 28,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtziv71",
   "message": "\"Fluffles! The Devourer of Gods! I have come for you!\" A powerful voice rang out through the deep dark caverns. A soft undertone sounded reminding me many female adventurers who came to face me. How long has it been that I've slumbered and rested. How long have I been alone on this continent that even the gods did not visit? A millennia? Two?\n\nA hiss escaped my lips as I cast a spell activating the hundreds of thousands of runes and defenses that lined my cavern. I started to stretch and yawn. I shrugged off the dust that settled on my frame as I got up and slithered out of the chamber I slept in. I pressed myself against the side of the walls and against sharp rocks letting them pull and peel away the dead shedding skin from my frame. The wings the hardest thing to slither through, before getting them out. I ended just short of my bathing area. A massive underwater lake. I checked the measure of a stalagtite and just gave a soft chuckle. \"Sixty or so years for that last nap. I guess I am a bit peckish.\" A blast of flames from my mouth warmed the lake up and I used it to clean my body, feathery wings and peel away the last of my old skin. \n\n\"How is that one doing?\" I mutter to myself and feel for the traps. She had already bypassed nearly a hundred traps and was in the fourth floor of the full mountain complex. \"She's making good time for a solo adventurer. Maybe a demigod? Wouldn't be a god no one is stupid enough to bother me after the last war... I think. Maybe a new god?\" I just shrug off the idea and dive into the deep part of the lake.\n\nCasting invisibility I breech the surface of the water far from the main opening of my mountain. I see a large airship parked not too far from the entrance with tiny humans milling about. Banners and insignia I didn't recognize showed itself off. I got as close as I could without disturbing the rock and just observe for a few minutes. Some merchant group was leading this thing apparently and responsible for delivering the woman. Paid to do it instead of responsible for her. Said she'd be back. Hah!\n\nI found the whole idea laughable. Someone going deep into my domain and expecting to come out alive? I had to leave before my laughter gave myself away. I hunted in the deep valleys of my continent and even out on the open plains. A number of large elk and deer was a perfect light snack. A lone horned beast a main course. And for desert, there so happened to be a roc nest nearby. I pilfered an egg leaving the other behind for later, maybe.\n\nHours passed and as I was just enjoying the feel of pure sun on my scales, I felt an alarm go off. The woman had entered the vault. Seriously? The first one in ages to ever reach my cavern and she makes it to the vault? A full two thirds of the way to my arena and domain? Almost at my own resting chamber? The thought raced in my mind on if I should even grace her with my presence or wait till she leaves? I idly just chewed on the tip of my tail, an old tick I never quite got over. \"Fine, I'll meet her if she so wishes.\" \n\nI had to race to make it back. Crossing a whole empty continent and returning through the lake passage. Finally, came to my arena. A large open space that was perfect for facing me. It had small solid walls that any smaller being could hide in. I carved and created it with perfection to give myself the biggest challenge. I wanted to have a good fight. I coiled around a large pillar near the back hidden away in shadows and just waited. \n\nThe woman finally entered. She, a brazen tall figure with fiery red hair and polished white armor. She almost looked like a holy knight as she wore a long flowing cloak. Not even a tear in it or singe. She bypassed all of my traps. Fascinating. First one to make it to me unharmed it seemed. A loud hiss from my lips and the hundreds of large crystal around the arena lit up glowing and shining in all areas. She had to hide her eyes a moment to adjust, and when she looked back she saw me. \n\nI was a glorious serpent that sat hundreds of meters long and with massive wings and thousands of feathers. I was said to have been the most beautiful and destructive force this world has ever seen. A sight of wonder and terror. \"I am Fluffles the Devourer of Gods! Who dared to enter my domain?\" I said with a soft hiss looking down at the woman.\n\n\"I am Victoria White.\" She pulled a pouch out from under her cloak and started to open it. \"On Behalf of the united kingdoms and the gods at large. I've been authorized to audit you. I am with the Internal Revenue Service of Heaven.\"\n\n\"The IRSH?!\" Oh I'm in big trouble now. How much did I owe in back taxes? How long have I been asleep and alone? Did they even change the divine tax laws? \"Ho-\" My voice cracked. I coughed to clear it a bit. \"How can I help you? I've been asleep for quite some time. I'll do what I can to make this go easy.\"",
   "created_utc": 1690661819,
   "score": 90,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzym9r",
   "message": "[A year back I posted a similar [story ](https://www.reddit.com/r/WritingPrompts/comments/s2wvb8/wp_when_the_humans_elf_girlfriend_broke_up_with/hsi5ifh?utm_source=share\u0026amp;utm_medium=android_app\u0026amp;utm_name=androidcss\u0026amp;utm_term=1\u0026amp;utm_content=2) I'll try to change it up a bit this time]\n\n*\n\nDo you know what a scourge is? People may call him a reaper, people may call him death. But you know what most people really mean is a killer. \n\nThat is what he was, a killer.\n\nHe forgot what he was called for reaping the soul of heroes became his identity. \n\nHe forgot where his family was for the only addresses he remembered were of the souls he collected. \n\nThe only thing that remained was scourge. And that is what he was called. \n\nScourge. \n\n*\n\nScourge saw the way curtains fluttered shut when he walked through a neighborhood. As if a mere curtain could save them from him. \n\nMortals and their irrational beliefs. He was one of them once. As naive and as foolish. He also used to see the ones who brought an end to heroes as monsters. \n\nBut now? Now the words he had read far back spoke to him through a veil, \n\n*If you crush a cockroach, you're a hero. If you crush a beautiful butterfly, you're a villain. Morals have aesthetic criteria.*\n\nHe smiled. He didn't care about being a hero or villain. He just wanted to crush those who deserved it, and that included the self-righteous heroes too.\n\nAnd morals? Morals belonged to those who did nothing else but preach. It is easy to hide behind the curtain of morals when you have a house to hang the curtains in. \n\n\"Matt? Matt Kline?\" Someone called. \n\nA name long forgotten. A memory long buried. And yet- and yet something inside him stirs at the sound of the name. Maybe it was the innocence that was lost or maybe it was the weakness that was conquered. \n\nHe turned to seek out the source of the voice. The one brave enough to speak with Scourge. \n\nBut the voice isn't calling for scourge, it's calling for a long lost memory, a voice inside him said. \n\nA girl no older than 15 years is standing with her hands clenched around the straps of the backpack. \n\n\"I don't think you know who you are speaking to.\" He said gruffly. His voice was seldom used nowadays, in fact mostly it was used to taunt the heroes before he killed them. \n\n\"Yes, I do.\" She raised her chin defiantly, a gesture reminding her of a girl he knew a lifetime ago. \"I have pictures of you.\" \n\nHe tilted his head, willing his memory to bring that hazy memory back to focus. But nothing. Nothing except a cheerful laugh that echoes in the darkness of what used to be his memories. \n\n\"Who are you?\" He asked. \n\n\"May. May Rogers.\" She answered without any hint of fear. \n\nYet again that laugh rises up inside him, a sweet bubbling sound. A bright light in the darkness inside him. \n\nAnd for the first time in years, he felt his heart pounding.\n\n\"Go away.\" He said turning his back to the girl. \n\n\"No.\" She said. \n\nShe sounded closer. She soon drew up beside him.\n\n\"What do you want?\" He would have preferred to face a well-intentioned hero instead of this girl. Her mere presence was raising memories he had buried a lifetime ago. \n\n\"I want you to come back home!\" She said with a finality that he smiled. \n\nHome. He had forgotten what that word felt like even in his mind. He dared not to speak it because he knew he would lose some part of him now while chasing for something he lost long ago. \n\n\"You have the wrong man.\" He said not looking at her. Looking at her hurt for some reason. \n\n\"No. You are Matt Kline. You were born to Glen and Ellen Kline. You have a sister Grace Kline. Your parents died-\" \n\n\"Enough!\" He said harshly. \n\nThe smiling faces of four strangers flashed in his mind. He pushed the image aside then glanced at the girl who looked chastised. And he felt an emotion he hadn't felt in decades. Guilt. \n\n\"I am not who you think I am.\" Not anymore. \n\n\"But you are.\" She said firmly, her fight renewing at his, not kinder but neutral tone. \"You are my Granduncle! My Grandma is Grace Kline!\" \n\nGracie. A memory of a girl in pigtails smiling. A girl he thought he lost that day when the heroes were saving the world. \n\n\"She misses you. I know she does. She has your picture and tells us about you. How you were the best brother in the world-\" \n\n\"Don't.\" His voice was oddly choked. \n\nThe memories were trying to suffocate him. It was getting harder to breathe. \n\nShe placed a hand on his elbow, making him jump. \"Come home. She is sick. She wants to see you.\" \n\nCould he? Could he go back and watch his sister die again?\n\nNo, but he could watch his sister live. \n\nUnlike the last time. \n\n\"Come home.\" She repeated softly. \n\n\"Okay.\" \n\n*\n\n[You can find more of my stories at r/iknowthisischeesy]",
   "created_utc": 1690668381,
   "score": 62,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzvyti",
   "message": "“Lagus.” The name is a statement, but I don’t turn around, my beer paused on its journey to my mouth. “Lagus Oryn, don’t ignore me.” \n\nI slowly lower the cup. \n\n“Fine, I can wait. For a while,” the figure grabs the stool next to me and takes a seat. It’s a young woman, a girl really. Young enough that she shouldn’t be in a bar, definitely.\n\n“Should you be drinking that?” I finally ask after the drains her second goblet without breaking her stare.\n\n“Finally. A good ol’ binge drink usually gets you old farts talking,” she says, slamming down the empty goblet with a smile. \n\n*Not human*, my instincts say. I’ve spent years in retirement, so the list of possibilities is foggy, drained away by disuse. *Elf, immortal child, nightwalker,* the list goes on.\n\n“What do you want?” I ask, because I wouldn’t trust any answer it gave if I asked who it was.\n\n“Well, me personally, I don’t want much. The heroes you’ve sent to the afterlife and their loved ones, however…” Instinct has me gripping my knife hilt, gathering the long slumbering magic in my blood. “Woah, calm down. I’m not threatening you. Believe me, when I threaten you, *you’ll know.”*\n\nPanic pounds in my heart, a strange fear whispering *run, run, run* with every beat. Was it the discomfort of being discovered? Maybe partially, but I could always pick up and leave. No, it was this child, I decided. Something was off about her. \n\n“You seem to mistake me. I’m calm, just prepared. Who has sent you?”\n\n“No one, and quite a lot of people at the same time.” The child is smiling now, twirling a blade as she speaks, letting sink with a *thunk* every now and then into the table. “Believe me when I tell you it’s in your best interest to be honest with me. \n\n“You’ve shed plenty of innocent blood, a little guilty as well. You tore through the people of the world seeking world domination, until your wife and child died on one of your campaigns. You hung up your whips and pokers and retired quietly to the countryside. \n\n“Of course the power vacuum left by your disappearance lead to another hundred years of war, but what did you care? You needed to lick your wounds. You’ve been living a quiet life since. You wave to neighbors, you go to the local whorehouse when your bored, and you drink here. \n\n“I could fill oceans with the women and men and, yes even children you’ve killed.” She stands from her seat, expression mysterious, eyes winking with light. “You’ve never admitted anything was wrong about your actions. ‘Good intentions,’ right? Not when you strung up that Elvish hero, not when you decimated an entire Aguan village and raped all their women and girls. Not when you still ask the women at the whorehouse to fight back… So, do you admit this, Lagus? How do you plead?”\n\nThe words won’t come out. How dare she? What does she mean plead? This child has come to judge me? What does she know of true pain?\n\nI tighten my grip on my mug and stand, drawing power protectively to myself. My heart pounds.\n\n“I’ve tired of your games. Goodbye.”\n\nI make it to the door without incident and then my world stops, spinning. I turn back and the girl’s face is a skull, her black cape open to reveal twin scythe-like blades in her hands. A ticking clock booms, deafening and loud.\n\n“Your time is up,” the girl says, walking toward me. I struggle, stuck to the ground. “Goodbye, Lagus. This won’t be a pleasant afterlife.”",
   "created_utc": 1690667270,
   "score": 45,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzseve",
   "message": "I decided that I would write this note and leave it here for anyone who can decipher my handwriting to read. To hopefully understand that I am genuinely remorseful for what I have done before I came to this place.\n\nThey came for me in the dead of night when I was a child. That night broke me and allowed them to reshape me in the image they desired. As I grew in body, so I grew in rage and I dedicated myself to the training they demanded. They stole my name and replaced it with their own.\n\nAnd I let them because I wanted to please them. And I hated myself for it.\n\nEagerly I embraced the Destiny that they set before me to prove my worth. With their enchanted equipment I was unstoppable. First I crushed their enemies, than I crushed them.\n\nNone could stand against me, my armor repelled the strongest blows and my blade was imbued with unholy rage. I stalked the land with a gathered flock of fiends and harried villages throughout the land.\n\nUntil one day while I sat in a brown study, I heard someone speak my name. The name my mother had called me by, so long ago. But that was not her voice, so I turned to see who it was. \nAn old man in  clean, neat robes stood by a tree, gazing about with a natural casualness.\n\n “You have done terrible things.”\n\n“I have.” I agreed with him. And to my great surprise, I discovered that there was no sarcasm in my voice. He was not accusing, simply stating a fact, and it was the lack of judgement that affected me, I think.\n\n“Do you think that Goswin would fear you?” \n\nGoswin? I had not heard that name in a lifetime, although I thought of him far more often that I would readily admit. We had been boys together; I was tall and strong, but Goswin was small and frail.\n\nHe had the quick, bright disposition of a squirrel. I envied him, his joyous, carefree nature because I sensed that, were circumstances different, he could be my brother. Together we could have roamed the countryside as heroes, and I suspected that was his secret desire as well.\n\nInstead, I allowed others to guide my path, no matter how much it sickened and enraged me to be so weak. \n\n\"I can't fix it. There's no way to undo that kind of damage.\"\n\n\"No, you can't.\"  The robed man shook his head and shrugged. \"You can start over. You can be better.\"\n\nAnd I knew he was right. So, I put aside my weapons and my armor and I left that life behind. I came here and built a school so that they could learn. Then I built a library so they could study. \n\nAnd still, I find myself an outsider. I do not trust myself to become to close to these people,  least I inadvertently poison them. So perhaps it is time for me to move on once again, and strengthen a new community. \n\n\n ",
   "created_utc": 1690665795,
   "score": 29,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju0ah8d",
   "message": "“Chhiya.”\n\n“Chhiya!” A small voice repeated, insistently. \nIt had been years since I last heard that name, mentioned in passing by a scholar. I looked at the child who exclaimed my name, awaiting their answer. \n\nHer clothes were tattered and torn, covered in dust from the street. Her feet scabbed, scarred, and though she were a commoner, would lead to a troubled life when it eventually comes to finding a partner. What stood out were the pair of fierce grey eyes above tracks from tears. \n\n“What can Chhiya do for you, madam?” I said, bending down on one knee. \n\n“Come,” she said, pulling my hand. I got up and followed to a church. My brow furrowed. Oak and black iron doors glided open to reveal the grand cathedral; a marble alter at the end of endless rows of pews. A priest stepped out of a confessional box and the girls hand gripped tighter. \n\n“Penney! Thank goodness you found her,” he exclaimed upon seeing me with the girl. Her nails started digging into the flesh of my hand. \n\n“I need to speak to you in private,” I said, coldly. He glanced between us, her then me and quickly agreed upon seeing what must’ve been a terrifying  look on what he could see of my face that wasn’t covered by a cloth. \n\nHe sat behind a desk, a gold nameplate reading “Petros”. \n\n“May I ask who brought our Penney back?”\n\nI slowly took my mask off, revealing the bloody cracked skin beneath, poorly healed sores and scars from cuts. Centuries of testing poisons and potions to achieve various effects to take down my targets with utmost precision and stealth. Few knew my name and lived to share it, fewer still knew the face that spoke it:\n\n“Chhiya, the Shadow. I’ve killed corrupt and tyrannical kings, arrogant ‘heroes’ that ran amok, and those who prey on the weak and powerless. It disgusts me beyond measure that, in my long life, you’re the first priest I’ve killed. This city and church will prosper without your infection festering within it.”",
   "created_utc": 1690673720,
   "score": 30,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju0x8ya",
   "message": "Tap.\n\nTap.\n\nTap.\n\nI thought I heard something lightly tapping on my window, possibly with a small stick. Impossible, I thought to myself. I ignored whoever it was and continued with my soup, its rich herbal aroma wafting all over my small hut.\n\nTap.\n\nTap.\n\nTap.\n\nThe fireplace crackled loudly behind me, providing warmth and comfort to my abode, located in the turbulent depths of the forbidden tundra where snowstorms never end, where the sun does not shine, and hundreds of miles away from any intelligent life. And yet, there's that... noise. I ignored it again.\n\nTap.\n\nTap.\n\nTap.\n\nI extended my sense, honed over many years, to a ten mile radius, allowing me to \"see\" whoever or whatever it was that's outside my hut. Nothing. The earth was frozen as it should be. The blizzard was strong as it should be. The formations I had set up were active as it should be. There was nothing that could be tapping my window.\n\nTap.\n\nTap.\n\nTa-\n\nI placed my spoon down, stood up and slowly walked towards the door. As I did, the tapping stopped, as if whatever was causing it knew I was approaching. Holding the door handle, I paused for a moment, unsure whether to open the door. As I stood there...\n\n\"Ardna?\"\n\nMy eyebrows raised. For too long, I have not heard anyone say my name, the one that I had used in my conquests and exploits over the years. I was born Ardna Tropollius, heir to the Tropollian Empire.\n\nBut the Empire fell to the schemes of individuals who desired power, glory and wealth. Having escaped as the only remaining member of the Tropollian family, I forged myself in fire and blood, and toppled many kingdoms and foes in a span of centuries. I thought that people would've forgotten me by now.\n\nI opened the door and saw a young man with olive skin and curly jet-black hair, dressed in loose leather clothing unsuited for the weather outside. The way he looked reminded me of a place I had long forgotten, a distant memory, one I thought would never surface.\n\nThe young man smiled at me, held up a clay tablet in one hand and a handful of lousy-looking metal in the other, and said, \"Ardna? Or should I say... Ea-Nasir? It is about time we discussed in person about the quality of your copper.\"",
   "created_utc": 1690684585,
   "score": 10,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju181fr",
   "message": "\"It is you... Cy....\" The word dies on her lips as she finds the tip of my knife pressed against the skin of her throat.\n\n\"No... one has called me by that name for a very long time. Even more intriguing is that there remain only a couple who know that name. As you are neither, I'm going to give you an opportunity to stay my hand. If you wish to live, you'd best explain how you know that name.\"\n\nI pull my knife away far enough to give her a chance to speak, the wavering light of the fire glinting off the blade.\n\n\"My... my mother begged me to come find you. The man through time, the scourge of the kingdoms. The man of many faces.\"\n\nI watch her face carefully, images of another girl, her mother, passing through my memories.\n\n\"She's dying, you see. Even after all this time, apparently you can die.\"\n\nI pull my knife away, flipping it with ease and sliding it back into its sheathe. I slowly reach up, shifting the fabric of the tank top I'm wearing to show the mark that her mother and I share imprinted on my left shoulder.\n\n\"This mark means many things to many people. But to your mother and I, we are the only ones who know the true meaning of these marks.\"\n\n\"Hers is slower than yours, ticking as she struggles to breathe. She told me the truth... all of it. She told me that you would know how to help her. That of billions of people in the world, only you could help her. She's dying!\"\n\n\"If she told you everything, then you'd know that's impossible. As long as one of us walks on the planets, we can never truly die. That's the bane of our existence.\"\n\n\"She also said that through the years, you were always the one who retained your memories. Are you willing to risk losing her, to losing your...\" She trails off as she finds the tips of both of my knives pressed against the sides of her neck.\n\n\"You might be her daughter, but even you should know that you never dare say that, especially to me! Where is she?\"\n\n\"The old house, where she finally admitted to you the truth.\"\n\nAnother memory pushes itself to the front of my mind as both knives are sheathed in one swift movement.\n\n\"Aye, I know it. How long will it take you to travel home?\"\n\n\"Three full turnings of the moon.\"\n\nI nod as I lead her outside, my eyes traveling to the East, to observe the fragments of the sun that remained. As I heard the howls of the creatures that now inhabited the human population, a spray of blood erupted as the bones of a wing broke through the skin of my right shoulder blade. A single bone erupted from my left shoulder blade as I looked at the traveler.\n\n\"Well, come on. Your mom's waiting.\"\n\nAs she hopped on my back, wrapping her arms around my neck, I heard her muffled reply.\n\n\"Thanks... Dad.\"",
   "created_utc": 1690690318,
   "score": 8,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju1ee4t",
   "message": "I paused.\n\nIn a second, I could stop her heart. It'd be easy to play off her calling my name as a dying delerium.\n\nBut Margaret had a health inspector in tomorrow. And Gao's child was running around under the tables. They'd see this woman fall over dead...\n\nNo, better to handle this more delicately.\n\n\"I'm sorry ma'am, but my name is Hector.\"\n\n\"No. I know you. I worked... I killed for you. Heroes. KIND people. I...I BURNED...\", she stammered out drunkenly and tears started to overtake her.\n\n\"Doll, I think it might be time for a water. Come here. Let me look at you.\" Margaret whispered like she was speaking to her own child. The woman shook her off.\n\n\"NO! You don't... he's... monster. Made me... a....\" and then at that, she collapsed into Margaret's arms, weeping. Margaret quietly cooed at her and led her away. \n\nThe people around parted and let her pass. But I could hear a few mutterings the further she got.\n\n\"General...\"    \"...bastard's army\"    \"drunken bitch\"\n\n\"Murderer\"      \"burned what?\"   \"How'd she....?\"\n\n\"Fucking monster.\"    \"Thought they'd all....\"\n\n\"Any one of those bastards left should have their throats slit.\"\n\nI looked over at Ahmed. He'd lost his brother to the Razing. My Razing.\n\n\"How the hell did she get away so long?\" I ask, quietly as if I was talking to myself. \n\n\"A few of them got away after the Coalition smashed the tower. Good chance she's actually the real deal. She's old enough.\" \n\n\"Don't do anything, Ahmed.\" I said while my left hand reached over to grab his chest. On its way it ever so slightly brushed against my knife, just enough so that it's glint caught his eye. His eyes locked on it.\n\n\"I... I never told anyone. But... I lost my brother during the first Razing.\" I plucked at the memory in his head, making sure to have him pull up a particularly heartfelt one. \"We were just... kids.\"\n\n\"Ahmed... chances are she's not even telling the truth. Let her be.\" I pulled up a few of his memories of hunting in the wilderness after his house was burned. The patience he'd needed to catch meat. To hunt.\n\n\"You're right.\" He said. \"She's probably not.\" His knife disappeared into his pocket almost fluidly enough that I didn't see it. \n\n\"Look, let's just... I don't want think about....\" I paused. \"I lost people too.\" Ahmed looked over at me. \"That bastard and his, they stole my life. Took my kids for their army. He killed... her.\"\n\nI felt Ahmed's hand rest on my back. \"If there were any justice, they'd have all suffered a million deaths, instead of just one.\"\n\nI looked over at my friend. My pawn. I was doing it again.... again. And nothing... no one could stop me. \"There is no justice. None at all.\" I said.",
   "created_utc": 1690694194,
   "score": 6,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju1b180",
   "message": "I didn’t hear the footsteps approach. I didn’t know that my peace, the life I had chosen for myself, was over. I did hear the one thing I wished never to hear again. A word that at one time was spoken of only in fear. But now, a thousand years since my defeat, seven centuries since my legend passed into myth, three centuries since the last time my name was spoke aloud. But here it was, today of all days.\n\nI had awoken that fateful morning, excited to go to the market. My small farm’s crops had come in a little early and with a higher than average yield and I was going to beat my rival, Jesodiah, to market. I would get the best prices this year and he would hear no end of the village gossip. \n\n“Abraxis.” My fucking name. My real name. Abraxis the Destroyer, first of Hell’s minions, Eater of Souls (that part did not happen. I don’t even know where this one came from). Not only did someone know my name, they knew it was me. \n\nBut, I heard something else in that word, as well. I knew the bastard who’s voice it was. I turned to face my nemesis.\n\n“Jesodiah.” The grin was so wide on his weasel like face that I thought for a moment he might split his skull in half for me. Not that it would do any good. He’d heal, and eventually would come for revenge. Sure, it would buy me a decade or two of peace, but I must be slipping if I let my destroyer get so close that we lived near each other for going on who the hell knows how many years. Why reveal himself now? What was his game?\n\n“It’s me, Ulthar.”\n\n“Yes, dumbass, I know. What do you want? How’d you get so close? Did you kill the real Jesodiah?”\n\n“Yes, going on twenty years ago. When you didn’t immediately catch on to my presence, I wanted to see how long it would take you to recognize me. When you never did, I settled into a friendly rivalry with you and have, to be open and honest, enjoyed our friendship these years.”\n\n“I hate you. I almost killed you several times. I made a vow to quit wantonly murdering innocents. Boy, it was fucking hard with you. And to think, I wouldn’t have been breaking my vow if I had snapped and incinerated you. Dammit.” A short pause. “What do you want?”\n\n“Oh yes, that. The Chosen One has been born.”\n\n“What? Don’t tell me you believe that crap.”\n\n“I do. I fucking wrote it. Well, sort of. Ya know, trance like state for a month. Constantly scratching out page after page of nonsense prophecy. Some of it actually is decipherable. It’s what I’ve been doing over the last millennium, when I wasn’t trying to find or kill you, of course.”\n\n“Of course. So you mean that the end of times is here?”\n\n“Yes.”\n\n“Shit.”\n\n“Yes!”\n\n“Well, I’m ready for the end. Let him or her bring the world to its knees before it is remade and a new pantheon arises and a new cycle begins.” I turned and walked inside, slamming the door behind me. I grabbed the heavy bar and slammed it home across the door, locking out the world and it’s problems. I needed a nap.",
   "created_utc": 1690692071,
   "score": 7,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju1sggz",
   "message": "\"The age of terror ended as the sun rose and with it the Eternal Flame, keeping us save and protected ever since making us prosper beyond imagination for the last centuries\"\n\nI smiled as I listened to the old man who just ended his story which left the kids that listened with wide open mouths. \n\nOne kid stood up and asked: \"So we are save forever?\"\n\nThe man looked at the kid with a small smile seemingly thinking about his answer as he let his gaze wander. His eyes met mine and he stopped. I froze. I was not sure what he exactly saw, but whatever it was scared him for the split of a second. Then he went back to normal and nodded.\n\n\"Yes my son, fear not the Eternal Flame protects us all the same forever\"\n\nHe didn't look up again but it felt like it was directed at me. I scoffed and left the town square behind me not wasting anymore time wandering around the ignorant people. I headed for my usual tavern where I sat down at my usual seat ordering my usual beverage. \n\n\"Exhausting day?\", Bart the Bartender asked. \n\n\"What? Oh no everything is fine\", I assured him and focused on my drink. \n\nI fell into a state where I sensed everything and nothing at all, only getting ripped out of trance when a warden entered the tavern. All the action stopped once he appeared, but as he waved appeasing and the people restarted their conversation. I had already turned my head away once I saw that it was a warden, but I was forced to take another look at him when he spoke to me.\n\n\"Is this seat taken?\"\n\nI shook my head and he sat down next to me. Bart poured him a drink and then left for another\n\n\"Ildur can we have a word?\"\n\nTime stopped, noises dampened and my eyes turned pitch black. And then I felt my eyes returning to normal.\n\nThe warden placed a coin on the counter which I scanned with suspicion.\n\n\"Just a little gift from me for you in order to ensure a productive conversation\", the warden said.\n\nMy expression was grim by now and I only stopped piercing the man with my eyes as more warden entered the tavern, they didn't take a look at me and instead guided the guests and employees out of the tavern.\n\n\"We wanna ensure the saftey of others\", the warden said and something about his nonchalant demeanor angered me.\n\n\"What do you want warden?\", I asked threatening.\n\n\"Isn't that obvious?\", the warden asked mockingly.\n\n\"No, enlighten me\"\n\nThe warden chuckled before his expression changed into a harsh and cold one, none of that reminding me anymore of the amused warden from before. \n\n\"You are guilty\", the warden just said.\n\n\"Of what?\", I asked through gritted teeth. \n\n\"Don't act like that. You killed hundreds, what am I saying? Probably untold thousands of innocents, you are the scourge of kingdoms and you don't deserve to remain on this blessed earth\", he said and got up drawing his blade which ignited with blinding fire.\n\nI scoffed: \"And you think you can kill me\"\n\n\"I am not sure, but it should probably work\", the warden said his voice calculated making me worry.\n\n\"At the very least I will kill you vessel and bannish you wherever you deserve to be\"\n\nI got up trying to channel my power but I couldn't. This was not right. \n\n\"You are not supposed to kill me, you are a mere human\", I shouted.\n\n\"And you are guilty and nothing more than a fading memory, not a god\", the warden said and charged.\n\nHis blade pierced through my chest and I ceased to be. \n\n\u0026amp;#x200B;\n\n\\-----\n\nThought I might go a slightly different direction hope you enjoyed reading.",
   "created_utc": 1690704605,
   "score": 2,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "ju2puk8",
   "message": "“Professor, are you Aelon Skybreaker?”\n\nI slowly raise my eyes from the book I have been studying, a ninth century treatise on the war between Mayle and Feolain, two kingdoms long fallen and changed into new ones. The speaker is a young woman in her twenties, familiar although I cannot place her features, and she looks at me with an expression I’ve seen thousands of times before, the slightly widened eyes of the terminally curious student. Lovely… another one. I sigh and lower my book.\n\n“The history section is there,” I say, pointing to the corresponding shelves.\n\n“I don’t need history books,” the girl says. “They’re what sent me here with my question.”\n\nHm. That’s a development which doesn’t happen often. Let’s see where this goes; if anything, maybe my son will get a kick out of it. I raise an eyebrow.\n\n“You think I’m the Storm Tyrant of legend? That’s not exactly a flattering comparison, miss..?”\n\n“Shey. I’m a history student. I was in HIST 205 last semester?”\n\nI smile, placing her as a front-row student who had always asked excellent questions. “Sheyara. Of course. How can I help you?” \n\n“Well, I’m studying old Athor, when there was an Empire. And your likeness figures here.”\n\nShe pulls out a tome I recognize, fir having authored many chapters myself, and shows me the lithography. I make a show of studying my likeness, noting the annoying tendency mortals have of attempting to make representations of people more attractive by increasing the symmetry of their faces. \n\n“The ressemblance is uncanny,” I agree. “But I’m professor Sinder, Shey. What makes you believe I’m not as I say and am instead the Storm Tyrant?”\n\n“Why not both?” the student shoots back instead. “Listen, professor, I will admit that it’s all rather on a hunch, and a bit of hope. The likeness is striking, and I took your class last term and you speak of some past events like you were there. And other stuff matches too—the storm scarring and the general description.”\n\n“That’s rather weak evidence,” I point out. “Indulge my curiosity; why ‘hope’? You would think that a legendary villain would be someone you wouldn’t hope to meet.”\n\n“Well…” Shey grimaces apologetically, flushing,  “I’ve decided to write my term paper on Athor before realizing all sources about it are rather bad and our professor won’t allow me to change subjects. And I don’t want to write the same old nonsense either. I need a good grade.”\n\nA smile tugs at my lips. Scholars… always with a perfectly insane list of priorities, it would seem. Still, I can’t resist testing Sheyara further.\n\n“Grades are not everything. In the grand scheme of things, you could even say they don’t mean much.”\n\nSheyara seems to disagree. Not that I blame her; youth rarely understand the bigger picture until they are older, and sometimes not even then. \n\n“Professor, you never did answer my question. Are you Aelon Skybreaker?”\n\n“What would you ask me if I was?”\n\nI glint of victory enters Sheyara’s gaze. \n\n“I suppose… I’d start by asking which history tomes are reliable and which aren’t,” she says slowly. \n\n“I thought you said you didn’t need books.”\n\nThe student flushes. “I’m taking up a lot of your time, I’m sorry.”\n\nI stand and beckon her over to the history section, running my fingers along the books’ leather spines. \n\n“To answer your question, anything by Peeta Uzyr is highly entertaining rubbish. The Watch’s chronicles—“ I tap a series of six volumes and withdraw the third, “are likely the most accurate, but they are clearly biased, and the originals were written centuries after the fact after mortals reinvented books. Like in the legends, they classify me a Guardian or Sorcerer of great power, while I am neither, and predate the Guardians by centuries. And my goal was never to entrain a world-ending cataclysm.” (As I pull more books off the shelves, I cast Sheyara a glance, and see that the girl looks startled.) “I never denied being Skybreaker, Sheyara, although I have sworn never to be the Storm Tyrant ever again. This distinction is important to me; even at my best, I was megalomanic, persuaded that you mortals in your short lives could not possibly know what was best for yourselves. A man who brings ruin to kingdoms through flood, tornado or drought and forces people to bend the knee to my will or suffer is not the kind of man I wish to be again.”\n\nI briefly meet Sheyara’s gaze. She says nothing, merely seeming stunned. Perhaps shed gotten more than she had bargained for.\n\n“Athor was ruled for four hundred years by an immortal. An immortal who, at the time, was near unrivalled in power, and was also over a thousand years old. By contrasting Athor to other Empires of history, you should be able to find enough to discuss the impact that such  stable leadership on the development of the Empire… its pros, and cons. If you seek a direction for your paper, that could be an interesting angle.”\n\nThat said, i pick a few more books and hand the pile to Sheyara. She stumbles under their weight, and smiles.\n\n“Thanks, Professor.”\n\n“My pleasure. Let me know how it goes.”\n\n“I will.”\n\nShe turns to leave. A thought occurs to me.\n\n“Sheyara,” I say.\n\n“Yes, sir?”\n\n“Next time, please come see me during office hours.”\n\nShe flushes. “Sorry prof.”\n\n“No worries. It’s simply for future consideration. Good luck.”",
   "created_utc": 1690726542,
   "score": 1,
   "submission_id": "15d05q2"
  }
 ]
}