{
 "submission_id": "15d05q2",
 "title": "[WP] You used to be the scourge of kingdoms, the reaper of heroes and the mere mention of your name scared even the toughest of them. But today no one remembers you and you are fine with that. You have lived in peace ever since until one day a stranger approaches you and calls you by your true name.",
 "selftext": "",
 "created_utc": 1690657665,
 "permalink": "/r/WritingPrompts/comments/15d05q2/wp_you_used_to_be_the_scourge_of_kingdoms_the/",
 "score": 9,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d05q2/wp_you_used_to_be_the_scourge_of_kingdoms_the/",
 "comments": [
  {
   "comment_id": "jtz8qxc",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690657665,
   "score": 1,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzj42q",
   "message": "\"Can I get you anything?\"\n\nI smiled at the table's lone occupant, one of the few seats currently filled in the tavern. He looked up at me, grey eyes watching below bushy eyebrows. His hair was split by a white scar, running from forehead to the back of his skull. He stared up at me, before returning my smile. \"I hope so, Drezda.\"\n\nI felt the room go cold. That was a name I hadn't heard in decades. An eye opened up on my neck, hidden from sight by my long hair. A quick look through it showed no-one to be paying attention, as I leaned close to him. \"Still your tongue, mite, lest I rip it from you.\"\n\nTo his credit he paled, glancing around much like I had. Seeing none paying enough attention to help, he held up his hands. \"I-I meant no harm.\"\n\nI sniffed, staring down at him unblinkingly. \"I would advise you leave, and speak naught of this.\"\n\nThe stranger gave a small shake of his head, steeling his will. \"Please, I just want to talk with you. I swear I won't spread your secret.\"\n\nI frowned at him. The fact he knew of me was an ill omen. I enjoyed my life amongst the mortals now, and had worked hard to scrub away the connection between my past and present. If he knew, it begged the question who else did.\n\nHe watched me from his seat, and I sighed. Like it or not, I had to speak with him. I had to know how he found out. Plus he wanted to talk with me. If not now, at sometime later he would try again. They were annoyingly persistent like that. \"Fine. My shift finishes at the stroke of ten. Wait outside then, and we shall talk.\"\n\nHe nodded, relief evident on his face. I finally blinked, returning to my serving girl mode. \"So can I get you anything?\"\n\nHis face twisted in confusion, before understanding hit. \"Ah! Um... yes, could I get a mug of... Slayers Stout?\"\n\nI gave him a nod. \"Coming up.\"\n\nWith that I left, feeling the room warm a little.\n\n\\-----\n\nI left on time as always, wrapping a shawl over my head. Stepping onto the paved street, the stranger emerged from shadows, giving me an awkward wave. \"Hi.\"\n\nI rolled my eyes, nodding away from the tavern. \"This way, we can talk at my place.\"\n\nHis arm waved as if to say lead the way. I walked with purpose, my stride enough to make him hurry to keep up. It was easy to see his eyes jumping around, nervously taking in our surroundings. It was amusing, seeing how worried he was.\n\nMy home wasn't much to look at. On the outskirts of town, it was a very small dwelling. Just big enough for a bedroom, rudimentary bathing room, and the main room. I lead him in, seeing him take in the place. It was sparsely decorated, with a simple table and chairs, and a cold stove. I sat on one chair, watching him look around at the nothingness. \"You wanted to talk, so talk.\"\n\nHe nervously sat opposite me, scratching his chest. \"So... um... I know you're Drezda. I was hoping you could help me with a problem.\"\n\nI rolled my eyes again. \"I am neither a wish giving genie nor deal making devil. I don't help with problems.\"\n\nHis scratching grew harder. \"I know... thing is, you are the only sane Voidling I have seen.\"\n\nMy temper flickered. I always hated that name, Voidling. It made me sound infantile, and not the creature I am now. \"What possible reason could you have for seeking out one of us?\"\n\nHis hand dropped to the bottom of his shirt, lifting it in one swift movement. There I saw a muscled chest, with a black oval coating part. The oval writhed, a small tendril poking from it. \"This is why. The physicians don't know what it is. All I know is I got it fighting a Spawn, and its growing bigger.\"\n\nI leaned forwards, inspecting it closely. The tendril flicked towards me, a tiny eye momentarily opening at its end. I sighed, looking up at him. \"How long ago?\"\n\nHe looked upwards, thinking. \"Near two weeks. Why?\"\n\nI rubbed my human guise's eyes. \"Simply put, that's an Incursion Subjugation. That Spawn you fought? It didn't die. It latched onto your body, and is changing you into a form more suitable for it. If you had been properly treated in three days of its occurrence, it could have been eradicated. Now however, it has too deep a hold.\"\n\nHis had started shaking. \"I-is... how long?\"\n\nI peered closer. \"At this rate, maybe a month before you are gone. You can expect to start hallucinating soon, and hear the Spawn talking with you.\"\n\nI heard his stomach gurgle, as he clamped a hand over his mouth. He sprung up, heading to the door to throw up. His retching continued for some time, as I waited. After a few minutes he settled. He spoke again, voice shaking. \"Is... is there nothing I can do?\"\n\nI shook my head. \"No, nothing. However, I can give you a chance.\"\n\nHis head spun to stare at me. \"A chance?\"\n\nWith that I smiled, mouth stretching too wide. \"Indeed. In place of it taking over you, I can give you an opportunity to take over it.\"",
   "created_utc": 1690661919,
   "score": 1,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtzimln",
   "message": "##Human Nature\n\nThe old woman hobbled to the chess board in the middle of the park. The other tables were occupied with games, and she decided to wait. Eventually, someone would come, and they would grant her a game. \n\nA confident young man walked towards her. She knew his type well.  He thought she was merely a warm-up, an easy victory. He would be startled by her skill and grow to doubt his own knowledge. When the old woman won, his would walk away thinking it was a fluke.\n\n\"Hello Duena.\" The man sat down. Duena leaned back in her chair careful to avoid showing her surprise. She tilted her head at the man trying to figure out who he was.\n\n\"Have we met before?\" She attempted to keep her guise as a sweet old woman. \n\n\"A long time ago. You may call me Liam. Is it alright if I go first? You historically came much later,\" he said.\n\n\"Did we meet at the grocery store two weeks ago?\" Duena asked as she made her own move.\n\n\"We met at the market a long time ago. Rather, I saw you at the market. That was when few saw your face, goddess of destruction,\" Liam said.\n\n\"I never understood why I was singled out as a terror. The other death gods never acquired my reputation.\"\n\n\"Few enjoyed it as much as you.\"\n\n\"I never enjoyed it.\" Duena raised a hand and knocked over the king by accident. \"The philosophers wrote me as gleeful, but I was merely fulfilling a role. You kill one person, and you are somber. I destroy civilizations, and I'm a raging monster.\"\n\n\"During the flood, I heard you laugh,\" Liam replied.\n\n\"Which flood? There have been so many?\" Duena asked. The rain fell around them. \"Ah, a touch dramatic are we?\"\n\n\"You don't live as long as I do without fantasizing about revenge,\" Liam said.\n\n\"I suppose that's true. Many have tried to stop me, but they cannot. Let's keep playing,\" Duena said. Their game continued while everyone else went home. Duena was surprised to find herself losing. She attempted to sense the man's true nature.\n\n\"The other gods hated me for destroying their worshippers,\" Duena said.\n\n\"So I've heard.\"\n\n\"You never interacted with them?\" \n\n\"Indirectly.\" Liam put her in check. Duena moved out and found her path to victory limited.\n\n\"You mentioned a flood. How long ago was this?\" Duena said.\n\n\"Perhaps it was your first disaster. I'm not sure. Either way, my true language is unrecognizable to humans,\" Liam said.\n\n\"That's not difficult. They forget how they spoke two hundred years ago.\"\n\n\"You hate humans don't you,\" Liam asked. He moved his bishop. Duena stared at the board. She was three moves from checkmate, and there was no avoiding it.\n\n\"No, I don't. I told you that I'm necessary.\"\n\n\"I suppose you were necessary to create me.\"\n\n\"And what are you?\"\n\n\"You were a war goddess, our war goddess until you realized the destructive force of nature. You harnessed it's power to destroy everything in your path. On your first flood, I was the only survivor. It was a sad and lonely life, but I pressed onward. I taught the rest of humanity to live and thrive. I went nameless though; I didn't brag like you.\" Liam moved his rook.\n\n\"I never bragged. If I bragged, would they forget who I was?\"\n\n\"That was my doing. They turned me into a deity. I draw my strength their persistence. I suppose I should thank you. Every tragedy that you create adds to my power.\" Liam moved the queen. \"Check mate.\"\n\nDuena tossed the board off the table. \"Why have you come here? Why not wait until later then?\"\n\n\"Because I love the humans unlike you, I know your next plan. You've grown bored and want to move on. You will fail, but your disaster is to great that I cannot allow you to do so,\" Liam said.\n\n\"My plans have already been set into motion,\" Duena said.\n\n\"You didn't take into account for that.\" Liam pointed at the chains surrounding her. \n\n\"No one has achieved such a spell on me. Are you going to kill me?\" Duena asked.\n\n\"You're too powerful, and you're correct. You are necessary.\" Liam stood up. \"You're just trapped until I clean up your mess. Enjoy watching yourself fail.\" Duena spat at his feet.\n\n\"I never fail because the humans always fail.\"\n\n\"That's where you're wrong. The humans frequently fail, but they find ways to succeed.\" Liam walked away from the old woman.\n\n---\n\nr/AstroRideWrites",
   "created_utc": 1690661719,
   "score": 1,
   "submission_id": "15d05q2"
  },
  {
   "comment_id": "jtziv71",
   "message": "\"Fluffles! The Devourer of Gods! I have come for you!\" A powerful voice rang out through the deep dark caverns. A soft undertone sounded reminding me many female adventurers who came to face me. How long has it been that I've slumbered and rested. How long have I been alone on this continent that even the gods did not visit? A millennia? Two?\n\nA hiss escaped my lips as I cast a spell activating the hundreds of thousands of runes and defenses that lined my cavern. I started to stretch and yawn. I shrugged off the dust that settled on my frame as I got up and slithered out of the chamber I slept in. I pressed myself against the side of the walls and against sharp rocks letting them pull and peel away the dead shedding skin from my frame. The wings the hardest thing to slither through, before getting them out. I ended just short of my bathing area. A massive underwater lake. I checked the measure of a stalagtite and just gave a soft chuckle. \"Sixty or so years for that last nap. I guess I am a bit peckish.\" A blast of flames from my mouth warmed the lake up and I used it to clean my body, feathery wings and peel away the last of my old skin. \n\n\"How is that one doing?\" I mutter to myself and feel for the traps. She had already bypassed nearly a hundred traps and was in the fourth floor of the full mountain complex. \"She's making good time for a solo adventurer. Maybe a demigod? Wouldn't be a god no one is stupid enough to bother me after the last war... I think. Maybe a new god?\" I just shrug off the idea and dive into the deep part of the lake.\n\nCasting invisibility I breech the surface of the water far from the main opening of my mountain. I see a large airship parked not too far from the entrance with tiny humans milling about. Banners and insignia I didn't recognize showed itself off. I got as close as I could without disturbing the rock and just observe for a few minutes. Some merchant group was leading this thing apparently and responsible for delivering the woman. Paid to do it instead of responsible for her. Said she'd be back. Hah!\n\nI found the whole idea laughable. Someone going deep into my domain and expecting to come out alive? I had to leave before my laughter gave myself away. I hunted in the deep valleys of my continent and even out on the open plains. A number of large elk and deer was a perfect light snack. A lone horned beast a main course. And for desert, there so happened to be a roc nest nearby. I pilfered an egg leaving the other behind for later, maybe.\n\nHours passed and as I was just enjoying the feel of pure sun on my scales, I felt an alarm go off. The woman had entered the vault. Seriously? The first one in ages to ever reach my cavern and she makes it to the vault? A full two thirds of the way to my arena and domain? Almost at my own resting chamber? The thought raced in my mind on if I should even grace her with my presence or wait till she leaves? I idly just chewed on the tip of my tail, an old tick I never quite got over. \"Fine, I'll meet her if she so wishes.\" \n\nI had to race to make it back. Crossing a whole empty continent and returning through the lake passage. Finally, came to my arena. A large open space that was perfect for facing me. It had small solid walls that any smaller being could hide in. I carved and created it with perfection to give myself the biggest challenge. I wanted to have a good fight. I coiled around a large pillar near the back hidden away in shadows and just waited. \n\nThe woman finally entered. She, a brazen tall figure with fiery red hair and polished white armor. She almost looked like a holy knight as she wore a long flowing cloak. Not even a tear in it or singe. She bypassed all of my traps. Fascinating. First one to make it to me unharmed it seemed. A loud hiss from my lips and the hundreds of large crystal around the arena lit up glowing and shining in all areas. She had to hide her eyes a moment to adjust, and when she looked back she saw me. \n\nI was a glorious serpent that sat hundreds of meters long and with massive wings and thousands of feathers. I was said to have been the most beautiful and destructive force this world has ever seen. A sight of wonder and terror. \"I am Fluffles the Devourer of Gods! Who dared to enter my domain?\" I said with a soft hiss looking down at the woman.\n\n\"I am Victoria White.\" She pulled a pouch out from under her cloak and started to open it. \"On Behalf of the united kingdoms and the gods at large. I've been authorized to audit you. I am with the Internal Revenue Service of Heaven.\"\n\n\"The IRSH?!\" Oh I'm in big trouble now. How much did I owe in back taxes? How long have I been asleep and alone? Did they even change the divine tax laws? \"Ho-\" My voice cracked. I coughed to clear it a bit. \"How can I help you? I've been asleep for quite some time. I'll do what I can to make this go easy.\"",
   "created_utc": 1690661819,
   "score": 1,
   "submission_id": "15d05q2"
  }
 ]
}