{
 "submission_id": "15d1tsz",
 "title": "[EU] All the supervillains know that Superman is Clark Kent, they just play along because whenever he's working his 9-5 is time when he can't be out fighting crime",
 "selftext": "",
 "created_utc": 1690661993,
 "permalink": "/r/WritingPrompts/comments/15d1tsz/eu_all_the_supervillains_know_that_superman_is/",
 "score": 10,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d1tsz/eu_all_the_supervillains_know_that_superman_is/",
 "comments": [
  {
   "comment_id": "jtzjan9",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690661994,
   "score": 1,
   "submission_id": "15d1tsz"
  },
  {
   "comment_id": "jtzwruq",
   "message": "Kent. \n\nKent! \n\nCurse the foolish farmers that found and raised that alien, as if he were one of us. He'll never be Human! Floating above us in his Watch-tower, with all the other gods and goddesses, and that lunatic Wayne, that funds it all.\n\nBut isn't that the ultimate insult? It isn't enough that he imposes his laws upon humanity, he gets his kicks from \"slumming it\", play-acting as if he bleeds, breathes, eats, excretes, passing his commentary on our \"weak, fallible flesh\".\n\nHMPH!\n\nI'm Lex Luthor, dammit! I am a miracle of Evolution, a Million years in the making, with brain enough to make my own fortune, might enough to hold my own with Professional fighters, and even in the face of a mocking would-be deity from a long-dead planet, I have all of the tricks and enhancements I need to stand toe-to-toe.\n\nAnd what are my Weaknesses? Radioactive isotopes? Certainly they are more dangerous than the pitiful pieces of green glass a thousand times less harmful (to the average human, at least) than the folly of Eben Byers.\n\nAnd yet, what drives a would-be deity to experience the life of a \"mild-mannered\" reporter? A life that is tantamount to corporate espionage, to chase the \"big story\", as if any journalist these days couldn't be bought off with a trifling million or two, and suddenly they're starry eyed, and Editors are praising my every move, which is far more considered than that Fool Arron Minque. Z, the last word in mobile device apps my foot!\n\nInvestigative journalism is dead, Kent! Didn't you get the memo?\n\nAh, but still, every moment that damnable Invader spends \"cos-playing\" at humanity, is one less moment spent interfering in my business, in my life. And Good Riddance! Kryptonite is Expensive, you know!\n\nAh, Kent. You still believe, don't you? You think that we don't know? It's only by my hand that those fool farmers that raised your larval state are kept from harm by every bandit and ne'er-do-well from the Backstreets of Metropolis to Timbuktu! And Lane, that you have bewitched so. And don't think that I would steal her away for my own, just because she took \"Loving the Alien\" far too literally. I could have any woman in the world, and frequently have- Hm, those tales are mine alone to keep.\n\nAll of them, Kent. Toyman, Brainiac, Bizarro, That death-obsessed bag of bolts Henshaw, countless others in the shadows of this fair city, do you know, Kent? And all of them, every last one, Kent, all of them are kept from your door by me. Your family walks the streets of this fair city, your larval caregivers putter their insignificant little lives, in literal Smallville. The irony is not lost upon me.\n\nAnd all of it, every last brainless, fearless, brazen moment, Kent, every second... by MY design, and MINE alone.\n\nAnd wouldn't it be fun to let you know this, Kent? To show you that I could rip away your normality with a snap of my fingers? To destroy your comfortable little world, and leave you broken and at my mercy?\n\n...And steaming mad, with nothing but time to interfere in my grand schemes. \n\nNo, such acts of self-sabotage are the domain of Minque and the Nouveau Billiardes. And I have no desire to join That little club.\n\nMuch better to watch you dangle, like the worm you pretend to be, on the hook. And one day, I will show you that I, Lex Luthor, Peak Human Specimen, First among lesser intellects and lesser physiques, am the \"Hero\" that this sad little world needs. And I will eliminate every last invader from the skies, with Malicious intent. That includes you... Superman.",
   "created_utc": 1690667600,
   "score": 1,
   "submission_id": "15d1tsz"
  }
 ]
}