{
 "submission_id": "15d16b4",
 "title": "[WP] The reason humans can’t use magic is because of the iron in our blood",
 "selftext": "",
 "created_utc": 1690660291,
 "permalink": "/r/WritingPrompts/comments/15d16b4/wp_the_reason_humans_cant_use_magic_is_because_of/",
 "score": 130,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d16b4/wp_the_reason_humans_cant_use_magic_is_because_of/",
 "comments": [
  {
   "comment_id": "jtzf4kf",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690660291,
   "score": 1,
   "submission_id": "15d16b4"
  },
  {
   "comment_id": "jtzzlki",
   "message": "\"I'm sorry, but you have no iron in your blood.\"\n\nI blink. \"As in... It's pretty low?\"\n\nThe doctor shifts in his chair, clearly uncomfortable. He glanced at his paper as is it offers an easy answer to this confusion.\n\n\"Umm... no.  You have no iron in your blood. Zero.\"\n\nI frown. \"Surely that's bad, right? \"I've definitely heard of iron deficiencies. My mom had one. She was sleepy as hell for months. Until they put her on a strick diet of steak and iron pills. Fixed her right up- talkative as ever. \n\nDad still hasn't forgiven the hospital. \n\nThe Doc glances down at his clip board again. As if it'll hold the answers: \"It's.. Not amazing- normally.\"\n\nMy spider sense is tingling. This isn't right. \"What does this mean?\"\n\n\"Have you had any strange experiences recently?\"\n\nI thought back, to the dog that dropped dead when attacking me. To the ATM that started spewing money. To the rain closed that had followed me for the past three months. Desire whatever weather was overhead.\n\n\"Maybe?\"\n\nThe doc glances at the door. He's nervous. I don't know why.\n\n\"Anyone interesting coming?\" I ask. Joking to ease the tension.\n\nHe blushes and looks down again...\n\nOh god. He is expecting someone.\n\nHe's afraid.\n\nOf me.\n\nI stand. \"Alright, I'm outta here.\" I make for the door.\n\nSuddenly the Doc is before me. His face contorted in fear and... Something else.\n\n\"N-no. You can't leave.\"\n\nI roll my eyes. \"Why not?\"\n\nHe glanced down to his chart once again, clearly he couldn't function without it. Such a strange fall from grace, he had been my go to carer for years. And now he was this sweating, panicking mess.\n\n\"I can't say-\"\n\nI step past him. Bored.\n\n\"-okay!\" He almost yells, stepping in front of me. As he does so, his papers fall to the ground. \n\nI stop, glancing down at him. \"Why shouldn't I leave right now and never come back?\"\n\nHe swallows. \"I- I can help.\"\n\n\"Help with what?\"\n\n\"Your lack of iron, it's been coming for a while. I've known about this meeting for a while.\"\n\nWhat else could I do but blink?\n\nAs if spurred on, he continued. \"I've known for a while, since the world started to turn wrong, that magic is indeed real. And iron is its anthesis. And the Earth has means of stopping it from becoming an issue...\n\n\"Like iron in my blood... It's natural?\"\n\nHe nods. \"It's natural, in an unnatural way. Nature taking back control.\"\n\n\"But my iron is gone, how is that control?'\n\n\"It's control... Just for someone other than you.\"\n\nI look at him. This is all too much, and too confusing.\n\n\"This is dumb as shit. Who are you taking about?\"\n\nHe glanced down. \"Someone who was expecting you. Someone who said to stall you.\"\n\nI glance down at the chart the doc dropped. And blood turns to ice. \n\nWritten on the page is: '\"I'm sorry, but you have no iron in your blood.\"\n\nI blink. \"As in... It's pretty low?\"",
   "created_utc": 1690668783,
   "score": 17,
   "submission_id": "15d16b4"
  }
 ]
}