{
 "submission_id": "15d8yzb",
 "title": "[WP] Your friend/SO suspects you're the city's local superhero and jumps off a building in hopes that you'll blow your cover to save them. Only thing is, you actually AREN'T the local superhero. This is a huge problem.",
 "selftext": "",
 "created_utc": 1690681349,
 "permalink": "/r/WritingPrompts/comments/15d8yzb/wp_your_friendso_suspects_youre_the_citys_local/",
 "score": 100,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d8yzb/wp_your_friendso_suspects_youre_the_citys_local/",
 "comments": [
  {
   "comment_id": "ju0qo99",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690681349,
   "score": 1,
   "submission_id": "15d8yzb"
  },
  {
   "comment_id": "ju1rqu6",
   "message": "This is bad. There is a certain decorum for the caped and cowled peoples. Do NOT mix business with private life. I am very adamant about that. My best friend and crush Destiny got curious when she noticed patterns. She noticed my absence whenever Defender would ever fight the resident villain, Raygun Ravager. She thought herself clever that she figured this pattern out, saw we were of similar height, and same body type. She knew for sure the pattern was there.\n\nUnfortunately humans tend to see patterns in EVERYTHING. Unfortunately she just had to jump off the building, and unfortunately she was caught by Defender who floated up with kissing who she thought was her friend. \n\nUnfortunately for the Defender, who seemed to deepen the kiss, I am one jealous super villain. Unfortunately for the Defender, I was also still pissed about losing the last fight and had a bone to pick with him. Unfortunately for the Defender, the Raygun Ravager was standing at the top of the building with my heat ray finger gun pointed at him. \n\nThere is a reason I adhere to separation of work and private life, because people tend to get hurt. Specifically Defender. A shame I didn't have a plan to capitalize on my beatdown of the resident super hero.\n\nOn the plus side, Destiny thinks I'm pretty cool. She did always have a thing for bad boys.",
   "created_utc": 1690704032,
   "score": 42,
   "submission_id": "15d8yzb"
  },
  {
   "comment_id": "ju2f8en",
   "message": "Faith is a strange thing. I was reminded of that as I watched her. I kept pleading with her, I kept trying to say that she was  seeing and thinking things that were not true. I thought about the clip she had shown me, her terrifying fall when that crane smashed into her parents apartment. I distinctly heard her terrified screams as some hapless gawker filmed her inevitable and definite demise.\n\nAnd then he saved her. \n\nThe clip barely caught sight of him as he flashed by her falling body. The person filming scanned the sky and saw nothing. They didn't know she had been saved she just disappeared. They stopped filming but that was not the end of the story. \n\nShe had told me endless stories about how that day changed her life. She constantly relayed to me how she had been a lazy hopeless college drop out, mouching off her parents and generally okay with nothing. Then she fell and felt that same transcendent sensation of any suicide attempt. That immense feeling of regret at wasting a life, that horror of realization of the value of a human life. In that moment she wanted to be the person she never believed herself to be. And then he saved her. \n\nHer therapist called it Savior Syndrome, it develops in 20% of those saved by Exo- tangents, even in the weaker more local heroes. Most learn how to manage it and there are certain medications, but she warned me that the more powerful the hero the riskier it became. She also told me that she was worried that she was developing a fixation of me because of my Japanese heritage.\n\nDarkstar was Japanese, Darkstar had saved her, Darkstar was the most powerful hero on earth. \n\nApparently I held a resemblance to him, enough of a resemblance for her. Yet even though I knew her attraction to me was partially due to her mental illness I loved her. She was sweet and kind and friendly to dogs. My parents liked her and I was thinking of proposing. I knew her issues, I had helped her through moments of intense depression when she wasn't saved from the troubles of her daily life. I would comfort her even when I couldn't save her. We where okay. \n\nBut now, with tears in my eyes and her in the ledge it all seemed to fall away. The police where still minuets away, I was the only one who could save her. I was the only one here for her. In this moment I was her hero and that was okay. \n\nI took a deep breath and thought of what her therapist had told me to say. Reestablish reality, remind her of the small ways she is special, the beautiful ways she saves the world through her charity work. Keep her here in the world of the real and instead of the world of chance encounters turned spiritual. \n\n\"Amy...\" I pleaded \"It was a statical anomaly. Darkstar was passing by, he saw you, he saved you. These are facts\n\n\"No... you knew\" tears streamed down her face too. \"You knew I was worth saving... you knew.... you could have let me fall\"\n\n\"No... Amy...I never met you before June 6th\"\n\n\"Your lying, I know your lying,  you always go out late at night, you are saving people everyday and I'm... I'm going to make you prove it\" she bundled her courage and took another step. \n\n\"Amy Amy Amy...\" I screamed as I took another jittery step forward. \"Please... please...\"\n\n\"No, it will be okay, it will be just like that day\" her eyes looked up to the sky in a spiritual ador \"that glorious day\"\n\n\"Amy,  he saved you because he was passing by, he saved you because of random chance. It was luck, not worship that saved you\"\n\nShe grinned looking back at me with eyes that conveyed pure love. \"I know you would say that, you have to, but it's okay, miracles happen and you knew I deserved love and joy\"\n\n\"Amy... I'm not dark star\"\n\n\"YOU ARE!\" she screamed teetering on the edge.  \"You have to be, why else would you love me?\" She asked genuinely. \n\n\"Amy...I love you because you're great...\" i said aghast that I even had to justify that. \n\n\"And you'd only know that if you saved me\" she smiled satisfied with her answer. \n\nFaith is a powerful thing. She believed she was worth saving but only because she was saved. It was a self justifying belief based upon a chance encounter. It clouded her judgment but it had also given her a new lease on life. But now it was going to kill her. All of these thoughts ran through my head as I saw her tip back. \n\nI screamed and cried as I saw her fall. Her face was dumb with hope and bliss. He savior would save her again and she should be able to believe she was worth living for again. She would know I was her hero and her love and we could get married and live happily together forever. \n\nBut I wasn't. I could save her on those cold nights where she shivered in terror from the weight of the world, I could save her when someone called her overweight or a looser. I could not save her from falling off a building. I realized how weak and fleshy my body was as a thick feeling of agoraphobia gripped me as I looked over the edge. I saw her body hurling to the ground below.\n\nShe had such faith even I was awestruck. \n\nWhat struck me more though was that she disappeared from my sight. I heard something behind me and I turned tears still in my eyes. I couldn't believe my eyes. She was save and alive in the arms of Darkstar. There was a shocking resemblance between us the only difference was the sadness in his eyes. Someone had called him. He was the only one who could save her. He was the only one she would want to be saved by.\n\nShe opened her eyes wanting to be justified but instead provided with a contradiction. Her two heroes sat on different sides of the skyscraper roof. She looked at him with a religious confusion. He simply set her down and to off, silently and speedily ascending into the heavens.\n\nThe police found us on the roof, her crying in my arms and me holding her tight, both of us grateful to be in the other's arms.",
   "created_utc": 1690721287,
   "score": 31,
   "submission_id": "15d8yzb"
  },
  {
   "comment_id": "ju3dc06",
   "message": "SUSAN\r  \n\r  \nI typed into my digital diary:\r  \n\r  \nTomorrow's the big day. Of course I know he's not FighterJet, but he can never know the real reason for the jump. He would blame himself to no end. I can't do that to him.\r  \n\r  \n\\--\r  \nHENRY\r  \n\r  \nIt was a pleasant spring afternoon when I received that phone call. I was in the office on the 20th floor of the World Tower, home to the World Media Group. I was no one of consequence over there, just another hero-chaser blogwriter. Someone whose main contribution to the daily paper was to report sightings, rumours and gossip regarding the superhero world.\r  \n\r  \nI checked the phone. It was Susan.\r  \n\"To what do I owe the pleasure, Mrs Cahill?\" I said, in our customary greeting.\r  \n\"To talk to you is in itself a pleasure, Mr Cahill.\" came back the reply.\r  \n\r  \n\"Actually, there is something.\", she continued. \"Where are you now?\"\r  \n\r  \n\"The Spin-Mill, as always.\", I replied.\r  \n\r  \n\"Head to the balcony, and look towards the Dink Chocolate building.\", she said.\r  \n\r  \nI complied.\r  \n\r  \nAnd that's when I saw her.\r  \n\r  \nOn the roof.\r  \n\r  \nAt the very edge.\r  \n\r  \n\"What are you doing over there?\" I asked innocently. I truly didn't know.\r  \n\r  \n\"I'm about to jump.\" came back the reply.\r  \n\r  \nMy heart skipped a beat, then started sprinting furiously.\r  \n\r  \nI started rambling. \"No. Don't do that. We can fix this, whatever it is. That is a permanent sol-\"\r  \n\r  \nI was interrupted. \"Henry, you are seriously scared? When you would rescue me?\"\r  \n\r  \n\"We both know you are FighterJet.\"\r  \n\r  \nAhhhh, not this again. I started praying silently in my head.\r  \n\r  \n\"L-love, we've been through this. I'm not a superhero.\" I replied, nervously.\r  \n\r  \n\"Why else have you both never been sighted together? And yet you always seem to get the best pictures of him. The \\_closest\\_ pictures of him. No one's shots compare.\"\r  \n\r  \nAh, that. Unfortunately, what she said was right. I \\_did\\_ get very good photos of him.\r  \n\r  \n\"I'm saying this again: I'm not FighterJet. I'll tell you why I get such good photos but you have to get off that ledge, \\*now\\*.\", I said, not even trying to hide the fear in my voice.\r  \n\r  \n\"What other explanation is there?\", she said.\r  \n\r  \n\"All right. I'll tell you. It's because I have a drone! A mil-spec drone that can keep up with him! The only reason I don't tell the others is because they'll try doing it too, and the only reason I didn't tell you is because the truth of how I got there is too painful!\" I screamed.\r  \n\r  \n\"Very convenient Henry. A little too convenient. If I'm wrong about this, then so be it.\"\r  \n\r  \n\"Goodbye, Henry.\" she said, cutting the call.\r  \n\r  \nI'll never forget what she did next.\r  \n\r  \nI watched her put one foot forward into thin air, lean forward, and plummet to the ground.\r  \n\r  \nI barely remember the journey to where she was. The elevator dinged, cars honked as I ran across heavy traffic.I pushed through a crowd that had gathered. \r  \n\r  \nAnd then I saw her. She looked like she could have been sleeping. Except that her limbs were askew and her body was in a pool of blood.\r  \n\r  \nShe was dead.\r  \n\r  \nI knelt beside her. I couldn't believe it. \r  \nTears were streaming from my eyes. I could say only one word.\r  \n\r  \n\"Susan.\"\r  \n\r  \nI was not prepared for what happened next.\r  \n\r  \nSuddenly, her eyes opened and she sat up, gasping for breath. There was a faint golden glow in her eyes.\r  \n\r  \nOh. Everyone knew what that meant. Anyone into superheroes, anyway.\r  \n\r  \nShe slowly stood up, looked around her, then gazed up to the sky and screamed one word:\r  \n\r  \n\"GOOOOODDAMMIIIIIT!\"\n\n\\--\n\nEnd of P1. P2 in reply due to charlimit.",
   "created_utc": 1690736565,
   "score": 1,
   "submission_id": "15d8yzb"
  }
 ]
}