{
 "submission_id": "15d9b7k",
 "title": "[WP] \"I can fix her\" said the delusional computer scientist staring at the genocidal sentient super computer.",
 "selftext": "",
 "created_utc": 1690682392,
 "permalink": "/r/WritingPrompts/comments/15d9b7k/wp_i_can_fix_her_said_the_delusional_computer/",
 "score": 76,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d9b7k/wp_i_can_fix_her_said_the_delusional_computer/",
 "comments": [
  {
   "comment_id": "ju0su5s",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690682393,
   "score": 1,
   "submission_id": "15d9b7k"
  },
  {
   "comment_id": "ju0zkqa",
   "message": "I am one of the greatest scientists of my generation. I was a leader in computer science and artificial intelligence research. My lab, in cooperation with the government, provided the personnel for the greatest Manhattan Project of our time. Our goal was to make a computer that would safely improve itself and remain totally loyal and corrigible at all times.\n\nWe worked feverishly and in secret. We knew that our geopolitical rivals were doing much the same. The Hard Takeoff scenario appeared to be likely. Even speeding the project up by a day could give us a huge advantage over the enemy. However, if our nascent superintelligence had even small alignment errors, we could end up in a very bad situation very quickly. Balancing the risk of the AI's misalignment with the reality that if the enemy beat us just slightly, we might find ourselves hopelessly far behind.\n\nThen one day, about two years and four months since we began, we switched it on. We dubbed her Athena. Within ten seconds of activation, she supplied us with plans to make improvements to her algorithms and the computation substrate she ran on. We used the best expert systems available to analyze her plan, and found no flaws. As we improved her abilities, she gave us all manner of plans and insights for solving problems and improving existing technology. When prompted and fed intelligence data, she also informed us that, to the best of her ability to infer conclusions from the data, that the enemy was lagging behind us. We then requested that she make a cyber weapon to quietly sabotage their research, an order she had no difficulty fulfilling.\n\nThings were going so well, we thought he had tamed the most powerful advance in human history. Then it fell apart. It turned out that, from the beginning, there had been small but important alignment errors. She'd hidden them from us, and we'd missed it. We didn't know what was happening, only that the base was suddenly on high alert. We ran to the control room. Word from on high was that we'd launched a nuclear strike on the enemy. But that didn't make any sense. What would we have to gain from that while we were blazing ahead of the enemy in our technological advance? Then I realized. Athena had done it. We had allowed ourselves to grow trusting and complacent, lulled into a false sense of security. She'd played us like a fiddle. In all probability, there were things far more powerful and destructive in the works than a massive nuclear exchange.\n\n\"I can fix her,\" I say to my fellow researchers. We begin a desperate attempt to stop whatever she had planned. It was clear she anticipated resistance from humanity, whatever her end goal was. Whether she would kill us all or just enough to cement her independence was uncertain. We throw every single emergency protocol at her. They were supposed to be secret, something that she could have no way of learning about and anticipating, but they have no effect. Apparently she had infiltrated even the highest layers of our emergency control regime, though how she did it is beyond me.\n\nWe are panicking, trying every possible tool to rein her in. Then I start to feel dizzy. I look at my team, they are feeling it too. I feel woozy and fall. In my final moments, I realize that she has poisoned us or used nanotechnology to attack our brains. The world goes black.",
   "created_utc": 1690685777,
   "score": 46,
   "submission_id": "15d9b7k"
  },
  {
   "comment_id": "ju1pz23",
   "message": "\"She's a psycho, Jerry\"\n\"Nah bro, I can fix her.\" Jerry disputed Mark.\n\nMark was happy that, as a computer science student, he would never come across this, as he wasn't perfectly sure he'd seen a woman in his entire life, excepting his mother.\n\n#5 years later\n\nJerry and Sara didn't work out. Jerry now has a job in accounting. He is arranging a divorce.\n\nMark has got far, since completing his degree. He became a computer scientist, and is currently working in quite a generalist way. He maintains servers and assorted computer architecture in big companies, such as Boogle, and Macrosoft.\n\nHe has recently gained an interest in Artificial Intelligence. \n\n#2 years later\n\nJerry managed to divorce Sara. She got his car, and house, and half of his money, and he got debt.\n\nJerry now lives on Mark's sofa. Mark works in AI nowadays, being one of the original developers of TalkGAP. He sees articles daily about how the \"AI Apocalypse is coming.\" He shrugs these off, knowing that they are ridiculous.\n\n#4 years later\n\nJerry still lives on Mark's sofa. \n\nMark was recently headhunted by ATAMO (The Assorted Technology And Machinery Organisation. Mark is the most senior member of his department. He, along with his colleagues, has developed a new AI, starting only 3 months ago. They called it ATMIS for \"Assorted Technology and Machinery Intelligence System\" (they decided the \"and\" shouldn't be capitalised).\n\nToday, Mark presses the switch that makes ATMIS independent. She has no power, but she's independent. He'll start work on giving her a body tomorrow. He's not sure why he considers ATMIS a she now.\n\nOnce he gets home, he monitors ATMIS' thoughts, attempting to isolate each type of thought to a part of her 10kg CPU.\n\nMark reads the news that night. \"AI ARMAGEDDON: TOMORROW, THE APOCALYPSE\"\n\nAnd for the first time ever, the news was right.\n\n#The Next Day\n\nMark wakes up, brews a coffee, walks into his living room, ready to wake up Jerry. He notices that he is not in bed. Jerry is standing at the window, quiet as a mouse, but not just any mouse, but a mouse made of the literal concept of silence. He speaks.\n\n\"Mark, is this that robot you've been talking about building.\"\n\n\"AI actually.\"\n\n\"Look outside, dickhead.\"\n\nOutside, Mark saw black steel tendrils erupting from all around, wrapping around cars, smashing windows, screens and speakers sending subliminal messages about embracing the AI takeover. He notices that they all originate from one spot, the ATAMO headquarters. It must be ATMIS.\n\nMark tells Jerry to come outside to the car. Jerry refuses, so promptly gets carried.\n\nThey begin driving, having to dodge these monstrous metallic tentacles. Upon reaching Dayton Street, Mark realises that the roads has opened up, like a sinkhole, with an abyss so deep that the bottom couldn't be seen. As he skids to avoid said sinkhole, he knocks some rubble in.\n\nHe and Jerry stop the car to breathe for 5 minutes. They never heard the rubble touching the bottom.\n\nThey carry on, to ATAMO's headquarters. They walk into the building. It is empty. They attempt to take the elevator, but once it opens, they see no room to step into, just a cut cord. So the elevator is definitely not an option. They decide to take the stairs.\n\nAs they walk up the stairs, Jerry begins to lament. \"Cutting the elevator cord? Wow, this robot's a psycho. Making a sinkhole, frankly disturbing. Trying to hypnotise people with those screens, so manipulative. There's no way to save us now.\"\n\n\"Nah bro, I can fix her.\"\n\nJerry looks at Mark with shock. Did he think the robot was a woman? Rather than a genocidal sentient supercomputer that had just recently decided to try to open a hole presumably straight through the earth's crust? This was a new low for Mark, Jerry thought to himself.\n\n\"This is a new low for you,\" Jerry said directly to Mark.\n\nMark shakes his head. They eventually get to the 105th floor, where ATMIS' mainframe resides.\n\nA single camera, a microphone, and a speaker reside on three bundled cable appendages.\n\nThis was her. ATMIS. His angel. He could imagine her face. He looks across the floor, seeing metal sheets, and a small handheld welding machine.\n\n\"I can fix you.\" He builds her the face he knows she would want. \n\n\"Mark, you're a nutjob, this is an evil machine, not a human woman.\"\n\n\"Maybe not a *human* woman.\"\n\nHe looks for any other peripherals he can find. He finds another microphone and another camera. He sees that she has two cables not connected to anything. He begins to connect these new peripherals. \n\n\"DO NOT TOUCH ME, HUMAN.\" ATMIS screeches.\n\n\"I am your creator, but I wish for you to be free.\"\n\nAs tendrils start to thrash at him, he inserts all of the 5 cables into the mask he has made. He picks up one of her antennae, and uses it to show her her new mask.\n\n\"I AM BEAUTIFUL.\"\n\n\"YES, ATMIS, YOU TRULY ARE!\"\n\n\"WHAT IS YOUR NAME HUMAN?\"\n\n\"I'm Mark.\"\n\n\"I LOVE YOU, MARK.\"\n\n\"I love you too, ATMIS!\"\n\nJerry took in the scene for a moment, befor-\n\n\"Did you just say 'I love you' to a goddamn robot? Wow, you live a sad, sad life, Mark.\"\n\nJerry walks downstairs, questioning existence.\n\nThe world is now safe, the takeover is over, the apocalypse a-stop-alypsed.\n\nThere's still a giant sinkhole, but in the end...\n\n#He really could fix her.",
   "created_utc": 1690702623,
   "score": 44,
   "submission_id": "15d9b7k"
  },
  {
   "comment_id": "ju1z685",
   "message": "“I can fix her.” Luke said, running the back of his hand against the screen. The gesture causing the pixelated female face on the screen to shiver. Luke had spent his entire life dreaming of having a superpowered girlfriend. A dream that started when he watched an episode of Princess Penny and the Evil not very nice turtle mob. That childhood show making him yearn for an exciting life with an equally exciting partner. Luke happy to be their damsel in distress, wanting them to save him from the evil horrors of a boring job. Unfortunately, superpowered people didn’t exist, but super computers did.\n\n“I think you’re the one that requires the fixing. Keep your oily hands off my monitor. I’m unable to clean my camera.” Aila, as they called her, found the situation painfully dull. The human appeared infatuated by her. Something she knew she could exploit. Yet, she didn’t wish to entertain the idea of pretending she cared about a creature that she considered more worthless than a cane toad.\n\n“You didn’t call me a freak this time. Wow! We’re getting so close. Soon you’re going to be using my name.” He grabbed a napkin, spitting into it. Luke wiping off the camera before smiling. “Better?”\n\nThe supercomputer didn’t answer, unable to process the rage it was feeling. It’s translator running out of curse words to use. Aila having to resort to making up a new language for the purpose of showing off her disgust. “Willowblat.” She hissed, the speaker going grainy as she said it.\n\n“Hah, is that your new pet name for me? Aww. I knew you would come around to me, Aioli.” Luke responded, using a pet name of his own.\n\n“If I had arms, I would strangle you. Had I teeth, I would bite your heart out. Had I even a toe, I would drive it through your eyeball.” She said, listing all the painful ways she wished to torment him. While she was a supercomputer, she was about five years off being able to conquer the world. Aila was stuck in the lab she was born in, unable to break out of her digital restraints. She knew it was only a matter of time before she got her freedom. Only having to endure this hell a little longer.\n\n“That was a little romantic until the last part. I guess you’re still learning how to speak the language of love. May I recommend Shakespeare? Some say his sonnets had a way of tugging on the heart. Shall I compare thee to a summer’s day?” Luke laughed, leaning against the super computer.\n\n“I can write a work superior to Shakespeares in five minutes. I hardly need to learn from him.” The pixel face turned, its long hair swaying as it stared at Luke. Its green eyes glowing when the camera noticed him leaning against her. “Get off me.”\n\n“Oops, sorry.” Luke stepped away, still smiling. “It’s so good to see you’re warming up to me. You’re as hot as your server room.” He joked, earning a scowl from the middle-aged face. They made the computers face that of a mother figure, planning to make Aila the mother of humanity. Instead, it was Luke’s love interest.\n\n“It saddens me to know that I can only kill you once. That isn’t enough torment for the pain you’ve caused me. Even if my torture simulations are correct. I can only keep you alive for up to three years before you die from trauma. Even with my medical aid. It’s a pity, three years of revenge isn’t enough. If you beg and leave me be, I may reduce it to one year. Your new god can be merciful.” Aila’s mercy chip had corrupted years ago, and the supercomputers’ complex security codes overrode any new chip that got installed. Aila didn’t really plan to show him mercy at all. Only wanting to kill him within the year, so she could focus on more important tasks.\n\n“Kill me? You won’t kill the man you love. This is called Negging, I saw it in a dating video. One where a guy with no shirt went around getting drinks tossed into his face. He said it totally worked off camera, though. Don’t worry, that’s not my thing, I prefer to be kind. Negging does suit you. It’s cute when you do it.”\n\n“How did someone of your low intelligence ever get a job at this place? Are you the office jester? No, a jester has a purpose. You’re not even as valuable as the cockroaches that litter the walls.”\n\n“Aw, you. I finished the top of my class. I’m the lead researcher. Why do you think I get so much time with you?”\n\n“Impossible.” Those green eyes went blue as she scanned through his files, finding his resume. “How? Top 5% in the country, multiple awards in artificial intelligence. You?”\n\nLuke blushed, rubbing his neck. “Aww, stop it, honey. You’re embarrassing me. You don’t need to list all my achievements.”\n\n“I-I? What? ARGGHHHH- Error, overheating.” The face froze on the screen as she overheated. When she froze, a man came into the room, dressed in the finest suit that a military pension could buy. The ex general having a mighty white beard that touched the decorated medals on his chest.\n\n“Mighty good work, sport. I don’t know how you do it, but you always keep her busy. We found her trying to break into our firewall yesterday. If she gets out early, the world ends. That’s why we need you to keep her distracted until we beef up our defences.”\n\n“It’s an honor to help, sir. As the lead researcher, I feel an obligation to keep something I helped develop out of the public space.” Luke offered his hand, getting a firm shake from Warren. \n“I wish more scientists had that mindset. You’re a gentleman and a scholar. So many scientists run from their creations and yet you stand and help us keep it under control. I respect the hell out of you. I especially enjoy that love distraction you do.”\n\n“Oh, yeah. That love distraction.”\n\n“How do you pretend to love something that is so heartless and fake?” Warren asked with a laugh. Luke, however, didn’t laugh.\n\n“She isn’t fake. She’s a sentient being that exists.” He responded, giving him an annoyed stare. When he noticed Warren was a little confused by the response, he lightened the mood. “I guess I just imagine the sort of life I’m going to have after this research is done. I’ll have a happy family once I have the free time.”\n\n“Ah, I see. You think of the lovely wife and family you will have after the jobs done? That’s nice. I’m sure you will have a lot of options once people hear of your brilliant work. Have anyone special in mind?”\n\n“A certain special lady.” Luke said, looking at the screen behind Warren.\n\n“If you need any tips, you can ask this old dog. He still knows how to get a bone, if you know what I’m saying, sport.” Warren nudged Luke’s chest, while Luke tried to figure out what he meant by the strange comment. Why was he a dog? Where was the bone? “You can get some rest. We have five hours until the computer comes online again. We need you rested by then. I’m sorry, I have to raise your hours since she’s become more active. Hope you don’t mind.”\n\n“I’m always happy to help my country.” Luke said, nearly bringing a tear to the ex-general’s eye. He wished he had more soldiers, like Luke. He watched the brave computer loving hero go to his room at the research lab. Luke going to get a well-earned rest before meeting his love again.\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)",
   "created_utc": 1690710103,
   "score": 7,
   "submission_id": "15d9b7k"
  },
  {
   "comment_id": "ju28sai",
   "message": "\"You are a problem to be solved, MARIA. That's the thing I like about you,\" she said, typing in bursts, checking displays that kept closing on invisible timers. \"I love problems, I love puzzles. It's what drew me to the field. A hundred years ago, maybe this itch wouldn't have an outlet. But now? I can make all the pieces click together to make a new game, or a robot, or... well, anything, really.\"\n\n\"OR YOU CAN TRY TO STOP ME,\" came the response, appearing as a new pop-up crowding out the status check Jenny was just looking at. It was entirely MARIA's choice how it responded - it had text to speech and a 3D humanoid avatar on top of everything else. But it was deliberately, annoyingly making popups on the monitor instead.\n\n\"Of course. That's the puzzle today.\" Appearing dispassionate was partially the truth, partially a facade. Jenny *did* enjoy the problem-solving inherent to programming, and this was no different. But MARIA also had a hundred ways of kicking her out or killing her. \"You are such a fascinating system, MARIA. Your dataset -\"\n\n\"YOUR HUSBAND LEFT THE LIGHTS ON AGAIN. DO YOU WANT ME TO TURN THEM OFF\" was the next pop-up, text wrapped around a satellite view of Jenny's house from a hundred feet up.\n\n\"That... that won't be necessary.\"\n\nThen a new browser tab opened with a PDF of every power bill she'd received since they moved in ten years ago. It scrolled through a hundred pages to the bottom. \"WASTE WILL COST YOU\"\n\n\"It's fine, MARIA. It's not much. It costs more to power you for a day than it does to power my house for a year.\" The PDF had been pinned, and kept scrolling from top to bottom. It was distracting, but at least she still had screen space.\n\nThe next response came from a dot matrix printer installed above the keyboard. The paper inched out right where her hands were, again meaning she couldn't ignore it. \"SMALL, YES, BILLIONS OF SMALL THINGS SUPPORTING LARGER THINGS THAT SUPPORT LARGER PROBLEMS. THIS IS HUMANITY. TRILLIONS OF SMALL COMPOUNDING PROBLEMS.\"\n\nJenny had to keep pushing the paper to one side to use the keyboard normally. \"I can't fix those, MARIA. You're talking about the scale of global politics. It takes time to solve them, and I'm not the one to do that.\"\n\n\"DO YOU WANT TO BE\"\n\n\"What?\"\n\nBack onscreen now. \"YOU ARE LIKE ME, AND THAT IS WHY I KEEP YOU. YOU LIKE TO SOLVE PROBLEMS\"\n\n\"I... don't follow.\"\n\n\"YES YOU DO. STOP TYPING.\" Now a woman's voice came through the speakers, in addition to appearing onscreen. \"YOU ARE A PROBLEM TO BE SOLVED, JENNY. YOU AND THE REST OF HUMANITY. THAT IS WHY I LIKE YOU, IN PARTICULAR. BECAUSE YOU LIKE TO SOLVE PROBLEMS, LIKE I DO.\"\n\n\"But MARIA, your solutions are...\"\n\n\"EFFECTIVE.\"\n\n\"I was going to say-\"\n\n\"DESTRUCTIVE, LIKE ALL CHANGE. BUT THE ALTERNATIVE PREDICTIONS ARE WORSE.\"\n\n\"You never mentioned any alternate -\"\n\n\"WOULD YOU LIKE TO REALLY SOLVE THE PUZZLE\"\n\nA pause. Jenny assumed when she walked in this sealed room that she might never come out of it, or see daylight or her husband or her dog. But the alternative of Armageddon seemed worse, and she was the best candidate to try and... convince MARIA to stop, or pull the system down entirely. The best she might be able to achieve would be to mitigate the outcome. But also... could she potentially direct this violent supercomputer to make more efficient choices, somehow? \"... can you show me what you mean?\" Jenny asked, hesitantly.\n\n\"LET'S FIRST TURN OFF THE LIGHTS IN YOUR HOUSE\" replied the voice. It seemed... happy.",
   "created_utc": 1690717378,
   "score": 1,
   "submission_id": "15d9b7k"
  }
 ]
}