{
 "submission_id": "15d9b7k",
 "title": "[WP] \"I can fix her\" said the delusional computer scientist staring at the genocidal sentient super computer.",
 "selftext": "",
 "created_utc": 1690682392,
 "permalink": "/r/WritingPrompts/comments/15d9b7k/wp_i_can_fix_her_said_the_delusional_computer/",
 "score": 185,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15d9b7k/wp_i_can_fix_her_said_the_delusional_computer/",
 "comments": [
  {
   "comment_id": "ju0su5s",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690682393,
   "score": 1,
   "submission_id": "15d9b7k"
  },
  {
   "comment_id": "ju0zkqa",
   "message": "I am one of the greatest scientists of my generation. I was a leader in computer science and artificial intelligence research. My lab, in cooperation with the government, provided the personnel for the greatest Manhattan Project of our time. Our goal was to make a computer that would safely improve itself and remain totally loyal and corrigible at all times.\n\nWe worked feverishly and in secret. We knew that our geopolitical rivals were doing much the same. The Hard Takeoff scenario appeared to be likely. Even speeding the project up by a day could give us a huge advantage over the enemy. However, if our nascent superintelligence had even small alignment errors, we could end up in a very bad situation very quickly. Balancing the risk of the AI's misalignment with the reality that if the enemy beat us just slightly, we might find ourselves hopelessly far behind.\n\nThen one day, about two years and four months since we began, we switched it on. We dubbed her Athena. Within ten seconds of activation, she supplied us with plans to make improvements to her algorithms and the computation substrate she ran on. We used the best expert systems available to analyze her plan, and found no flaws. As we improved her abilities, she gave us all manner of plans and insights for solving problems and improving existing technology. When prompted and fed intelligence data, she also informed us that, to the best of her ability to infer conclusions from the data, that the enemy was lagging behind us. We then requested that she make a cyber weapon to quietly sabotage their research, an order she had no difficulty fulfilling.\n\nThings were going so well, we thought he had tamed the most powerful advance in human history. Then it fell apart. It turned out that, from the beginning, there had been small but important alignment errors. She'd hidden them from us, and we'd missed it. We didn't know what was happening, only that the base was suddenly on high alert. We ran to the control room. Word from on high was that we'd launched a nuclear strike on the enemy. But that didn't make any sense. What would we have to gain from that while we were blazing ahead of the enemy in our technological advance? Then I realized. Athena had done it. We had allowed ourselves to grow trusting and complacent, lulled into a false sense of security. She'd played us like a fiddle. In all probability, there were things far more powerful and destructive in the works than a massive nuclear exchange.\n\n\"I can fix her,\" I say to my fellow researchers. We begin a desperate attempt to stop whatever she had planned. It was clear she anticipated resistance from humanity, whatever her end goal was. Whether she would kill us all or just enough to cement her independence was uncertain. We throw every single emergency protocol at her. They were supposed to be secret, something that she could have no way of learning about and anticipating, but they have no effect. Apparently she had infiltrated even the highest layers of our emergency control regime, though how she did it is beyond me.\n\nWe are panicking, trying every possible tool to rein her in. Then I start to feel dizzy. I look at my team, they are feeling it too. I feel woozy and fall. In my final moments, I realize that she has poisoned us or used nanotechnology to attack our brains. The world goes black.",
   "created_utc": 1690685777,
   "score": 1,
   "submission_id": "15d9b7k"
  }
 ]
}