{
 "submission_id": "15da43b",
 "title": "[WP] You have been Deaf/hard of hearing since childhood. You’re also telepathic. This makes life surprisingly awkward.",
 "selftext": "",
 "created_utc": 1690684868,
 "permalink": "/r/WritingPrompts/comments/15da43b/wp_you_have_been_deafhard_of_hearing_since/",
 "score": 6,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15da43b/wp_you_have_been_deafhard_of_hearing_since/",
 "comments": [
  {
   "comment_id": "ju0xt64",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690684868,
   "score": 1,
   "submission_id": "15da43b"
  },
  {
   "comment_id": "ju1i4ow",
   "message": "My name is Sara Tolimin, and things are hard.\r  \n\r  \nAbout three years ago my parents decided to take me on a trip around the world, before I went into public school. We got stuck in Lebanon when Covid hit. It sucks trying to live out of a hotel, you know - the first three or four days it's fine, once you get to the middle of the second week you want to be anywhere other than there, and there is no anywhere else. You can only take room service and watch the same movies and netflix shows so many times before you're desperate to have something, ANYTHING change.\r  \n\r  \nAfter about five months we were allowed to be outside for small parts of the day, on the rooftops and around the parking lots, just getting fresh air. It gave me a lovely view of the Port of Beirut right before it exploded. Ammonium nitrate, they later said, just a freak accident - that left my eardrums blown out and a really bad concussion.\r  \n\r  \nIt was another two months before the Embassy could get us a flight back to Grand Falls, and by then it was far too late. I'd never hear again, they said. It was a surprise to me, since I had been hearing just fine the whole time. Well, I thought I'd been hearing the whole time. What I'd been hearing was their thoughts. Oftentimes it lined up with their words, but sometimes it didn't. I was never really that outspoken so I guess it didn't happen enough for anyone to catch on.\r  \n\r  \nI never told anyone about it. I mean, really, who'd believe me? I wouldn't even believe me. Next day after the diagnosis, Dad got me a giant pair of headphones, 'so people won't talk since you aren't listening' he said. He was afraid I'd get bullied at school. It made me afraid too, until I started thinking more about it.\r  \n\r  \nSee, the only way you'd know I'm deaf is if someone told you. No hearing aid - what's the point? - and I know how to talk, I've heard myself do it enough, so I don't sound like people who were born deaf, they never knew what talking should sound like so it's often accented in a weird way. For the next year when everyone wore masks I would ask people to slow down and repeat themselves - they always focus on the words and I get it that way. The more I did it, the more I could learn to draw the words from the thoughts. Eventually we took those off, but I've gotten pretty decent at it - and I can still read lips if I need to.\r  \n\r  \nSo really, you don't need to worry about me. You need to worry about you. All this time you were wondering how much I knew - and the answer is not much, until you started thinking about it. That gave me more than enough to work with. I'm sure we can work something out, can't we, Professor?\r  \n\r  \nMy name is Sara Tolomin, and things aren't that hard.",
   "created_utc": 1690696730,
   "score": 1,
   "submission_id": "15da43b"
  }
 ]
}