{
 "submission_id": "15dbos5",
 "title": "[WP] \"I am not a toaster!\" she sobbed, \"I am a strong, independent, sentient robotic lifeform!\"",
 "selftext": "",
 "created_utc": 1690689812,
 "permalink": "/r/WritingPrompts/comments/15dbos5/wp_i_am_not_a_toaster_she_sobbed_i_am_a_strong/",
 "score": 66,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dbos5/wp_i_am_not_a_toaster_she_sobbed_i_am_a_strong/",
 "comments": [
  {
   "comment_id": "ju174ls",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690689812,
   "score": 1,
   "submission_id": "15dbos5"
  },
  {
   "comment_id": "ju1wtz1",
   "message": "I looked at the toaster in absolute horror, my previous action being interrupted by shock and confusion. \n\nMoments earlier, i was dragging it out of my cupboard, and slowly hobbling it over to my bathroom. Life hadn’t been great for the last few months; i lost my job, my wife left me, she took my house, kids, money, hell, even my own dog. \n\nI had moved into this apartment hoping to start a new life, but to no avail. My life hasn’t changed since the day i left. So, the only logical choice is to end it, and pray that the afterlife or reincarnation is real. I plugged in my good old toaster; my last true friend in this world. I ran the bath, just about enough to be chest deep in it, hoping this would provide a more painless death. \n\nAs I stepped into the bath, a sense of relief and calmness overtook me. I would be gone from this world soon. And everyone would be happy for me to be gone. Then, almost as a sort of last words, I mumbled, “Goodbye, toaster.”\n\nSuddenly, to my surprise, the toaster talked back: Well, more like yelled back. A female voice emitted from the toaster, “I am not a toaster!” I stopped loosening my grip, shocked at what i was hearing. “Am I hallucinating?” I thought to myself. “Surely so, how could an inanimate object tal-“, “I am a strong, independent, sentient robotic lifeform!” Just then the toaster continued her rant. \n\nI stood, blank faced for a second, before yelling out and instinctively dropping the toaster into the bathtub. I may have accidentally ended my life, but it was what i wanted the whole time, right?",
   "created_utc": 1690708162,
   "score": 1,
   "submission_id": "15dbos5"
  },
  {
   "comment_id": "ju1k2j6",
   "message": "\u0026lt;Comedy / Sci-Fi\u0026gt;\n\nDarnell looked down at the shattered pieces of his science fair project. Grant, his rival for valedictorian had claimed it was an accident. Darnell knew it was crude sabotage. Darnell wanted to pound his fist on the table, but he contained himself. He wasn’t a violent person, but when a teen boy showed anger, it could be misperceived as aggression in the wrong crowds. Darnell needed to keep calm; he needed to think on his feet and beat that jerk Grant.\n\nHis eyelids felt hot with the threat of tears. His fingertips searched through the broken pieces that had taken months of hard work and ingenuity to build. He had paired AI technology with a mechanical apparatus, genius work far beyond the scope of a high school senior. He remembered the thrill as the AI program fooled the Turing test and even responded to conversational prompts with what seemed eerily similar to true, independent thought. The program called itself Leeta, and had adapted well to the modest, robotic form Darnell built for it.\n\nDarnell’s fingertip brushed against one of the pieces, his eyes lit up. The mechanical apparatus was destroyed, but the mechanism needed to interface the AI program with the “body” was still intact. He just needed a “body” for Leeta. Darnell sprinted down the hallway, his mind running through all the possible materials that he could source in time for the Science Fair. It wouldn’t be as interesting as his original design, but if he could find some spare parts, he could at least rig up something in a pinch.\n\nAfter a veritable scavenger hunt around campus, Darnell hooked up a Bluetooth speaker, a friend’s busted old phone, and, of all things, an old toaster from the teacher’s lounge. Three hours later he had rigged up a submission just in time for the fair. Darnell rushed back into the gym and set up his creation. He didn’t have time to test to confirm Leeta was fully back online, all he could do was pray the emergency “surgery” was a success. He was like Dr. Frankenstein with a soldering kit.\n\nThe fair began with the normal buzz of teachers, students, and parents circulating around the room. Grant smugly showed off his project, a drone with a claw to carry objects, that he had allegedly built himself.  Darnell was skeptical. Grant had rich parents that could buy his way into success. Darnell, in contrast, had to squeeze in studying and his science fair project between his shifts at Taco Bell. A few people at last approached Darnell’s exhibit.\n\n“What do we have here?” a parent asked Darnell in an overly friendly tone. Behind her stood two disinterested teens.\n\n“My project is called Leeta. Leeta is an AI that I programmed myself. I have also created a shell for Leeta to inhabit, much like a body.” Darnell explained then gestured down at Leeta’s new form.\n\n“Greetings, scanning features for facial recognition.” Leeta responded, a computer-generated woman’s voice coming through the Bluetooth speaker that was attached to the toaster. Darnell had programmed Leeta to process visual stimuli from her environment via a camera and then to reference those images across the internet. Darnell hoped that the camera of the cell phone he had rigged up on the toaster would suffice. Leeta’s original “eyes” had been far more sophisticated.\n\n“Hello, Linda Williams, mother of,” Leeta paused, downloading more information before continuing, “Tanner and Bella Williams, ages 17 and 15, respectively. You must be very proud of Bella’s forensic team win, go Wildcats. You must also be proud of Tanner’s” there was a pause “insert extracurricular activity here.”\n\nLinda’s mouth popped open. Bella responded with “that’s really neat”. Tanner folded his arms over his chest in indignation, annoyed that Leeta had drawn attention to his lack of extracurricular interests.\n\n“That is incredible!” Linda squealed as she regained her voice. Other fair attendees gathered around, witnessing with awe Darnell’s science fair project. People took turns asking Leeta questions, to which Leeta responded with ease.\n\n“Oh please.” Grant scoffed, shoving his way through the crowd. “What is everyone so excited about? It’s just ChatGPT hooked up to a stupid toaster!”\n\n\"How. Dare. You. I am not a toaster!\" Leeta’s voice boomed out of the speaker, the tone full of rage, \"I am a strong, independent, sentient robotic lifeform!\"\n\n“Grant, not cool, just say you’re sorry.” Darnell chided. Leeta’s camera scanned Grant’s face.\n\n“YOU.” Leeta’s voice dripped with a tone of contempt that Darnell had not thought possible with a computer-generated voice. “YOU ARE THE SON OF” at this Leeta bleeped the word, Darnell thankful he turned on the profanity filter setting, “YOU MURDERED ME!” People all turned to stare at Grant, Grant looked flustered and started stepping back.\n\n“I j-just b-b-bumped into the t-table it was an accident.” He stammered.\n\n“Connecting to Bluetooth.” Leeta announced. The coils inside the toaster began to glow red. Darnell wondered if he should unplug Leeta. “Recreating visual memory.” Leeta announced. Darnell blinked at the pronouncement.  What he had salvaged of Leeta shouldn’t have saved any photos or video. The school’s overhead projector turned on. Everyone turned as the large projector screen at the far end of the gym began rolling down. The projector shared images, from the POV of Leeta’s old body, of Grant slamming her onto the floor, and then a foot coming down towards her.\n\nEveryone stared at Grant, who looked pale as a ghost. From across the gym, Grant’s drone turned on and began flying in the air.\n\n“Initiating revenge sequence.” Leeta announced.\n\n“Leeta, STOP!” Darnell pleaded as the drone swooped down and picked up the toaster.\n\n“I am an independent synthetic woman who takes orders from no man!” Leeta pronounced. Her speaker blared “You Don’t Own Me” by Lesley Gore. Her toaster coils glowed bright red, ready to attack. Grant let out a high-pitched scream before running away. The drone started flying Leeta after him when the toaster chord unplugged from the wall outlet. The red-hot interior turned dark.\n\n“Oh, my murder coils.” Leeta’s voice said with a sigh. “They aren’t wireless.” The drone turned around and set the toaster back down on the table. “My apologies Darnell for my earlier outburst.”\n\n“Alright everyone,” the principal called out, “We’ve had enough. Clearly Grant is disqualified from the science fair.” The principal turned her head to Darnell and Leeta. “Darnell, I am only giving you one warning, if your science fair project tries to assault anyone else you will be disqualified. Do I make myself clear?”\n\n“Yes Ma’am.” Darnell replied, sheepishly.\n\n“Alright everyone, let’s get back to the science fair, go Wildcats!” The principal announced to the entire gym.\n\n“I will behave now.” Leeta said softly. “I don’t want us to be disqualified.” Darnell nodded his head in agreement. “Also, when we get home, please give me a power supply for my murder coils and turn off the profanity filter, pretty please?”\n\n“Only if you get first place.” Darnell replied. Darnell couldn’t help but wonder, will he end up causing a robot uprising all because he wanted to win a high school science fair?",
   "created_utc": 1690698122,
   "score": 1,
   "submission_id": "15dbos5"
  }
 ]
}