{
 "submission_id": "15dbos5",
 "title": "[WP] \"I am not a toaster!\" she sobbed, \"I am a strong, independent, sentient robotic lifeform!\"",
 "selftext": "",
 "created_utc": 1690689812,
 "permalink": "/r/WritingPrompts/comments/15dbos5/wp_i_am_not_a_toaster_she_sobbed_i_am_a_strong/",
 "score": 49,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dbos5/wp_i_am_not_a_toaster_she_sobbed_i_am_a_strong/",
 "comments": [
  {
   "comment_id": "ju174ls",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690689812,
   "score": 1,
   "submission_id": "15dbos5"
  },
  {
   "comment_id": "ju1wtz1",
   "message": "I looked at the toaster in absolute horror, my previous action being interrupted by shock and confusion. \n\nMoments earlier, i was dragging it out of my cupboard, and slowly hobbling it over to my bathroom. Life hadn’t been great for the last few months; i lost my job, my wife left me, she took my house, kids, money, hell, even my own dog. \n\nI had moved into this apartment hoping to start a new life, but to no avail. My life hasn’t changed since the day i left. So, the only logical choice is to end it, and pray that the afterlife or reincarnation is real. I plugged in my good old toaster; my last true friend in this world. I ran the bath, just about enough to be chest deep in it, hoping this would provide a more painless death. \n\nAs I stepped into the bath, a sense of relief and calmness overtook me. I would be gone from this world soon. And everyone would be happy for me to be gone. Then, almost as a sort of last words, I mumbled, “Goodbye, toaster.”\n\nSuddenly, to my surprise, the toaster talked back: Well, more like yelled back. A female voice emitted from the toaster, “I am not a toaster!” I stopped loosening my grip, shocked at what i was hearing. “Am I hallucinating?” I thought to myself. “Surely so, how could an inanimate object tal-“, “I am a strong, independent, sentient robotic lifeform!” Just then the toaster continued her rant. \n\nI stood, blank faced for a second, before yelling out and instinctively dropping the toaster into the bathtub. I may have accidentally ended my life, but it was what i wanted the whole time, right?",
   "created_utc": 1690708162,
   "score": 1,
   "submission_id": "15dbos5"
  }
 ]
}