{
 "submission_id": "15ddpci",
 "title": "[WP] They've been following for months. 5 countries. 3 identities. But tonight they found you again you were too tired to run. A man in a business suit approached you as you were unlocking your front door. He looked at you coldly, \"We've been trying to reach you about your car's extended warranty.\"",
 "selftext": "",
 "created_utc": 1690696371,
 "permalink": "/r/WritingPrompts/comments/15ddpci/wp_theyve_been_following_for_months_5_countries_3/",
 "score": 6,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15ddpci/wp_theyve_been_following_for_months_5_countries_3/",
 "comments": [
  {
   "comment_id": "ju1hm1h",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690696372,
   "score": 1,
   "submission_id": "15ddpci"
  },
  {
   "comment_id": "ju22qcp",
   "message": "\"Does it come with coverage for windscreens and windows?\"\n\nGary's response was barely audible over the sound of the passing traffic.\n\n\"No, that isn't part of this policy. But there is another option we can offer you.\"\n\nGary coughed, spat a thick wad of phlegm next to the man's shoe. If the Policy covered Theft, then Gary would be back in the trenches, trying to find something and killing the person who stole it along the way. If it was Panel and Paint, it would be a dirty smash and bag job. God forbid it was Fire. Fire meant the world was going to Hell, and he was likely to burn up with it.\n\n\"What's the option?\" Gary muttered, shaking his head. He had been so careful. Had asked for a break, had left the UK and kept his head down. Had slipped off the grid as only men of his trade could. Five countries. Three identifies. Constant motion. But the Salesman was here. They had still found him.\n\nGary knew that he would have to accept the Policy, but he didn't have the heart for the work anymore. Not after he had walked with a Princess, arm in arm, to her death. Kate. Some thought it a crush. Something silly, as if Gary, with all the things he'd seen and done could be star-struck. It wasn't that, even if she had been one of the few truly beautiful people he had ever met. It was the fact that even she thought the world would be better after her death, three years later, it was still the same bullshit. The poor were poor. The rich, rich. People like Gary were soaked up to the elbows in blood and guts and gore, and the world wasn't put to right at all. Her death. The most honorable of deaths, meant nothing. It all meant nothing now. Gary could see that. There was no good fight to fight. The Salesman used to peddle dreams, now Gary understood that his services were just being sold to the highest bidder.\n\n\"We would be pleased to offer you comprehensive cover for Fire, Mr Armitage. Will you accept?\"\n\nGary spat again, made sure it hit the man's shoe this time, before he squared his shoulders and looked him in the eye.\n\n\"What's the Policy start date?\" Gary asked.\n\nThe Salesman handed him a briefcase, and smiled.\n\n\"It never really ends Gary, you know that.\"",
   "created_utc": 1690712992,
   "score": 1,
   "submission_id": "15ddpci"
  }
 ]
}