{
 "submission_id": "15demnj",
 "title": "[WP] Your an ant that for a few seconds experienced what it was like to be a human, endless senses, views, and emotions fill your mind and then you're an ant again. The question now is, how do you move forward.",
 "selftext": "",
 "created_utc": 1690699581,
 "permalink": "/r/WritingPrompts/comments/15demnj/wp_your_an_ant_that_for_a_few_seconds_experienced/",
 "score": 8,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15demnj/wp_your_an_ant_that_for_a_few_seconds_experienced/",
 "comments": [
  {
   "comment_id": "ju1m1gi",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690699581,
   "score": 1,
   "submission_id": "15demnj"
  },
  {
   "comment_id": "ju1vyno",
   "message": "*Scutter. Scutter. Food. Colony. Queen.*\n\nWhite letters scattered across the screen, quickly flitting on and off like the flickering of candlelight. The thoughts of the ant were laid bare, the crevices of the creature’s innermost sanctum displayed for the world to see.\n\nThe method that allowed for the display was quite peculiar. Countless black wires snaked across a speckless white floor, until they slithered into a box no bigger than a mug. Cables plugged into their respective holes, spilling over onto each other, creating an ugly, tangled mess. And, underneath the pile, inside the box, was the ant. Not by any means a particularly interesting animal. For now.\n\nFor one quick glance to the origin of the wires revealed a much larger box that contained a slumbering human. The man had stubble dark as charcoal, and his fingertips were painted red, the liquid pooling underneath his nails. On the other hand, his canvas - the walls of the box - were streaked crimson.\n\nA deep voice rang out. “Switch them.”\n\nThe man’s box lit up, and slathers of white streaked from him into the walls, flowing into the wires, and eventually, infusing into the ant.\n\nAnd slowly, the letters on the display began to change.\n\n*Food is.. Why.. am I?*\n\nSentences began to form from the string of unintelligible words. Reason was born from the corpse of chaos.\n\n*It’s blurry. It’s dark. I must bring food for the colony. For expansion. For the queen. For.. what?*\n\nThe ant began to pace.\n\n*Because I am an ant. The colony is the most important. I am an ant. To live is to obey, and to die is to no longer serve.*\n\n“Increase it.”\n\n*But this.. cannot be called living, no? To live in this tiny shell of a body, to move tirelessly clenching meat and dirt and whatever else is needed between my pincers like some drone. And yet..*\n\nBubbles frothed from the corners of the man’s mouth.\n\n*I am an ant. This is my fate. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant. I am an ant.  I am a-*\n\nThe letters came to an abrupt end as the ant finished bashing its head into the ground. If one looked closely, they could see a clear liquid pooling on the ground between snapped antennae. But no one did.\n\nIt was not a particularly appealing sight.",
   "created_utc": 1690707442,
   "score": 1,
   "submission_id": "15demnj"
  }
 ]
}