{
 "submission_id": "15dem73",
 "title": "[WP] Your ability to foresee the future is world renowned. Not only are you never wrong, you can foresee things with incredible detail and clarity. However, your next vision leaves you very confused. The vision - tomorrow, you see your birth.",
 "selftext": "",
 "created_utc": 1690699534,
 "permalink": "/r/WritingPrompts/comments/15dem73/wp_your_ability_to_foresee_the_future_is_world/",
 "score": 49,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dem73/wp_your_ability_to_foresee_the_future_is_world/",
 "comments": [
  {
   "comment_id": "ju1lz96",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690699534,
   "score": 1,
   "submission_id": "15dem73"
  },
  {
   "comment_id": "ju1p8ql",
   "message": "The vision was disturbing, confusing, discombobulating. I’d never been wrong before, never. And yet what I saw was clearly my own birth. \n\nFrom a vantage point like a floating camera, moving slowly in a tight circle above a vivid scene of a newborn baby, streaked in blood and a sticky-looking cowl. Being picked up, wrapped in cloth and handed gently to a woman, drenched in sweat and gasping, clearly aching to hold this tiny creature.\n\nThe camera shifts quickly and I am looking out through the eyes of the child, a blurry vision of a being I instinctively identify as mother.\n\nThe vision snaps shut and I am in my study, the crystals in their stand in front of me. I’m shaken, physically trembling, nauseated. I reach for the decanter but I it’s empty. Slowly I stand, unsteadily stepping to the liquor cabinet. The bottle of Burnout is empty.\n\nI’ll get some more. The store is literally across the street. A few steps.\n\nI grab my coat and open the front door. Down the steps to the curb. I step into the street and hear a blaring horn, like a truck, and briefly, squealing tires.",
   "created_utc": 1690702046,
   "score": 10,
   "submission_id": "15dem73"
  },
  {
   "comment_id": "ju2qk0c",
   "message": "I always joke that the worst thing about having *the* *foresight* is explaining it to people. I don’t mean all those who don’t believe me, or the looks on people's faces once they do; the non-human way their gaze on me shifts. I mean literally, *descriptively*, explaining it to people.\n\nFor me it’s like trying to explain something that is as base to you as a sense, how can you explain smelling to someone who has never experienced it? I try to tell them it’s as natural as breathing or dreaming to me… I just *do* it. As simple as speaking but less learned and admittedly less volitional. Sure, I can use this clairvoyance, premonition, prophecy, whatever you wish to call it, whenever I wish, but it’s not like I can completely control it like one would a skill or a tool. I can’t simply see anything, anywhere at any point in time; I just *foresee* and then I… do.\n\nThat’s the other thing; people imagine the foresight like sight - I close my eyes and see just as if I’m watching a movie of the future. But it’s not like that, it’s different… it’s *more*. Seeing is such an odd way to describe it, it’s not a simple visual snapshot - it’s more a facsimile of a future memory than a second sight. I *know* things: people I’ve never met, complex relationships and histories, context, atmosphere. It’s an incredible amount of detail; but it’s also a little fuzzy things are missing, things are confused… like it’s something important I’d lived that I’m reminiscing on, trying, trying to remember everything as your brain fills in the gaps that always emerge.\n\nThere I go again, trying to explain the inexplicable. Anyway, my point was that I say that a joke. Yeah, it’s annoying but it’s not the worst part about the foresight, I just say that; a little to make light of it and a little to vent the real frustration I’ve had with both understanding it myself and explaining it the thousands of times of over the years. And it has been years. I’m 33 now, and since I’ve been about 14 the foresight has been my life. Once word got out about my “gift” I had no time for anything else. It’s been 19 years of travelling around the world, doing everything from talk shows and conventions, to assisting police and military investigations, to having every medical device imaginable scan, snip, sample, and squeeze me trying to get at this little talent of mine. Sorry, I’m rambling again, but none of that’s not the worst part either.\n\nIn reality, the worst part was always the responsibility… the guilt of association; the responsibility that I always felt even though everyone told me it was not mine to feel. Sometimes others would depend on me to foresee something, but what I would see would have nothing to do with what they needed, like I said, I can’t really control it. But often it was worse when I could foresee what they wanted me to: the tornado ripping through a family home, the cancer treatment not working, the bomb going off in the subway, the missing child being stuffed into a weighted suitcase. It’s **me** who’s telling them that. It has to be me, and I can see them. Sometimes yelling it, sometimes hiding it behind their thanks and understanding. I can see them wishing I was wrong, but knowing I’m not. I can see them forever associating the worst moment of their life with my stupid face. I can see them wondering, is he seeing the future, or creating it? I can see them hating me.\n\nYes I know... still rambling. I’m sorry, I ramble when I’m nervous. But what I’m trying to say is that *was* always the worst part. Until today. Now I see, the worst part is much more selfish than that. The worst part I know now is the feeling I have after foreseeing what I did today. The confusion, the desperation. My visions have not always been pleasant, but they’ve always been *correct*, always been *logical*. Until today. Today, I foresaw my own birth.\n\nWhat does it mean to see your own birth? It’s ridiculous, it’s logically… physically impossible. In fact, while I’ve always seen the future of the world around me and the people in it, I've never foreseen myself. And yet, there it was, with no doubt in my mind. Not my death or my expectant future - my own hectic, exciting, sticky, bloody birth, but not 33 years ago. Tomorrow.\n\nI have been sitting here since, trying to wrap my head around it. Does that mean everything before that point is now uncertain? Is everything I’ve ever known about wrong? Or does this mean something else entirely? Is my foresight broken? Fuck this better not be some butterfly effect bullshit. With each thought - each crazy explanation I can form I’m left with more questions than answers. For the first time in my life, I’m scared of what the future holds.\n\nTomorrow, I am born.",
   "created_utc": 1690726860,
   "score": 7,
   "submission_id": "15dem73"
  }
 ]
}