{
 "submission_id": "15dk4kp",
 "title": "[WP] \"If you kill a killer the number of killers stays the same.\" \"Just kill two, hell i killed like 17 today.\"",
 "selftext": "",
 "created_utc": 1690719196,
 "permalink": "/r/WritingPrompts/comments/15dk4kp/wp_if_you_kill_a_killer_the_number_of_killers/",
 "score": 169,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dk4kp/wp_if_you_kill_a_killer_the_number_of_killers/",
 "comments": [
  {
   "comment_id": "ju2bog8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690719196,
   "score": 1,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju2lmse",
   "message": "Long nights at the state penitentiary were always a difficult thing to get through. On a good day, I wouldn't have to speak to any officers, nor prisoners, nor even the warden. On a bad day, however, I might have to execute twenty. Of course, being the state executioner will, over time, cause you to feel less and less each time you have to do it. At first, I thought perhaps I was a monster for no longer feeling bad when watching the skin of my victims melt when I flipped the switch, but eventually I learned that I wasn't *not* feeling it, rather I was deliberately ignoring the feelings I had when simply taking away a human life, even if the victim in question slaughtered children in the most brutal way possible.\n\n\u0026amp;#x200B;\n\nThe next morning, of course, I would love to pretend that I've never had to suffer ill effects from the deaths of these criminals; when I return home each day from the federal penitentiary, I sit at my couch, stare forward, and say nothing for hours at a time. My girlfriend has begun to worry that I might slowly be losing my soul or something, but I personally think that it's just her overly worried nature sometimes. After all, I've worked this job since my early twenties, and it pays well, enough for us to afford a nice house and a fancy lifestyle. That being said, I can only imagine how distraught she must be seeing me like this every night.\n\n\u0026amp;#x200B;\n\nWhen I got home last night, she sat down by me, seeing the anger in my eyes as I began to sob, for the first time since we met showing my true emotions about my job. Panicked, she began searching her mind for every possible phrase even vaguely related to the situation.\n\n\u0026amp;#x200B;\n\n\"You know,\" she said, hoping to pull something out of the air, \"If you kill a killer, the number of killers stays the same.\" She realizes what she said immediately, before I respond softly, hanging up my rain-covered hat.\n\n\"Just killed two, hell, I killed like 17 today.\"",
   "created_utc": 1690724563,
   "score": 1,
   "submission_id": "15dk4kp"
  }
 ]
}