{
 "submission_id": "15dk4kp",
 "title": "[WP] \"If you kill a killer the number of killers stays the same.\" \"Just kill two, hell i killed like 17 today.\"",
 "selftext": "",
 "created_utc": 1690719196,
 "permalink": "/r/WritingPrompts/comments/15dk4kp/wp_if_you_kill_a_killer_the_number_of_killers/",
 "score": 155,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dk4kp/wp_if_you_kill_a_killer_the_number_of_killers/",
 "comments": [
  {
   "comment_id": "ju2bog8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690719196,
   "score": 1,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju2lmse",
   "message": "Long nights at the state penitentiary were always a difficult thing to get through. On a good day, I wouldn't have to speak to any officers, nor prisoners, nor even the warden. On a bad day, however, I might have to execute twenty. Of course, being the state executioner will, over time, cause you to feel less and less each time you have to do it. At first, I thought perhaps I was a monster for no longer feeling bad when watching the skin of my victims melt when I flipped the switch, but eventually I learned that I wasn't *not* feeling it, rather I was deliberately ignoring the feelings I had when simply taking away a human life, even if the victim in question slaughtered children in the most brutal way possible.\n\n\u0026amp;#x200B;\n\nThe next morning, of course, I would love to pretend that I've never had to suffer ill effects from the deaths of these criminals; when I return home each day from the federal penitentiary, I sit at my couch, stare forward, and say nothing for hours at a time. My girlfriend has begun to worry that I might slowly be losing my soul or something, but I personally think that it's just her overly worried nature sometimes. After all, I've worked this job since my early twenties, and it pays well, enough for us to afford a nice house and a fancy lifestyle. That being said, I can only imagine how distraught she must be seeing me like this every night.\n\n\u0026amp;#x200B;\n\nWhen I got home last night, she sat down by me, seeing the anger in my eyes as I began to sob, for the first time since we met showing my true emotions about my job. Panicked, she began searching her mind for every possible phrase even vaguely related to the situation.\n\n\u0026amp;#x200B;\n\n\"You know,\" she said, hoping to pull something out of the air, \"If you kill a killer, the number of killers stays the same.\" She realizes what she said immediately, before I respond softly, hanging up my rain-covered hat.\n\n\"Just killed two, hell, I killed like 17 today.\"",
   "created_utc": 1690724563,
   "score": 144,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju3e114",
   "message": "\"*You* killed 17 people today?\"\n\nLen raised an eyebrow from his prone position on the pavement.\n\n\"Soon to be 18. These wasters are all killers, and they're everywhere around here. You should be more careful, stupid man. The name's Scorpion.\"\n\nLen regained his feet. The waster that had blindsided him lay on the ground before Scorpion, cursing her and clutching his slashed Achilles tendon. He looked to the injured man, then back to his savior.\n\n\"You are a 10 year old girl,\" he said.\n\nScorpion crossed her arms. \n\n\"I'm 11, *asshole*.\"\n\nScorpion took a mag pistol out of her belt and loaded in a ball bearing. Without hesitation, she pointed and fired the projectile straight through the eyeball of the waster. He jerked around violently, then went limp. The sick smell of fresh death attacked his nose, and Len heaved, but stopped himself from vomiting.\n\n\"18.\"\n\nLen looked at the remains of the man, and his eye caught a glint at the mans belt. Scorpion walked over, kicked him to make sure her job was done, then began searching his body. She looked at the puzzled expression on Len's face then followed his eyes.\n\n\"It's a filet knife,\" she said. \"Most of his kind prefer them. They're light, sharp, and good for stripping meat off idiots like you.\" \n\nLen was sure this time he would not be able to stop himself from vomiting, but a rumble overhead drew his attention away from his nausea. Scorpion jumped to her feet and looked up. \n\n\"Shit. Acid storm. Good luck, stupid man,\" she said, pulling up the hood on her pink plastic poncho.\n\n\"You'll need it.\"",
   "created_utc": 1690736853,
   "score": 66,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju3pahn",
   "message": "Those definitely weren't words I was expecting to hear from my dad tonight. Or ever, of course. \n\nIt was a clear night, the cool white moon contrasting against the deep blues of the rich night sky. We had gone outside onto our newly built patio for another drink, as usual.\n\nI had recently turned 18 and so, me and my father had made it a habit to talk long into the night. I had always enjoyed the company of my partner. He was always the type to make you smile when you thought that it wasn't possible.\n\nAnother thing I especially liked about our nighttime talks was how drinking alcohol made me feel.\n\nIt gave me a sense of maturity, of importance. It felt like I was finding my way into the adult world, a place where I could belong. I was still fighting a losing battle with depression at the time so it helped to distract me as well. Despite my clear distaste for it at the start, I grew to become fond of it and how it made my problems take a backseat. Even if it was just for a little bit.\n\nIn fact, my father was the one who first encouraged it. I'd already grown used to the sight of him chugging down bottles of beer since I was younger.\n\nHe claimed it was a way to \"destress\" from the pressure of his business trips, especially when he had to deal with tougher clients. Despite getting heavily drunk, he always remained his composure with me, still maintaining the bubbly and mature father figure that I had known him for. I admired him for that.\n\nWe had just started on the topic of morality and whether it was OK to kill someone. I believed that it wasn't okay, no matter the reason I always believed there was a better way to make them face the consequences. \n\n\"If you kill a killer you still end up with the same amount you started with, you know?\" I said trying my best to give my point of view. As I was soon about to find out, my father had a different view.\n\n\"Well, if you kill multiple then you'll improve the world.\" he said with an odd sort of passion. You could tell he wouldn't be easily swayed on the topic. \"I mean, I've killed over 17 so far.\" \n\nI remember when I first heard him I started bursting out into laughter. Despite being depressed, I had always enjoyed a good joke. It was about the only thing that actually did make me happy these days.\n\nIt wasn't until I looked at him that I realised it. He was serious. His eyes wouldn't break contact with me, as if they had been turned to stone.\n\n\"I'm not joking.\" \n\nMy laughter stopped soon after hearing that. You could tell it was true. He had always been a man who kept his word. When he promised something, he would keep it with unwavering sincerity. When he spoke the truth, you could tell it in the abrupt, cold serious tone his voice taken. \n\nJust like when he told me my mother died.\n\n\"I've wanted to tell you, but I've waited. I refrained until you were of age, and now you are.\" he said with that same firm tone.\n\nHe always told me he wanted to join the family business, but I had never once considered this to be a possibility.\n\n\"It's perfectly okay if you don't accept it. I wouldn't blame you.\"\n\nDespite knowing he wasn't lying, I had still hoped it wasn't true. I had always been like that, I denied the truth until I learnt to accept it. If I saw a shooting star, I would've wished that none of this had happened.\n\n\"W-Why are you even telling me this?\" I stuttered out. Despite my mind swirling with a thousand questions, this was the one I needed to know the most. \n\n\"There's no use in dancing around it so I'll just be completely honest. I want you to join me and help me to kill people.\" \n\nI didn't know what to say. I didn't think it would be possible to be more shocked but here I was, hearing that on top of my father being a killer, he wanted me to kill alongside him. Talk about a twisted father and son relationship.\n\nHowever, I felt something. Something inside of me. An urge. \n\n\"I'll do it.\" I mumbled out. I had never been so unsure yet so confident about something in my life. I knew it was sudden but what else did I have? It's didn't have any special passions or grand dreams for the future. Nothing ever really appealed to me or stuck out to me.\n\nUntil the thought of murdering someone came along.\n\nIt wasn't until then that I looked at my father, I could tell he wasn't expecting that answer. Or at least for it to come that fast. \n\n\"Are you sure? You know I want this to happen, but this is also a big decision. I want what's best for you and if you feel like that could be college or something else, I want you to consider it.\" \n\nI could tell he was happy with my decision but apprehensive. The more I thought about it, the more sure I became. I needed this, I needed to belong somewhere and if assassinating people for a living was where I belonged, so be it.\n\n\"I'm sure. You don't need to persuade me, I'm confident this is right for me.\" I declared. \n\nWe spent the next hours discussing it. I never once thought that how to murder someone would become a topic we would talk about in our nocturnal conversations. All of my questions were answered, of which I had a lot. \n\nThe first person we were to murder would be tomorrow. My father was essentially a hit man, he took money to kill people except he had one rule. He would only kill someone if they were a killer. Despite murdering people for a job, he still kept his morals and firm beliefs. \n\nI knew it was wrong. How I had chosen to murder someone so easily but I couldn't help it. The excitement I felt, the burning passion that lit in my stomach. I was also well aware that this wasn't the point. We weren't killing for fun.\n\nAt least, my father wasn't.",
   "created_utc": 1690741506,
   "score": 11,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju3qet0",
   "message": "If you kill a killer the number of killers stays the same.\" \"Just kill two, hell i killed like 17 today.\" \"You arn't any better then they are then!!!\" \n\n\"The story is always the same with you guys, the ideology, the living up there on your high horse, the so called morals. How many times have the killers, the rapists, those ANIMALS keep coming back after you capture them, arrest them for the police, and escape, just to start all over again. What GOOD did all of that do for MY family....what if this was YOUR family?....\"\n\n\"damn it, this isnt how hero's act!!!\" \n\n\"When the hell did I ever say I was a hero....you know my name. you ALL know my name and I never claimed to be your hero...so say it....say the name that the criminals really fear.....\"",
   "created_utc": 1690741970,
   "score": 9,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju3o1ib",
   "message": "The freecompany had often berated Mortis for his lethality. In fact, they berated him for a lot of things. His dark sense of humor, his all leather fashion choices, and attitude towards other superheroes. Today though, he had really crossed the line, killing a united states senator who was funding them. \n\n\"I can't believe you!\" Magna maiden yelled, while leveling a sword to Mortis's eyes. \"Does restraint mean nothing to you?\" Mortis squinted through his black eye, trying to see the angry Amazonian more clearly. \n\n\"You don't know what I saw, Hipolita.\" He said, pausing to spit out some blood. \"Senator Graves. He-\"\n\n\"Was the only thing keeping this operation afloat!\" Jade interrupted him, his eyes glowing green from rage. \n\n\"I don't know what you think you saw, Mortis.\" Ultimate stated \"But killing people isn't the answer.\" Mortis looked at Ultimate, noticing the way his eyes were darting around the room.\n\n\"Holy shit,\" he said, while spitting out more blood. \"You knew. You all knew what he was doing.\" The room fell silent. \"There's what? Seventeen of you? Not a single one of you spoke up about what he was doing to those girls.\" Magna Maiden prepared to speak up as Jade threw his hand in front of her.\n\n\"Senator Graves took care of collateral damage. Every time we couldn't save someone, or some derelict got crushed by debris, he was there to clean it up. In the end, him having a lethal hobby is the lesser evil.\" Mortis's expression somehow grew even angrier.\n\n\"I bet that government money was a good motivator too, wasn't it?\" Ultimate raised Mortis and his chair up to the ceiling.\n\n\"Watch your mouth.\" He said. \"If you kill a killer, the number of killers stays the same.\" Mortis grinned. \n\n\"Just kill two.\" He started to chuckle. \"Hell. I'm about to kill seventeen today. Everyone in the freecompany looked confused.\n\"Oh, you didn't know.\" Mortis said, feigning sincerity. \"You see, when your base is a literal space station, you tend to pick up a few facets of knowledge. Like the fact that one puncture in the hull, will depressurize the whole station.\" Ultimate's face grew pale. \"You may all be strong, but I doubt any of you can survive being exposed to space.\" Everyone's head shifted to the left, as they heard a metallic clink on the conference room window. On the outside of it, sat a blinking device with claws digging into the glass. \"Look at me.\" Mortis said calling Ultimate's attention. \"This is what happens to people like you.\" Ultimate looked genuinely terrified for the first time since he had met Mortis. \n\n\"Why?!\" He shouted, shaking the room. \"It was just a few girls. Why would you care!?\" Mortis laughed in a low tone. \n\n\"Because,\" he said as he revealed a detonator in his hand. \"I'm a hero.\" On earth a news broadcast was being played.\n\n\"Breaking news.\" The anchor said, interrupting whatever was playing. \"The superhero group known as the Freecompany has been killed in what authorities are calling a freak accident. All eighteen members were found floating through space. Each of their faces displayed an expression of horror, except for the hero known as Mortis, who was said to be smiling. More on this as the story develops.\"",
   "created_utc": 1690740988,
   "score": 7,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju3facl",
   "message": "Revenge was an immature action, taken by those with too much pride, uncontrollable emotions, or those who felt they had nothing to lose. Of course, reasoning such would never work for those so committed. Why then, did I even try? I knew it in my heart- the same call and response I've known to not work. His answer was as stupid as it was disturbing. 17 people. How could 17 people have wronged him just today? I look up into his eyes, but I know what I'll see before our sights converge.\n\nThe \"Revenge Master\", (as some dummies that clothe themselves for their non-existent Olympic race call him) has recently seemed to almost miraculously attract the dullest of the nails- the fodder and proprietors of a typical antihero story. Chance encounters with friends and relatives of Drake (his real name), in which uncles, siblings, and third cousins twice removed, seem to be murdered for whatever benign reason. All by coincidence, to clarify once again. Though it's not unlikely at this point to reason that I may be killed soon too, as I'm currently the most closest relative being his great grandmother's nephew's son. I *would* rather ignore it all, but considering that conspiracy to murder is a crime, I'd ideally prevent the obtaining of a criminal record getting me fired from my bringing-home-the-bacon levels of work. He doesn't seem to care of course. Too busy thinking of how to bribe me into acting as bait. Poor as an ex-target of Robin Hood, though. I'll just wait him out until he gives up or I die. I drove a hard bargain for my life insurance anyways.",
   "created_utc": 1690737377,
   "score": 2,
   "submission_id": "15dk4kp"
  },
  {
   "comment_id": "ju42w1k",
   "message": "\"If you kill a killer, the number of killers stays the same.\"\n\n\"Just kill two. Hell, I killed, like, seventeen today.” He ignored the glare the bartender gave him and scratched his blood-stained chin. “Now get me a drink.”\n\nThe bartender’s scowl remained unchanged, but he reached under the counter, anyway. “You know, eventually, I’m going to stop giving you free drinks.”\n\n“The things you do for family,” Trevor said. “I deal with your morally righteous bullshit, and you deal with my occupation of choice.”\n\nThe bartender raised an eyebrow as he poured a dry scotch. “Oh, you’re getting paid now?”\n\nTrevor shrugged. “No. But occupation sounds more professional than hobby.”\n\n“Yeah, well, your ‘hobby’ better not make its way to my bar, or I’m done serving you.”\n\n“But of course, your lordship.” Trevor caught the glass his brother slid his way and downed the smoky, salty liquid in one gulp. “Another for big bro?”\n\nHis brother braced his hands against the oak wood of the bar, concern etched on his weathered face. “Seventeen, Trev? Really?”\n\nTrevor rolled his eyes and swiped the bottle from behind the counter, pouring himself another glass. His brother didn’t even try to stop him. “Seventeen and a half, to be exact.”\n\n“Not funny.”\n\nTrevor sighed. “Brian—”\n\n“Don’t Brian me. Did you really take seventeen lives?”\n\nA boom broke the silence of the bar, the walls vibrating for a moment before settling down.\n\n“The hell was that?”\n\nTrevor took a long sip of his scotch. “Number eighteen.”\n\nBrian whirled his head to his brother. “What did you do?”\n\n“Delivered justice, that’s what.”\n\nBrian straightened up, his chest swelling with anger, then deflating. “Get out.”\n\nTrevor paused mid-sip. “Bro—”\n\n“I said get out!”\n\nTrevor huffed out a half-hearted laugh. “You can’t be serious.”\n\nBrian just pointed to the old wooden door of the bar, his brows furrowed and his face set.\n\nFor a moment, he looked just like he did when they were kids. When he’d huff and puff and stomp his feet to get his way. Trevor had always outsmarted him—it hadn’t been hard. But now he was his own man, with his own business. Now, when he stomped his feet, it meant something.\n\nTrevor sighed and stood. “I’ll be back when you’ve cooled down.”\n\n“No, I don’t want you back here. I can’t tolerate this anymore, Trevor.”\n\n“Whatever. Same time next week?”\n\n“I mean it.”\n\n“Uh huh.”\n\n“Trevor, I swear to—”\n\nTwo more booms rattled the walls.\n\nTrevor paused mid-sip. “Aaaand there’s nineteen and twenty. A new record.” He made his way to the entrance, ignoring his brother’s scoff and the sirens wailing in the distance.\n\n“This isn’t going to bring them back.”\n\nTrevor froze, his hand on the knob. “Is that what you think I’m trying to do? Resurrect the dead?”\n\nBrian raised his arms at his sides. “What else?”\n\nTrevor took a long swig from the bottle, then wiped his mouth. “If I thought killing would bring them back, I’d double my numbers.”\n\n“I just don’t get how you can live with all this blood on your hands.”\n\nTrevor raised his bottle of scotch. “This helps.” He opened the door and stepped out, only to stop again when Brian spoke.\n\n“I mean it, Trev. I don’t want you back here. Ever again.”\n\nTrevor weighed his options, gripping the bottle so tight he thought it’d shatter. He could turn around and argue, maybe just flip him off. But with Brian, the best thing he could do would be to give him space. So he bit his tongue and kept walking, bottle in hand as he watched the smoke rise from over the horizon.",
   "created_utc": 1690747108,
   "score": 1,
   "submission_id": "15dk4kp"
  }
 ]
}