{
 "submission_id": "15dor66",
 "title": "[WP] You are a divorce lawyer, the best in your field. You have just received word that you will representing the Greek goddess Hera in her divorce from Zeus.",
 "selftext": "",
 "created_utc": 1690731976,
 "permalink": "/r/WritingPrompts/comments/15dor66/wp_you_are_a_divorce_lawyer_the_best_in_your/",
 "score": 182,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dor66/wp_you_are_a_divorce_lawyer_the_best_in_your/",
 "comments": [
  {
   "comment_id": "ju32cxj",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690731977,
   "score": 1,
   "submission_id": "15dor66"
  },
  {
   "comment_id": "ju45amp",
   "message": "\"I am... certainly flattered, lady Hera\"\n\nI said with a shaky voice, truly baffled at the situation.\n\n\"\"You ARE the best in the mortal world, are you not? This is not flattery. I need the best if I am to get a favorable result against Mr. \"God king of justice\"\"\"...^(Fucking arrogant piece of ignorant donkey dung.ugh. How in TARTARUS has he never grasped the concept that being in charge isn't the same as always being right? He has had millennia. mumble mumble rapist, liar, mumble mumble \"Justice\" my pert perfect ass. mumble heartbreaker mumble mumble mortal hussies mumble thunderprick mumble stupid baby brother mumble mumble should have killed him and done the universe a favor. mumble stupid, pigheaded, charming, handsome, asshole. mumble mumble curse my libido...) \n\nI blinked slowly at her as she trailed off muttering further obscenities to herself, seemingly lost in thought...\n\nI patiently waited for her to finish.\n\n\"Well Lady Hera, you seem to have the right idea seeking a human court decision seeing as there isn't any other potentially unbiased way to solve this considering the situation...\"\n\nA thought struck me, then.\n\n\"Ummm... Forgive me if it's not my place to ask, but how will you hold him accountable to an outside court decision? He is \"God King of justice\"  after all\"\n\nHera looked startled at my word choice, blushing an odd yellow color hearing her sarcastic words parroted back at her,\n\n\"\"I happen to have an unconditional favor that he, himself, granted me. So he can't refuse without admitting wrongdoing, which he will never do.\"\"\n\nShe looks proud of that statement.\n\n\"And why, might I ask, aren't you simply using this favor to get the divorce you want outright? Why resort to a mortal ruling?\"\n\n\"\"Because he will contrive an excuse not to grant that particular favor no matter how bad it makes him look because he doesn't want a divorce. But if I get him to grant in advance that he, for my favor, will \"Abide by and agree to the terms decided by a single human court ruling\" he will gladly rush to do so without reading the fine print because it seems like a trivial way to discharge an unconditional favor, and he's a big dummy that will probably think the ruling I choose will be something about women's rights or something. His constant underestimation of everyone that isn't himself or his offspring will be my salvation and his undoing. Making excuses is one thing, but he can't go against his own rulings as a consequence of his justice domain\"\"\n\nHera again looks extremely proud of herself.\n\n\"Quite the plan you have, there. I'm guessing it was Athena's work? Well, anyway, the sheer amount of crimes and infidelities he has committed against you and your marriage are a slam dunk in your favor in any human court. Practically decides itself, this case. As long as you both pose as humans it shouldn't be difficult to make this a very profitable endeavor, Lady Hera \"\n\n\"\"Thank you for your support, Mortal. You will be lavishly rewarded for your services to me. And I appreciate the compliment, but that brat is firmly on her father's side, whether by blackmail or by bribery I don't know. No, this plan is simply the result of an entire millennium of my own bitter, calculated, spiteful plotting in secret.\"\"\n\nI smiled. This should prove interesting.\n\n\"Well, then may the fates and fortune be with us, lady Hera. And may your brilliant plot succeed beyond our wildest expectations. We can hash out the details at your next appointment.\"\n\n\"\"Agreed, mortal.\"\"",
   "created_utc": 1690748039,
   "score": 1,
   "submission_id": "15dor66"
  },
  {
   "comment_id": "ju3xt0u",
   "message": "I would never consider myself a religious person, in fact I tried to stay away from the stuff. It is pretty hard to not believe in something right in front of you though. Especially hard to not believe in God(s) when one was staring daggers at you. \n\n\"Defense? Do you have any questions for the prosecution?\"\n\nI cleared my throat into my fist before rising to my feet and approaching the bench. Hera sat there, as pristine as can be hoped for an immortal being. Her eyes had been cutting holes into my confidence since the beginning of the trial. Although she has her faults, it's been exceedingly hard to argue they are comparable to my client. \n\n\"Hera, the goddess of marriage, women in general, and even childbirth.\"\n\nWhile all eyes were on her, her smile was warm and friendly. The type of smile you would give to a dear friend after not seeing them. Even so, I could feel the energy she had focused on me like a weight in my chest. \n\n\"One would think that would entitle you to be a devout wife, yes?\"\n\nShe turned to the judge with eyes as innocent as a baby deer. The judge takes his turn to give me a despiteful look before nodding at her.\n\n\"Well yes, I do think being the goddess of marriage would pertain that. And even if it did not, it's simply not in my nature to be anything else.\"\n\nThe smile she gave was so bright that I saw several people in the benches squint. It told of a woman who would never tell a lie. The antithesis of that smile was upon my face before I continued.\n\n\"So devout that you would plan to overthrow your husband? Have him tied to his throne by those he trusted the must.\"\n\nThe smile vanished instantly replaced by a very deep seeded frown. The judge itched the back of his neck nervously. \n\n\"Counselor, what does this line of questioning have to do with this proceeding?\"\n\nI backed up slightly, allowing the audience to see the air of confidence I had gotten.\n\n\"Why, sir. Should we not look at just why she would like to leave my client? She talks of him as though he is not the shining example of Olympia.\"\n\nI turned to the crowd now, ignoring the goddess and her energy. \n\n\"Should we not look at what my client has gone through? Years and years of systematic emotional abuse for a ma- sorry, God she knew was wildly in love with her.\"\n\nThe look of shock on her face could be bottled and sold to the terminally ill. I allowed my words to hang in the air for a few more seconds before starting the trek back to my seat. \n\n\"The defense rests.\"\n\nFor a few minutes the only sound to be heard was the shuffling of papers. During this time, I leaned over in order to whisper to Zues.\n\n\"Do you think that worked? I saw doubt on some of their faces.\"\n\nHe let out a laugh that had to be heard outside of the courtroom. When he had finally calmed himself enough to respond, he was still lightly chuckling.\n\n\"Heh, you did good my boy. Honestly if I didn't know any better I'd say you were one of mine.\"\n\nHe stopped laughing and got awfully serious drawing my eyes to his. \n\n\"You're not right?\"",
   "created_utc": 1690745022,
   "score": 1,
   "submission_id": "15dor66"
  },
  {
   "comment_id": "ju3wuqu",
   "message": "\"I cannot argue that you get half of Olympus in the divorce.\" I panicked, backing toward the wall of the rather lavish room that held this auspicious meeting.\n\nHera, in her divine beauty and fury, dragged her nails over the surface of a fine mahogany table as her hands balled into fists. If looks could kill, my existence was certainly being negotiated at this moment. \"Explain.\" She glared as the words escaped in a low breath.\n\n\"Consider how the current state of affairs came to be.\" I shook as pristine marble kisses my back. \"Zeus is king of the gods by combining efforts with Hades and Poseidon to topple the tyranny of Kronos.\"\n\n\"I know.\" She hissed as she leaned forward. \"I was...there.\" \n\n\"Of course.\" Panic flooded my veins as I forced myself away from the wall, pacing in front of it instead. \"But what causes issues is that the current laws of the world were then written by the same three. None of them hold greater authority than Zeus.\"\n\nHera pressed her fingers against her temples. Though it appeared as a gentle caress, I envisioned myself being ground to dust by those same fingers. \"Which means I cannot come out favorably in this divorce.\"\n\n\"Not...entirely.\" I quaked with each step. I'd been summoned because of my unorthodox methods with the law. Certainly, human methodology would not prevail against the gods in a matter of such cosmic import. But when she stared at me with piercing and demanding eyes, a new terror filled me. There were some lines of thought that should be kept inside the box.\n\nNo, I was doomed either way. Zeus would see to it.\n\n\"For the sake of appearing impartial, the proceedings are being held in the Underworld.\" A simple statement of fact. Nothing more. Nothing less. Everyone knew it was a charade, though. \"But...the actual location has yet to be disclosed. I suggest requesting Tartarus.\"\n\nThat unyielding presence the queen of the gods held me under broke for the first time. \"You're mad.\"\n\n\"I am a dead man.\" I acknowledged. \"Or I will be at the conclusion of this. So, ignoring my fate and well-being, I suggest Tartarus be the location so we can invoke the ol-\"\n\n\"No.\"\n\nI'd expected the rejection. I'd not expected the icy chill in the air.\n\n\"So long as Zeus is the highest authority, he controls the terms.\" I explained as I approached the table once more. \"While this puts both of you at the whims of a mad titan, you know Kronos hates him far more than you.\"\n\nAnd like that, the table was reduced to splinters. I had no idea how, but that was the nature of me being human in the realms of gods. I was an ant among giants.\n\n\"The rivers were tainted for CENTURIES with blood, mortal.\" She seethed as she stared at the floor. \"Much as I loathe my husband, THAT is not an option.\"\n\nSilence rang against the walls like the harshest storm. What else was there to discuss? There was no winning in a court owned by Zeus. The very world was doomed in one where Kronos was freed.\n\n\"So we seek an outside court.\" I breathed, barely uttering a sound. Gods be damned for their impeccable hearing, though.\n\n\"An outside...what?\"\n\nI couldn't blame her. The idea sounded absurd. And I loved it.\n\n\"A human court.\" I clarified, now sitting in a chair across from Hera. \"The rules of this court will be that you must both plead your cases as humans TO humans. We, who are so ignorant of the way of gods would see this predicament from a more innocent perspective.\"\n\n\"And then I can get half of Olympus?\"\n\nI shook my head. \"Still not happening.\"\n\nA divine eyebrow rose. \"Then explain the incentive for this plan.\"\n\nI cocked my head to the side with a wry grin. \"I hear Athena is not on the greatest id teams with her father. Athens may be a most favorable court to negotiate things like...alimony.\"\n\nFinally. Finally...Hera smiled.",
   "created_utc": 1690744622,
   "score": 1,
   "submission_id": "15dor66"
  },
  {
   "comment_id": "ju3ckeb",
   "message": "\"Impudent worm!\" Zeus bellowed as he hurled a lightning bolt in my direction. The sky outside my office darkened and thunder echoed through the room as the blazing streak of light and electricity struck me.\n\nWhen the dust settled, I reassembled the scattered papers on my desk and motioned towards the seat.\n\n\"Mister Zeus, please,\" I continued casually. \"I can assure you the term 'bastard' has been chosen for its accuracy, not the more modern derogatory nature.\"\n\n\"How did you...\" Zeus gasped quietly. \"You're... how did you survive...\"\n\n\"I'm a very good lawyer,\" I noted.\n\n\"Oh, please, sit down already,\" Hera said with blatant annoyance. Zeus, still reeling from the shock of his bolt having no effect, sank into the comfortable leather chair.\n\n\"As I was saying, the custody of your...\" I looked up at Zeus carefully, \"*illegitimate children* would be entirely with you, Mister Zeus-\"\n\n\"Just Zeus is fine.\"\n\n\"And would you...\" I said and looked at Hera.\n\n\"Just Hera will do. Continue,\" she nodded.\n\n\"Most of your children prefer shared custody, though there are few... exceptions,\" I said as I listed through the documents. \"There we are! Hephaestus elected to stay with Zeus on account of his treatment-\"\n\n\"We don't, uh, need to go into that,\" Hera said shakily.\n\n\"Of course. Aphrodite, on the other hand, wishes to side with Hera on account of her help in uniting her son Eros with Psyche.\"\n\n\"Wait, Aphrodite?\" Zeus asked and looked at the equally confused Hera. \"She isn't our- that is, she was born of the foam when, uh...\"\n\n\"Purely legal matter, sir,\" I interrupted. \"There is, of course, the matter of your domain and its splitting.\"\n\nThe two gods before me sighed and sank into their chairs. They knew this would be perhaps the trickiest part of their divorce.\n\n\"Now, The Sky is a rather large estate, of course, and your brothers have raised some concerns about-\"\n\n\"Blast them all,\" Zeus growled. \"I bet they put you up for this as some sort of power grab!\"\n\n\"Them?!\" Hera scoffed. \"You think they had anything to do with it, and not your constant, petulant, immature, womanizing, arrogant-\"\n\n\"Hera, please!\" I yelled to interrupt. \"Some concerns about the *nature of your divorce*.\"\n\nThe two gods looked at one another. \n\n\"They *what*?\" they said in unison.\n\n\"Hades in particular visited me on several occasions and urged me to try and... mend things between you.\"\n\n\"Mend things? Aren't you a divorce lawyer?\" Hera asked.\n\n\"I also provide couples therapy.\"\n\n\"How is that at all profitable?\" Zeus continued.\n\n\"You clearly haven't seen my rates. Now-\"\n\n\"And where does Hades, of all people, get the high horse to-\" Hera started.\n\n\"I have taken that into account, but as records indicate...\" I said and pointed towards the corner of the room stacked to the ceiling with books and scrolls on myth, \"the marriage between Hades and Persephone is perhaps the healthiest out of your Pantheon with zero recorded divorce requests.\"\n\n\"Huh,\" they said in quiet surprise.\n\n\"Now, Hera, as your representative, I merely wish to extend my council towards you. Your wish to divorce Zeus is, of course, entirely within your prerogative, but Hades asked me to try and look Zeus in the eyes for an extended moment.\"\n\n\"How will that-\" she protested.\n\n\"Please.\"\n\nShe sighed and did so. A scowl spread across her face, a tinge of disgust as she recalled all the slights he did to her, but before too long, other emotions started to pour in. The smallest bits of nostalgia, sentiment and joy; even a noticeable amount of attraction.\n\n\"I... *blood and thunder*, Hades,\" she sighed. \"*One* chance. You get *one*\\-\"\n\n\"I know,\" Zeus smiled.\n\n\"Excellent!\" I said and pulled out a ledger, listing through it swiftly. \"How does every other Tuesday work for you?\"",
   "created_utc": 1690736247,
   "score": 76,
   "submission_id": "15dor66"
  }
 ]
}