{
 "submission_id": "15dp3oy",
 "title": "[PI] Your teachers always warned you to never, under any circumstances, cast a resurrection spell on someone still alive, but refused to elaborate why. Today your curiosity got the better of you.",
 "selftext": "Link to the original prompt: [https://www.reddit.com/r/WritingPrompts/comments/14li1go/wp\\_your\\_teachers\\_always\\_warned\\_you\\_to\\_never\\_under/](https://www.reddit.com/r/WritingPrompts/comments/14li1go/wp_your_teachers_always_warned_you_to_never_under/)\n\nStrayed a bit from the teacher part of the prompt but was really intrigued by the resurrection spell idea - \n\nResurrection is sacrifice. Those who live and breathe bear a light that sparks their soul. Without that light, the dead are but husks. To revive someone who has passed, part of the caster’s own soul, their spark, must be given.\r  \n\r  \nOnly one revivification circle existed, and it had fallen into the hands of the Purgers. Ever since the circle had been created, the population had magnified. Lost relatives, soldiers taken too soon, victims of illness and tragedy - they all walked the world once more. However, both those who offered up a portion of their soul and the revived who took that spark lived half a life. With only part of a soul to experience the world, emotions, senses, and memories were all muted for those half-lives who came to be known as Shells.\r  \n\r  \nShells, a derivative term by those who wished to consider the revived inhuman, and no one used it more than the Purgers. The Purgers despised Shells with an emotional passion that the Shells could never hope to experience. They blamed those with half a soul for wreaking havoc on their world - corrupting it with overpopulation, tanking the economy, and filling the world with walking corpses. And now, with the revivification circle in their hands, there soon might never be another opportunity for those robbed of life to return to the ones they loved.\r  \n\r  \nDesmond couldn’t let that happen. The mere term, Shells, filled him with a rage rivaling anyone with a complete soul. He owed his life to that circle, as well as countless others. He may be a Shell, but he lived as fully as any one of those Purgers. So, he decided, with the aid of his fellow half-souls, to take back the circle.\r  \n\r  \nHe flipped through the loose arcane notes that had been compiled in regard to the revivification circle over generations of study. What Desmond held in his hands was likely the closest that anyone had regarding a complete picture of the circle. He understood enough to work it and even explain most of the sigils, but it still was a far cry from being able to create a new one. Until he had that knowledge, it was vital to recapturing the Purger’s circle.\r  \n\r  \n“Has anyone ever completed the chant with a recording?” Desmond asked.\r  \n\r  \nOne of the Shells spoke up, “I heard of an instance where a summoner brought a recording of the revivification chant with him so he could copy the chant’s lyrics to ensure he wouldn’t mess up. He still messed up, he’s an awfully clumsy fool, and only moreso as a half soul, but the chant still worked. It could be possible that he owes his success to the recording.”\r  \n\r  \n“Intriguing…” Desmond scratched his chin, “That bodes well for us. If it doesn’t require a mouth to recite, it means that the importance is not in voice, but pitch.” He turned to the Shells, who still looked perplexed, he continued, “What I mean, is that we could use anything to create the chant as long as the pitch is right. We could play the flute, stomp our feet, even drum on a rock. Are you all following?”\r  \n\r  \nThere were some mixed nods, though one Shell raised his hand, a confused look on their face. Desmond gestured to them, urging them to speak, “Yes, I mostly follow. But I fail to see how this knowledge benefits us.”\r  \n\r  \nDesmond nodded, “Understandable. What I’m getting at is that while the chant is familiar by this point, the pitches aren’t so easily detected. If we ran up to a revivification circle filled with Purgers and started chanting, we would surely be stopped. If they heard seemingly random noises blending into the background… well, that wouldn’t be so easily noticed, would it?”\r  \n\r  \nSounds of realization washed over the crowd, though the same Shell took issue once again, “The reason why there is a chanter present is because someone’s soul has to be split in order for the ritual to work. Merely creating the right pitch would be useless. Besides, who would the circle summon if there was no summoner to designate a lost soul for revival?”\r  \n\r  \n“The circle isn’t empty,” Desmond responded, “it’s filled with Purgers. One of them surely will have someone in mind that they miss.”\r  \n\r  \n“But splitting their soul? Is that a fair cost?”\r  \n\r  \n“Look at us? We all are missing pieces of our souls, but we couldn’t be more grateful to be standing on this very ground. A piece of a soul is a petty cost to bring back someone lost. Besides, these are Purgers we’re talking about, not model citizens. Think of how many times they have tried to hunt us, how they treat us like vermin. If one of them were to become a ‘Shell,’ don’t you think it could spark something new in their bigoted minds? Some sympathy even?”\r  \n\r  \nMany of the Shells pumped up their fists in solidarity at Desmond’s speech, filling the air with vibrant fervor. Desmond grinned, “That’s more like it! Now, let’s figure out that chant’s pitch and take back the circle!”\r  \n\r  \n\\_\\_\\_\\_\\_\\_\r  \n\r  \nThey had actually done it, Desmond was filled with pride at his band of half-souls, for they had successfully mapped the pitch of the entire chant. Now, it was time to put it into motion.\r  \n\r  \nIt started as planned, the Purgers heard a whistle, nearly indistinguishable from that of a bird, and paid it little mind. Then, a breeze of wind, followed by the bounce of a pebble. The snap of a twig, the drip of water, the Shells tried to create as many of the sounds as they could with mere nature, but not all of the pitches were so easily achieved. A few Purger eyebrows raised at the apparent stomp of a foot and heave of a cough. It could have been one of them, but multiple of these sounds in a row appeared to be raising suspicion.\r  \n\r  \nDesmond kept his cool as he looked on the Purgers with anticipation. Sure, they were starting to suspect foul play, but by the time they could pinpoint what happened, the ritual would be complete. \r  \n\r  \nAnd that’s exactly what happened. Shock came over the eyes of the Purgers as the circle began to glow with arcane energy. One of them, trying to investigate, stepped onto the circle, analuzing the runes. Desmond’s eyes widened, he didn’t know what would happen if a living entity was on the circle when it activated. He hoped and prayed that once they figured out a revival was happening he would step off, but as the seconds passed and the ritual finalized, the Purger still stood at the circle’s center.\r  \n\r  \nTo Desmond’s surprise, not one but six of the Purgers must have had lost loved ones on the mind, for when the circle activated, six Purgers gasped in pain as their souls were split, their skin growing grey in color - the mark of a Shell. But newly revived corpses were not appearing, the soul halves were not imbuing any dead, but instead, they all went directly into the chest of the Purger in the circle.\r  \n\r  \nThe Purger screamed in agony, the sound almost inhuman, distorted and reverbant. His eyes glowed with the brightness of the souls he had been imbued with, light pouring out of every facial orifice, his mouth agape in a perpetual cry of pain.\r  \n\r  \nThis abhorrent that was once a creature had been a victim of something that Desmond had never heard of - the revival of an already living being. Though this seemed an amalgam. The thing that was once a Purger was half alive and half dead, transcending the boundary between either. It had the equivalent of four souls within it, nearly too much for their mortal husk to contain. The other Purgers rushed towards it, attempting to fend the vile creature off, but they were no match for the strength of four souls.\r  \n\r  \nTheir weapons had no effect on it. Ammunition pierced what should have been vital organs, but the entity appeared unfazed, their many soul-fueled body healing itself moments after the damage was done. The monstrosity’s soul-light illuminating its warped body dimmed for a moment as it healed, a hunger gleaming in its eyes as it pounced on an attacking Purger, sinking its gaping maw into the chest of the victim, siphoning the very soul from their body.\r  \n\r  \nThe afflicted Purger’s skin turned greyer and greyer with each moment of feeding they succumbed to, until the light in their eyes went out. Desmond gasped in horror. The creature had removed the entirety of its victim’s soul. \r  \n\r  \n“Desmond.. What do we do now?” The Shell’s voice was filled with fear as they looked to him for an answer.\r  \n\r  \nHe turned to the Shell, fighting to maintain composure, breath shaky, “We run.”\r\n\n\u0026amp;#x200B;",
 "created_utc": 1690732870,
 "permalink": "/r/WritingPrompts/comments/15dp3oy/pi_your_teachers_always_warned_you_to_never_under/",
 "score": 4,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dp3oy/pi_your_teachers_always_warned_you_to_never_under/",
 "comments": []
}