{
 "submission_id": "15dqh1r",
 "title": "[WP] Hearing a flight attendant ask if there are any doctors on board is scary. Them specifying a doctor of nuclear physics or aerospace engineering is somehow much more so.",
 "selftext": "",
 "created_utc": 1690736363,
 "permalink": "/r/WritingPrompts/comments/15dqh1r/wp_hearing_a_flight_attendant_ask_if_there_are/",
 "score": 21,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dqh1r/wp_hearing_a_flight_attendant_ask_if_there_are/",
 "comments": [
  {
   "comment_id": "ju3cuhy",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690736363,
   "score": 1,
   "submission_id": "15dqh1r"
  },
  {
   "comment_id": "ju59gv4",
   "message": "Ah. Hello there. My name is Doctor Phillip A. Neuro. I am told it is a name *destined* for science, and sure enough most of my professor pushed me towards that field. I had often wondered whether the pursuit of my doctorate was a product of nurture, rather than nature, but those thoughts were almost always followed by errant thoughts related to my profession. \n\nEither way, such thoughts arose once more when the flight attendant asked for the presence of a doctor. Of course, I had watched movies before. I knew that they weren't asking for me. They were asking for a doctor of medicine, something that I had knowledge of but no actual experience with. My jurisdiction would likely cause more harm than help, and there was surely to be a person better suited for the situation than I. \n\nIf not a doctor, then surely a nurse of some kind would be on board. There were more than 100 passengers on this train. It was nearly impossible for there to be *no one* in the medical profession present. \n\n\"I'm a doctor!\" a woman near the front roared. She rose from her seat and made her way hurriedly over to the flight attendant, something that I had to commend her for. There was an urgency to her movements, but she was in no rush. She knew how to act with haste, but not with waste. A true professional. \"What seems to be the problem? Is someone hurt?\" \n\nI could feel the wave of relief spreading through the cabin. There is a certain level of urgency that arises whenever a person's life is in danger, and most humans tend to feel it even when they aren't even slightly related to it. That feeling had definitely permeated the cabin, and was only just alleviated now. \n\nMost people were sighing, breathing out their relief. Some had even gone back to doing what they were doing before, turning back to their phones or their video games, or putting their headphones back on. \n\nBut not me. I continued to stare at the woman's face. \n\nThe flight attendant folded her hands before her, crossing them over her blue pencil skirt. She pursed her lips as she analyzed the doctor with a critical eye, raking her attention to every part of the woman's suit. \n\nThen she sighed. \n\nMy stomach dropped. \n\n\"My apologies, ma'am, but I need someone else.\" \n\nTo this, the woman looked offended. But, true to her professionalism, she did not act on it. Her lips curled for just a second before she reigned it in. \"I'm sorry? I can assure you, I am board certified. I have been a physician for almost twelve years, all of which I have been active. Whatever the case you have, I'm sure that I can at the very least offer council.\" \n\nAnd, owing to her professionalism, in the face of the offended passenger the flight attendant merely smiled. \"I'm sure you are, ma'am, but what we need right now isn't a physician.\" \n\nA look of confusion came over the doctor's face. It was a look that was mirrored across every other face still paying attention. \n\n\"What do you mean?\" she asked. \n\n\"I mean that we don't need a doctor of medicine right now. We need a doctor of nuclear physics.\" \n\nThe silence that permeated the cabin was deafening. The flight attendant weathered the stares of dozens of people with the ease of a politician. \n\n\"You must be joking,\" the doctor said. \"This is a prank of some kind.\" \n\n\"I sincerely wish it were,\" the attendant replied. Then, without wasting a breath, she turned and addressed the rest of the cabin once more. \"Hello? Once again, we are requesting the aid of a doctor. A doctor of nuclear physics?\" \n\nThe cabin was silent once more, though it was more through awe at the incredulity of the matter. I'm sure that none of them had ever even known a doctor of nuclear physics, let alone ever needed one before. Such a situation must have seemed so alien to them as to be preposterous.\n\nHell, it was preposterous to me, and I was the one in question. \n\n\"Is there no one?\" the flight attendant continued to ask. By now, the medical doctor had already returned to her seat, mumbling something to herself the entire time. This left the flight attendant by her lonesome, standing as if a rock in a river. \"We really need your help. If there is anyone here, anyone at all, experienced in nuclear physics please let us know. There are lives at stake.\" \n\nThough it might have been due to the calmness with which she spoke, the people on board weren't alarmed in the slightest. This, of course, was something good. I didn't think I would be able to be heard if there was a panic. \n\nOf course, I didn't believe she needed me, either. Unless they let some kind of radioactive material onboard, there weren't a very many situations where a nuclear physicist could be particularly helpful on a plane. \n\nOf course, I knew this. But it would be funny regardless. \n\n\"Hello,\" I called. I stood from my seat. I didn't cut nearly as good a figure as the physicist did. I was shorter than her, and I wore a simple button-up shirt that I found in a thrift shop. I had tucked it into a pair of slacks that I had since high school. Both were bland, pastel colors. \"My name is Doctor Phillip A. Neuro. I am a doctor of nuclear physics. I heard that you needed my help?\" \n\nThe flight attendant, of course, looked skeptical. My name was, of course, far too perfect for my position. It wouldn't be too far of a stretch to assume that someone was taking advantage of the situation to make a joke at the expense of the attendant. Hell, some of the people still paying attention had started to laugh. \n\nI held strong, however. If, by some stroke of fate, she really did need assistance, then it was up to me to help. \n\n\"Where did you get your doctorate?\" she asked. \n\n\"John Hopkins University.\" \n\nHer apprehension seemed to melt just a bit at my immediate response. She looked like she had more questions that she wanted to ask, but the urgency of the situation seemed to force her hand. \n\n\"Fine,\" she said. \"Come with me. We have something we need your help with.\" She then walked away, striding with all the ramrod straight urgency of a woman at work. \n\nI followed her to the front of the plane, passing by the business and first-class cabins. There were people in both, though they were eager to enjoy their much more expensive seats. The people in the business class looked annoyed at our trespassing into their domain, though the first-class clients barely paid us any attention at all. It wasn't long until we were in the cockpit, and I was face-to-face with the pilots. \n\n\"Is this guy a doctor?\" the co-pilot asked. He was speaking for the both of them, as the pilot himself looked to be too focused on the task at hand. \"We don't have time for any jokers right now.\" \n\nThe flight attendant spared me a glance, then nodded her head. \"Yes, he's legitimate.\" \n\nThe co-pilot stared at me for a single moment before nodding himself. He turned back to the control board and pressed a button. \n\nI didn't expect for a panel to open, revealing a glowing green rock hidden behind nothing more than a glass panel. \n\n\"Dear goodness,\" I gasped. Instinct almost pushed me out of the cabin, urging me to get as far away from the unstable rock as possible. What was something like *that* doing *here*? I wasn't in proper gear. I wasn't protected! Just being this close... there were lasting health effects even for people in perfect conditions if they had prolonged exposure to such things. \"What...\" \n\n\"There isn't much time to explain,\" the co-pilot said, interrupting both my words and my thoughts. I zeroed in on him as he spoke, suddenly serious about the situation. \"I'm going to cut straight to the point, if you don't mind. There was a malfunction, and nuclear meltdown is set to occur soon if we don't hurry. There are just over a hundred people on this plane, and all of their lives are going to be at risk if we don't find a way to remedy this situation. We won't be reaching Japan for another few hours, and by then we will all be dead. Can we count on you to save some lives?\" \n\nI looked between the gathered people: the two pilots, one of whom had yet to take his eyes off the sky, and the one flight attendant. Then, with as much confidence as I could muster, I rolled up my sleeves and nodded. \n\n\"Of course,\" I said. \"I am Phillip A. Neuro. I was born for this.\"",
   "created_utc": 1690765989,
   "score": 23,
   "submission_id": "15dqh1r"
  }
 ]
}