{
 "submission_id": "15dqsa8",
 "title": "[WP] A hero show up at the villain’s doorstep, bloodied and bruised, and say “I didn’t know where else to go”",
 "selftext": "",
 "created_utc": 1690737152,
 "permalink": "/r/WritingPrompts/comments/15dqsa8/wp_a_hero_show_up_at_the_villains_doorstep/",
 "score": 22,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dqsa8/wp_a_hero_show_up_at_the_villains_doorstep/",
 "comments": [
  {
   "comment_id": "ju3er2o",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690737152,
   "score": 1,
   "submission_id": "15dqsa8"
  },
  {
   "comment_id": "ju48n8k",
   "message": "The Terrorizer let out a deep long sigh as he heard the ring of the doorbell. He waited for a moment but it was followed by a knock, and he decided to rise from the comfort of his couch and head to the door. Today was his day off, and he wanted nothing more than to spend it on his couch nursing various bruises and cuts.\n\nHe opened the door with a growl “This had better be-” but he stopped short when he saw just who was at the door. It was Maxim, one of the city's superheroes. Well he was the superhero. And now he was standing on the doorstep of his greatest enemy, covered in cuts and bruises with a black eye and a torn mask. \n\nThere was a long pause before the young man spoke, “I-i’m sorry, i didn't know where else to go.'' There was even more silence as Terrorizer looked over at the young man. Not even he had ever hurt the kid this bad, and he went by the name Terrorizer, the city's greatest villain. The kid looked almost half his age after all, he could never quite bring himself to hurt them.\n\nMaxim swallowed hard and spoke again, “i-im sorry, this was a dumb idea. I'll just go.” “No” Terrorizer said with a threatening voice, “you won't be going anywhere, get inside.” Maxim flinched a bit and paused before walking inside, heavily favoring one leg as he limped in, “I've got a few questions,” the terrorist said as he slammed the door shut, “One, how do you know where I live?”\n\n“Your sleep gas has a very distinct perfume,” Maximum replied as he stood awkwardly in the entrance way, “I figured out what perfume it was, got a list of who buys it, and it was a process of elimination from there.” Terrorizer crossed his arms with a raised eyebrow, “and how'd you know i used a perfume in the gas?”\n\nMaxim shifted awkwardly some more, “well uh, it's the same stuff my mom uses on her date nights.'' There was more awkward silence as Terrorizer thought that, “damn” was all he muttered before walking into his living room, “well, take a seat. Try not to bleed on my couch”\n\n“Thank you” maxim muttered quietly as he hobbled over to the couch and sat down with a grunt, “if you know who i am and where i live why haven't you arrested me yet?” Terrorizer asked as he grabbed a bottle of water, giving it to Maxim as he sat on the couch beside the young hero.Maxim took a grateful drink before responding, “well uh, your good practice i guess? Not to offend or anything” he added quickly, “it's just, I can tell you to hold back when we fight. Plus you keep the other bad guys away, the actually dangerous ones. Again, not saying your not dangerous or anything Terrorizer.”\n\n“You already know my real name, just use it” Terrorizer said with a sigh as he leaned back on the couch, “Sorry” Maxim apologized, “it just, feel weird to call you Kyle. and i'm sorry for coming here, i just don't want my parents to see me like this.”\n\n“Don't sweat it, it's my day off. How old are you anyways?” Maxim paused before answering, “uh, 17” that made Terrorizers eyes narrow, he really had been fighting just a kid this whole time. Now he was extra glad he was always holding back, “And just what happend to you?”\n\nMaxim was quiet for a long time as he fiddled with the water bottle before answering almost too quietly to hear, “It was the A team” “the superhero team from Haddensview?” Terrorizer asked with growing anger in his voice, “Y-yeah” Maxim muttered, “Said they were teaching me a lesson, teaching me how to be a real hero or something like that.”\n\nTerrorizer scoffed, “some superheroes, jealous of a 17 year old kid” maxim couldn't help but flinch at the pure hatred coming off the supervillain he sat next to, “maybe it's time someone taught them a lesson.'' It had been a while since Terrorizer had been in a good fight. Not since he went by the title obliterator. Ok he wasn't the best at names, but the title still struck fear in anyone who heard it. He was the most feared villain in the world at one point, and now it was time for Obliterator to come out of retirement.\n\nBut first, he stood up and headed to his bathroom, coming back out with a medkit in hand.",
   "created_utc": 1690749399,
   "score": 12,
   "submission_id": "15dqsa8"
  },
  {
   "comment_id": "ju3rvuv",
   "message": "# Triston\n\nMy eyes meet my enemy's. He stares in confusion. \"We fight constantly. I want control of this city. You want to protect it from me. The only reason you don't throw my sorry ass in prison is because of the people who root for me to overthrow, and I quote, 'that darned dirtbag mayor'. Why, of all people, would you come to *me*?\"\n\nI struggle to remain standing. \"May we talk inside? Please?\"\n\nHe shrugs. \"Fine. But know that this isn't me being kind, I'm just taking pity on you.\" He helps me onto his couch.\n\nResting, my body relaxes. \"You want to take the city by force. That's why I have to stop you. But the one thing you'd *never* do... is destroy it, or its people. I know you just want the power, but you're hardly *evil*.\"\n\n\"What's your point?\" He folds his arms impatiently.\n\nMy eyes close from exhaustion. \"The election for a new mayor happened recently...\"\n\n\"Oh, yeah, I heard about that. Another guy making false promises only to burn the city's resources to the ground?\"\n\nI focus on breathing as I speak. \"The new mayor... he wants to lock up anyone and everyone he deems a threat... I'm in this state after fending off several armed police officers... my crime? I'm a known hero. He think I'll just turn around and abuse my status and power.\"\n\n\"What an absolute pig. Hypocrite. Well... you said it yourself. I'm not evil. But I don't trust you. The only reason you'd be here telling me all this is because you want me to deal with the dirtbag. That won't come for free. Once he's gone, the city's mine. Understood?\"\n\nI force my eyes open, turning to look at him. I don't have a choice. If it was just me I'd deal with the injustice, but other innocent people have been threatened and arrested. \"I'll agree to anything... I'm begging you, Puppeteer...\" my mind works quickly, realising I should call him by the villain name he *wanted*, not what he got *given*. \"...Emperor King.\"\n\nEmperor King smirks, realising what I've said. \"Let me get you patched up first. You must be in a great deal of pain.\"\n\nJust before passing out, my lips let loose one final thought. \"Thank you.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThis story is the first in my new series, [A City of My Own.](https://www.reddit.com/r/Crystal_Chronicles/comments/15dsu90/a_city_of_my_own/?utm_source=share\u0026amp;utm_medium=web2x\u0026amp;context=3) Please check it out!",
   "created_utc": 1690742573,
   "score": 8,
   "submission_id": "15dqsa8"
  },
  {
   "comment_id": "ju4vc7z",
   "message": "\"How... How you get my address birdy?\" I said at the bird-like hero in front of me.\n\nThe hero looked at other side a bit ashamed. \"I seen you come here a few times when you run away...\"\n\nI put two fingers in my forehead, trying to stop a headache... Or my desires to kill him. \"Enter, take seat in the dining room,  I gonna pass you the first aid kit and make you something to drink...\"\n\nI said walking away and letting the first aid kit in the dining room and went to the kitchen make a cup of coffee.\n\nA few minutes after I walked back at him with the cup of coffee and a few cookies.\n\n\"Eat and talk, why are you here and what happened to you?\"\n\nHe take one of the cookies and eat it with a sip of coffee. \"Well remember that time when I said that my powers sometimes get a bit strange.\"\n\n\"Yeah, you said that after you stopped me from destroying Golden Gate, what about that?\"\n\nHe take another sip and cookie before answering. \"I was patrolling a few streets down, flying and greeting the citizens like the usual and my powers deactivated and I fell really bad and well my house is like at the other side of the town, so I come here to rest and wait for my powers to come back.\"\n\n\"I guess you can crash here for a while, just don't try something funny.\" I said taking the first aid kit from the table. \"Now take this fake feather cape, this not even look good on you.\"\n\n\"What now, are you jealous that I have a unique style and you not Simple McGeneric.\" He chuckled a nit before finally taking off  the cape and I was able to treat the wounds.\n\n(To be continue... Maybe I'm low in inspiration)",
   "created_utc": 1690759295,
   "score": 1,
   "submission_id": "15dqsa8"
  }
 ]
}