{
 "submission_id": "15dqogc",
 "title": "[WP] You are a werewolf and everyone in the village knows. When its nearing the full moon they all help you baricade yourself in your home since you are the only wheat farmer in town. Everything was fine until some self righteous lord takes over and demands not only your land but your home as well.",
 "selftext": "",
 "created_utc": 1690736870,
 "permalink": "/r/WritingPrompts/comments/15dqogc/wp_you_are_a_werewolf_and_everyone_in_the_village/",
 "score": 139,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dqogc/wp_you_are_a_werewolf_and_everyone_in_the_village/",
 "comments": [
  {
   "comment_id": "ju3e2k2",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690736870,
   "score": 1,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju3lwnt",
   "message": "I know I'm lucky, compared to some in my position. I don't have to hide my condition, or hide away from settlements out of fear for both them and me.\n\nIt happened nearly seven winters ago. I was stumbling back from the tavern, along the road that leads out to my mill, when the beast attacked. I was found the next morning, savaged but alive. The village healer knew what my wounds were as soon as she set eyes on me.\n\nWere I anyone else, I would have been cast out if I survived without the healer's help. The same for if this village was larger. In a large enough town, I'd have been murdered where I lay, by some overly zealous adherent of the faith.\n\nBut this isn't a larger village, and I'm not anyone else. I'm the miller, the only one for three day's ride in any direction. I'm the only one who knows how to operate the mill, which everyone here relies on. It's not an easy skill to learn, and none who live here have shown the aptitude for the magic.\n\nAnd so my condition is managed. The smith and the carpenter devised covers for the windows and doors of the mill, operable only from the outside. The lord himself sends men to ensure their closure on the nights of the moon, with me inside. \n\nOr, rather, he _sent_ men. The lord was called to war six moons past, and he took all but a handful of his soldiers with him. None returned, and we got the word this past week. They were ambushed, the entire contingent slaughtered to a man. Our lord's head was returned to the king in a bag, his tongue severed and replaced with his hands.\n\nWe said our prayers to his soul, unable to ascend and condemned to wander the mortal lands forever due to this abhorrent mutilation.\n\nAnd then we got the word of the lord sent to replace him, a cousin raised in the capital. In the centre of the faith. One of the zealots who would see me murdered.\n\nHe has ordered my seizure, and the seizure of my lands and my homes. The former is not much, just a small garden where I grow some vegetables and a few herbs that I trade to the healer in exchange for the pain draughts she brews from them. But the mill, that is not just _my_ livelihood, but the lifeblood of the village.\n\nAnd he has not brought a miller to replace me, that much is known. So the men of the village are gathered outside of my home, armed as best as they can manage, to resist my punishment. Because to punish me is to condemn them all. Without me their grain does not get milled, there is no flour to make bread, no hreth to offer in worship at the temple.\n\nWithout me we don't get the protection of the gods, against the beasts that lurk in the forest. The last time we failed to make the proper offering was nearly seven winters ago, when a storm damaged my mill.\n\nI can hear the cries of the lord's men now, shouting at the villagemen to disperse and let them \"take the beast\". I can hear through the covers that they've pulled over the doors and window, to protect me instead of themselves this time.\n\nI am writing this in between bouts of production. I don't believe that my neighbours - my _friends_ - will be able to hold off the trained soldiers of our lord. If they can buy me enough time, I can hopefully produce enough hreth to tide them over until a new miller is found, then perhaps no one else will suffer my fate.\n\nOr worse. A werewolf is not the most dangerous thing that lurks outside of the faith's shields, after all.",
   "created_utc": 1690740096,
   "score": 89,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju4q4ec",
   "message": "I had considered myself lucky up until now. The villagers protected me despite the transformation, locking me in my house so I wouldn't afflict any others with my condition.\n\nYears ago when I had been bitten, I had started packing my things to leave, wished the rest of the town goodbye. I had plans to go far away, where no humans were, and live in solitude.\n\nBut the townspeople, Old Bertrand the Baker, Willow the Dairy Farmer and her 10 strong sons, the girls down at the pub, even Tiffany the town guard, they all refused to let me do that to myself. Instead, they helped me build barricades around my little cottage, easy to drop down when the full moon came. Along with the chain and collar I had bolted to the stone fireplace myself. Tight when I transformed, but as the beast I had no thumbs to unlatch the collar.\n\nBut now....\n\nThe decree hung loosely upon my door. On half the doors in town. A new lord, appointed by the king, was claiming our homes for his men. We all had to be moved out within two months.  Two moons of time, and my home, my carefully secured domicile, would be lost.\n\nIt hadn't escaped notice either that the untouched houses were those that belonged to single women or families with daughters. Willow with her 10 sons was being asked to leave, but Tiffany and her 6 daughters, not one over 15, were left behind.\n\nAnd myself...despite being a single woman, the rumors by now had surely reached the Lord and the army. A cursed girl. A witch. A monster.\n\nPartially true, all of those tales.\n\nBut now...\n\nI begrudgingly started packing my things. It wasn't much, I'd had the bag planned from the time I was turned, after all. Easy to grab and go.\n\nA cough behind me broke me out of my packing. \"Ahem....Lyra. What do you think you are doing?\"\n\nI turned, wincing as I saw Tiffany's bulk in my doorway. She had taught me to fight, as she taught all the town's children. As she taught her own daughters.\n\n\"I figured, I was asked to leave and I can't be living with anyone, so I may as well start going now so I'm not a danger to anyone else on the road.\"\n\nTiffany looked thoughtful. \"Aye, lass, I figured you'd do as much. 'tis why I came here when I saw those confounded papers about town. However, we have a plan for that, if you'd be so kind as to come to the council meeting tonight.\"\n\nI stared dumbly at her, my mouth half open. Tiffany raised an eyebrow at me and tapped her foot. I gulped and nodded.\n\n\\---\n\nThat night, the council was packed with the adults of the town. When I arrived, I could hear shouting and arguing from outside, along with punctuated versions of \"this uppity lord\" and \"purebred mongrel\". It seemed everyone was upset.\n\nAs I entered, however, the arguments stopped, and all eyes were on me.\n\nBertrand, at the head of the table, was the first to speak. \"Come here, Lyra, and hear our plan.\" He gestured at the empty chair next to him, and continued to speak as I walked up. \"We have known for some time that a new lord would be appointed our lands eventually, and like all new lords, he is of the mind of replacing our people with his own, profiting off of the homes our mothers and fathers built long ago.\n\n\"However, as we have been planning since young Lyra was bitten, we can barricade our own homes as well. The secondary safety measures can keep out a werewolf, so a human soldier will be hard pressed to find a way in without resorting to fire. However, we don't plan to die in flames.\n\n\"Lyra, child, we plan to lock our own doors and let you wander free. We have been planning this for awhile, as locking you up and listening to your howling breaks all our hearts. If you wander freely, the rumor of a huge beast haunting our city will come true. And when the soldiers come, the wolf shall have freedom. When the Lord marches in, you will be free. Do you wish to accept this risk?\"\n\nI looked at the faces around me. Eyes, shining with hope. Not one of them afraid I would hurt them? Not one afraid I would turn on those I care about. I gulped nervously, and then met Tiffany's eyes. There was a light in them, shining brightly. More than hope, she believed in me.\n\nMy own voice was distant to my ears. \"Yes, I can try.\"\n\n\\---\n\n*Moon bright and shiny in sky. No leather noose on neck this time. Freedom?*\n\n*Bang bang bang from the...door? Yeah, it's a door, can't open with paws. Normally has bar but not this time. Seems....loose? Oh right, the human me left the bar off this time. Remember...have to remember...*\n\n*Bang bang CRASH.*\n\n*Door open!! There's men with pointy things in my territory. The one who broke my door, his eyes meet mine for a second. My nose twitches. he smells of fear. Did he...mark my territory? He lets out a shriek and turns to run. Oh a chase!*\n\n*I leap on his back and bite. His screaming stops, his eyes stay open. I shake him once to be sure. Oops, I think I killed him?*\n\n*I see another soldier, banging on another door trying to get in. My nose puts a name to the door. That's Bertrand's house!! His smell was there on full moons when he'd be outside my cage to sing with me.*\n\n*I howled a greeting and the soldier turned. This one yelled something, and pulled a shiny sword from his waist.* \n\n*I greeted him with my jaws as well.* \n\n*All through the town, soldiers either ran or died.* \n\n\\----\n\nThe next day, I woke up in a barn and puked, remembering the blood I had shed. \n\nEach body on my conscience, the more my stomach rebelled. \n\nTiffany was there though, rubbing my back and making me drink water.\n\nAnd a week later, the lord had a new pronouncement. \n\nWe could keep our homes. As long as we kept the beast contained.",
   "created_utc": 1690756915,
   "score": 156,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju4srsy",
   "message": "I tilted my head, mind not quite comprehending what my ears had heard. \"...Are you serious?\" \n\nThe lord, newly 'appointed' over our town, scoffed at me. \"Of course I am. Me telling you to tell the rest of the village is a formality that I decided to follow.\"\n\n...He didn't know.\n\nOur village had a *very minor* werewolf problem. People who are good at medicine and alchemy and the like are very hard to come by, so we couldn't just kill him or whatever. If anything, his condition usually helped him. Much easier to smell out herbs and such when you sometimes have wolf senses. Just had to make sure to tie him up when the full moon was coming, which he was aware of and willing to do.\n\nThe issue is that... werewolves. The good news was that this lord clearly didn't know about it. The bad news was that... he was going to very quickly.\n\n\"Are you listening?\" I snapped back to attention.\n\n\"Apologies,\" I said with a slight curtsy. \"That building and land belongs to our town's medicine man. If you take it-\"\n\nThe lord waved his hand dismissively. \"What happens to your town is none of my concern,\" he interrupted coldly. \"I will be arriving within the week.\" I bit the inside of my lip but nodded. I couldn't exactly *say no,* not  if I valued my life, which I did.\n\n\"I'll be sure to inform the rest of the villagers.\" The lord nodded, turning and waving his hand.\n\n\"You're dismissed.\" I bowed, turned, and walked out of the room.\n\n...I had an idea. A stupid, foolish, idiotic idea that would surely result in the death of all involved if it didn't work.\n\nBut it *was* an idea.",
   "created_utc": 1690758120,
   "score": 62,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju4ndym",
   "message": "I'm the only brewer and baker in town.  Everyone gets their beer and bread at my pub, women bring pies and stews to bake in my oven during the day, and in general the village relies on me.  It's a little village on the edge of nowhere in particular, so we don't really have anyone else to rely on or trade with.  I always give them fair deals when I trade with them, I help out when help is needed, and in general I try to be a good friend.  Without me, the lives of everyone in the village would be a lot harder.\n\nSo when I was bitten by that strange wolf, I tried to hide it.  I was successful for several months, but then one night I managed to break out of my basement in my beastly form. Luckily, I only savaged old Mrs. Gravis's chickens.  But my secret was out.\n\nI can't say I was all that surprised when the villagers were willing to help me instead of banishing me. After all, most of them had known me my entire life, and I was the only one who really knew how to run the ovens. So the best carpenter in the village helped me reinforce my basement door, everyone knew to take their chickens in on a full moon night, and except for my little difficulty, things went on pretty much as they always had.\n\nAnd then that arrogant lord came. He said some king we had never even heard of had given him the land. He said we owed him taxes.  He and his men strutted around the village like cockerels. He began to have his way with the local maidens, whether they wanted his advances or not.  But the last straw, at least for me, was when he decided that a mere woman couldn't be allowed to run the pub and bakery. He announced that he was going to take it from me, and give it to one of his retainers to run.\n\nHe was foolish or unlucky enough to announce this on the day before the full moon. All the villagers know about me, and they know to keep their doors locked, their windows shuttered, and their livestock inside. That arrogant lord knows none of these things. And I won't be locking my basement door tonight.",
   "created_utc": 1690755675,
   "score": 52,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju4xrm3",
   "message": "A home is a man's castle. Wether a peasant or a King, this is true. The village of Valune, they called my small, humble mill the Chateau, the most important building they had.\n\nSurrounded by fields of gold, tilled by me and mine since time immemorial. \n\nThe fruits of that labour ground into white powder by  the power of the wind. Sails sewn by the fingers of ancestors long passed.\n\nI was all that was left, the only one who knew the secrets of the ground. The seasons, the howls of the wind. Now waiting, as time ground my bones to dust, as it did the grain.\n\nNone from the village took to the words of the ground or its blessings. None could understand the plough. I despaired. \n\nAnd then, foul beast! Terrible, wonderous beast! It bit me, deep and strong!\n\nI writhed in agony for days. Yet I healed. Pain fled my aching bones, the clock wound back and though I still looked a withered man, I worked as ten men strong! \n\nOh golden grain, I harvested, put to mill stone, and so kept the village safe from famine winter long. The price, however was something I kept to myself. Barricaded in the 'Chateau'. Inescapable to beast, made of stone that could not be breached by man or beast alike.\n\nBut only so much can be done by one man alone, however strong, the howls brought curiosity, and thus did my wretched state become discovered. The Mayor put to a vote wether I should be allowed to live , near unanimously was the vote of yes. No harm had come to the people of Valune as long as I had been around, and so they said it must be my doing. \n\nIt was of course, not so.\n\nThus did the ritual start, and so did the coming doom .\n\nEvery moon the Chateau lived to its name, a fortress did it become, protected, fortified and kept locked tight to keep me from the thing I feared and craved.\n\nYet so the word of prosperous Chateau grew, and protection grew. The village was then carefully selected by a Lord, young and foolish, who did say the lands all thus belonged to him and him alone. Any attempt to hold anything from him, would be met with force. \n\nHis men, upon that fateful night, came to ensure that no one would bar the Lord from seeing what was within the Chateau.\n\nSo no one stopped him and his men, so politely let him in, and locked it up behind.",
   "created_utc": 1690760419,
   "score": 36,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju48jnw",
   "message": "You're body, though appearing young feels the years of transformations. As you walk across the floor you can remember your first time being stabbed, your first time changing even. The night you changed not knowing what your body was doing. Feeling like your body was going to explode. Now here You are in what some would call a \"Comfortable\" life and it's being taken. Your first thought is easy \"Rip this new lord to pieces\" a thought easily channeled by rage. A more curious thought harbor's itself moments later. You could turn this new lord, turning him into the monster he sees you as.",
   "created_utc": 1690749358,
   "score": 10,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju5qks3",
   "message": "When they think of werewolves, they think of death. They think of flashing claws, bared fangs, and frenzied snarls.\n\nThey're not wrong to think that way. Our reputation isn't the best. There's been more than a few times when a werewolf tore through an innocent town, leaving none alive.\n\nIt would be easy to think that a werewolf is a monster, violence incarnate.\n\nThat would be wrong. The lycanthropic curse is both less and more.\n\nThe wolf is instinct, impulse, and desire mixed in one. It's a person with every mask stripped away, allowing what they are at their core to reveal itself.\n\nIt's disheartening to see how many people are nothing more than a ball of violence and anger once the wolf lays them bare.\n\nDisheartening, but not surprising.\n\nMy town is lucky. Instead of a roving lycanthrope spreading the curse to the town drunk, the mercenary, or the standoffish hunter, it gave the curse to me. The farmer.\n\nI'm good with my hands, I'm good with tools, and I like my work. My work puts food on my table, and on my people's. We're all better for it, and I'm happy.\n\nThere's hate in me, of course. It's in everyone if you look deep enough, but the difference between them and me is that I hold it. It doesn't hold me, and it never will. \n\nSo when the moon shines just right, I wield that hate, and point it where it needs to go.\n\nI haven't had to wield it in a long while. I'd kept my people, and when the clock struck, they took to locking me away in my cabin. I didn't mind, lets me catch up on some sleep.\n\nTonight wasn't one of those nights. A new lord came to town after the old one got sick and died. Some of us thought poison, but we're not exactly in a position to be poking around. The old lord an I had an agreement, but the new lord wants to make a name for himself. Want's a werewolf's head mounted on his wall. And he makes it clear with all the land he's in charge of, he wouldn't miss a few acres of scorched homes if the townsfolk got in his way.\n\nThey leave my cabin unlocked, and my windows open. It's been a while since  I've felt the full moon's light on my skin. It feels good. \n\nThe smell of burning torches is what hits my nose first. The new lord and his band of soldiers are close.\n\nI can feel the wolf waking in my mind, making everything all too simple. They're here to kill you, they’re here to kill your people.\n\nMy hate speaks a single command.\n\nKill them first.\n\nI'm inclined to listen.",
   "created_utc": 1690774606,
   "score": 16,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju60ryh",
   "message": "The new Senior Cares assisted living manager Mr. Veer sat across the table from the staff. He was giving the same old spiel. \"We need to be sure we are providing the best quality of care to our residents. That means we need to prioritize speed and efficiency in the delivery of medical care and ensuring all residents have easy access.\" Everyone knew that meant: get as many out of their individual apartments and into the nursing ward where beds cost more.\n\nHe continued, \"Which brings me to my first piece of business for today: Mr. Lee Carl Thrope.\" The staff had been zoning out but now they were paying attention. \"He's 95, lives in his own apartment but is getting nursing care more consistent with our nursing wing. I think he'd be happier with the higher quality of care in the nursing wing. Can we have that done before the end of the week?\" He looked to the head of nursing.\n\nShe cleared her throat \"Mr. Veer, with all due respect, moving Mr. Thrope is simply not practical. He has nightmares and screams. He-\"\n\nBut he cuts her off \"Sounds like he has an untreated neurological condition. I didn't see any of this in his records. Why haven't we been treating this?\"\n\nShe looks to her colleagues for help but there is none until Jamal, the head of maintenance, speaks up. \"Mr. Thrope had an arrangement with the old manager. He's a war hero, also took a bullet for Reagan. Fought off a wolf during *that* Dick Cheney hunting trip. We sound proofed his rooms.\"\n\nWith a gleam in his eye now he turns to Jamal. \"Now we're getting somewhere. Go on.\"\n\nJamal looked ahead: \"I don't want to speak out of turn but maybe you should talk this over with Mr. Thrope?\"\n\nMr Veer was looking exasperated. \"Ok but let's start getting his move in order.\"\n\nThe head of food services looks at her watch before speaking \"I agree but I think an informal meeting would help clear things up. Lee Can is busy tonight with his bridge club but I'm sure he'd love to have you over tomorrow night for dinner.\"\n\nThe head of nursing paused for a moment and nodded. \"Yes, but in the meantime I'll start making the necessary arrangements to move him. I think we can get the move done by the end of the week. I'll have a packet for you to share with him tomorrow.\"\n\nMr. Veer smiled. \"Excellent! On to other business.\"\n\n----\n\nHis second day on the job had been a long one. One thing after another and he still hadn't gotten to see Mr. Thrope yet. It was like the world was conspiring against him. A pipe had burst and one of the cooks called out so he was helping in the dining room. Which really was just him chatting with the residents. Even after that he had to go find the head of nursing to get the packet from her. She happily showed him the way to Mr. Thropes room and practically pushed him inside. The last thing he saw was the geriatric wolf leaping at his throat.",
   "created_utc": 1690780877,
   "score": 5,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju6a6vt",
   "message": "They should have called me a monster , grabbed the fire and pitchforks and drove me out of town it’s not like I would’ve  fought  it. …. But they didn’t when the boards to my basement door came loose and I transformed from wolf into human in front of everyone in our small town, Who  were out ironically to see what the commotion was about. The  the wolf in me had broken the door off it’s hinges causing a loud bang as it hit the ground … well I was mortified. Thank god it was near dawn and the sun allowed me to turn back before I hurt anyone. I had stared at them wondering what their next move would be. Would they tear me to pieces together, allow me to live on the condition I leave … or worse. They did none of those things one by one they held out their hands as if in acceptance and understanding. “I don’t get it” I said not knowing what to think or how to feel. “You don’t have to just know your the only one who can supply this town affordable food and you’ve crept your way in the hearts of every one of us.” The old man that lived across the street from me said his voice was gruff and had wrinkles for days but when he smiled he had a little more of them to show off. His name was Regan. I smiled back accepting the old man’s hand happy I’d get to stay a little longer. That was until a week ago. My secret has been out for 2 years by this point and each and every month all the towns people gather to help barricade me in for everyone’s safety. They even throw different kinds of meat in there to keep the wolf happy and in the morning we all have a breakfast feast as a community. But when a notice on my door appears stating that some rich asshole mogul named Ashton wants to buy me out of house and land my heart filled with dread. When I say or worse I mean the rich moguls. I’ve heard of horror stories on the far sides of America where towns and cities would sell my kind to these rich moguls for testing and cheap labor.  And because the government sucks and our kind was only known to the public recently we are treated like dogs more than anything . The moguls would supply a small fortune to these people and in return they’d get about 160 years out of us due to our expanded life expectancy of 200. I immediately went to Regan in a panic and explained why this could be bad for me. With a stern set look about him like a man on a mission he left without saying a thing. He knocked on every door of our small town letting them know I was in danger and what he thought of was genius. Regan had spotted something I hadn’t the reason the rich guy wanted my property was because it was the first step to industrializing this town to fit modern standards. The town had the eye of many realtors none finically well enough to buy anyone out but this guy was. When he pointed it out I knew his plan was to cut off the main food supply to undercut the rest of the town. So … we made the town look as unappealing as possible made it so bad no investor would want to touch it with a ten foot pole. It was then 3 months later Ashton came down to the town himself. Unfortunately for me it was on the night of the full moon. He knocked on the door and with everyone inside as the town was working on my barricades. The font door busted down in quick succession guns were trained on everyone. He had hired private army of gunman probably to threaten me. Then as if my luck couldn’t get any worse my wolf broke through the weak barricades. My instincts took over and I was in front of them growing at Ashton his eyes lit up with greed and malice. “ A creature your size is worth a small fortune …. How lucky your a rabid stray.” He said in a fake mocking tone . “Grab the wolf and destroy this place” He said. Regan was in front of me in a second his body covering mine. “No , you won’t take him I won’t let you.” He yelled in anger and fear Ashton smiled and signaled the gunman on the left and in a second Regan had a bullet in his head his body going down as it slid off of me. He hit the floor in a pool of blood. “You seem to think you have a choice.” The Ashton said in a voice that carried all the evil he possessed. “Let me assure you that you don’t.” The next second I pounced aiming for the Ashton in a fit of rage. But gunman to the right of the right of him had a different weapon and shot me with a paralyzing dart. I watched helplessly as they forced the towns people out and destroyed my home and farm. They captured me in a net 2 men about to drag me out as Ashton crouched down to look at me. “You know I came here to make you a deal … offer 10x the amount with a more effective means of persuasion. But it seems I lucked out , … you should’ve taken the money.” He growled the last part. I was terrified. He kicked me in the face and the last thing I remember is being put in the trunk of a car.",
   "created_utc": 1690787916,
   "score": 1,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju6ysc0",
   "message": "Author’s note: I couldn’t get the italics to work, so anything that has asterisks around it is the wolf’s perspective.\n——————————————————————————————————————————————————————————\n\nThe entity’s deal was too good to be true. That’s why I declined, told it I was fine with where my life was, and didn’t need any intervention, divine or otherwise. It had glared, and said, “**If you truly wish to reject my gift, then know this. Any who decline an offer from me are twisted and warped out of their own body, into a new form that they will struggle to deal with. And you just rejected one of my best offers.**” With that, it took its clawed hands, and stabbed them into its chest before ripping a massive hole into it. It reached in and pulled out an orb with pink flames dancing around it. It flicked the orb in my direction and suddenly, it was gone, but there was a warm feeling in my chest, and when I looked down, there was a pink glow emanating from it. \n\nI shrugged it off as a dream when I woke up, and began my usual tasks of harvesting and winnowing the grain. However, this had been an incredibly productive cycle, and so I had to continue working after sunset. As the beautiful full moon began to rise and illuminate the crops, I felt an odd sensation at my back, as though thousands of tiny hairs were sprouting out of my skin. The feeling then spread to my arms, and when I looked at them to check, I was terrified by what I saw. Thick gray fur, covering my arms. By now the feeling had spread to my whole body, and there was a spark of pain in my jaw. I began to weep through my new snout, and soon my whole body was that of a wolf’s. If not for the scar on my torso from when I was still learning to use a scythe, I’d be indistinguishable from any other feral wolf. Thankfully, I was still…in…control…fading…\n\n*I awaken in a field of grain, unsure of my surroundings. I am scared and I want to hide somewhere. I see a hiding place in a large building.\n\nI am tucked underneath a bed, whimpering because of what they will do to me. They will all hunt me and chase me away. They will kill me. They will run after me with torches and pitchforks. They will-\n\nThere is somebody in the room I am hiding in. I cannot be seen. I must not be seen. If I am seen then-*\n\n “Honey, are you in here? I know you’re not outside, the tools are left in the middle of the field, just like you always do when you’re done.”\n\n*The man must not see me. He must not know I am here, whimpering like a coward and hiding. The man turns in my direction. He walks closer. I cannot move. I am frozen. Why am I frozen? I must run. I must hide. I must not be seen. \n\nThe man sees me. The man will surely kill me now. The man will-\n\nI am wrapped in a warm embrace. The man is not killing me. The man is hugging me and weeping into my side. The man is saying that he’s sorry I am like this now. The man promises to keep me safe. Why does he promise to keep me safe? Why does he not tell the others? What can he-*\n\nAs the sun rose, I regained control of my body. I realized with a start that I was in the bed that I shared with my husband with torn clothes. With how much skin was exposed, I may as well have been wearing nothing but a leaf to cover my manhood. I flushed red as I imagined what might have taken place last night. As I got up, I noticed that my body was sore all over. I looked around the room for Damien, who was nowhere to be found. I walked down the stairs to find him standing at the stove with bacon sizzling in the pan. Somehow, it smelled even better than I remember. When he noticed me, he ran up to me and hugged me. I wasn’t sure what I did to warrant such affection, but I’d take it regardless. He filled me in on what happened last night while I downed two packages worth of bacon. I was both relieved and *slightly* disappointed that we didn’t, er, “do the whoopee” last night. What had actually happened was that while Damien was hugging Wolf-Me, I changed back to a human, but was unconscious. So, he put me in our bed to recover, and began to work on breakfast. He told me that he would do anything to keep me safe, even if that meant using the old scythe we have in case the power harvester stopped working to defend me.\n\n———————————————————————————————————\n\n18 months later\n\nHonestly, the whole “werewolf” thing isn’t nearly as bad as it’s made out to be. Damien gets to snuggle with what is essentially a 500-pound puppy, and I get to take a break from having to be a productive member of society. It’s a win-win, really. Except for the time when a group of teenagers decided to throw rocks at the wolf when the  town found out about it and learned that it’s more like a scared puppy than a ferocious wolf. That was a bad idea, and resulted in two funerals and one hospital visit. After that, the mayor told us that we had to install barricades on our home to prevent future incidents, despite Damien’s protests that it was their own fault for antagonizing a 500-pound wolf. Then, the town got a new mayor. A mayor who’d only recently moved here. A mayor that didn’t know my secret. As his first act, he declared that our farm would be turned over to the city to become a public park, since “There’s no need to farm and process our own grain when we can just buy it!”\n\nDamien had an idea where we could invite the mayor over for a *lovely* moonlit dinner to discuss the terms of the deal. I agreed, and so the preparations were made and the invitation was sent.\n\n*There is a table with food on it in front of me. I am seated next to the kind man who gives me hugs and keeps me safe. Across from us is a man who stinks of unearned wealth. The greedy man’s cigar falls out of his mouth. I walk around the table to get closer. He steps back in fear. He fears me. Humans destroy things they fear, things they do not understand. He will destroy me. He will send people with guns and torches and pitchforks after me. I have to kill him first. He cannot take me from the kind man. I will kill anyone who tries to harm the kind man.\n\nThe greedy man is dead. I have killed him. I have won. The kind man is gently wiping the blood off my mouth, and he has promised what he calls “snuggles” afterwards. I like it when he gives me “snuggles”. I wish for more snuggles.\n\nNow, he is giving me snuggles. I am safe. We are safe. \n\nAll is well.*",
   "created_utc": 1690805664,
   "score": 1,
   "submission_id": "15dqogc"
  }
 ]
}