{
 "submission_id": "15dqogc",
 "title": "[WP] You are a werewolf and everyone in the village knows. When its nearing the full moon they all help you baricade yourself in your home since you are the only wheat farmer in town. Everything was fine until some self righteous lord takes over and demands not only your land but your home as well.",
 "selftext": "",
 "created_utc": 1690736870,
 "permalink": "/r/WritingPrompts/comments/15dqogc/wp_you_are_a_werewolf_and_everyone_in_the_village/",
 "score": 91,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dqogc/wp_you_are_a_werewolf_and_everyone_in_the_village/",
 "comments": [
  {
   "comment_id": "ju3e2k2",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690736870,
   "score": 1,
   "submission_id": "15dqogc"
  },
  {
   "comment_id": "ju3lwnt",
   "message": "I know I'm lucky, compared to some in my position. I don't have to hide my condition, or hide away from settlements out of fear for both them and me.\n\nIt happened nearly seven winters ago. I was stumbling back from the tavern, along the road that leads out to my mill, when the beast attacked. I was found the next morning, savaged but alive. The village healer knew what my wounds were as soon as she set eyes on me.\n\nWere I anyone else, I would have been cast out if I survived without the healer's help. The same for if this village was larger. In a large enough town, I'd have been murdered where I lay, by some overly zealous adherent of the faith.\n\nBut this isn't a larger village, and I'm not anyone else. I'm the miller, the only one for three day's ride in any direction. I'm the only one who knows how to operate the mill, which everyone here relies on. It's not an easy skill to learn, and none who live here have shown the aptitude for the magic.\n\nAnd so my condition is managed. The smith and the carpenter devised covers for the windows and doors of the mill, operable only from the outside. The lord himself sends men to ensure their closure on the nights of the moon, with me inside. \n\nOr, rather, he _sent_ men. The lord was called to war six moons past, and he took all but a handful of his soldiers with him. None returned, and we got the word this past week. They were ambushed, the entire contingent slaughtered to a man. Our lord's head was returned to the king in a bag, his tongue severed and replaced with his hands.\n\nWe said our prayers to his soul, unable to ascend and condemned to wander the mortal lands forever due to this abhorrent mutilation.\n\nAnd then we got the word of the lord sent to replace him, a cousin raised in the capital. In the centre of the faith. One of the zealots who would see me murdered.\n\nHe has ordered my seizure, and the seizure of my lands and my homes. The former is not much, just a small garden where I grow some vegetables and a few herbs that I trade to the healer in exchange for the pain draughts she brews from them. But the mill, that is not just _my_ livelihood, but the lifeblood of the village.\n\nAnd he has not brought a miller to replace me, that much is known. So the men of the village are gathered outside of my home, armed as best as they can manage, to resist my punishment. Because to punish me is to condemn them all. Without me their grain does not get milled, there is no flour to make bread, no hreth to offer in worship at the temple.\n\nWithout me we don't get the protection of the gods, against the beasts that lurk in the forest. The last time we failed to make the proper offering was nearly seven winters ago, when a storm damaged my mill.\n\nI can hear the cries of the lord's men now, shouting at the villagemen to disperse and let them \"take the beast\". I can hear through the covers that they've pulled over the doors and window, to protect me instead of themselves this time.\n\nI am writing this in between bouts of production. I don't believe that my neighbours - my _friends_ - will be able to hold off the trained soldiers of our lord. If they can buy me enough time, I can hopefully produce enough hreth to tide them over until a new miller is found, then perhaps no one else will suffer my fate.\n\nOr worse. A werewolf is not the most dangerous thing that lurks outside of the faith's shields, after all.",
   "created_utc": 1690740096,
   "score": 1,
   "submission_id": "15dqogc"
  }
 ]
}