{
 "submission_id": "15dsxpb",
 "title": "[WP] \"None of it is real! It's all fake. Here, slap me and I won't feel a thing!\"",
 "selftext": "",
 "created_utc": 1690742536,
 "permalink": "/r/WritingPrompts/comments/15dsxpb/wp_none_of_it_is_real_its_all_fake_here_slap_me/",
 "score": 7,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dsxpb/wp_none_of_it_is_real_its_all_fake_here_slap_me/",
 "comments": [
  {
   "comment_id": "ju3rskm",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690742536,
   "score": 1,
   "submission_id": "15dsxpb"
  },
  {
   "comment_id": "ju4dt8r",
   "message": "“None of this is real! It’s all fake. Here, slap me, I won’t feel a thing!” Mac said as he slid into his usual barstool \n\nGlen slapped Mac across the face with a loud smack. \n\n“Ow shit. What the fuck man?” Mac said as he rubbed his red dining cheek. \n\n“I thought you weren’t going to feel a thing.” Glen said. \n\n“So did I! I mean I shouldn’t have felt anything.” \n\n“Why wouldn’t you feel it?” Glen asked and took a drink from his pint glass. \n\n“Because we live in a hologram man. It’s all fake. None of it is real!” Mac said. \n\n“Awww Jesus, what are you getting into now?”\n\n“I was reading this great book called “The Holographic Universe” by Michael Talbot. He explains it all. Our reality is nothing but a hologram.” Mac said and tried to get the bartenders attention so he could order a drink. \n\n“Did you finish the book?”\n\n“Well no, I’m still finishing up the introduction, but it explains so much!”\n\n“Like what?”\n\n“Well, it’s kinda hard to explain.”\n\n“I bet it is.”\n\nThe bartender stopped in front of the two friends. \n\n“Hi Christine, I’ll have a Daisy Cutter please.” Mac said. \n\nMake that two, I’m going to need it.” Glen added. \n\n“Ok so, the universe is a hologram because of the unique characteristic of holograms where they imbed the image printed in then through the entirety of the hologram.” Mac said.\n\n“Ok wait, before you keep going on I have question. \n\n“What’s up?”\n\n“Are you high right now?”\n\n“I fail to see how that’s relevant.” Mac said   \n\n“That’s a yes.” Glen said smugly. “So what does that even mean? That the printed image is imbedded through the hologram?”\n\n“What it means is that if you were to take, say a hologram of a house, and smash it on the ground. You could pick up any of the shards of the holographic film and still see the whole image of the house.” Mac said. \n\n“Huh, that’s crazy. Are you sure it’s true.” Glen asked. \n\n“That’s probably the only part of this hypothesis that I know is true.”\n\n“Ok, so how does this Talbot guy connect the dots between a hologram and our universe.” \n\n“I don’t know, I haven’t got that far yet. But he did have a cool explanation for quantum entanglement.” Mac said. \n\n“Im sure it’s a gem. Let’s hear it.” Glen said \n\n“It’s something to do with a fish in an aquarium and two cameras. Shoot I can’t remember how it goes.” \n\n“Are you sure you know how to read?”\n\n“Don’t be a dick. Forget about the entanglement part. I’ll admit it’s beyond my expertise.” \n\n“Ok, so after all this, why would you think that if I slapped you you wouldn’t feel it?”\n\n“I guess I just got a little excited about this new information.”\n\n“Well if you ever get all amped up and need to be slapped again I’m your man.” Glen said. \n\n“I’ll keep that in mind.”\n\n“So do you have any other wild cosmological ideas?” Glen asked. \n\n“Hmmm, I did have a dream that the reason general relativity and quantum mechanics can’t work together is because quantum mechanics is the true base reality physics and general relativity is the game physics for the simulation we currently reside in.” Mac said with a side smile. \n\nGlen dropped his face to his hands and mumbled. “Why am I friends with you?”\n\n“Because of you weren’t you life would revolve around work which is about the most boring thing you can do with you’re precious few life moments.” Mac said.",
   "created_utc": 1690751514,
   "score": 1,
   "submission_id": "15dsxpb"
  }
 ]
}