{
 "submission_id": "15dz16a",
 "title": "[WP] The alien invaders thought the Canadians would be an easy first target. If only they had studied their military history...",
 "selftext": "",
 "created_utc": 1690757379,
 "permalink": "/r/WritingPrompts/comments/15dz16a/wp_the_alien_invaders_thought_the_canadians_would/",
 "score": 19,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dz16a/wp_the_alien_invaders_thought_the_canadians_would/",
 "comments": [
  {
   "comment_id": "ju4r52z",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690757380,
   "score": 1,
   "submission_id": "15dz16a"
  },
  {
   "comment_id": "ju4xmf1",
   "message": "The plan was complete.\n\nNext, the aliens had to take the bait.\n\nPiles and piles of meat of various types stewed in the sun, steaming and smelling.  The aliens craved flesh, and the Canadians were happy to oblige.\n\nThe last crane dumped a bunch of Canadian bacon on top, a final touch of hospitality.  The aliens would surely converge on this area soon. \n\n*They wouldn’t be able to help themselves.*\n\nPrivate Caynuck stared down the sight of his rifle, controlling his breathing like the dozen other men in the field.  They had one shot at this and it had to work.\n\nThe aliens had a strict hierarchy.  The small nasty little ones would hunt and kill and pile meat up.  Then the big ones would come down from the ships and feed. It was strange, seeing them have weird little uniforms but gobbling up meat and bone like a wild animal and their giant circular buzz saw mouths. \n\nWhen the aliens first came to Toronto it was a massive surprise.  They swarmed down during a normal day and no one could withstand the onslaught.  The surprise it worked for a while until the Canadians decided to reach out with diplomacy.  \n\n“We will provide meat and land in exchange for peace”\n\n“An armistice” was the only reply. A temporary ceasefire.  It would have to be enough.\n\nAs expected, the alien mothership hovered above after appearing from nowhere.  A strange Escherian shape that seemed to be shifting and moving with the light, impossible angles and corners that trembled in the breeze - sensitive and terrifying looking.  Like it was aware of everything.\n\n*steady…* the privates all told themselves.  \n\nThe massive pile of meat could not be any more unappealing to a human.  Most of it was raw.  But the aliens teleported straight down into it, their largest one at the center in the top, gobbling his way down.\n\nA flare went up.\n\nShots rang out.\n\nA massive explosion ripped through the raw meat and the alien meat, their glorious leader a part of a glorious fireball that smelled pretty good for a second - like an uncles BBQ.\n\nThe alien ship seemed to scream and tremble as it fell from the sky.  The Canadians didn’t know it yet but it was controlled by a brain implant in the alien leader.  How convenient! \n\nThe soldiers cheered as the aliens squealed, the small ones connected by a hive mind shivering and shaking like the alien ship did.\n\n\nThe plan was genius and the commander was a historian.  In world war 1, German troops were lured to a point in their trenches by the nice Canadians throwing canned meat to them.  The Germans were desperate for food due to the British blockade.\n\nAfter a while and the crowd got bigger, the Canadians heard the Germans screaming “more!  More!”  \n\n[Then, they threw grenades.](https://talesofatravellingsalesman.com)",
   "created_utc": 1690760351,
   "score": 9,
   "submission_id": "15dz16a"
  }
 ]
}