{
 "submission_id": "15dzrxd",
 "title": "[WP] The battle was over, but somehow, you survived. As you stare into the heavens, it occurs to you... You remember dying. And from the look of the battlefield, considerable time has passed...",
 "selftext": "",
 "created_utc": 1690759281,
 "permalink": "/r/WritingPrompts/comments/15dzrxd/wp_the_battle_was_over_but_somehow_you_survived/",
 "score": 105,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dzrxd/wp_the_battle_was_over_but_somehow_you_survived/",
 "comments": [
  {
   "comment_id": "ju4vb3v",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690759282,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju57iq6",
   "message": "In the first seconds I admired the peace and quiet. There had been nothing but cacophony behind the shield wall, following every order you could barely hear over the clash of steel on steel. There had been so much noise. So much blood.\n\nTo think, I could feel the breeze.\n\nBut-\n\nSomething crawled in the back of my mind, like an inky sludge made memory. The taste of blood, the pain of a spearpoint.... what it felt like to die.\n\nI'd died. I was dead.\n\nI dug my fingers into the dirt on my right; it was damp. This was real. I was alive. Maybe it was again, but I was alive.\n\nIt took a second for my body to take over for my wandering mind. Sometimes things were too big to think about and you just needed to move instead of thinking about the implications. Along that line, I sat up.\n\nFor the first time I was able to see the battlefield around me.\n\nWell, it had been a battlefield. I'd known it as one, but this was a lush field. If I didn't know its past I couldn't have fathomed that this was the site of a war. There were so many flowers, rows upon rows swaying in the soft afternoon breeze. I was sitting under a blue sky. It was nice.\n\nHow long had it been? At least months. Maybe years? It had felt like the war was never going to end but here we were, somewhere beyond it. Trenches and mud replaced with wildflowers. There was something poetic about that, but I'd never been a poet, poets didn't go to the front lines.\n\n\"I did it! I did it!\" A young girl squeaked behind me. I tried to spin to see her but lost my balance halfway, I hadn't done it in a while.\n\nSo there I was laying on the ground, with my nose almost buried in the vermillion robes of a young- Albosholi Mage.\n\nMy blood started to boil, but then it suddenly cooled, strangled by whatever force had brought be back from death.\n\n\"Whoops, let me help you up Mr. Skeleton,\" the girl said.\n\nSkeleton?\n\nA soft hand grabbed mine and pulled the way only a kid could, not physically helping but motivating you to stand. I found my feet after a moment.\n\nThe little girl, emphasis on little, was staring up at me with wild sparkling eyes, stuck somewhere between awe, wonder and being under ten. Why had I gotten so angry? She was just a child. She couldn't have known what happened in the battle and-\n\n\"Can you talk Mr. Skeleton?\"\n\nSkeleton? I stared down at my hands. Flesh and blood.\n\n\"Oh yeah! You can't see it but you're all bones. Bones-bones-bones-bones.\"\n\n\"Please stop.\"\n\n\"So you can talk! HA! I win! I did it! They said I couldn't do it but I showed them, now I have a minion and-\"\n\nI was already walking away.\n\n\"Hey, wait please.\"\n\n\"No.\"\n\n\"Oh come on! I- Why isn't the magic making you stay? Stop minion! Stop. Minion. Pleeease stop\"\n\nI slowed down, but only because of the natural guilt that came along with upsetting a child. \"What?\"\n\nThe girl ran around me, stopping in front and stomping her foot in an adorable huff. The hook of her oversized robe precariously held onto her curly hair. \"I need a minion if I'm going to go back to town and show those meanies who they're messing with.\"\n\n\"And if I don't?\"\n\nThat question seemed to be a little too much for her. I watched the wheels spinning for a moment before, \"But but- You're my minion. You gotta, I summoned you and it was so hard and-\"\n\n\"Fine.\"\n\n\"I wanna have a minion and if you walk away I won't have one and then- Wait what.\"\n\n\"I said fine. One thing. I'll be your minion for one thing and then I need to-\"\n\n\"I HAVE A MINION! I AM A MIGHTY NECROMACER! THEY WILL TREMBLE IN FEAR!\"\n\n\"Go,\" I finished, but the little girl was already sprinting through the wildflowers, half-tripping over her robes.\n\nDamn my big heart.\n\n\u0026amp;#x200B;\n\n*I feel the need to point out that Necromacer is how she said it.*",
   "created_utc": 1690765044,
   "score": 76,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju5d1jf",
   "message": "The sky was clear, and the stars twinkled in the night sky above the battlefield. The champion of my people, I stood tall as others could flee, could hide from the encroaching darkness that was consuming the land. I felt at peace, then dread as I realized that I had died. I remembered the pain and chaos that followed. \n\nAs I continued to stare at the sky in dreaded solemnity, I came to the startling realization that the sky had changed. The constellations I had learned as a child were gone, and new ones filled the sky. I had been dead for quite some time. Yet, why now? Why do I finally remember. Why am I not at peace in the Halls of the Dead, feasting with my family?\n\nHad I been brought back? Did I have a purpose again? No, too much time had passed. Any business I may have had is long since unresolved. Any family long forgotten me. Why then do I remember? Is this my torment? My last failure? Why now? Why? Why? Why?\n\nIn my musings, I almost didn't feel the draw of the purple storm, pushing back the clock and dragging my soul though itself. The pain that was once unimaginably intense barely a trickle. Back to my 12th namesday, and the war of the free folk would wage once more. Maybe this time would be my last.",
   "created_utc": 1690767725,
   "score": 9,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju568vl",
   "message": "The din of battle overwhelms. Dirt whipped into mud with spilt blood and the slight misty fog that the Blues used for their surprise attack on the king's flank. \n\nInstead, they met the King's army already moving to do the same. \n\nHead to head, hours have already passed. Exhaustion in both men and body will eventually require the armies to pull apart and regroup.\n\nIn what is possibly the final fury of violence Ser Roberts sees his death before it sees him. A mammoth knight in rusting armor swinging a long piece of honed metal above his head and smashing it down on victims from above. The sword is as long as he is tall. Roberts guess at least 2 ells if not more. He moves in for the kill certain he'll land a critical blow while the other knight is busy killing infantry peons.\n\nThen, nothing until he opens his eyes. \n\nWind rushing softly through tree leaves. A brilliant blue sky above. A warmth like he has not felt since before the great war started. \n\nThere is a sleepiness upon him suggesting he has awoken from a nice long slumber. Luxuriating in the mellowness he stretches. Reaching his arms high over his head, and though he knows he is moving, he does feel any sort of stretch at all. Stretching even harder yields more of the same. That's an odd feeling, he decides, no feeling at all. And sits up, great clumps of grass and dirt falling from his armor. He finds himself in the middle of a green field. Small red flags on sticks flutter in the breeze. Sisters of the Bloody Sacrifice are wandering the field, stopping at each flag, and saying a whispered prayer.\n\nHe does not worship the Bloody Sacrifice. Few knights do. It is a heinous religion one of blasphemy and evil.\n\nHe hears a voice calling his name, the voice is soft and melodic. It says, \"Come Ser Alexander Roberts. Sleep no more. There is fighting to be done.\"\n\nSer Roberts doesn't want to go. He wants to stay here. Yet he struggles to his feet anyway, dirt falling away from his armor which screeches with rust and rot as he stands. He puts weight on his family's sword, once brilliant and shard, is now brittle with corrosion and snaps in half. Undisturbed, with hilt and half sword in hand, he manages to his feet and begins to trek toward the voice.  He moves like he stretched, with no discernable feeling just the knowledge he is locomoting in the direction he needs to go. As he moves he hears clods of earth falling from other suits of armor also unhappy to be moving. He looks around, obviously free to do so, and finds himself surrounded by thousands of knights, infantry, cavalry, and archers climbing out of the ground. Clothing filled as if living bodies inside, but no faces. No hands. Just floating rotting weapons inches above floating clothing. They move only with the sound of equipment. Thump of boots and gear hitting armor. No talking, or moaning, no soldier sounds or even human sounds of any sort.\n\nThen he understands.\n\nOnce, he had a choice whether he fought in this war. He came because his king asked him to come and honor his family line. He was a slave then, it turns out, and he is a slave now. This thought hurts. How could his king make a pact with evil to use the souls of his army to win his little war? The honorable way to lose would have been to die on his last field of strife. As the knight walks the idea the king would do this burns inside him. It burns so intently he thinks he can almost feel it until he finds himself cresting a hill and seeing the Blue Army stretched out in front of them. thousands upon thousands, sleeping late because they think they won this war and the Blue Baron is king. They are the victors and the war is over.\n\nThe dead, who got there first, sprint into the unaware camp. Soon enough the slap of dull metal against unarmored flesh greets his still-functioning senses. Screaming half-naked men run for their armor and weapons but fall to ravages of undead steel. \n\nThen he is running also. His half-sword raised until it is time to kill. And he does. Without choice over and over again until the only living things on the battlefield are the Sisters of the Bloody Sacrifice and their army raised for a dead puppet king.",
   "created_utc": 1690764438,
   "score": 34,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju5sgud",
   "message": "I lay on my back, staring up into the clear blue sky. It was a beautiful spring day, barely a cloud in the sky, birds singing in the nearby trees. Truly a wonderful day to be alive.\n\nThere were only a couple of problems.\n\nFirst. It has been a rainy, gray, winter evening when the battle had started.\n\nSecond. I had died during the fighting.\n\nYet here I was, lying on my back, feeling the cool ground beneath me and watching a scrap of cloud blow by overhead. I took a breath, and found that I could, in fact, feel that. I could feel the faint thuds of my heartbeat and fact that one of my boots was resting in a puddle of water.\n\nAfter what seemed a very long time, I sat up and examined my surroundings. The field was marked with holes where artillery fire had pounded both sides. I could remember hearing over the radio that the Sickness had been discovered on the field, but I had no idea if it had driven the artillery to fire on us, or if we had been the infected ones and the bombing had been to keep the rest of the armies from being infested.\n\nI examined my body. two arms, two legs, head, face. Everything seemed to be where it should have been. The only oddity was the fact that I was dressed in rags. My uniform was torn, and appeared to have been rotting off of my body. Which definitely should have been alarming.\n\nIt was at this point that I realized that my emotional response was muted, dim. The fact that I had apparently been blown to pieces, and yet was still sitting here in clothes that had obviously been exposed to the elements for months was only evoking a mild concern and slight curiosity.\n\nI took stock of my supplies, which consisted of my pocketknife, now severely rusted, half a canteen, a single boot, tattered pants and shirt, and nothing else. My gun was lost somewhere, probably destroyed in whatever bomb blast had killed me.\n\nA thought occurred to me, and I acted on it without really considering. I unfolded my rusty pocket knife and cut the little finger on my left hand. Only after I sliced the skin did I realize how odd it was to just stab myself, but I couldn't even bring myself to be alarmed at my own behavior. Instead, I examined the cut curiously as it sealed up without even bleeding.\n\nWell, I seemed to be able to regenerate. With the price being, at least in part, a dulling of emotional response and reduction of inhibition. interesting.\n\nThe cool logic and lack of alarm to that realization felt odd in my head. I had been a very emotionally driven person back before. But now, hmm...\n\nI stood. looking at the sun to get my bearings. If that was east, then the nearest city would be... that way. I started walking, the occasional dulled pain from my one bare foot didn't seem to bother me as much as it should have.\n\n.............\n\n\u0026amp;#x200B;\n\n*The preceding was an extract from a journal recovered from the castle of the Undying King, obtained by an adventuring party during the third mage war. It seems evident from the journal that the Undying King used to be a mortal man during the age of steel, just like the rumors claim. It is my belief that the sickness referenced here is the mage fevers that contributed to the end of that age and the rise of the age of loss. I leave it to you, honored council, to decided how to act upon this information. But it is my recommendation that, if we are not able to open diplomatic relations with the Undying King, that we should endeavor to capture and interrogate him regarding the workings of Steel Age technology that would give us an edge in the current conflict.* \n\n\u0026amp;#x200B;\n\n*Your servant always,*\n\n*Edgar Ulbrecht.* \n\n*Inquisitor of the Old ways.* \n\n*Arbiter of magic.*",
   "created_utc": 1690775671,
   "score": 24,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju5wc4h",
   "message": "Am I lying in a field of flowers?\n\nIf the fire of hatred within me were not burning so intensely, I would say I felt... serene. I look around. The battlefield, once stained red with the blood of my enemies and compatriots alike, is now overgrown with little white buckwheat flowers, gently waving in the wind.\n\nAt a glance, this looks like heaven, but I know it to be hell. My own great sword, rusted and stained, is firmly embedded in my chest. The pain is blinding, still every bit as intense as when it was thrust into my heart.  I try to grasp my sword, to move it, but I cannot. My hands claw at its hilt and I heave with all my strength. It will not budge. It must be my punishment for all the lives I have taken, all the blood that stains my hands.\n\nWhy do I yet live? As I ponder my cursed existence, I decide my first course of action. If this were hell, I will make sure it is not only my own hell. I will bring my fire to those who have betrayed me, those whose sins were blacker and more evil than my own. The greatest traitor who, not by his own hands, but by those of others he controlled, killed me. Killed countless others in my family, in our country. The only one who deserves more than I do to burn eternally by the fire of this tainted sword.\n\nI stand. As my resolve hardens, my pain and hatred spill from me, bursting forth in flames of blue, materialising into an identical copy of the great sword running through my heart.\n\nEdit: [Btw I'm writing about this K-drama.](https://www.hellokpop.com/featured/goblin-snags-another-record/)",
   "created_utc": 1690777982,
   "score": 7,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju60e8p",
   "message": "The blade twisted in my stomach, severing my last connection to the mortal world. In my last moments, I stared at General Qain. My rival getting the better of me in our final fight. They had always compared the two of us. The mighty lord knights of the kingdoms. The two strongest knights whose clashing of swords would shatter the world. Was it dramatic? Yes, but not entirely untrue. While the world didn’t shatter, the battle slowed as we traded attacks. Soldiers stopping to watch the two greatest go at it.\n\nOpposition chants went up as I fell, and our soldiers knew they were defeated. An army without a commander is like a chicken without its head. It can still run around without direction, but it will ultimately fall. Sorry, everyone.\n\nI coughed, holding my stomach as I sat up, feeling a hot bloody ache that dulled with time. My body caked in mud, getting stuck to the hairs of my arms and legs. When I went to move, I wobbled, falling onto my stomach. Was this hell? I kept my hands on the ground, the world feeling as if it was spinning around me. No, this was very real.\n\nI got to a knee and scanned the battlefield. Skeletal bodies were visible around me, some having sunk into the ground, while others remained clear. How long had it been? There were no signs of other soldiers, only me. They had stripped my armor, leaving me with only a mud stained white shirt and a pair of shorts. No doubt my armor was a trophy for some commoner or even something to be paraded to the queen. Either that or looters had come during my time unconscious.\n\nUnconscious? No, I was dead. The blade went through me. I couldn’t have survived that.\n\nWhen I lifted my shirt, I could see the scarred remains of my wound. The scar leaving another mark of defeat on my already maimed form. It felt tender to touch, still making me wince whenever I pressed a finger against it.\n\nWhen I recovered my bearings, I walked across the battlefield. It’s cruel how the brave ones that die are left to rot. There is never enough time to gather the dead, so they’re left behind. Forever a monument to the bloodshed. At first, I had tried to cover the skeletons I found, only stopping after the tenth.\n\n“This is how the great war ends.” I’m not sure what I expected. Maybe more ceremony? A sign that this would create peace? Instead, I found nothing, continuing to walk the silent grounds, until footsteps appeared behind me.\n“Disappointing. Isn’t it?” I knew that voice, instinctively reaching for my blade, only to hear the metal scrap against the dirt as the figure tossed it at my feet. Qain stood there, not looking as grand as he once had. The figure of strength and nobility, a lot more worn and tired now. He was missing his right ear and that hardly looked like it was the worst of his troubles. He didn’t have any armor, only his basic noble wear and his prized blade. By his side was a younger figure, one that held a spell book, keeping it close to her chest.\n\n \n\nI picked up my blade, keeping it at the ready. “How’s my kingdom? Did the queen survive?” I asked. My gaze was less focused on Qain and more on the person beside him. They shared some similar features. That same small nose and fuzzy eyebrows. Perhaps a daughter?\n\n \n\n“The kingdom is fine, Grant. It does still feel the sting of war, but they reached negotiations to secure peace. I’m sorry to say Queen Bethany passed a few years ago. Natural causes.” Qain held a hand to his chest, offering his sympathies. The person next to him didn’t bother with any formalities, only watching the exchange.\n\n \n\n“I see. That’s good to hear. Are you sick?” He appeared pale, even more than a noble tended to be. My question earned a laugh from Qain. Before he could answer, the woman at his side spoke.\n\n \n\n“Father. We can try to find a healer. You don’t need to die like this.”\n\n \n\n“Sweetie. We have visited every healer we could find in both kingdoms. There’s no cure. It’s either die like a warrior or die in a bed. I love you.” He crouched by her, embracing her tightly. When she cried, I faced away, staring at the surrounding battlefield.\n\n \n\n“I’m sorry about your condition. I truly am, but you can’t expect me to kill you before your daughter. You should know I don’t hold any anger towards you. We are both warriors, and I don’t feel a need to avenge myself. The battle was fair.”\n\n \n\n“It was. I can’t help feeling I was lucky on that day. Had things gone a little differently, I would have been in your position. There’s no cure for the condition I have. You would be sparing me from a painful death. I plan to die a warrior, like you did.” He raised his blade and moved forward.\n\n \n\nI couldn’t raise my blade, not when I saw the look on his daughter’s face. I sat myself down, dropping the blade before me. I had committed the biggest sin a knight could do. I had thrown down my sword before an enemy and still it felt the right thing to do. “You.” I pointed to his daughter. “You’re the one that revived me, right?”\n\n \n\n“Yes.” She meekly said.\n\n“Can’t you heal him?”\n\n \n\n“It’s not that easy. A spell can soothe the pain. Removing the illness is impossible. At least it is without… without…” She stared at me, smiling. “Father, we can help you. This is brilliant.” She flipped through the pages, tapping a few images. “I needed parts. Sir, may I have your heart and lungs?”\n\n \n\n“GRACE, WHAT DID I SAY ABOUT THAT? I refuse to harm an innocent person. You said you needed live parts. I won’t kill someone to live.”\n\n \n\n“He’s already dead. He’s only going to die again in a few hours. If we switch the parts now, there’s a chance they could survive when the spell wears off.”\n\n \n\n“That’s fine. You can have them. If I am to die, it won’t matter, anyway.” I said, walking over to Grace. Grace smiled at me, grasping my hand. With her free hand, she showed me the book, letting me read the spell. “I see. It’s fascinating that you can perform such an act without surgery.” \n\n \n\n“This is out of the question. Grace, this is why I didn’t want you to become a mage. All mages are heartless beings without a code of honor.” Qain snapped. The man’s chest rising before I knocked him to the floor with a punch.\n\n \n\n“She’s doing this because she loves you. How much of an old fool are you? What difference does this make? There’s no honor in dying. I’m willing to give this to you. You’re not taking anything from me. Personally, I would prefer not to be revived again, anyway. You have a family, don’t you? What knight abandons their family?”\n\n \n\nQain sat silent, reflecting on my words, before turning to his teary daughter. “I’m sorry. I am an old fool. I spent so many years following that honor that it’s clouded my judgement. You’re a better man than I, Grant.”\n\n \n\n“A better swordsman too. How about one last fight before I return to wherever I was? It’s funny, I can’t remember a thing about heaven. Only that I’m certain I was there at some point. Perhaps the angels protect us from speaking about it when we return.” I grabbed my sword, grinning.\n\n \n\n“It would be an honor.” He raised his blade and despite the protests of his daughter, we clashed. Each strike proved how much his condition had affected him. Even a deadman like myself could outmaneuver him. Soon my blade was at his throat and he dropped his weapon in surrender.\n\n“I win.”\n\n \n\n“You do.” He dropped to the ground, taking a long breath, recovering after the exchange. I sat by his side and gave his daughter a nod, letting her know she could proceed.\n\n \n\n“Hey, Qain.”\n\n \n\n“Yes, Grant?”\n\n \n\n“When you do eventually die, I expect another fight. Ending our rivalry on a tie feels undignified.” I smirked, feeling Grace’s magic pulse through my body, causing a sharp ache to grip my heart.\n\n \n\n“Then I shall continue training. I don’t plan on losing. Thank you, Grant. You’ve been a better friend than most of my own men have. I’ll honor you in our halls.”\n\n \n\n“Don’t. It’s an insult for a knight of Laiox to be in your halls.” I felt tired, falling onto my back, struggling to keep myself awake.\n\n \n\n“Ah, so it is. Then I’ll say your praises in stories. Rest easy, Grant.”\n\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\u0026amp;nbsp;\n\n(If you enjoyed this feel free to check out my subreddit /r/Sadnesslaughs where I'll be posting more of my writing.)",
   "created_utc": 1690780616,
   "score": 6,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju63adw",
   "message": "There is no air in what I breath but only void. My mind sees no rest through the ever repeating demands. As long as I still exist there is an order I must obey. Advance and stride away. Push on and pursuit what lies in front of me. The everlasting pain I feel lies not in my harmed body, as the burden that holds me down for so long has let me forgot its emotion. The constant suffering lets me reimagine the battlefield I was slayn in. Do not forget what killed me. Days after days and months after months I still must remember. My comrades corpses that I saw in front of me perished along with my rotten body. There is no flesh left on my bones but in its remains sprouts wild growth of magnetit. Whatever still holds me down dominates me in the constant fight to remove it. So much time has passed but there is only so much I have achieved. I must not forget what overpowered me before my death. My mission remains and compels me to act. What restraints me may not be allowed to prevent me from upholding my duty. You make me sick and I must remove this disgust from me. What holds me down can no longer resist me. I must go on. Whatever pile of me still exists stands up. I can see what I must do. But sight are only my memories. The once display of craftswork my sword was is now in its broken shape the only tool I will need from now on. I pull it out from the dirt. Step by step I move on. The sorry company I belong to must be left behind but not forgotten. As long as I obey my death will not be the end and my watch proves the existence of my company. There is nothing that can hold me back anymore. I will walk onwards and despise any resistance. No animal or human may be a challenge to me. To not forget how I was killed, each strike I take resembles the memories I see in my mind. I enforce the way I was struck down onto other so that I can be the master of my death. In unison from reliving my past and the sword I hold, my opponent will suffer the burden that once was mine. My will is the boulder on their body. Stay down, you can't oppose. Their Blood is what flows through my vein. I am what has killed me and they become what I have left behind me. The life I can no longer life. You must obey my demand. Even if you amass against me. The battlefield I've died in will become yours. There is no air left to speak but only void.\n\n\\------------\n\nEnglish is my second language so I'm not sure how good my grammar and spelling is. But that's part of why I wrote this as a practice.\n\nI didn't have some specific 'creature' in mind. I thought about middle ages, fantasy and wanted to go for some kind of irresistable force that pursuits its enemies.\n\nI'll take a nap now so I would read any comments in a few hours. Atleast if there is one at all.",
   "created_utc": 1690782658,
   "score": 2,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju6a3nc",
   "message": "The battle is won but at what price? As I stand here, my sword still dripping with the blood of countless foes, I realize something... I am the sole survivor. All my companions, all the knights and soldiers, all the friends an familly, everyone I swore my oaths with, have fallen.\nIt is a hard reality to come to grips with. Be it friend or foe, I have seen many of them die. It is not a pleasant sight, watching the life drain from someone's eyes, or listening to their final words as they leave the world behind.\nThe only comfort I have now is the thought that we did win. Our enemy has been crushed and the realm will know peace again.\n\n\nNow I find myself wondering what I should do now as I wander amongst the corpses, soon turned to dust. It feels like an eternity has passed, or perhaps it has, since the battle started. Time seems to be slipping away.\nThe only company I have now are the clouds in the sky, dark and heavy with rain, and the wind. The green pasture led place to a dead field of blood and dirt. It is quite the sight.\n\n\nI do wonder what I should do now. This victory was empty without friends to celebrate it with. The joy and the feeling of victory that I felt just a short while ago have left me. All I have is this emptiness in my heart, the feeling that there's nothing left. \n\n\nThis was the great war to end all wars. Yet, what is that? That light on the horizon? Burning everything everywhere. It is as if a sun was born on the earth.. and soon, countless more.",
   "created_utc": 1690787840,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju6afh9",
   "message": "The unending blue of the sky opens up above me. It feels as if i could fall into it at any moment, yet im undisturbed by the possibility. Laying on my back, Im too uncaring to stand back up and rejoin the ranks. I might hang for abandoning my duty. Yet another possibility that leaves me undisturbed.\n\nPerhaps my wounds are suvere enough to save me.\n\nAs the thought passes my mind, I realise that i no longer feel any pain. My hands cant locate the wound.\n\nI sit up to take a look at myself, but freeze at the sight before me. Undisturbed field of grass and flowers, wave gently in the breeze. And how quiet it is.\n\n\"It looks better this way, doesnt it?\"\n\nI turn my head and see my units commander next to me. I jump on my feet and salute with a drilled in reflex.\n\n\"At ease soldier.\" The always stoic man gives me a gentle and little amused smile.\n\n\"Yes, sir!\"\n\n\"No need to call me sir either.\"\n\n\"Where is everyone, sir? EXCUSE ME SIR!\"\n\nI stumble over my own words, as the drill takes over my tongue.\n\n\"All is as it is meant to be. You dont need to worry about me either. I assume you see me as your superior?\"\n\n\"You are my superior.\"\n\n\"I am an authority. People percieve me as what they associate with authority the most. Superior, mother, priest, god, thug...\"\n\n\"Are you God?\"\n\n\"I am an authority.\"\n\nQuestions flooded my mind quicker than i could voice them.\n\n\"What..?\" Is all I could get out.\n\n\"You werent supposed to die. Thus, you are not dead.\"\n\n\"Why, am I supposed to do something?\"\n\n\"Live.\"\n\n\"That doesnt explain anything!\"\n\nThe authority smiled. \"You dont need an explanation. All will be, as it is meant to be. You can think of this as a second chance, if you wish.\"\n\nWith that, the authority has dissapeared.\n\nI stood and stared into the distance for several moments. Then I moved forward with a new found resolve.",
   "created_utc": 1690788104,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju6vja4",
   "message": "I was born a fighter, I'd die as such. They'd always told stories of me, \"The Spun Blades.\" I was not just a lumbering brute of a man, crushing men's skulls with my own. I was an artist and the battlefield, my canvas. A step to the left, a spin to the right.\n\nBut, even the most of agile men can be fooled and fell. As had happened to me. I had been doing my dance when a monstrous blow to my side sent me crashing to the mud. As I rolled onto my back, I was met with the sight of an axe swinging down towards my chest.\n\nAnd then nothing. I don't remember what happened after that. Yet now, I lay on a field of grass, a soft breeze tickling my face as birds called their greetings. The warmth of the sun on my face was a startling contrast to the fact that I am supposed to be dead.\n\nSlowly blinking my eyes open, I sit up, letting my eyes adjust to the light of the sun and the sky. As my eyes adjust, I'm greeted with a sea of colors. Red, white, even yellow flowers scattered against a sea of green grass, swaying in their own dance.\n\n\"If this is the halls of Valhalla, I'm severely disappointed at the lack of the Halls.\" I mutter.\n\n\"It is not those legendary Halls of yours.\" A bemused voice echoes from behind me.\n\nIn a fluid motion, I plant my feet on the ground, shoving forward with my hands in my roll. As I land on my feet, I pivot on my right foot, my hands grasping the handles of my blades.\n\nI'm greeted by a young woman, her smile only growing as she gives me a light ovation.\n\n\"Bravo. I can see why they give you the name The Spun Blades. And it illustrates that my choice is correct and perfect.\"\n\n\"Am... Am... I... Dead?\" I croak out, wincing at the dryness and pain in my throat.\n\n\"No. Nor are you alive. I am in need of someone with your talents. An assassin. You are now my Agent, given life by my Will and the Will to carry out my Commands. You may not die permanently. You may be killed, but you will be reborn.\"\n\nI grimace as I feel a crippling tightness around my chest, squeezing painfully, forcing her Will over me. \"Very well... and what may I call you, my Lady?\"\n\n'I will serve you... until I find a way to break this oath of yours... and then I will enjoy ripping out your throat and bathing in your blood.'\n\n\"Yoy may call me... Lady Death. Your name shall forevermore be known as... Nosferatu.\"",
   "created_utc": 1690803848,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju6zh6u",
   "message": "                I’d found myself snarling, standing over the scattered remains of my kin. Victory had been denied to me, and defiance was all I had left. I caught one of them with a draw cut, his entrails steaming in the air. Another with a riposte from below that left me bloodied in turn. Another with three desperate thrusts that left their lungs a leaking ruin. I could handle any five of them… but there were many more than five. I met a flash of cold steel followed by the hot flow of arterial blood. My teeth clenched against screaming as the world grew gray and distant, and finally oh finally, sweet unconscious indifference wrapped me in its soporific arms. \n\n                I woke to the distant rumble of thunder and that unmistakable scent of potential that comes before the worst of storms. I made to speak a question to whatever god might be listening, but my voice was strangled and lost to me. Feeling at my neck revealed heavy corded scar tissue tracing from collar bone to chin and my mouth drew into a melancholy grin. It seemed even words of mourning would be denied me. \n\n                Taking in my surroundings I noticed the well decomposed bodies lacking flesh but clad in armor and lichen as the forest reclaimed them. There was Re’ol always smiling and whistling offkey. Then Tawna, who swore every lover in every town was her one and only. Wend with his belly laugh and love for every new food we came across. I named them all in silence as I trudged to where I’d seen my brother Q’ouren fall, pulled down as he covered the retreat.  \n\n                I froze after cresting the rise, mind whirring. The bodies of our foes remained in their eternal prostration but where my brother had lain remained nothing but a small slip of paper which I grasped with shaking hands as rain began to fall. The script was clean and neat and undeniably my brothers. It read “I am sorry for the deal I have made, and the price we will pay but this destruction of our people will be repaid manyfold. I will unleash upon them the hot fires of hell for every wound they have dealt us.” \n\n                The rain became torrential, but I remained still and unmoving as I tried to understand what had transpired and how I drew breath. As puddles formed at my feet and lightning flashed, I saw my reflection and everything became clearer.  My eyes were like pale diamonds set in my face, my skin unnaturally pale and my hair a starker white than fresh fallen snow. The choked remnants of what could charitably be called a laugh rose but made it no further than my chest. I would find him and understand. Our clan and my name were dead, till I had my answers I would remain nothing but the White to my friends and the Wight to my foes.",
   "created_utc": 1690806033,
   "score": 1,
   "submission_id": "15dzrxd"
  }
 ]
}