{
 "submission_id": "15dzrxd",
 "title": "[WP] The battle was over, but somehow, you survived. As you stare into the heavens, it occurs to you... You remember dying. And from the look of the battlefield, considerable time has passed...",
 "selftext": "",
 "created_utc": 1690759281,
 "permalink": "/r/WritingPrompts/comments/15dzrxd/wp_the_battle_was_over_but_somehow_you_survived/",
 "score": 75,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15dzrxd/wp_the_battle_was_over_but_somehow_you_survived/",
 "comments": [
  {
   "comment_id": "ju4vb3v",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690759282,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju57iq6",
   "message": " In the first seconds I admired the peace and quiet. There had been nothing but cacophony behind the shield wall, following every order you could barely hear over the clash of steel on steel. There had been so much noise. So much blood.\n\nTo think, I could feel the breeze.\n\nBut-\n\nSomething crawled in the back of my mind, like an inky sludge made memory. The taste of blood, the pain of a spearpoint.... what it felt like to die.\n\nI'd died. I was dead.\n\nI dug my fingers into the dirt on my right; it was damp. This was real. I was alive. Maybe it was again, but I was alive.\n\nIt took a second for my body to take over for my wandering mind. Sometimes things were too big to think about and you just needed to move instead of thinking about the implications. Along that line, I sat up.\n\nFor the first time I was able to see the battlefield around me.\n\nWell, it had been a battlefield. I'd known it as one, but this was a lush field. If I didn't know its past I couldn't have fathomed that this was the site of a war. There were so many flowers, rows upon rows swaying in the soft afternoon breeze. I was sitting under a blue sky. It was nice.\n\nHow long had it been? At least months. Maybe years? It had felt like the war was never going to end but here we were, somewhere beyond it. Trenches and mud replaced with wildflowers. There was something poetic about that, but I'd never been a poet, poets didn't go to the front lines.\n\n\"I did it! I did it!\" A young girl squeaked behind me. I tried to spin to see her but lost my balance halfway, I hadn't done it in a while.\n\nSo there I was laying on the ground, with my nose almost buried in the vermillion robes of a young- Albosholi Mage.\n\nMy blood started to boil, but then it suddenly cooled, strangled by whatever force had brought be back from death.\n\n\"Whoops, let me help you up Mr. Skeleton,\" the girl said.\n\nSkeleton?\n\nA soft hand grabbed mine and pulled the way only a kid could, not physically helping but motivating you to stand. I found my feet after a moment.\n\nThe little girl, emphasis on little, was staring up at me with wild sparkling eyes, stuck somewhere between awe, wonder and being under ten. Why had I gotten so angry? She was just a child. She couldn't have known what happened in the battle and-\n\n\"Can you talk Mr. Skeleton?\"\n\nSkeleton? I stared down at my hands. Flesh and blood.\n\n\"Oh yeah! You can't see it but you're all bones. Bones-bones-bones-bones.\"\n\n\"Please stop.\"\n\n\"So you can talk! HA! I win! I did it! They said I couldn't do it but I showed them, now I have a minion and-\"\n\nI was already walking away.\n\n\"Hey, wait please.\"\n\n\"No.\"\n\n\"Oh come on! I- Why isn't the magic making you stay? Stop minion! Stop. Minion. Pleeease stop\"\n\nI slowed down, but only because of the natural guilt that came along with upsetting a child. \"What?\"\n\nThe girl ran around me, stopping in front and stomping her foot in an adorable huff. The hook of her oversized robe precariously held onto her curly hair. \"I need a minion if I'm going to go back to town and show those meanies who they're messing with.\"\n\n\"And if I don't?\"\n\nThat question seemed to be a little too much for her. I watched the wheels spinning for a moment before, \"But but- You're my minion. You gotta, I summoned you and it was so hard and-\"\n\n\"Fine.\"\n\n\"I wanna have a minion and if you walk away I won't have one and then- Wait what.\"\n\n\"I said fine. One thing. I'll be your minion for one thing and then I need to-\"\n\n\"I HAVE A MINION! I AM A MIGHTY NECROMACER! THEY WILL TREMBLE IN FEAR!\"\n\n\"Go,\" I finished, but the little girl was already sprinting through the wildflowers, half-tripping over her robes.\n\nDamn my big heart.",
   "created_utc": 1690765044,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju5d1jf",
   "message": "The sky was clear, and the stars twinkled in the night sky above the battlefield. The champion of my people, I stood tall as others could flee, could hide from the encroaching darkness that was consuming the land. I felt at peace, then dread as I realized that I had died. I remembered the pain and chaos that followed. \n\nAs I continued to stare at the sky in dreaded solemnity, I came to the startling realization that the sky had changed. The constellations I had learned as a child were gone, and new ones filled the sky. I had been dead for quite some time. Yet, why now? Why do I finally remember. Why am I not at peace in the Halls of the Dead, feasting with my family?\n\nHad I been brought back? Did I have a purpose again? No, too much time had passed. Any business I may have had is long since unresolved. Any family long forgotten me. Why then do I remember? Is this my torment? My last failure? Why now? Why? Why? Why?\n\nIn my musings, I almost didn't feel the draw of the purple storm, pushing back the clock and dragging my soul though itself. The pain that was once unimaginably intense barely a trickle. Back to my 12th namesday, and the war of the free folk would wage once more. Maybe this time would be my last.",
   "created_utc": 1690767725,
   "score": 1,
   "submission_id": "15dzrxd"
  },
  {
   "comment_id": "ju568vl",
   "message": "The din of battle overwhelms. Dirt whipped into mud with spilt blood and the slight misty fog that the Blues used for their surprise attack on the king's flank. \n\nInstead, they met the King's army already moving to do the same. \n\nHead to head, hours have already passed. Exhaustion in both men and body will eventually require the armies to pull apart and regroup.\n\nIn what is possibly the final fury of violence Ser Roberts sees his death before it sees him. A mammoth knight in rusting armor swinging a long piece of honed metal above his head and smashing it down on victims from above. The sword is as long as he is tall. Roberts guess at least 2 ells if not more. He moves in for the kill certain he'll land a critical blow while the other knight is busy killing infantry peons.\n\nThen, nothing until he opens his eyes. \n\nWind rushing softly through tree leaves. A brilliant blue sky above. A warmth like he has not felt since before the great war started. \n\nThere is a sleepiness upon him suggesting he has awoken from a nice long slumber. Luxuriating in the mellowness he stretches. Reaching his arms high over his head, and though he knows he is moving, he does feel any sort of stretch at all. Stretching even harder yields more of the same. That's an odd feeling, he decides, no feeling at all. And sits up, great clumps of grass and dirt falling from his armor. He finds himself in the middle of a green field. Small red flags on sticks flutter in the breeze. Sisters of the Bloody Sacrifice are wandering the field, stopping at each flag, and saying a whispered prayer.\n\nHe does not worship the Bloody Sacrifice. Few knights do. It is a heinous religion one of blasphemy and evil.\n\nHe hears a voice calling his name, the voice is soft and melodic. It says, \"Come Ser Alexander Roberts. Sleep no more. There is fighting to be done.\"\n\nSer Roberts doesn't want to go. He wants to stay here. Yet he struggles to his feet anyway, dirt falling away from his armor which screeches with rust and rot as he stands. He puts weight on his family's sword, once brilliant and shard, is now brittle with corrosion and snaps in half. Undisturbed, with hilt and half sword in hand, he manages to his feet and begins to trek toward the voice.  He moves like he stretched, with no discernable feeling just the knowledge he is locomoting in the direction he needs to go. As he moves he hears clods of earth falling from other suits of armor also unhappy to be moving. He looks around, obviously free to do so, and finds himself surrounded by thousands of knights, infantry, cavalry, and archers climbing out of the ground. Clothing filled as if living bodies inside, but no faces. No hands. Just floating rotting weapons inches above floating clothing. They move only with the sound of equipment. Thump of boots and gear hitting armor. No talking, or moaning, no soldier sounds or even human sounds of any sort.\n\nThen he understands.\n\nOnce, he had a choice whether he fought in this war. He came because his king asked him to come and honor his family line. He was a slave then, it turns out, and he is a slave now. This thought hurts. How could his king make a pact with evil to use the souls of his army to win his little war? The honorable way to lose would have been to die on his last field of strife. As the knight walks the idea the king would do this burns inside him. It burns so intently he thinks he can almost feel it until he finds himself cresting a hill and seeing the Blue Army stretched out in front of them. thousands upon thousands, sleeping late because they think they won this war and the Blue Baron is king. They are the victors and the war is over.\n\nThe dead, who got there first, sprint into the unaware camp. Soon enough the slap of dull metal against unarmored flesh greets his still-functioning senses. Screaming half-naked men run for their armor and weapons but fall to ravages of undead steel. \n\nThen he is running also. His half-sword raised until it is time to kill. And he does. Without choice over and over again until the only living things on the battlefield are the Sisters of the Bloody Sacrifice and their army raised for a dead puppet king.",
   "created_utc": 1690764438,
   "score": 1,
   "submission_id": "15dzrxd"
  }
 ]
}