{
 "submission_id": "15e078m",
 "title": "[WP] You look up from what your were doing and see a cloaked figure, scythe in one hand, impatiently tapping their foot, while looking at their watch, occasionally glancing up at you. Nobody else seems to notice them.",
 "selftext": "",
 "created_utc": 1690760424,
 "permalink": "/r/WritingPrompts/comments/15e078m/wp_you_look_up_from_what_your_were_doing_and_see/",
 "score": 15,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e078m/wp_you_look_up_from_what_your_were_doing_and_see/",
 "comments": [
  {
   "comment_id": "ju4xs30",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690760425,
   "score": 1,
   "submission_id": "15e078m"
  },
  {
   "comment_id": "ju5estx",
   "message": "I love the Glim Town library. It's so big and has so many books. In fact, it was where I had finished my most recent book by Brandon Mull, **Fablehaven.** When I closed the book, it was to my surprise that I would catch view of a cloaked figure standing at the center of the main computer section walkway. \n\nThey tapped their foot in a most impatient manner while looking at a watch worn over their cloak's left sleeve. The cloak in question was poorly tailored; it's sleeves were too  long and hood too big and base too long. *Could they even see in that?* \n\nI looked around to see if anyone else noticed the individual. *Surely I cannot be the only one seeing this person holding a large sharp \u0026amp; dangerous weapon.* I doubt the scythe held in their drooping right sleeve was allowed in here, let alone legal. Yet, no one seemed to bat an eye. Everyone near walked past the cloaked figure as if they were not there but also absentmindedly stepped around the figure as they neared it, narrowly avoiding a collision with them.\n\nWhen the cloaked figure glanced from their watch at my direction, I instantly held my book up and pretended to read the back summary. *Maybe this is some advertisment.* I would think. *Perhaps a publicity gimmick by an author.* From my peripheral, I'd catch them glancing in my direction once again. *At me?*\n\nI'd rise to obtain another book, this time picking a comic. **Calvin \u0026amp; Hobbes.** I'd see the figure at an end of the aisle when I bent down, still tapping with impatience. I returned to my spot by walking the opposite way. \n\nAs I progressed through the comic, I'd look up and catch the figure performing various actions:\n\n- Through their arms up in frustration.\n- Pacing while dragging their scythe along the ground.\n- Gently banging their head against a desk.\n- Expertly twirling their scythe.\n\nAn action that remained constant throughout was their continual glancing at what I was positively sure was me. It wouldn't be until they themselves had picked up a manga and began to read that my heart would jump. Unable to flip a page with their overly long sleeves, they'd pull one back to reveal a pale bony hand. \n\n*This is no publicity stunt.* The sight had startled me. *That's death, isn't it?* I concluded my reading early and closed the comic with jittery hands. *It's the Grim Reaper.* I felt the cloaked figure's presence as they followed behind me at a distance. *I- I- I'm going to die today aren't eye.* When I checked out the book, my voice had been shaky enough for the librarian to ask if I was ok. What could I have told her? *What do I do?* \n\nA smokey mist travelled past my feet as I approached the library exit, causing me to pick up my pace. My hands clumsily fiddled with my keys upon entering my car and from the rearview mirror I saw the cloaked figure exit the library doors. They stopped on the side as I pulled off and stared me, me, **me,** not my car, they were staring at me through the rearview mirror, it was something I just knew.\n\nI quickly turned into traffic so that they could finally be out of my sight. I drove carefully, but with haste, just wanting to get home. I stopped at lights, used signals, let others pass, and eventually went through a dimly lit tunnel. When my car emerged once again into the light, there was a sigh. ... I turned to look at my passenger seat.\n\n#\"WILL YOU HURRY UP ALREADY!!?\"\n\n\"Ahhhhhhh! Oh Fu-\" I had been unprepared to greeted by the skull beneath the cloak in such a manner. The event caused me to swerve in traffic while I tried to regain control of the car. I'd find myself staring through the windshield and meeting the frightened eyes of a bicyclist. My eyes closed and I feel the car bank right, but not before hearing a dreadful thud. The car came to an abrupt halt again a brick wall.\n\nMy body shivered as my eyes opened. The front of my car was wrinkled like an accordion, but my windshield was surprisingly intact. ... At least that is what I thought until I looked towards the passenger side.\n\n#\"Finally!!\"\n\nProtruding halfway through the passenger side of the windshield was the bicyclist, his face bloodied from the glass and his eyes dead. The corpse looked directly at death itself. \n\n**\"Wheelies on the wrong side of the road, tsk tsk. Lucks run out? I've been after you for a long time Dustan Hews. Far, far too long.\"**\n\nI could only stare as the skull somehow spoke with a wispy voice, it possessed no mandible.^([1]) Death rolled down the passenger window and stuck both scythe and arm out of it to have more range or motion; reaching around with the scythe, they touched its tip onto the back of the corpse. A light blue substance I could assume to be the soul was extracted from the corpse and coated the entire blade of the scythe, causing it too to glow light blue. \n\nDeath turned its skull and faced me, **\"Oh uh, sorry about the car,\"** then they dissolved into a dark mist. \n\n\n°°°°°°°°°°°°°°°°°°°°°\n\n^([1] The mandible is the largest and strongest bone of the human skull. It is commonly known as the lower jaw and is located inferior to the maxilla.)",
   "created_utc": 1690768577,
   "score": 6,
   "submission_id": "15e078m"
  }
 ]
}