{
 "submission_id": "15e1eir",
 "title": "[WP] A Supervillain from the 30s flung into the modern day tries to continue their life of villainly. But finds their ransoms are laughably small, their riddle traps are foiled by boxes the civilians carry and their plan to kill the global elite is getting a lot less pushback than expected…",
 "selftext": "",
 "created_utc": 1690763727,
 "permalink": "/r/WritingPrompts/comments/15e1eir/wp_a_supervillain_from_the_30s_flung_into_the/",
 "score": 40,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e1eir/wp_a_supervillain_from_the_30s_flung_into_the/",
 "comments": [
  {
   "comment_id": "ju54re8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690763728,
   "score": 1,
   "submission_id": "15e1eir"
  },
  {
   "comment_id": "ju5o9li",
   "message": "“MY MACHINE WORKED” I exclaim as I open the door to the future. \n\nA few passersby’s look at me oddly from what I assume to be the current cars. My how machines have changed.\n\nI yell out to a young passerby, “Greetings, mind telling me where to find a newspaper?”\n\n“Newspaper? What are you, 80?” The young man yelled, turning back the direction he was walking.\n\n“Odd”, I thought, “whatever, I’ll figure it out via some other means.” I started to walk towards a green and white building labeled Starbucks\n\nAs I walk in I see a young woman by the register with an odd metal device in her hand. “Good afternoon miss, where can I find the nearest bank?”\n\nShe begrudgingly answers without looking up “Can’t you google that?”\n\n“Sorry, google?”\n\nShe looks up, looks me up and down and sighs. She quietly says “Another one? I thought the Amish parade had ended.” Then louder “It’s in town square, you can’t miss it.” Then goes back to her device.\n\nAfter arriving at the bank, I yell “GIVE ME 1000 DOLLARS OR I’LL SHOOT.”\n\nThe clerk laughed. Not out of delirium or fear. She was laughing at me. “Dear, what will you buy with 1000 dollars?”\n\n“A nice house-“\n\nA sea of laughter echoed in the large room. Humiliated I said “IF NO ONE CAN ANSWER THIS QUESTION IN 3 MINUTES I WILL EXPLODE THE BUILDING. WHAT WORD HAS 3 CONSECUTIVE DOUBLE LETTERS.”\n\nA moment of silence before a young man in the back yells “BOOKKEEPER”\n\n“Damn it” I mutter, walking out of the building.\n\nI then had a great idea. \n\nI go to the center of the town square and yell “I WILL KILL ALL THE GLOBAL ELITES AND I WILL BE YOUR NEW RULER.”\n\nAn uproar happens. People are cheering. People are slapping each other’s hands for some reason. I throw down my hat and get back into my time travel machine.\n\n“Where’s the money?” My assistant asked.\n\n“Remind me to never go to the future again.”",
   "created_utc": 1690773332,
   "score": 165,
   "submission_id": "15e1eir"
  }
 ]
}