{
 "submission_id": "15e1eir",
 "title": "[WP] A Supervillain from the 30s flung into the modern day tries to continue their life of villainly. But finds their ransoms are laughably small, their riddle traps are foiled by boxes the civilians carry and their plan to kill the global elite is getting a lot less pushback than expected…",
 "selftext": "",
 "created_utc": 1690763727,
 "permalink": "/r/WritingPrompts/comments/15e1eir/wp_a_supervillain_from_the_30s_flung_into_the/",
 "score": 41,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e1eir/wp_a_supervillain_from_the_30s_flung_into_the/",
 "comments": [
  {
   "comment_id": "ju54re8",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690763728,
   "score": 1,
   "submission_id": "15e1eir"
  },
  {
   "comment_id": "ju5o9li",
   "message": "“MY MACHINE WORKED” I exclaim as I open the door to the future. \n\nA few passersby’s look at me oddly from what I assume to be the current cars. My how machines have changed.\n\nI yell out to a young passerby, “Greetings, mind telling me where to find a newspaper?”\n\n“Newspaper? What are you, 80?” The young man yelled, turning back the direction he was walking.\n\n“Odd”, I thought, “whatever, I’ll figure it out via some other means.” I started to walk towards a green and white building labeled Starbucks\n\nAs I walk in I see a young woman by the register with an odd metal device in her hand. “Good afternoon miss, where can I find the nearest bank?”\n\nShe begrudgingly answers without looking up “Can’t you google that?”\n\n“Sorry, google?”\n\nShe looks up, looks me up and down and sighs. She quietly says “Another one? I thought the Amish parade had ended.” Then louder “It’s in town square, you can’t miss it.” Then goes back to her device.\n\nAfter arriving at the bank, I yell “GIVE ME 1000 DOLLARS OR I’LL SHOOT.”\n\nThe clerk laughed. Not out of delirium or fear. She was laughing at me. “Dear, what will you buy with 1000 dollars?”\n\n“A nice house-“\n\nA sea of laughter echoed in the large room. Humiliated I said “IF NO ONE CAN ANSWER THIS QUESTION IN 3 MINUTES I WILL EXPLODE THE BUILDING. WHAT WORD HAS 3 CONSECUTIVE DOUBLE LETTERS.”\n\nA moment of silence before a young man in the back yells “BOOKKEEPER”\n\n“Damn it” I mutter, walking out of the building.\n\nI then had a great idea. \n\nI go to the center of the town square and yell “I WILL KILL ALL THE GLOBAL ELITES AND I WILL BE YOUR NEW RULER.”\n\nAn uproar happens. People are cheering. People are slapping each other’s hands for some reason. I throw down my hat and get back into my time travel machine.\n\n“Where’s the money?” My assistant asked.\n\n“Remind me to never go to the future again.”",
   "created_utc": 1690773332,
   "score": 160,
   "submission_id": "15e1eir"
  },
  {
   "comment_id": "ju7xtp0",
   "message": "               EXT.  LAS VEGAS (STOCK FOTTAGE) - NIGHT\n\n               GRAPHIC:  1967 - SOMEWHERE IN NEVADA\n\n               It is set against the obvious skyline of Las Vegas.\n\n               INT.  DR. EVIL'S PRIVATE QUARTERS - DAY\n\n               The lair is 1960's high-tech.  We see a huge oversized \n               conference table with six scary-looking EVIL ASSOCIATES, \n               including a Latin American REVOLUTIONARY in a field jacket \n               and turtleneck, TWIN NORDIC DOCTORS, and a METER MAID.\n\n               ANGLE ON:  A RING WITH DR. EVIL'S INSIGNIA ON IT.  THE RINGED \n               HAND IS STROKING A WHITE FLUFFY\n\n               CAT.\n\n                                     DR. EVIL\n                              (face always unseen)\n                         Gentlemen, are we all here?  Good.  \n                         As you know, my plot to high-jack \n                         nuclear weapons and hold the world \n                         hostage has failed.  Again.  This \n                         organization will not tolerate \n                         failure.\n\n               He presses a button.  The Revolutionary, the twin Nordic \n               doctors, and the meter maid's chairs tip\n\n               back and fall into a pit.  Their chairs return empty and \n               smoking.\n\n                                     DR. EVIL\n                         Mustafa...\n\n               ANGLE ON:  MUSTAFA, an Arab with a red Fez.\n\n                                     DR. EVIL\n                         Frau Farbissina...\n\n               ANGLE ON FRAU FARBISSINA in a severe Salvation Army uniform.\n\n                                     DR. EVIL\n                         I spared your lives because I need \n                         you to help me rid the world of the \n                         only man who can stop me now.  We \n                         must go to London.  I've set a trap \n                         for Austin Powers!",
   "created_utc": 1690820353,
   "score": 3,
   "submission_id": "15e1eir"
  },
  {
   "comment_id": "ju84an6",
   "message": "*January 22, 1931 (?)*\n\n*Something strange has happened, something very strange indeed. See, today started out relatively normal; New York forgot to pay, or perhaps they were hoping I conveniently wouldn't notice that they didn't. Those who refuse to pay must pay! (I'm working on a better slogan, bear with me, please.) Well, either way, I found out. It was a usual run: I ordered the boys to fire up the engines of my zeppelin, the fearsome \"DESTROYER-EXODUS\". Dear reader, if I haven't yet made it clear, we were going to drop some bombs onto New York. Most of the time there was nothing they could do to stop me from doing it. It was their fault that I came at all, anyway.*\n\n*We'd set out from the hideout and made our way towards New York. A bit windier than usual, sure, but our pilot held up well and the journey was altogether smooth. However, don't let that fool you at all, for that's when things started going loony. The city came into sight. It was different. There were buildings I had never seen before. Buildings* like *I had never seen before. I had to ask my pilot if he was seeing what I was seeing. It was no mirage, but still I was skeptical. They couldn't have thrown these up in a single night.*\n\n*I ordered Pilot Crosbuck to take us down. First things first: I needed my money. Even if they wouldn't pay, I would still collect. I addressed my maps, cursing under my breath. Hopefully the bank wasn't lost in this jumble of mad architecture.*\n\n*To my luck, it still existed, and was still in the same place. I have never been a religious man, but I thanked God for providence at that moment. As we neared our destination, I noticed that people on the streets were looking curiously up at the zeppelin. Most of them held strange rectangles in their hands, some of which flashed. Was I under attack? I checked our gauges, even peeked up into the envelope. We were fine. Those strange devices were harmless, but I was in the dark as to their true function. All along the street I noticed some interesting buildings. \"Starbucks.\" Hm. Must be some sort of \"Moby-Dick\"-themed place. Maybe the book had become popular while I was gone. There was a \"Taco-Bell.\" However no bells in sight. Misleading branding, to hell with it! I briefly wondered what sort of establishment Mr. McDonald ran. No matter. I had more important business to attend to.*\n\n*I had the ladder dropped in front of the bank, and before I slid down it I concealed a rather large pistol under my flying jacket. Just in case, just in case... More flashes from those strange boxes followed me as I descended the ladder. Damn them, was I about to be interviewed for the news?! I had made clear in my terms with the city that they would not interfere with my business, unless they wanted a bomb through the roof of their City Hall. I tried my best to ignore them as I ascended the steps.*\n\n*When I walked in, I found heads already turned in my direction. So, I did as I do best, and I smiled my winning smile. I never listen to that accursed Inspector Vondale, who says it's too big for my face. People love it! I cleared my throat. \"Charles Wyte, here to collect.\" I announced.*\n\n*To my surprise (and annoyance), no once flinched at the sound of my name. People were supposed to be scared of me, dammit! Did they not realize I could flatten their city if I wanted to? The teller even* laughed *a little, before asking me, \"How much?\"*\n\n*\"The City of New York owes me 2500 dollars, their monthly payment.\"*\n\n*And people laughed! People were laughing! How stupid I felt at that moment! \"What can you even expect to buy for twenty-five hundred bucks?\" Some taunter leaning on the counter jeered, and it took all strength to resist the urge to shoot him.*\n\n*\"Damn you! You should be asking, 'What can't twenty-five hundred dollars buy'? Are you even economically literate, sir?\" I retorted.*\n\n*\"I don't know. Are you?\"*\n\n*I had had enough. I didn't need a payment anyway. I would be perfectly content with just bombing their city. In fact, I might come around again a little later, to rub salt in their wounds. Who were they, to forget their payment? Who were they, to disrespect Charles Wyte? Well, I would show them.*\n\n*For extra measure I grabbed the arm of some woman and dragged her outside, holding my pistol to her head. A crowd had assembled; I could use that to my advantage. A lot of them were aiming their funny boxes at me, and gasped audibly when I left the bank with my catch. Yes, this was the reaction I was looking for. \"Want her to live?\" I grinned. \"Well, you'll have to answer my riddle to save her.\" It was perfect. With this situation, they'd either have to use all of their guessing power, or pay me what I was owed.*\n\n*I noticed with some annoyance that one woman in the crowd was pressing her strange rectangle to the side of her face, exclaiming \"Hello? 911?\" I decided to think nothing of it. \"The riddle is this. 'Give me air, and I thrive. Give me water, and I die-\"*\n\n*I was immediately cut off by several people in the crowd shouting the answer to my riddle. \"It's fire, dude!\" Some hooligan up at the front of the mob yelled at me, holding up his box to me. Sure enough, there was the answer writ upon it, as though it had been stored there the whole time.*\n\n*I let the woman go, and she ran off crying. Typical. By this point I had been exhausted in my patience and turned to the crowd, pointing a finger as though to scold them. (And in a way, I really was doing just that.) \"Listen, you all. You have gotten on my last nerve. I will have none of this foolishness any longer. Your city refused to pay what it owed* me, CHARLES WYTE...*\" Pause for dramatic effect. \"And as such it justly deserves its suffering! I tell you, I am not one to be messed with! You cannot even imagine the lengths I will go to get what I want. Why, I could kidnap the most powerful and influential men in the world and you would hear nothing of them ever again! Is that really what you want?!\"*\n\n*The crowd stood in shocked silence for mere seconds, then some fellow shouted \"Hell yeah!\" (Or something along those lines.) And the crowd* cheered. *What was happening! What was going on! Did they not care for their great industrialists? Their senators and presidents? What had happened in New York while I was gone?*\n\n*I changed my mind. The bombing was off. I called down the ladder, and as I began my climb I noticed a young woman standing with her back to me, holding her strange box out in front of her. We were both reflected on its surface. I continued my climb, shaking my head. I feared I had brain fever.*\n\n*Upon reaching the gondola, I called to Crosbuck, \"That's all. Take us up.\"*\n\n*As the DESTROYER-EXODUS lifted off, I could see the red-blue flashing light of what was no doubt law enforcement. I wanted to laugh to myself. Well, good luck to them. For unless they have wings they cannot even dream of reaching me.*\n\n*\"How was it down there, sir?\" Crosbuck inquired.*\n\n*\"Simply awful.\" I remarked, staring down at the crowd still huddled on the street. \"I fear the entire city of New York has gone mad. Or some strange, unknowable thing has happened there.\"*\n\n*We reached our cruising altitude and Crosbuck guided us back out over the Atlantic. There was no way for us to be caught now. As we left I had found myself missing that idiot Inspector Vondale and his snarky quips. It was better than what I was leaving behind, anyhow. \"We'll leave New York from our route for a while.\" I declared. \"Clearly, we've been hitting them much too hard lately...\"*",
   "created_utc": 1690822766,
   "score": 1,
   "submission_id": "15e1eir"
  },
  {
   "comment_id": "ju8vfjy",
   "message": "If he was completely honest with himself, The Red Menace was never really a communist. \n\nSure, his father was in a trade union before he passed, but it wasn't as if he'd ever read any theory. Frankly, he had only a vague and fuzzy idea of what communism even was. Something about the government taking all the money and then doling it out evenly to everybody? Weird.\n\nBut though he wasn't at all political, The Red Menace was contrarian. And he knew that he wanted to embody everything America was against.\n\nHe'd started supervillaining as a teenager, shortly after the great depression hit. He and his mother may have had to live in a Hooverville, but he'd be damned if he was going to starve while he was freezing. He didn't have any powers in particular, but back in the day, you didn't really need those. He was good with a toolbox, he was clever, and he had enough charisma to scare money out of people, and that was all you really needed to at least be a small-timer.\n\nImagine his surprise when the famous America-themed hero \"Proudly Hail\" decided to start coming after him.\n\n...imagine his further surprise when he started winning against him.\n\nProudly Hail may have actually had powers, but he also had weaknesses that could be exploited. He'd been in the Great War, so he had shellshock. Though he hid it like FDR hid his wheelchair, it was easy enough to figure out. He responded badly to loud noises, especially those caused by explosives, and he hated enclosed spaces. And if all else failed...well, Red did have a day job as a barber, so he always kept some hair on him to burn.\n\nRepeatedly and visibly putting the kibosh of America's most famous and most patriotic superheroes earned him clout. At first it had been primarily about money, but Red couldn't deny that he enjoyed the spotlight. He liked smirking when he heard people speaking about him in hushed voices. He liked seeing himself in the newspapers. And he wanted more of it. So he started going bigger.\n\nThe first kidnapping he ever did was the mayor. That nearly got him shot, so the next time he went with a politician's kid son.\n\n...that one actually did get someone shot. Not him though.\n\nAfter that, he made a point to only kidnap important people. Sure, the first part was harder, but better a hard beginning than a hard end.\n\nIt was actually the thing with the kid that got him noticed by Susanna.\n\nSusanna wasn't a super, but she actually did have some powers. At least, it seemed that way to Red. That woman spent significantly more time in jail than he did, and she did it just by showing up places and not leaving. That was what skin that dark would do for you. And jail is where they first met.\n\nUnlike Red, Susanna actually was a communist. She tried to explain it to him a few times, but whenever she started talking about it, Red just couldn't keep up. That wasn't too surprising. For one, she was the most gorgeous dame that Red had ever met, so that made paying attention a little tricky. And for another, she was also the smartest person he'd met, maybe the smartest in the world.\n\nShe may have known a lot about politics, and she may have spent most of her time making whites uncomfortable by being in their spaces, but her main thing was machines. That was something Red could keep up with her to an extent about, given all the traps he'd put together, but once it got into what she called \"temporophysics\", she lost him. From what he could gather, she was doing weird things with time. And weirder still, it seemed like it was working.\n\nWeirdest of all, she was willing to share it with Red. When they met in jail, she told him she'd been waiting for him to get put in the clink with her. After the kid-kidnapping went so wrong, she noticed that he only took the important people. Apparently, to her, that meant that he was \"good enough.\" So if he agreed to do what she wanted, she'd share her time shit with him.\n\nHonestly, he'd agree just to get a grip on those hips, but after seeing what she did to a handsy copper, Red decided to keep that thought to himself.\n\nEven so, he turned into her attack dog, and he didn't mind it at all. For one, she still let him do things his way as long as he got it done. Kidnap and humiliate this politician? If she was gonna do it, she'd take pictures quietlike or something. Red got him to say his secrets over radio instead. \n\nThere was the kit she had too. They may have been \"prototypes\" according to her, and she said she was letting him test them so she didn't have to, but they hardly ever steered him wrong. The one he liked best was the one that let him charge. It could only hold a minute, and it took an hour to \"reload\" (he said that'd make it a real shitty gat, and that actually got Susanna to laugh), but for that one minute, he was moving, but nothing else would.\n\nThe others he used pretty sparingly. One could reel stuff backwards to like it was before, but using it on himself made him puke like a hooch guzzler, so he usually used it to make weird traps. Another one was the opposite and moved a minute forward real fast. That one gave him a headache, but he could make other things move fast, so he'd use that one as a weapon, tossing it at some schmoe and watching them stand perfectly still while he made tracks.\n\nMore than anything else, though, Red just liked her. Not only was Susanna a real looker and a real thinker, he started liking talking to her too. The two of them would smoke jive and lie on a couch together, talking about all kinds of things. The radio, the great war, their parents, life...death. She was the only person outside of his ma that Red ever cried in front of, and he did it when he told her he was scared to die. She wasn't. That was crazy to him. But she didn't treat him like a coward.\n\nAfter a few years knowing each other and talking like that, Red ended up getting a grip on those hips after all. When they were pitching woo, sometimes Red'd think about his confederate grandpappy and how mad he was that his daughter married a chinaman, and he would laugh and laugh and laugh.\n\nIt got less funny when Susanna's belly started getting bigger.\n\nSusanna didn't stop going to jail. Red begged her to, and when she asked if he'd give up villaining, he said yes, but they both knew he was lying.\n\nRed was lying so much that he started making mistakes. He was going too far, making things too big, taking risks he shouldn't have. And that's how he ended up finally getting shot.\n\nIt was a good shot. Right in the chest. It wasn't even anyone special. It was just some copper. Not even a copper he knew. And when he screamed that he didn't want to die and that his girl was gonna have his baby, he could see that that cop's gun wasn't getting any lower on him.\n\nThe gun fired again. He hit his minute button. And the next thing he remembered was being in the hospital.\n\nThe nurse was some guy in red. He said he wasn't quite a nurse, but he was a nurse. When Red had asked where in the hell he was, he was shocked that he was in the exact same city he'd been in.\n\nIt took a minute for him to figure out that he should have been asking when.\n\nSo now here Red was. In a completely different millennium. Owing more suds to this hospital that'd put his ribs back together than any scrub could pay in a whole life.\n\nThe first few months were a fucking mess. Apparently they knew who he was and when he was from, so they were ready to make papers for him, but one of those papers was a warrant for his arrest. He ended up right back in the clink, which had barely changed at all. The only different thing was that the cops were fatter and there were black circles on the ceiling that, apparently, were cameras. Trying to get the lay of the land was tough. Nobody liked him; he wasn't white enough for the whites there, and the blacks and mexicans didn't like him either. He got some weird information, and he couldn't tell who was telling the truth or lying. Eventually he figured out that some of the goons had been in here for decades for selling jazz, and may as well have known as much as he did. The newer guys were more useful, but they were actual criminals, and they didn't have any respect for some guy who \"went around in his underwear\" nearly a century ago.\n\nThe lack of respect was actually kinda useful. Made it easier to escape.\n\nOnce Red got his mitts on one of these \"phones\" (which were absolutely not fucking phones, but that was another thing) he was able to figure stuff out. Once he learned how to turn the goddamned thing on, touching the glass was pretty intuitive, but sorting out what all the stuff beneath the glass meant was another story. The thing that helped him understand it the most was when some kid half his age working at a coffee shop took pity on him and showed him how to \"google\" shit.\n\nAnd god damn had he missed a lot of shit.\n\nThere were cars that looked like round little bugs. Everybody's favorite cookie was something he'd never heard of. Planes full of people had started flying over the oceans. Farmers in Oklahoma and Texas had to leave since all the ground dried up. There was a ninth planet, except now there wasn't any more, apparently. There'd been *another* great war.\n\nAnd that was just what he missed from the rest of the thirties.\n\n[[Continued in a reply]]",
   "created_utc": 1690832826,
   "score": 1,
   "submission_id": "15e1eir"
  }
 ]
}