{
 "submission_id": "15e2ssg",
 "title": "[WP] You come home and fall asleep, you wake up outside your room, something is pulling you down- you’re still asleep, you must get to your body…",
 "selftext": "",
 "created_utc": 1690767689,
 "permalink": "/r/WritingPrompts/comments/15e2ssg/wp_you_come_home_and_fall_asleep_you_wake_up/",
 "score": 13,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e2ssg/wp_you_come_home_and_fall_asleep_you_wake_up/",
 "comments": [
  {
   "comment_id": "ju5cyxo",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690767689,
   "score": 1,
   "submission_id": "15e2ssg"
  },
  {
   "comment_id": "ju5gx8t",
   "message": "Nightmares are terrifying. They have to be. Manifestations of our fears from our very minds. You cannot dispell fears you conjure yourself. Some nightmares are no products. Sometimes, we have intruders beyond what we can perceive outside our dreams.\n\nWhen the first ones came, I too mistook them for mere bad dreams. Nightmares of creatures that gnash and claw at my body in obscurity. A slight view of a claw here, an eye there, burnt flesh with mawing teeth. Just enough for our own imagination to run wild and enough pain to eventually wake you up in a cold sweat. When claw marks on reddened skin starts to show up, you realize these are not in your mind.\n\nTrying to research the occult without running into a wall of fantasy writers, conspiracy theorists, wannabe cultists, close minded over rational people and those that are just quite simply wrong. It gets frustrating and time consuming.\n\nBy the time, I had learned anything of value about these creatures, it may have been too late. They flay your mind and soul in your dreams to weaken your bond with your body. When they eventually drive you out. They can take over and drag you for their own purposes. Reason beyond I have yet to discern.\n\nTonight, I regain consciousness outside my body. Instead of the nightmares where I am forced to scream and shriek in pain, I feel nothing except the pure fear of what I may be too late to prevent.\nOutside my room, my incorporeal body looks down and my near lifeless body. It slowly tenses a few muscles before sudden spasms cause it to roll over a bit. It is slowly but surely forcing my body to the stairs.\n\nWith nothing I can grab or push against, no sense of a body in this form, I cannot move forward. Unfamiliar and inexperienced, I can feel what little attachment to my own body slowly thinning out as whatever inhabits my body makes themselves at home. It is close enough to the stairs that panic begins to set it as to what it is planning to do. \n\nIn my panicked state, I manage to lash out and close the gap with my body. In a single gut wrenching body that feels like my entire being is split in two, I manage to force the other out of my body. A cold sweat and every muscle in my body strained to the limit.\n\nI have won a night but time is running out. Whatever these are and however I must fight them. I need to find out soon, lest it is my final night.",
   "created_utc": 1690769602,
   "score": 3,
   "submission_id": "15e2ssg"
  }
 ]
}