{
 "submission_id": "15e68ma",
 "title": "[WP] A ghost falls in love with a lonely mortal who is thinking about ending it all and wonders if they can stop them and if they even want to.",
 "selftext": "",
 "created_utc": 1690778451,
 "permalink": "/r/WritingPrompts/comments/15e68ma/wp_a_ghost_falls_in_love_with_a_lonely_mortal_who/",
 "score": 94,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e68ma/wp_a_ghost_falls_in_love_with_a_lonely_mortal_who/",
 "comments": [
  {
   "comment_id": "ju5x2zw",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690778452,
   "score": 1,
   "submission_id": "15e68ma"
  },
  {
   "comment_id": "ju68kio",
   "message": "\n*Why? Why did he wince?*\n\nThe boy reached out a shivering hand and pulled the blanket over his knees, the hairs on his neck standing on end. I thought I knew him, having watched him for weeks I could tell his thoughts from the quiver of his lower lip, would know what type of sandwich he was going to buy from the drifting of his eyes over the corner store fridge, so why did he wince?\n\nPerched in the corner of his dimly lit studio apartment I watched as my ethereal trail dispersed into the air, a thin fog of translucent emerald that stretched from his chest to my core. I would have been fine with confusion, I would have even welcomed a healthy skepticism, but for him to be repulsed as our forms connected was out of my realm of understanding. Sulking, I flattened myself out on top of the wardrobe and watched as the smartphone illuminated his face a synthetic blue. His eyes half closed, a gaunt thumb lazily scrolled through messages and notifications.\n\nIf I had teeth to grind, his flimsy neck would be spinning to find the cacophony echoing off the half painted walls. His efforts were all in vain, as much as he reached out life would hand back empty sentiments. \n\n“We understand your pain, and rest assured we have you high on the waiting list.”, we’ve all heard that one.\n\n“Anything you need,” followed by a non-commital thumbs-up emoji, “I’m always here to talk.” Missing the point entirely, he needs you to reach out first! I could scream at them if I had a voice, force them to take him seriously.\n\nThe gentle clink of a beak rapping against a glass window drew the boy’s gaze. Placing his phone gently on the pillow his thin body contorted and stretched, two pale feet with overgrown nails plodded gently onto the hardwood floor. Still wrapped in his blanket cocoon he pulled back the grey material, grunting at the sudden wave of morning light washing into the room. On the other side of the window sat a rock pigeon, it’s round black eyes staring up longingly through the glass.\n\n“Alright, alright.” He muttered as the pigeon’s request became more animated, fluttering its wings and pecking persistently.\n\nPeeling the lid off the battered container, he reached inside and pulled out the little red scoop from within. He opened the window, only after a small budge did the security chord reach the end of its tether and lock into place, leaving an arm’s width of opening to the outside air. The slightest hint of a smile perked up on the corner of his chapped lips as the seed clattered into the metal tin, it reminded us both of a rain-stick we had seen in a film together on his laptop.\n\nThe red pulsing glow of his phone drew my attention away from the feeding, a new surge of notifications had hit. These people didn’t deserve him, he was kind and loving and the fruit of their efforts was only twenty seconds of typing in a lazy attempt to connect with his withering soul. Willing myself forward, I passed effortlessly through the bed frame, the mattress, the pillow, and finally the phone. All of the furnishings were unaffected, but the phone screen flickered silently as it lay surrounded by my glow. Like a swimmer turning at the end of a lap, I rolled over and passed back through the device again. Over, and over.\n\n“Wh- No!” He cried out, leaping onto the bed. Cradling the metal cuboid in his hands he frantically thumbed at the buttons and rapped his finger on the screen. After twenty seconds he knew any further theatrics were pointless, slumping his shoulders down he flipped the phone over and pulled out the small red chip plugged into its open port. Why did he persist, chasing these flimsy threads of hope? If he knew a life was waiting for him past the veil, would he still put up such a pitiful fight, I wonder?\n\nLost in thought, I was brought back to my senses by the unfamiliar click of the apartment’s lock. Not wanting to be left behind I floated effortlessly through the wall. I was nearly blinded by the rush of colours as my core passed through kitchen cupboards to be met with sauces of every variety, mismatched plates and mugs, bags of dried pasta, and finally the connecting wall with a nest of wires installed haphazardly in the plasterboard. \n\nI followed him downstairs, watching as he saw the light drizzle begin through the complex’s door and pulled up his hood, forcing two hands deep into his pockets and passing out into the world. The mirage of tinted clouds beyond his vision would put the most adorable dumbstruck look in his eyes. To him it was a monotonous grey with specks of rain beginning to drain the colour from even the billboards. He could not fathom the mirage of different coloured trails weaving and soaring over the city above his head. Souls taking flight.\n\nCrossing streets and navigating down side passages, he made his way through the maze toward the tech store. The final obstacle was crossing down into the Southern Quarter, over the folding bridge. Slapping down, his trainers produced a hollow ringing from the metal structure as he climbed higher above the river below. At the bridge’s crest, he stopped.\n\nThis could be it. A step, a leap, and a fall. Our two forms could mingle and merge for all of time, he wouldn’t have to keep up his daily routine any longer, his weak struggle against oblivion. His lip quivered, eyes fixed on the green railing before him. Planted in place, he could not progress any further toward the railing nor off the bridge, he was simply frozen in place.\n\nIt wasn’t fair. He has love to give, and no one will take it. It’s not his fault. Though I hesitated, my core moved without thinking. Passing through him, the hairs on his neck stood on end. Dispelling the thoughts with a violent shake, he rubbed his temple and continued on his journey.",
   "created_utc": 1690786649,
   "score": 13,
   "submission_id": "15e68ma"
  },
  {
   "comment_id": "ju66nut",
   "message": "\"I've found it.\"\n\nIt was a summer evening. Evenings were generally pleasant, but this specific evening had been spectacular despite the mugginess. At the very least, it was a spectacular evening for Andy Green. The weather mattered plenty for Andy and his colleagues because it was only during the evenings in which he and men and women and children like Andy Green could move freely. In the day and even during the early summer mornings, the daylight was harsh. It ripped straight through Andy and it pained him to move.\n\nHe took shelter in attics or closets or dim rooms. The popularity of blackout curtains had been heralded by Andy and his clan as the best invention in the 21st century. Andy and people like Andy thrived in these conditions for they were ghosts. Not the kind of things that haunted and lingered, though Andy did do his share of lingering, but they were ghosts. Simple ghosts who died and wanted to stay a bit longer to observe. Andy Green had died nearly three decades ago when he was 24. He still felt 24 and he looked 24, but in ghost years, he was easily in his 50s.\n\n\"What did you find?\" one of Andy's friends asked.\n\n\"I found out why I'm still here,\" Andy replied.\n\n\"Don't tell me it's because of a girl.\"\n\nThey were in one of their usual haunts, an abandoned bar with an upstairs living area that was permanently shrouded in an eastward facing darkness. The spot had five years at most. Potential renters or entrepreneurs would visit and the ghosts would literally cover them and think about every possible regret they had. Ghosts weren't very strong despite what popular media would suggest. They were feeble, barely hanging on to their invisible selves. It took a lot to keep a ghost around and most ghosts knew what it would take for them to leave. Andy was not one of those ghosts. He died and he stuck around by sheer will.\n\nAndy floated silently in front of his friend, another ghost named Rochelle.\n\n\"It's a girl,\" she said. \"You do know that you're like a gazillion years old, right?\"\n\nRochelle had died a few weeks ago, but she had adapted to this new life better than most. She was hit by a truck, a drunk driver on the way to her dead end job at some office where she sold health insurance. Andy was physically the closest ghost to her when she had died so he was the one who welcomed her to what was to be her new life.\n\n\"I got hit by a drunk driver at six thirty in the morning?\" she asked.\n\n\"You did.\"\n\n\"Jesus Christ,\" she replied.\n\nThe two were close after that. They shared the same spaces, Andy had told her a little about his life. How he died of cancer and how he felt it was an injustice that he had died so young. Rochelle replied saying that she was relieved that she wouldn't have to make her two hour commute anymore. Andy thought she was insane, but she was a ghost so of course she was insane.\n\n\"24 is not that old,\" Andy said.\n\n\"You're basically 60.\"\n\n\"Okay, but the girl in question isn't quite so young herself.\" Andy said.\n\nRochelle stared at him. She stared so hard that she was staring through him and Andy (as well as any other ghost) could feel when someone did that to them. It was a physical pain to be noticed, it stung and vibrated and heated up. It was a peculiar feeling and ghosts, at least Andy, did not enjoy the feeling of being noticed.\n\n\"How old is she?\" Rochelle asked.\n\n\"Old enough,\" Andy said. \"She wants to be one of us soon.\"\n\n\"Ah.\"\n\nEmma Wilma Davis celebrated her fortieth birthday alone. Her cat, Captain Wells, had passed away after turning 24. He lived a good life, easily the longest life of any cat she had known. Captain Wells was an orange cat and spent much of his life idling around Emma's two bedroom condo. He had his routine and he quite enjoyed it. His singular regret was that he couldn't live long enough to see to it that Emma would be okay. He held on for longer than he had to, he had been visited by the grim reaper several times, but he appealed the inevitable visit.\n\n\"May I stay another year?\" Captain Wells asked. \"My human is sick.\"\n\n\"Very well,\" the grim reaper replied.\n\nAndy had watched Captain Wells pass through his physical life and straight to his spiritual one. They locked eyes and Captain Wells had understood at once that his mission would be carried out.\n\n\"She loves music,\" Captain Wells said.\n\n\"Meow meow meow,\" Andy heard.\n\nAndy had been watching the two. Emma worked from home, she was some kind of paralegal. Computer screens hurt his eyes so he didn't look very often. Emma wore headphones for easily twelve hours a day. She ordered her groceries online, she kept her lights off, she had blackout curtains surrounding the entire perimeter of her apartment. She was a ghost's dream and Andy knew it. There were many ghosts that had tried to stay at Emma's, but he fought them, as much as a ghost could fight another ghost. He made himself, and the ghosts with him, known by opening doors, changing the temperature of the house, wiggling her mouse. All things that took tremendous effort, but it scared the other ghosts because they didn't want to be noticed.\n\nIt hurt Andy too, but he knew that it was having an effect. Ghosts were staying away from Emma and he had her to himself. He found himself doing little things like increasing the temperature by a degree or two when he noticed how Emma was covering herself in her blanket. He noticed that Emma would live the faucet dripping and he would use what was left of his strength to turn the faucet off. One night, Emma had left the oven on and it took Andy hours to turn the damn thing off. It was little things like that. Little things to Emma, but mountainous efforts to Andy. He watched her constantly. And from Emma's perspective, she had stopped worrying so much about all the things that had been going wrong in her life. She felt as though she could never do anything right. Her utility bills seemed more manageable, she slept better through the night. She was remembering to take the medicine she was being prescribed. The bottles had appeared on her nightstand almost on their own, but she must have been doing it because who else could do it?\n\nShe would face each day because she knew she could.",
   "created_utc": 1690785177,
   "score": 3,
   "submission_id": "15e68ma"
  },
  {
   "comment_id": "ju72uuz",
   "message": "As I sat in the corner, I watched him. The tears flowing out of his eyes. The slight whimpers he made. The way he tossed and turned. It certainly wasn't a new scene to me, my life hadn't been too different.\n\nTo say I'm happy to be dead would be a lie. At the same time, I don't exactly miss the days that I lived either. I remember my life as being overpoweringly bitter. Happiness, love, elation weren't foreign emotions to me. However, the intoxicating despair and helplessness I grew all too familiar with had overpowered them on a daily basis.\n\nMy first thought about him was that we were kindred spirits. I had spent my fair share of days unable to get out of bed too. I hardly saw a reason to most days. The thoughts just kept swirling around my mind, keeping a tight grip on me, never letting go. Those thoughts never stopped reminding me of just how worthless I was. How talentless, how devoid of personality, how spineless, how utterly useless and of how ugly, inside and out, I was. I was so meaningless to this world and nobody could've made me think otherwise. \n\nThere wasn't even anyone that tried to.\n\nI stayed there, in the only place that gave me any form of comfort. I let my emotions take power over me in ways I had to hide during my daily life.\n\nMy heart flooded with emotions, memories and new sensations everytime I even so much as glanced at him. \n\nOne of those sensations being love. I wanted to hug him, touch him, put my hands through his hair. Comfort him in the way nobody had done to me. I had dreamed of it so many times. I even lay there next to him so many times in that bed, my heart tugging at every single tear that dropped. My hand evaporated through him everytime I made a futile attempt to engage in contact.\n\nThe first time I took notice of it I felt my stomach fill with a heavy, crushing weight. Although at the same time, I felt butterflies fluttering around at the thought.\n\nI was fully aware it was wrong. No part of me should've felt a shred of happiness. It tore me up inside. I could give him everything he ever wanted. Everything he deserved. I would love him in the way that he so desperately needed.\n\nAnd he would love me back, in the way that I so desperately needed...\n\nIt was selfish. It was immoral. It was twisted and it was ugly. I think deep down, that's why I did it. I always was a people pleaser, after all. I just knew on the inside that this wasn't the way it should happen.\n\nI knocked over a lamp. He jumped, forcing the pills out of his trembling hands and down the drain. He collapsed, his body weighed down by the realisation of what he had planned to do. I stared at him the way I had done so many times before. His face was wrought with despair, hopelessness and sorrow as he buried his face in his hands.\n\nMy mind flooded with thoughts at the sight. Did he feel sad? Did he truly yearn for death or was it because he felt he had no other option? Would it have been better for me to... \n\nNo. I need to cast those thoughts aside. In that moment, I knew what I had to do.\n\nIn my heart, I knew we were destined for each other. I think that's why I was sent to this house after all. However, I wasn't going to let it happen like this. Our fateful meeting would come to fruition when the time was right.\n\nFor now, I had a mission to accomplish.\n\nI had to stop him from doing the same thing I did all those years ago.\n\n-------\n\n**Writing Prompt #14**\n\n**Please let me know if you have any thoughts/feedback on this story or if you enjoyed it, it means a lot to me!**",
   "created_utc": 1690807712,
   "score": 3,
   "submission_id": "15e68ma"
  },
  {
   "comment_id": "ju6riyk",
   "message": "[removed]",
   "created_utc": 1690801398,
   "score": 1,
   "submission_id": "15e68ma"
  }
 ]
}