{
 "submission_id": "15e77lu",
 "title": "[WP] At first, joining up with the Legion of Evil just to get revenge on the League of Goodness doesn't seem like a bad idea, but once you saw and realized that they're no better than the heroes you despised. You decided to quit and go on your own path.",
 "selftext": "",
 "created_utc": 1690781830,
 "permalink": "/r/WritingPrompts/comments/15e77lu/wp_at_first_joining_up_with_the_legion_of_evil/",
 "score": 6,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e77lu/wp_at_first_joining_up_with_the_legion_of_evil/",
 "comments": [
  {
   "comment_id": "ju624o1",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690781830,
   "score": 1,
   "submission_id": "15e77lu"
  },
  {
   "comment_id": "ju67rx4",
   "message": "Jason salutes along with the other henchmen, but he doesn't join them to their assigned task. He goes to his personal quarters to pack. He doesn't know what he expected, really, joining the Legion of Evil. A bit more murder and vengeance, maybe?\n\nBut no. The evil overlord gave everyone explicit orders to 'maim, not murder' the heroes during the planned attack on the city. Civilians? Do whatever you want. Heroes? Pain is good, death really isn't.\n\nThere's also an explicit rule of not kidnapping a hero or their loved ones. The Lord is fine with threats, and if they get in the crossfire a little damage is fine too, but no. Killing. Of. Heroes. \n\nThat rule is bullshit. The only reason Jason joined the Legion was to get a shot at killing bloody Evangeline. But the Legion is just as useful as the League of Goodness' internal complaint system. Which means not at all. \n\nBut it's fine. Jason will just pack his bags and go his own way. The Legion can keep doing its thing, and the League can go on in blissful ignorance until Jason figures out a plan. Because he WILL kill Evangeline. No matter what.\n\nJason is stuffing the last of his clothes in his rucksack when his door squeaks open. Jason whirls around, thinking someone's there to stop him. There's nothing there but shadow. \n\nCrap. It's Ebony Darkness. Jason fumbles for his flashlight, and points it at Ebony before she enters his personal space. When the light hits her, she pops into existence with a smirk.\n\n\"Leaving so soon, newbie?\"\n\nWhen she doesn't do anything but stand in the doorway, Jason puts his flashlight away too. He checks to make sure he took everything before answering her. \n\n\"Yup. I'm not made of the right stuff for evil.\" He tries to look dopey and upset. He fails, if Ebony's widening grin is anything to go by.\n\n\"Oh, Jason. I think you are made of exactly the right stuff. It's the Legion that falls short, isn’t it?\" \n\nJason freezes. Does she know? They stare at each other for a komen, before Ebony moves out of the way with a sweep of her arm.\n\n\"I've been annoyed at the Legion for years.. I think I'm going to join you in your crusade against the League. Just leave Matador for me. I've been itching to cave his face in for ages.\"\n\nJason doesn't move. He's not an idiot. He's not going to believe one of the high ranking lieutenants of the Legion wants to skip town with him. Ebony sees his reluctance and rolls her eyes.\n\n\"How are you going to get past the guards? The Lord has got eyes everywhere.\" \n\nOh. Jason didn't think of that. Guess he is stupid. If he's going to get caught anyway, he might as well let Ebony join. \n\n\"Fine. But Evangeline is mine.\" \n\nEbony's grin turns wicked. \"And we'll team up on everyone else.\" With a sweep of her arm, the world turns monochrome. The pair walks out without issue, now that they're cloaked in Ebony's shadows.\n\nJason grins too. The heroes won't know what hit them when they strike.",
   "created_utc": 1690786039,
   "score": 1,
   "submission_id": "15e77lu"
  }
 ]
}