{
 "submission_id": "15e85m2",
 "title": "[WP] it is well known that the inventor of the saxophone, Adolphe Sax, suffered from freak accidents since childhood. What people don't know is that they were caused by you, a saxophone hating time traveler.",
 "selftext": "",
 "created_utc": 1690785077,
 "permalink": "/r/WritingPrompts/comments/15e85m2/wp_it_is_well_known_that_the_inventor_of_the/",
 "score": 133,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15e85m2/wp_it_is_well_known_that_the_inventor_of_the/",
 "comments": [
  {
   "comment_id": "ju66j9x",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690785077,
   "score": 1,
   "submission_id": "15e85m2"
  },
  {
   "comment_id": "ju6qla3",
   "message": "You really don't get it, do you? I really just hate saxophones. \n\nThat's all. There's no all encompassing moral good that I'm chasing. Adolphe Sax didn't commit some horrendous act, and getting rid of the saxophone won't change the future in some way beneficial to me or society. Really, I don't know how it will change, because it hasn't changed yet. 1. I just really hate the saxophone, and 2. No matter what I do, the saxophone keeps getting invented.\n\nI can travel through time. I can literally do anything now. I could probably rewrite the rules of reality if I went back far enough, and yet the F\\*\\*\\*\\*\\*\\* SAXOPHONE OF ALL THINGS IS OMNIPRESENT! \n\nI just don't get it. None of the scientists in other iterations of time that I asked do either. I put myself and my machine in our own time stream separate from the rest of reality, and I drop the little s\\*\\*\\* off a building, and he lived. I poisoned him, he lived. I drop him in a river AFTER hitting him in the head with a rock, he lived. I shot him. Straight up. He died, and somehow the saxophone was still invented due to \"unknown circumstances.\" I can't even find the specific moment in that timeline when it was created, its just untraceable! I *CAN* accidently wipe out the Australian subcontinent, and cause a life long reign for Napoleon in Europe, I've had four genocides happen because of my meddling, and I can't stop the saxophone from being created.\n\nSo why? Why the f\\*\\*\\* is the saxophone inevitable. There's no way for it to be unaffected by the timestream! \n\n\"You sure?\"\n\nMy focus zooms back into the small diner of iteration... I think we're somewhere above four hundred now, but I can't remember off the top of my head. We're in the desert of... somewhere. Used to be the USA in the Prime Iteration, but now I think its some monarchy run by the Kennedy family. It's a ratty place, about what you'd expect from \"middle of nowhere, 2040's rural diner.\" Torn seats, dead bugs, alive bugs, bugs in the corn bread, burnt macaroni and cheese, and a mix of farmers who need to stop flirting with the waitress twenty years younger then them. Across from me is... guy. I never asked his name. It's not like it matters, since this iteration will be gone at some point.\n\n\"What do you mean, of course I'm sure,\" I reply annoyed, before sipping more coffee. He's older then me, maybe late 80s, but he's got a young look in his eye, and he seemed a lot smarter then anyone else in this diner. Sometimes I pick a place and random person to rant to, ok? Helps with all the stress and thinking.\n\nThe old man leans back, smirks, and throws an arm back. \"Well, you didn't always know how to separate objects from their timestreams, right?\" I take a moment, then nod apprehensively.  \"Well there you go,\" he says with a s\\*\\*\\* eating grin. \n\n\"Are you saying I missed something?\"\n\n\"I'm not saying just that, I'm saying much more.\" He takes a napkin, and starts to doodle. \"Way I see it, you have a couple different options that come to mind immediately. 1. The saxophone is an omni-present creation of some god outside even your perception and reach of reality.\" He finishes drawing a tiny saxophone with wings, and gives it a holy halo. \"2. You're accidently creating the saxophone in every iteration.\" This time, he draws me playing the saxophone. \"3. The concept of the saxophone itself has some property you don't know about yet.\" He draws a saxophone walking away from a trail. \"Or 4. There's another time traveler.\" He draws me, and then a second me. A second me.\n\nAnother time traveler? \n\nI spit out my coffee over the napkin. \"That's preposterous! There can't be another time traveler! There isn't a God, there isn't something \"special\" about the saxophone, and there's definitely no other time travelers!\"\n\n\"And how do you know that?\"\n\n\"I...\" I don't have a response. \"I just do! None of that would make any sense anyway!\"\n\n\"None of it makes any sense to you now.\"\n\nI go silent. He's right. I don't know how he's right, but he is. I don't know how this is happening to begin with, and each of these would explain so much, even if they themselves don't make sense. Is it really that crazy? To explain the unexplainable with something else you can't explain?\n\n\"I need to go.\" I grab my coat (I'm in the desert but I have a coat) and haphazardly put it on. I grab a random rock from my pocket, some artificial new element I picked up in the New Roman Republic I think, and place it on the table hurriedly. \"This should cover breakfast.\" \n\nI'm out the door as fast as my legs will carry me, and head for the large metal box with graffiti on it standing in the parking lot, between the Subaru and some sports car I don't recognize (what's that doing here??) I unlock the door with the keys, and turn to look at the old man, as he stares back at me. Green eyes. A translucent, otherworldly sort. Like radiation in those old kids shows, or some kind of harmful energy. I slam the door shut as I enter, seal the chamber, and start the engine up.\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------\n\nThe old man in the diner watches the door slam shut, and sighs. Cindy brings over another coffee, and places it down, snatching up the rock from the table.\n\n\"Must be a friend of yours, right?\" Her southern drawl isn't as thick as it used to be, but her hands are just as fast.\n\nThe old man chuckles and looks away from the time machine. \"What makes you say that?\"\n\nCindy snorts, eyeing him up. \"You're the only one I know who pays in whatever-this-is.\" She tosses the rock up and catches it. \"You know how hard it was to find a buyer for this?\"\n\nAnother chuckle, and a shake of the head. \"Yes I do.\"\n\nCindy stares at the old man, and sensing she won't get any answers from him today, shrugs. \"Alright John, keep your secrets.\" She walks back to the counter, yelling back to the cook for another order of \"the house special,\" whatever that was today. The old man looks back out the window, over the distant horizon. The machine is gone now, and faintly, over the buildings and dry dirt and sand, next to the rising sun, a second one appears.\n\nThe old man was lost in thought. He'd done everything right, as far as he remembered, so everything should be on course, but the possibilities nagged at him. Everything would continue as it should, but that didn't stop him from wondering what could have been. What would have happened if he hadn't come today? What if he'd said something different? What if he'd made a different face then he was supposed to, or some inscrutable variable that he couldn't predict had been set out of place. What would have changed? \n\nThe second sun begins to grow brighter and larger. Some of the patrons look out the window, and start talking about what it might be. Someone suggests a plane might have went down, while someone else jokes about World War Four.\n\nWhat would he have said if I told him what was happening, the old man thought. What would have happened if I told him it was a mixture of the four?\n\nAs that second sun grows, some customers panic. A few start laughing and talking about how they're excited to wake up from this dream, and one passes out, face falling into the macaroni. A fly lands on him, as if he was a fresh corpse. The old man sips his coffee, and rests his eyes. As the rules of reality unravel around him, as that second sun comes baring down on his existence, as the fly on the mans face grows to unimaginable proportions, as the corn bread becomes popcorn, then butter, then stone, as Cindy walks though the diner cleaning as if nothing was happening, the old man feels peace. A kind of acceptance in what's going to happen. From then to now.\n\nAs the light consumes the unreality, the old man relaxes. He knows it is painless.",
   "created_utc": 1690800784,
   "score": 1,
   "submission_id": "15e85m2"
  }
 ]
}