{
 "submission_id": "15edlwr",
 "title": "[PI] You woke up in an entirely fake world. It’s an endless doll-house plastic facsimile powered by miles of clockwork gears and levers that go straight down into darkness. You did not get here yourself, and you have no idea how to leave.",
 "selftext": "And [here](https://www.reddit.com/r/WritingPrompts/comments/v3vnbj/wp_you_woke_up_in_an_entirely_fake_world_its_an/)'s the link to the original prompt.\n\n\"What the hell?\"\n\nWhat the hell indeed. Three words encompassing flawlessly the emotions Jess was experiencing at the moment, mostly incomprehension and fear.Jess walked a narrow path suspended by ropes made of thousands of fishing lines and hooks. The thick ropes disappeared in the darkness above, and below her, a clockwork world.\n\nHumanoid shapes made of cogs and dripping oil went on moving plates. Some went flawlessly, taking a step the moment a plate passed before them, never stumbling, never falling. Others struggled to remain aloft on the uppermost layer, turning their heads wildly, hoping to correctly guess what direction they should take to stay above a little longer.\n\nThen there were the others. Those that suffered that stroke of bad luck, those who simply lacked the skill, and those who abandoned, not knowing why they should continue fighting.\n\nJess saw the moving gears, gargantuan contraptions that knew no pause, grinding the tiny humanoids into dust. She saw hands held high in a desperate attempt to reach at the darkness above, before being sucked down in a screech of broken parts and snuffed candles.\n\nIt suddenly dawned on Jess that she was looking down inside a maw. A clockwork, world-sized maw. Eating, devouring, digesting what little life - or pretense of life - existed on its outer set of teeth. It was the maw that produced the light that helped Jess see. An industrial, automated furnace nested deep below the cold teeth she could catch a glimpse of when the plates moved just right, a stomach to process and digest reality itself.\n\nAnd the maw was moving. Slowly, imperceptibly, Jess knew it was going up, devouring the darkness itself, leaving behind an absence that would not be filled.\n\nA glimpse of light caught her hand, and Jess saw how she was made of the same gears, ropes and tubes filled with oil than the shapes moving below herself. She moved a finger, and a thousand little cogs whirled into place to allow the smooth movement. She touched her face, felt nothing but smooth ceramic, black oil and cold steel. But how could ceramic and steel feel such a thing?\n\nJess felt her mind unravel at the seams. She had to find her way back, lest she go insane. Where was she before? The fog in her mind had to be pierced.\n\nFocus. Focus!\n\nOr a lack of focus. She dimly remembered a suspect and Jess was prodding into his mind. The suspect struggled to keep the thoughts from rolling over themselves. She remembered a flood, a distraught colleague, a white room...\n\nJess did the mistake of looking down at herself. She found no flesh in the cold construct, only a perfectly immobile machinery awaiting orders.\n\nShe felt her mind break a little more.\"No,\" she whispered.The single whisper echoed far in the darkness, ricocheting on the bursts of light born from the world-maw, nesting into the nooks of the whirling gears.\n\nThe narrow path split in half, a distended and maimed hand that had been a seamless part of the ground a moment ago rose. In the palm of the machine-hand, a face. Smudged with black oil, a tube sunk into its eye, it leaked thick drops onto the path.\n\n\"Ah, another visitor,\" the voice was a croak born from grinding gears, just like Jess'.\n\n\"Another?\" she replied.\n\n\"Look around.\"\n\nJess squinted her mechanical eyes. In the distance, another narrow path, held by ropes made of fishing lines and hooks. And she could almost make out another shape like herself walking upon it.\n\nHer eyes grew wide. There were thousands of such paths, with thousands like hers.\n\nAnd they all stood in the way of the maw going up.\n\n\"Have I gone mad?\" she asked.\n\n\"Mad?\" the face laughed, \"quite the opposite, you have never been so sane and you never will be again. You're seeing things exactly as they are.\"\n\n\"No... no. I'm not made of... whatever this is. This is all wrong.\"\n\n\"Is it wrong, or did you merely take away the veil before your eyes to look at reality as it is?\"\n\nAn uneasy silence stood between them, only broken by the echoes of others like Jess who were having a similar conversation.\n\n\"There are two ways to shield yourself from absolute reality. One is to believe the world as utterly senseless. This is the path of the godless and master-less, after all, if nothing makes sense, you are free, free to make rules and sense for yourself. Others fear such freedom, such a lack of clear rules and direction. They much prefer order. They find it in faith, laws of justice and physics. But this, Jess, this is reality as it is.\n\n\"This is the world you truly inhabit. It does make sense, a lot of sense born from machinery, sense that couldn't care less about you or your sanity. This is where you evolve, and everywhere you look you'll see things exactly as they are. You remember a certain colleague, yes? Distraught, desperate? Look down. You will find him, despite the immensity of the Maw of the Void, you will find him. You always find what you are looking for when perfectly sane.\"\n\nJess looked, and she found. A shape, reminiscent of someone she respected, on its knees, slowly sinking under the plates, edging closer to be another casualty to the maw. Further away, she saw the shape of the suspect, walking haphazardly, randomly, yet always staying on the surface, not even getting close to stumbling.\n\n\"Quite the sight, is it not?\" asked the face in the hand.\n\n\"No, No!\" Jess felt her mind breaking. And here, her mind was a very tangible part indeed. Cogs split and broke, her fingers dug into crumbling machinery, came back slick with oil, oil that gushed from the open wound that was her head, oil coating her in the same color as the darkness above her, the darkness the maw was consuming.\n\n\"Let me out. Please! LET ME OUT!\" she screamed words as well as oil and her very substance, in her screams she lost the parts making her up. She slowly came apart, bits making her up leaving her on their own volition.\n\n\"PLEASE!\"\n\nScreams traveled far and found fellow screams to bundle up together, a warm wave of fear, gaining weight and turning heavy, so heavy it could only go down when the Maw of the Void went up. Fear too, would be eaten.\n\n\"Rest assured, you're about to leave,\" said the face in the hand, \"this here is absolute reality. And if there's one thing I learned...\"\n\nThe face got very close to Jess'.\n\n\"...It is that sanity cannot exist for long under conditions of absolute reality.\"\n\nJess disintegrated in a splash of oil.\n\nA gasp.Jess woke up with hands made of flesh and bone, in the bed of a hospital room with a reassuring lack of cogs and gears. Except for the clock on the table, but she could live with that.\n\n\"Jess?\" asked a sad man at her side.\n\n\"Clive?\" she replied.\"How? You..., you,\" Clive took a moment to gather his thoughts, \"do you remember interrogating the suspect? You got into his head and... didn't fully come out. You barely made sense, then you turned catatonic for days. How... how did you found your way back?\"\n\nJess shook her head, \"I'm not sure. I saw weird stuff, my head is messing with me, I guess. I'm glad to be back.\"\n\n\"So am I,\" replied Clive, and Jess saw that, beneath the veneer of a consummate professional with little time for friendships, Clive was speaking the truth. \"Do you want something to drink?\"\n\n\"Gladly, I'm parched.\"\n\n\"I'll get you a bottle. Be right back.\"\n\nClive left the room, and Jess settled into her pillow. As much as she hated hospitals, it remained a thousand times better than the horrific hallucinations she went through. A haze came over her, she awaited the oncoming sleep.\n\nBut it remained just outside of her reach, pushed away by the seconds ticking away on the clock on her table. She heard the well ordained tick, tick, tick.\n\nShe heard the seconds ground to dust. Jess looked at the clock on the table.\n\nAnd she felt the faint presence right behind it, devouring, devouring time and darkness. Always going up, up, up.\n\nTo what lie beyond the shadows, to Jess and Clive, to the stars and the sun.\n\nAnd it would devour it all in turn.",
 "created_utc": 1690803087,
 "permalink": "/r/WritingPrompts/comments/15edlwr/pi_you_woke_up_in_an_entirely_fake_world_its_an/",
 "score": 20,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15edlwr/pi_you_woke_up_in_an_entirely_fake_world_its_an/",
 "comments": [
  {
   "comment_id": "ju6u8rw",
   "message": "**Welcome to the Post!** This is a [\\[PI\\] Prompt Inspired](https://www.reddit.com/r/WritingPrompts/wiki/how_to_tag_prompts#wiki_pi.3A_prompt_inspired) post which means it's a response to a prompt here on /r/WritingPrompts or /r/promptoftheday.  \n\n**Reminder**:\n\n\u0026gt;[Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback provided in the comments.\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690803087,
   "score": 1,
   "submission_id": "15edlwr"
  }
 ]
}