{
 "submission_id": "15eed2n",
 "title": "[WP] Your identical twin is a superhero, you are not. You both think messing with people with this fact is hilarious",
 "selftext": "",
 "created_utc": 1690805214,
 "permalink": "/r/WritingPrompts/comments/15eed2n/wp_your_identical_twin_is_a_superhero_you_are_not/",
 "score": 103,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15eed2n/wp_your_identical_twin_is_a_superhero_you_are_not/",
 "comments": [
  {
   "comment_id": "ju6xyur",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690805215,
   "score": 1,
   "submission_id": "15eed2n"
  },
  {
   "comment_id": "ju7bksm",
   "message": "\"Excuse me\" says a pretty lady beside you \"Are you Savanto?\"\n\n\"Haha, no not me. I get that a lot. I even have a photo of us together. See\" you pass over your phone and show you and Savanto, side by side. Except in this photo you are actually in the hero get up, and your twin is in civilian clothes. Your brother has a similar photo, with your brother in costume and you in civilian clothes on his phone. Most people accept, you are who you say you are when it looks exactly like you.\n\nYou look at the pretty lady and decide you might play hero if she's single.\n\n\"Flynn, nice to meet you\"\n\n\"I'm Louisa...\" she seems a little disappointed \n\n\"I hoped, rather than believed you were Savanto. He saved my life. I never got to say thank you.\"\n\n\"It was nothing... I mean, I'm sure for a hero like Savanto, it would be nothing. Was it just you Savanto saved... or did he also save your boyfriend?\"\n\nLouisa blushes\n\n\"It was just me. I got caught in the crossfire on Field Bridge, off the high street. An ice blast...\"\n\n\"...caught you around your ankles. Knocking you off the bridge. Savanto caught you just before you landed in the river.\" It made it so much easier when your brother shared his heroic stories with you.\n\n\"Or at least so I heard\"\n\nYou flip the photo onto your phone again.\n\n\"Isn't technology amazing? You could make it look like you're in two places at once. Savanto must have been too busy to notice how beautiful you are. Otherwise he'd already have your number.\"\n\nLouisa giggled \"I knew it was you. I could never forget my hero! Maybe you can take me back to your 'secret hideout' \"\n\n\"My civilian digs are right around the corner. I hope that will do? I can't be revealing all my secrets, can I?\"\n\n\nMeanwhile across town, Savanto is battling a giant trash monster.",
   "created_utc": 1690811671,
   "score": 49,
   "submission_id": "15eed2n"
  }
 ]
}