{
 "submission_id": "15ekr3w",
 "title": "[SP] It hasn't rained in 270 days on old Earl's farm.",
 "selftext": "",
 "created_utc": 1690820669,
 "permalink": "/r/WritingPrompts/comments/15ekr3w/sp_it_hasnt_rained_in_270_days_on_old_earls_farm/",
 "score": 11,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15ekr3w/sp_it_hasnt_rained_in_270_days_on_old_earls_farm/",
 "comments": [
  {
   "comment_id": "ju7yoaw",
   "message": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n\u0026gt;* [No AI-generated reponses \u0026amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n\u0026gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n\u0026gt;* Responses don't have to fulfill every detail\n\u0026gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22\u0026amp;restrict_sr=on\u0026amp;sort=new\u0026amp;t=all) for stricter titles\n\u0026gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690820670,
   "score": 1,
   "submission_id": "15ekr3w"
  },
  {
   "comment_id": "ju86jjx",
   "message": "\"It hasn't rained in 270 days on old Earl's farm. The twirdlypop's are all poped out with all them colors and all\", said Thomas. \"Y'all shoud come and see it for yourselves for sure !\".\n\n  \nFollowing the small group of farmer's which he lead, I carefully descended into the deep, wide, canyon that kind of made up half of the county. From the highs of Felipe's Watch to the bottom of the valley, one could expect half an hour walk on quite steep and narrow paths. Some reckless kids would occasionnaly drive down with their glideboard, rushing past the pedestrians with little to no care. I, for one, was no kid, nor was I reckless in any regard; but I did enjoy a good twirdlypop harvest from time to time. \n\nThe indegenous plants thrived in harsh environement, their wide stems would form huge spiraling patterns where ascending currents could form. Then, when the time was right, they would release grapes of ballony fruits that would rise high above the ground with chearful colors and tiny, slimy stems to keep them attached. If left this way, firebirds would feast on them and scatter their seeds away. But for us, those wonderfull fruits where a precious source of methane, hydrogen and nitrogen. \n\n  \n\"There, there !\" pointed Thomas, smile wide as the horizon. \"Y'all see that ! They're ginormous !\" He proceeded to jump around while approximatively approaching the farm house.\n\nOld Earl was standing on his porch, a satisfied smile on his face. He gestured in our direction to invite us. A large basket full of gathering tubes had been posted right next to the gate. I took my time, enjoying the view before all those colorful balloons disapear; but then I heard a clicking sound and my heart missed a beat. One, two, three more clicks and the crowd starting to scream. I briefly saw old Earl's face melt from joy to horror before the explosion kicked me away. I rolled on the ground, bounced a few times even, and somehow I didn't faint. All I could see of the farm was a wall of flames and, right in the middle of it, a standing figure. All I could hear from there was the flames scorching everything away and a distant but very distinct laugh; maniacal, crazy... joyfull laugh.",
   "created_utc": 1690823606,
   "score": 1,
   "submission_id": "15ekr3w"
  }
 ]
}