{
 "submission_id": "15en8kq",
 "title": "[PI] The fourth little pig built his house out of wolf skulls. It wasn't very sturdy, but it sent a message.",
 "selftext": "And [here's](https://www.reddit.com/r/WritingPrompts/comments/14p1j87/wp_the_fourth_little_pig_built_his_house_out_of/) the link to the original prompt.\n\nBloodshot eyes, stained fur. Hunger drove the beast. Its belly was full, but the creature was long pastconsidering food as a sole necessity for survival. It devoured because it wanted to, it ate flesh as much as it delighted in the squeals of pain from its victims. Violence drove the beast, the thrill of the hunthad long silenced self-preservation and measurement. Its long claws left deep grooves in the ground; its muscles stretched the skin. An untrained eye would call it a wolf, other wolves would call it for whatit was: an abomination.\n\nWhen it set eyes on a house made of straw, it filled its tremendous lungs with air, and let out a thunderous gale. As the dust settled, a round, portly shape emerged from the ruins. The beast still remembered the delicious squeals the pig made as its sunk its fang into the soft flesh.\n\nWhen it came upon a house of sticks, the beast roared. The sticks trembled and snapped under the strain, and under the splinters, a very, very angry grunt. Feisty, this one. Foolish all the same, it went down charging.\n\nTwo pigs, a distended belly. The beast felt the digested flesh pushing through its veins and into themuscles, its skin distended to give way to the increased mass. Long ago, it might have been a wolf. This abomination was the caricature of a noble animal, the sum of all fears, real or imagined, one could have about wolves.\n\nAnd then, it came upon a new home. There, it learned even monsters can feel ill-at-ease.\n\nFor the pig didn’t hide behind straw or twigs or even stone. It waited outside, watching the beast with a dispassionate eye. Patches of fur stuck to its tusks, it bore the scars of a lifetime of war, its hide hardened by the application of fire and wounds.\n\nAnd behind the pig, a mountain of skulls. Only skulls. Of femurs or clavicle, nothing to be seen, exceptthe ones it was chewing on.\n\nIt was a message. It was a statement.\n\nWhere a wolf gnaws at the bone, a pig grinds it to dust. Meat is the wolf’s religion; religion was the pig’s food.\n\nA house of skulls as a challenge to the world, as a declaration of supremacy.\n\nCrawling out of the forest, the abomination that was once a wolf howled at the moon. Standing before its altar, another abomination that had once been a pig roared at the world.\n\nAnd far, far away, wolves and pigs huddled close together, and prayed very hard that the battle would see both monsters dead.",
 "created_utc": 1690826455,
 "permalink": "/r/WritingPrompts/comments/15en8kq/pi_the_fourth_little_pig_built_his_house_out_of/",
 "score": 67,
 "url": "https://www.reddit.com/r/WritingPrompts/comments/15en8kq/pi_the_fourth_little_pig_built_his_house_out_of/",
 "comments": [
  {
   "comment_id": "ju8eaim",
   "message": "**Welcome to the Post!** This is a [\\[PI\\] Prompt Inspired](https://www.reddit.com/r/WritingPrompts/wiki/how_to_tag_prompts#wiki_pi.3A_prompt_inspired) post which means it's a response to a prompt here on /r/WritingPrompts or /r/promptoftheday.  \n\n**Reminder**:\n\n\u0026gt;[Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback provided in the comments.\n\n\u0026amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n\u0026amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n\u0026amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n\u0026amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
   "created_utc": 1690826456,
   "score": 1,
   "submission_id": "15en8kq"
  },
  {
   "comment_id": "ju8jv31",
   "message": "Loved this.\n\nVivid imagery and a very cool take to make them abominations.",
   "created_utc": 1690828543,
   "score": 1,
   "submission_id": "15en8kq"
  },
  {
   "comment_id": "ju921qz",
   "message": "As it turns out, anyone can be a monster.\n\nGood work.",
   "created_utc": 1690835256,
   "score": 1,
   "submission_id": "15en8kq"
  },
  {
   "comment_id": "ju92imw",
   "message": "and then the 5th pig built his house out of depleted uranium",
   "created_utc": 1690835428,
   "score": 1,
   "submission_id": "15en8kq"
  }
 ]
}