{
 "submission_id": "182mmqd",
 "title": "AITA for telling my sis I won’t let my trauma hurt my kids, unlike her?",
 "selftext": "Sorry for long post, feels good to vent, tldr at end \n\nI (34F) have a son (4M) and twin daughters (2F) with my husband (36M). My sister (36F) “Leah” has two sons (10M and 9M) and a daughter (7F) with her husband (41M). We had a really rough childhood. \n\nOur dad was an addict that hopped in and out of our lives. Our mom stuck around but was an addict as well. They’d literally steal our toys (whether they bought them or not) and sell them to buy more drugs. \n\nOur grandma cared for us the most, but was very old and sick so she couldn’t work. Our parents never helped her out so we mostly lived off of her social security check. \n\nOnce, my mom somehow overheard my grandma talking on the phone about how she decided that she had to sell her old engagement and wedding rings (grandpa died years before), earrings she inherited from her mom, as well as a few other sentiment items in order to cover a prescription my sister needed. Plus, she really wanted to be able to afford new shoes for us. We had both far outgrown our old pairs. \n\nMy mom stole everything she had mentioned and collected the cash to supply her addiction. She was high when grandma found out. She screamed that she was the one who gifted her granddaughters so she deserved it. I’ll never forgot how long my poor grandma cried. She only ever got the engagement ring back. She died when Leah and I were teens. \n\nOk, trauma dump over. \n\nI studied really hard and eventually was accepted to college, and then law school with a lot of scholarships. I met my husband who works as a financial advisor 7 years ago. We both are fortunate so our family is definitely very well off financially. Don’t want to sound like I’m bragging, just trying to show our situation clearly. \n\nLeah went to college as well and now works as a nurse. Her husband works at some office in sales. They make pretty good money as well. We live in the same area and still see each other often. \n\nMy husband and I can afford a very affluent lifestyle and that’s what we do. Our kids attend a private nursery and will attend private school after they out grow daycare. Our son loves race cars and we buy him many expensive toys and track setups. We’ll do the same with our daughters once they’re old enough to show clear interests. The kids constantly get new, high-quality clothes for any event they have. We’ve taken them on several fancy vacations and recently booked a cruise for next year. We have over-the-top birthday parties every year since the kids were just little babies. I know they probably won’t remember the experience but I still love to do it for the memories of my husband and I. I buy organic everything which can definitely get really expensive. We also have a housekeeper that helps watch the kids and can cook whatever they want to eat during meals and snack time. \n\nWe’re trying to be very careful and teach our kids to appreciate everything and understand that they’re very fortunate. We’ve explained that many kids aren’t lucky enough to live now as we do so they should be careful to not to become arrogant and put down other kids just because they don’t live like us. Our daughters are very sweet, but are a bit too young to tell if our message has sunken in. Our son is a very humble, kind, and polite boy. We’re extremely proud of him. \n\nLeah has expressed her disapproval of our parenting style before. Her kids attend public school (which is totally fine obviously) and have only been on one or two small vacations to the beach an hour away. They shop for clothes at goodwill and the younger kids mostly wear hand-me-downs. Her daughter doesn’t really like it because she has to mostly wear her older brothers’ boy clothes. She even goes to the soup kitchen to get ingredients for dinner (even though she can afford to shop). The kids also aren’t allowed to have birthday parties. They just bake a cake at home and maybe go the park afterwards. \n\nShe does love her kids and I’ve always just minded my own business and avoided commenting on her parenting style. I just wish she’d d show me the same courtesy. She’s made many snide remarks about how I’m “ruining” my kids for the real world because of how much I spoil them. She rants about how her kids living this frugal lifestyle will prepare them for the harsh reality of life. Her passive aggressiveness does annoy me but I don’t usually comment and try to be the bigger person. \n\nIt all came to a head a few days ago when I was talking to Leah about my daughters’ upcoming 3rd birthday party in few months. They love Disney princesses and have asked me to get them princess dresses for the party (or at least as much as toddlers can “ask” with their limited vocabulary). They aren’t huge fans of the princess dresses that you can just order premade or something. \n\nThey’ve even scribbled and colored a little drawing of how they want their dresses to look (colors, styles, etc). It’s mostly messy scribbles so I just observed it and tried to follow the requests as well as I could. A good friend pointed me towards a seamstress nearby that specializes in this sort of thing. I reached out and commissioned her. It’s expensive,  but she’s very talented and I know my girls will be overjoyed.  Yes I realize the girls don’t ‘need’ this. I don’t just give in to every single request I get. I just thought it was a really cute idea and my husband agrees. I wasn’t actively trying to make Leah upset, it’s just that we talk to each other about everything and I wanted to share my idea with her. \n\nLeah cut me off and asked how much it was. When I told her the price she rolled her eyes and started one of her classic monologues. It turned to a different direction when she started mentioning our childhood. She went on and on about how we would’ve killed back them to have any new clothes at all, forget about commissioned dresses. I got angry when she made some comment about how my daughters will grow up to become total brats who won’t deserve any sort of expensive dress with the way I’m raising them.\n\nI snapped and began yelling about how I’m sick of her projection. I’ve moved on from our past and she needs to work on her own issues instead of insulting my kids. She just wants our kids to suffer like us because she’s still bitter about everything. I won’t let my past affect my kids’ childhood, unlike her. I love to give my kids a luxury life because it brings me joy. I want to give them everything. Just because she’s projecting her trauma and suffering onto her kids doesn’t mean I have to do the same. \n\nShe began to cry and left immediately. She’s been ignoring my texts and calls ever since. Now I feel awful for lashing out. I feel like I should’ve just bit my tongue and kept my temper in check. We’re usually very close and I love her a lot. Most of my friends say I’m totally in the right and a few say I should’ve just ignored her and moved on. My husband was upset too, but says I should’ve just turned the other cheek because I’m the only one that could truly understand what she went through. I just got sick of letting her insult my choices and demean me as a mother while I usually minded my own business and avoided critiquing her parenting style before this. AITA?\n\nTldr: sis and I had rough childhood filled with poverty, now we both have families and make good money, I give my kids lots of expensive things while she has her kids live as frugally as possible, she insulted my parenting style and I snapped back that I won’t let my past harm my kids, unlike what she’s doing currently \n\nEdit: Hello, thank you all for the advice so far. I have a lot to think about. I’ve seen a number of comments questioning as to how well I know about her financial situation. We talk often and she has literally told me that they have plenty of income and don’t actually need to live the frugal way they do. There’s no problem with people working to save money so I never commented on it. It’s her life and I didn’t want to butt in. ",
 "created_utc": 1700810947,
 "permalink": "/r/AITAH/comments/182mmqd/aita_for_telling_my_sis_i_wont_let_my_trauma_hurt/",
 "score": 62,
 "url": "https://www.reddit.com/r/AITAH/comments/182mmqd/aita_for_telling_my_sis_i_wont_let_my_trauma_hurt/",
 "comments": []
}