{
 "submission_id": "182onqy",
 "title": "AITA for telling my husband we’re headed for divorce?",
 "selftext": "My husband and I have always been great at discussing our hurt feelings and moving forward together with consideration. He’s a mental health counsellor and I volunteer at a domestic abuse service so we’re both very comfortable and familiar with using kind language to discuss hard things.\n\nI have adhd and part of that includes sensory processing issues. My biggest challenge is overwhelming sounds, like if the tv is on and some in watching on their phone and the dog is barking it makes me feel like my brain is itchy and I can’t scratch it and it consumes my thoughts. I know I’m better at handling it than I used to but I’m not perfect, sometimes I still need complete quiet to recover.\n\nToday after dropping our son off at school together we both got back home. The morning had been chaotic and noisy and the school was busy and stressful too as there was a fundraiser on the playground today. The moment I sat down I wrapped myself in a blanket with my dog and started trying to wind down again. Usually when I do this my husband is starting work upstairs but today he started a little later. \n\nWhen he joined me I said “I’m just taking a few minutes to calm down ‘cause school was crazy” and he said okay. He played on his phone at the same time of clicking the tv on. His phone started a comedy video on full volume while YouTube on the tv started a gamer video. He snapped open a can of coke, chugged it and burped so loud. Then with the remaining little bubbles popping in the can were down my ear and the clashing videos with the applause on the comedy video and the screaming excited gamer, I obviously felt worse and my sensory issues were not improving because my routine was interrupted.\n\nI shook the can to pop the remaining bubbles, lowered the tv volume and asked him (with frustration in my voice) “can you please lower your phone volume or go to up work or something?” To which he rolled his eyes and said “I’m not arguing with you” with no intention to do anything about the noise. \n\nAfter about 10 seconds I said “(name) please, the noise is too much and I can’t calm down” to which he rolled his eyes and tutted, repeated himself “I’m not getting into an argument with you!…” and leaned away. \n\nFeeling ignored, I got up and went out to the kitchen and got a drink of water, and he followed me with his phone. When he tried to hug me from behind (phone in hand) I took this as him antagonising me, rather than apologetic how he probably meant it, since he had decided to ignore my request for quiet.\n\nI shook him off me and walked away again, calling behind me “keep rolling your eyes and not listening to me and *not arguing with me* and in 5 years all our stresses will have built up and we’ll just get a divorce instead of talking to each other”\n\nAll of a sudden he’s hurt and I’m the bad guy, whereas I feel like I was pushed to say something that would grab his attention. I don’t think you can act the way he has and expect someone to tolerate you, when they’ve expressed their needs clearly, married or not.\n\nSo, am I the asshole for jumping to divorce after my needs being ignored?\n\nEDIT: \n\nthe bedroom is also the office, he needed that space shortly so I was in the most appropriate space to take my time to regulate, and I could have done that if my husband had been mindful after I told him what I needed.\n\nAnyone with ADHD knows what it’s like to be disregulated, and while I’m not medicated (and dont need to be) I implemented my coping strategies as I always do which is the only course of action.\n\nEDIT 2: \n\nFor everyone concerned about his drink, he had finished it. I shook the empty can so that the last few drops would stop popping in the now empty can. He enjoyed the whole can. \n\nAlso for those of you who think it’s a communication issue, unfortunately my husband is not telepathic (bummer right?) so as soon as you suggest a better way to articulate myself other than using plain language like I already did, I’ll take it into consideration \n\nUPDATE: \n\nRather than sit and annoy each other I went for a walk and to do some errands (yet another strategy I executed to give us time and space). He has since text me and apologised, explaining that he didn’t mean to be antagonistic (as I already knew) and that he didn’t understand the gravity of my needs in that moment. I also apologised for tempting fate bringing up divorce, even though he admitted he knows it’s not really something I’m considering. We’re going to talk properly later on",
 "created_utc": 1700819330,
 "permalink": "/r/AITAH/comments/182onqy/aita_for_telling_my_husband_were_headed_for/",
 "score": 188,
 "url": "https://www.reddit.com/r/AITAH/comments/182onqy/aita_for_telling_my_husband_were_headed_for/",
 "comments": [
  {
   "comment_id": "kajsk12",
   "message": "INFO: is this the first time something like this has happened, or is it a pattern with him?\n\nOkay after getting a bit more info, NTA. He is refusing to communicate with you about a recent pattern of behaviour that he’s exhibiting that he knows is not good for your sensory issues/shows a disregard for your needs. He should be aware of how his actions and lack of communication can lead to detrimental consequences. If he refuses to communicate, then a statement as jarring as what you said may end up being the only type of thing that will get him to start actually talking to you about the issues. It’s not like you threatened to divorce him then and there, you warned him about the road that the two of you were heading down if communication continued to be shut down like this.",
   "created_utc": 1700820149,
   "score": 96,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak2r1q",
   "message": "NTA. You clearly expressed a need (more than once!) and he refused to meet it. His feelings are hurt because what you said snatched him out of his bubble. I’ve done the same to my spouse. He questioned my level of exhaustion and visible frustration. I sighed and said “It’s just hard being a single parent when you’re married.” Made him stop ignoring the kids for his video games for a bit.",
   "created_utc": 1700828243,
   "score": 20,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kajyjd0",
   "message": "NTA when you have sensory processing disorder and you are in overload and your partner blatantly ignores this its extremely hard to not react the way you did, frankly you did really well for the situation\n\nMost people here wont understand how intense sensory overload is, but it can be excruciating (as in actual pain) and your partner reacting/acting so selfish and inconsiderate is just a jerk move\n\nYou tried to remove yourself from the situation and he followed you with his damn phone blasting",
   "created_utc": 1700825117,
   "score": 197,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kajw3p5",
   "message": "NTA\n\nYou explained your situation. \n\nYou asked for things too be less loud, but he didnt care and acted like you were an annoyance. \n\nYou removed yourself from the situation but he came after you.",
   "created_utc": 1700823128,
   "score": 54,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kajyfx5",
   "message": "NTA. Girl you described my personal sensory hell so I can very much imagine how you were feeling. Bringing up divorce probably wasn't great, but tbf you were pointing out how things like this can lead to divorce and not just threatening to get a lawyer tomorrow. \n\nSomething needs to happen here. For sure a long talk, but maybe marriage counseling too. Your husband just repeating \"I'm not arguing with you\" while antagonizing you is not acceptable.",
   "created_utc": 1700825042,
   "score": 197,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalb4i7",
   "message": "Loop earplugs - comfy and don't block the sound completely. \n\nI have adhd and Dyspraxia, I completely understand needing queit decompression time but also you need to try and find a coping mechanism you can control.\n\nSometimes our loved ones are noisy and irritating and sometimes we're naggy back to them. Try and find a happy compromise or a little space thats just yours.",
   "created_utc": 1700849052,
   "score": 23,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak0vch",
   "message": "NTA - Also wtf is wrong with him that he has to have the TV on AND his phone blaring out some screaming manchild gaming bro AFTER YOU JUST SAID YOU NEEDED QUIET TIME?\n\nDoes he not know what words mean?",
   "created_utc": 1700826911,
   "score": 22,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kajymy6",
   "message": "NTA\n \nBut I have questions for men reading. Why tf do you guys do this shit?! I've had to tell my husband on occasion to knock off an annoying behavior that he does SPECIFICALLY piss me off. One day, I sat him down and told him I was ready to walk away if he didn't stop going out of his way to antagonize me. You know what his response was? \"Oh, I'm just playing, I'm just giving you a hard time.\" He didn't have an answer for why he thought pissing me off was supposed to be fun for me. Wtf do you think we enjoy this?!?! You think our lives are so damn easy and perfect that you deliberately fucking with us is fun?!?!It's NOT fun. You're NOT funny. And these fuckers honestly have the audacity to get upset when they finally succeed at pissing us off after they admit that was the intention!!! Its like they never made it past elementary and we actually have to sit the fools down and tell them its not appropriate and it never was.\n\nYou very clearly told him you were overwhelmed, you told him you wanted quiet, you even removed yourself from the annoyance! And then he wants to invade your space and come in for a hug while still being an annoyance AND after a response clearly custome designed to egg you on? And he's hurt?!?!Can he possibly make himself the victim anymore?",
   "created_utc": 1700825197,
   "score": 77,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakc2ps",
   "message": "NTA. He's literally chasing you through the house blasting his phone and saying, \"I'm not arguing with you.\"\n\nWhat does that even mean? Is it therapy speak for \"I have a right to do anything I want to you and you do not have the right to get away from me?\"\n\nI worry that this guy works with clients.",
   "created_utc": 1700833807,
   "score": 111,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalpmrh",
   "message": "ETA: apologies for the long ass post, holy shit lol \n\n i’m kinda leaning toward ESH. your husband for obvious reasons, he was being antagonistic and there doesn’t seem to be a clear reason why, other than that he just didn’t feel like dealing with the “quiet time” thing right before he went into work. he wanted to do something to make himself comfortable and relaxed before spending the next 8 or so hours working and probably being moderately stressed out - perfectly reasonable, but he didn’t have to be a dick about it. \n\nBUT, i am curious as to why his first response to you asking (irritably, by your own telling) for him to turn the volume down was “i’m not arguing with you.” is this something that often turns into an argument? if he usually respects these requests, then there shouldn’t be any reason for the request to turn into an argument, but his response tells me there’s an established pattern of arguments arising from the quiet time issue. i think more context is needed here to be able to judge his statement properly. also, OP, i know you said the house is small and you didn’t really have anywhere else to go to get away from the noise, that’s understandable. but why then, when you know you have this issue, have you not gotten yourself some noise canceling headphones or even just earbuds for this sort of thing? you know that you are neurodivergent and you experience sensory overload and that you need quiet in order to recharge, but you haven’t taken measures to ensure that you can take care of yourself regardless of what the rest of the household is doing despite the fact that those measures are readily available. \n\nthat’s where i think ESH - bc while he’s being a dick, it’s also exhausting to have to move around somebody else’s very specific needs for quiet while you’re just trying to go about your day in the way you’re comfortable. i’m also a person who is neurodivergent and gets agitated with a lot of noise (i have pure OCD, so all of my rituals and compulsions happen in my head ON TOP OF the intrusive thoughts, and i get agitated when i can’t do my mental compulsions bc i keep getting interrupted by noise and talking) while my husband needs a lot of background noise in order to help him be comfortable and be able to think, so i get what you’re going through. but ultimately, it’s much easier for you to put on some noise canceling headphones to get your quiet time than it is for him to just drop everything he’s doing or leave the room bc you don’t want him to be noisy at that time and i’ll explain why: you were irritated by the sound of bubbles in a can. so even if he had turned the volume down on the tv and phone but still loud enough for him to hear it, that still wouldn’t have been good enough, bc clearly what you needed WAS complete silence. and yes he could have left the room, but he obviously wanted to be near you at the time even if you two weren’t actively doing anything together. since you pointed out patterns that can lead to divorce, allowing your ADHD to make you pissed off and push your partner away when they want to be around you even if it’s just to do your own thing in the same room together will also lead to divorce eventually. \n\ni’m not saying neglect yourself, i’m certainly not saying to tolerate disrespect from your partner, but i am saying to be reasonable and recognize that your unique mental health needs are primarily for you to take care of, so get some noise canceling headphones so you can have your quiet time and still spend time with your husband during his “noisy time” without creating animosity and resentment toward each other.",
   "created_utc": 1700854948,
   "score": 9,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak9uzz",
   "message": "There's a big difference between, \"if you don't stop we're getting a divorce\" and \"this new behavior will lead to divorce in five years.\"  The first is a threat with a sense of urgency and immediacy that conveys control and manipulation.  The second is a more measured, informative tone.  \n\nYou basically told him that, over time, his actions will create a home/relationship where your mental health will deteriorate to the point where you will need to jettison him for the sake of your own health.  While poorly phrased, the intent was educational.  NTA",
   "created_utc": 1700832625,
   "score": 83,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakln38",
   "message": "Noise cancelling headphones.",
   "created_utc": 1700838454,
   "score": 71,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak4kjv",
   "message": "\"i am not getting into an argument with you\" might be a good tool in some high conflict situations where you need to deescalate. Using it as a reply when your overwhelmed wife asks you to reduce the stress you are causing her is bordering on abusive, even if not meant that way.\n\nYou are so much NTA here. He is really inconsiderate and not at all listening to you.",
   "created_utc": 1700829464,
   "score": 115,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kajzpfl",
   "message": "*You're NTA and anyone here saying otherwise or claiming its a communication issue when you literally tried to communicate with him only to be blown off and not only ignored but pursued by the problem* is an idiot.\n\nPretty sure this antagonistic method of abuse/malicious thoughtlessness/maladaptive attention seeking behavior etc is called 'Water torture'. You get needled and fucked with until you blow up and they act hurt and treat you like you're a monster. Suddenly, you're the bad guy.\n\nAnd he's not stupid. He did all that on purpose, just so you know.",
   "created_utc": 1700826032,
   "score": 176,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak88ve",
   "message": "Have you tried noise cancelling headphones?",
   "created_utc": 1700831717,
   "score": 29,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakceaw",
   "message": "NTA. He’s pushing and pushing and then playing the victim when you start getting upset and showing what could be consequences. My guy does this too. Set a boundary and then loves to cross it. When you blow up or push back, makes you the bad guy. *surprised pikachu face ensues*. This is not you making a threat to me either. This is you being clear that how him continuing to ignore and antagonize even if small ways could build with time. I think he’s more made about being called out. \nHe’s acting like what you are asking for his a big deal when it’s so easy to fix. He can go into another room or let you go into another room. He can get headphones. He can give you and hour to calm down before doing all of this. There are so many things he could do. He just wants to do what he wants to do and make you deal. Fuck your needs in his eyes.",
   "created_utc": 1700833973,
   "score": 37,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal7ykb",
   "message": "You're asking reddit if divorce is the answer. You know what the replies will say.",
   "created_utc": 1700847784,
   "score": 6,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalh0cg",
   "message": "girl, you have misophonia. Invest in some noise cancelling earphones (over the ear, so he can see them) and dub them the “cone of silence.” That, a blanket and maybe even a sleep mask will get you calm when overstimulated.",
   "created_utc": 1700851438,
   "score": 6,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kamml0l",
   "message": "He apologized🎉 and was understanding later on🎉 without escalating the situation or making you apologize first 😍🎉\n\nI'm jealous. My emotionally volatile husband would escalate the hell out of that little situation.",
   "created_utc": 1700868481,
   "score": 6,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalnz24",
   "message": "I don't get it. Why would you not go into a room where you know you won't be disturbed? It's also unusual that you don't have easy access to noise cancelling headphones. He was being kinda of a dick, for sure. But sounds like you're both getting a bit fed up with each other.",
   "created_utc": 1700854281,
   "score": 13,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakfu1t",
   "message": "Bose noise canceling headphones on your Christmas list. This will give a visual to others when your sensory is challenged.",
   "created_utc": 1700835717,
   "score": 14,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakxrgo",
   "message": "I’m on the spectrum, please get a Bose noise canceling headsets.",
   "created_utc": 1700843634,
   "score": 14,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal7ode",
   "message": "INFO. Why couldn’t you leave the room? If the noise was too much that would be the easy solution.",
   "created_utc": 1700847671,
   "score": 15,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal5zm0",
   "message": "Noise Canceling Earphones 😒",
   "created_utc": 1700846996,
   "score": 6,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak3zsu",
   "message": "Who tf turns on the TV at the same time as playing videos on their phone?  Madness.",
   "created_utc": 1700829092,
   "score": 48,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak4kwh",
   "message": "YNTA but maybe you should invest in a good pair of noise hands canceling headphones… It’s done wonders for my marriage as someone who also struggles with similar issues. Like I’m easily irritated, or distracted by what’s going on, but when I have those on, I can calm down or focus on things I need to do so much more easily by by drowning out background noise.",
   "created_utc": 1700829471,
   "score": 42,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal0kuv",
   "message": "You say in your post you don’t require medication but you might need some reconsideration in that.",
   "created_utc": 1700844792,
   "score": 18,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal12hj",
   "message": "ESH, there's enough you put in to make me want to hear his side of the story",
   "created_utc": 1700844993,
   "score": 18,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal8p09",
   "message": "You sound like a handful",
   "created_utc": 1700848079,
   "score": 15,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalayg8",
   "message": "As a fellow therapist who works with a lot of couples, using the word divorce often is expressed in order to manipulate. For that, don’t use that word in the future.",
   "created_utc": 1700848982,
   "score": 16,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalkz66",
   "message": "I have all the same issues and I think you went nuclear and that’s a bell you can’t really unring. So yeah I think soft YTA because sometimes, as hard as it is we have to just swallow our own issues for the good of the situation and find a way to cope. He clearly wanted to be near you (hence sitting with you AND following you) and maybe that was HIM trying to regulate as well but you made it all about your own needs and that’s simply unfair. I know it sucks but we don’t always get perfect solutions to our sensory needs, as an adult in a committed relationship, you need to find a way to modify your issues to support him as well. Divorce is a big threat and now you’ve put it out there, things will never be the same.",
   "created_utc": 1700853070,
   "score": 15,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalpt60",
   "message": "Yeah you clearly escalated the situation far too much. YTA.\n\nYour husband did what exactly? Drank a soda? And watched a video on his phone in the living room? Then hugged you to apologize? \n\nThat sounds mildly annoying at worst, I'm sorry you have sensory issues, but maybe this is something to see a doctor about and not threaten your husband with divorce.\n\nThink about it from his perspective too - he wanted to spend time with the person he loved most. He sat next to you to unwind also, had something to drink, then when he realized you were very upset he tried to hug you to make you feel better and you threatened divorce",
   "created_utc": 1700855022,
   "score": 15,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kam65bb",
   "message": "YTA. And why can’t you just wear noise canceling headphones?",
   "created_utc": 1700861536,
   "score": 16,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal6fkm",
   "message": "You sound exhausting to be married to",
   "created_utc": 1700847174,
   "score": 31,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kala03u",
   "message": "YTA MAJOR YTA. ADHD doesnt cause the sensory issues you describe and youre full of shit. I have ADHD, my whole family does, and my youngest sister yells at us for chewing chips but doesnt yell at anyone else. It was never an issue at school. I think youre the same way. I feel so bad for this dude holy fucking shit, you are so full of shit you must taste it.\n\nOh wow, youre also not medicated? Look at how bad my ADHD is! Im not addressing it and being mean to my partner and pushing through his boundaries but I dont need to work on myself at all!!!!\n\nThis guy should view this whole scenario as a MAJOR red flag. Youre manipulating him. Way to make your shitty self control his problem.",
   "created_utc": 1700848599,
   "score": 12,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalyrx3",
   "message": "Lots of N-T-A but YTA. I have ADHD and it’s our job to figure it out. It’s not our partners jobs to get out of our way, nor is it there job to evacuate from common spaces when we are overwhelmed. \n\nIf you are done, you need to move. Our issues are ours and ours alone.",
   "created_utc": 1700858600,
   "score": 25,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kaky55y",
   "message": "As someone whose wife has similar issues, yes, he was a jerk in this scenario. But also, it’s really really exhausting having to walk on eggshells and make adjustments for the disordered person all the time, and sometimes it can be easy to forget and slip back into behaving how we did when we were younger and a little bit of noise was just a part of family life. It also sucks that we get held to account for our failures, but the other person has the ol’ mental illness get out of jail free card for threatening divorce and whatnot. I will say that her stopping all alcohol and doing meds have helped my wife and our relationship quite a bit. But also, she stays away from stuff like school fundraisers that she knows will fuck up her nerves all day.",
   "created_utc": 1700843791,
   "score": 11,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kam6xgt",
   "message": "ESH.\n\nYou're NTA for having needs and explaining them, sure, but I'm tired of people thinking just because they have defined and labeled their mental struggles it lets them off the hook for any maladaptive behavior that stuff causes. \n\nNo, it's not normal for an ADHD person to snap and threaten divorce after doing the strenuous mental gymnastics of *checks notes* their normal morning routine? Their domestic partner being loud? \"I'm not medicated and I don't need to be\". Stop. I'm not your doctor and I won't diagnose and prescribe medication on Reddit but you need SOMETHING. You are not functional and you, as a mental health worker, should know that long before you come to reddit looking for validation. Get your head together.\n\nAnd yes, he sounds like a total chore. He sounds like an obnoxious twat. But drinking soda and watching two videos at a time aren't crimes and they aren't grounds for divorce, ffs. He sounds like he's needy for attention and he's not getting any because his partner has to shut down for two hours every time they leave the house otherwise they threaten divorce.\n\nSource: I'm as ADHD as they come, medicated under the supervision of a wonderful psychiatrist, with the same types of overstimulation patterns that OP describes, and not once have I ever threatened drastic, hurtful things like OP did when I felt overwhelmed. I, a grown man in his 30s, have cried in the middle of a Saturday morning farmer's market because there were just too many sounds. But I didn't get vindictive with anyone and I certainly didn't come to reddit to validate my behavior. According to OPs logic, I should have snapped and started threatening people. \n\nYou both sound like you need to grow up. Maybe separately, because clearly you aren't good at being supportive of each other. Get some earplugs and a sleep mask, set some boundaries, and if he can't respect them then move on. That's called a relationship, and getting 3000 redditors to tell you you did nothing wrong isn't going to help it.",
   "created_utc": 1700861851,
   "score": 13,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal1mm8",
   "message": "YTA, for even mentioning divorce, it doesn't matter how you word it. It was uncalled for divorce, and even the possibility of future divorce is not something that should be used for shock value. How would you feel if he said if you don't get a handle in your reactions, he sees a divorce down the road? \n\n Instead of expecting the world or household to quiet down for you when you need it. Why not be proactive and get some noise canceling headphones. As someone who gets over stimulated easily, it's my job to block out my triggers. Not my families job to stop their life until I feel better.",
   "created_utc": 1700845220,
   "score": 20,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalkgq9",
   "message": "Throwing the D word out in a fight is manipulation. You need to apologize.\n\nYTA",
   "created_utc": 1700852861,
   "score": 17,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakyl47",
   "message": "Dismissing your partner’s needs is the fastest way to end up at the divorce attorney. Being by yourself ends up being easier then dealing with that shit.",
   "created_utc": 1700843976,
   "score": 11,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalmih1",
   "message": "Honestly, I would be pretty annoyed if My Wife tried push me out of the living room “ because it’s the only place I have” \n\nSounds like you need to fix that part because it’s probably part of the reason why he’s getting a little bit more snippy. I can’t imagine never getting the opportunity to sit in the living room because I’m expected to run up to the bedroom to work..\n\nI certainly can’t imagine, knowing I have to adhere to only your needs when you’re having a bad day.",
   "created_utc": 1700853690,
   "score": 9,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kak1dfy",
   "message": "NTA. The least he could do is buying you noise cancelling headphones if that helps you, or headphones for himself so that definitely would help you.\n\nHis neglect of your condition and feelings is baffling. Does he even love you?",
   "created_utc": 1700827278,
   "score": 28,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalb8zk",
   "message": "Bringing up the D-word in a marriage shouldn't be something taken lightly, especially when the situation described is about a can of soda.\n\nMarriage is a whole experience of internal suffering and learning to swallow pride and emotions when the situation calls for it. Couples who have been married for decades know this to be true; it isn't roses and candy corn all the time. It's WORK and part of that work is actually suffering a bit yourself so that you both avoid nuclear meltdowns but take a little damage yourself. \n\nIf, for example, you're willing to verbally threaten divorce after he's pushed your senses to the brink (yes, he's being an asshole), then what other recourse do you have if you catch him doing something significantly worse? \n\nIn our worst fight, my wife called me \"a bitch\". When we finally calmed down and could talk like human beings, I told her that needs to be the last time she calls me that word. I mentioned that she cannot call me something that could lead another man to a violent end if he were to call me that. I'm glad she understood and has never said it again. No, I've never laid hands on her; but being called that in the moment was the closest I've ever considered it. She's also used \"divorce\" one time, to which I later said she'd better not be bringing up something so final just to say it in the heat of the moment. Were we fighting over me cheating? Her cheating? Money issues? Sexual problems? No. It was over some bullshit that I can't even fully remember, but likely just miscommunication.",
   "created_utc": 1700849102,
   "score": 9,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakk6i0",
   "message": "If you don't want to hear anything then why don't you put on hearing protection or noise canceling headphones instead of expecting the world around you to be silent?",
   "created_utc": 1700837777,
   "score": 6,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakylnc",
   "message": "You need a safe word for noise",
   "created_utc": 1700843982,
   "score": 7,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakz937",
   "message": "NTA, that was some pretty blatant disrespectful behavior from him. You had a need. You communicated it and established a boundary. When you enforced the boundary, he violated it again.",
   "created_utc": 1700844248,
   "score": 6,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kammbcu",
   "message": "Everybody needs to shut the fuck up about adhd, it’s not a big deal. I was diagnosed years ago and I take meds for it daily, but when I don’t I’m not a complete useless baby like this or the people on r/adhdwomen\n\nI didn’t read past the ADHD bs but I’d be comfortable wagering that you are an asshole. Get real",
   "created_utc": 1700868357,
   "score": 8,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kam9cgg",
   "message": "YTA  never bring up divorce unless you are serious.",
   "created_utc": 1700862844,
   "score": 10,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal96ff",
   "message": "YTA.\n\nYou squatted in a common area and asserted your needs were more important.\n\n“while I’m not medicated (and dont need to be)\n\nWait, so which is it? You can’t have it both ways. Either your ADHD is a problem or it isn’t.",
   "created_utc": 1700848269,
   "score": 26,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalop9f",
   "message": "You seem a bit exhausting. \n\nYour ADHD creates a dynamic where your needs and wants will always trump his therefore he at times is tired of prioritizing your numerous needs over himself. Nothing he did was out of the ordinary yet being with you creates a non-normal environment. \n\nYTA becasue not only must he prioritize you all the time due to your sensory issues he also has to think of everything he does from a noise perspective due to either a bodily function noise to drinking a can of soda. \n\nThen you use divorce and a source of hurting his feelings?",
   "created_utc": 1700854573,
   "score": 22,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kal2e7n",
   "message": "I have similar sensory overload issues in a chaotic environment, and this is something that my ex struggled to understand.  Some people have a hard time separating \"I want to be by myself\" from \"I don't want to be with you\".  Although if he knows that you have this issue, you told him you need a bit of quiet, and he's ignoring it, then he deserves the end result.",
   "created_utc": 1700845533,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalagc3",
   "message": "It happens. My gf has ADHD and I know how much she needs her winding down time and how much she can have ADHD rage about random sounds which sometimes include my breathing.   \n\n\nAs long as you guys have good conversation, there is nothing to worry about.",
   "created_utc": 1700848779,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalf7oe",
   "message": "NTA — but in fairness, no one is TA here. I have ADHD as well and the way I describe it is when I’ve hit my limit I need space. Sometimes it’s hard to convey that and if someone isn’t aware of it it’s like I’m hot lava and any attempt interact with me at that moment is like trying to stick your hands in lava …you’re going to get burned. \n\nAnd of course, in that moment, I may not be able to convey properly that I’m over stimulated. \n\nWhen I’m at home in my normal surroundings, sometimes I just step on my yoga mat, surrendering to child’s pose, lay on my back or cross legged seat, close my eyes and my family knows I’m on my island and to let me be for a bit. \n\nThis is my go to phasings: “I am overwhelmed. I need a few minutes to  _________ (reset, find balance, regain homeostasis).",
   "created_utc": 1700850705,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kalkfn2",
   "message": "Hey OP have you tried ear plugs like [Loop](https://www.loopearplugs.com/pages/earplugs-for-adhd)? they can help with noise sensory issues.\n\nThere are different levels as well, so you can still talk and listen to people, but be less overwhelmed by the noise around you.",
   "created_utc": 1700852848,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kamgqfk",
   "message": "Comedy video on phone plus YouTube gamer stream plus chugging soda? Lmao this guys brain does not have a microgram of dopamine left.",
   "created_utc": 1700865923,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kamhod1",
   "message": "You said it yourself, you are the bad guy.\n\nYou are an adult, marriage is about compromise, and nobody is perfect, he realised it and tried to apologise, you realised it, but did you apologise?\n\nTbh, I think Reddit is a crap place for this sort of thing as it just reinforces selfish behaviour most of the time or overly reacts to very little information.",
   "created_utc": 1700866326,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kamil6d",
   "message": "If I were your husband I would demand you get on meds or I would have to leave , that sounds crazy and not because of him",
   "created_utc": 1700866713,
   "score": 3,
   "submission_id": "182onqy"
  },
  {
   "comment_id": "kakgg9k",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "182onqy"
  }
 ]
}