{
 "submission_id": "182tj1y",
 "title": "AITA (32m) for hooking up with one of my cousin's friends (22f) at her birthday party instead of the one (31f) that my cousin tried to set me up with.",
 "selftext": "So I am older than my cousin she is 23, and I am 32. She asked me if she could have her birthday party at my apartment. The plan was they were going to pregame at my spot then go out to some club.\n\n  \nAt the party I am playing bartender. Woman call her Kara (30-32)  starts talking to me. (Prior to party cousin told me Kara has a crush on me) Kara is not my type but I was open to meeting her. But her way of talking to me was just asking me questions about my job, and then showing me pictures and telling me about her dog. Like \"{dog\\_name} needs a new dad, but he knows how to tell if a guy is good! he has better judgement than me!\"\n\n\u0026amp;#x200B;\n\nThe group is about to head out and  my cousin and the group begs me to come. I come. At the club one of the girls from the party approaches me call her Ashley (23). Ashley and I have matched on dating apps multiple times before but she never responded to my messages. But here she starts flirting with me first.At about 1:30AM Kara comes up to me and starts saying she is drunk not feeling well and that she wants to crash at my apartment (She lives in Jersey). I tell Ashley and my cousin that I’ll take Kara home and to enjoy their night. But Ashley is like oh I’ll help you. Long story short. Kara crashes on my couch and Ashley shares my bed with me.\n\n\u0026amp;#x200B;\n\nThe next day my cousin’s friends see me as a giga Dbag. Apparently, when Kara was saying she is drunk and wants to crash at my spot that was her way of asking me to take her home. And she told my cousin and her friends that I was into her that I was asking about her dog. I did not perceive it that way at all. Now this drama is spreading within my family that I hooked up with one of my cousin's friends and it has gotten really tough.",
 "created_utc": 1700836747,
 "permalink": "/r/AITAH/comments/182tj1y/aita_32m_for_hooking_up_with_one_of_my_cousins/",
 "score": 134,
 "url": "https://www.reddit.com/r/AITAH/comments/182tj1y/aita_32m_for_hooking_up_with_one_of_my_cousins/",
 "comments": [
  {
   "comment_id": "kakxb95",
   "message": "Someone trying to hook up with me by saying their dog needs a dad would be an instant turnoff. For several reasons.",
   "created_utc": 1700843445,
   "score": 238,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal15si",
   "message": "“I’m drunk” = I cannot consent to hooking up\n\n“I’m not feeling well” = prioritise getting me home safely, don’t even think about making a move while I feel like crap\n\nNTA - I’m sure it’s upsetting to Kara that the person she fancies openly pursued someone else (a much younger woman too) in front of her but it’s clear that you two weren’t clicking.\n\nEdit: and Kara, sorry love, but you have zero game",
   "created_utc": 1700845029,
   "score": 63,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakk2gz",
   "message": "NTA. You're not obligated to hook up with someone you're not into. Just because you engage someone in conversation, doesn't necessarily mean you're into them. If the vibe isn't there, it's just not there. And her pretending to be drunk and saying it means take me home is very childish and would really only work on guys who don't mind taking advantage of drunk girls. The way she behaved and then the name calling is immature and you honestly dodged a bullet.",
   "created_utc": 1700837726,
   "score": 133,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakyzx9",
   "message": "You would have been the asshole for hooking up with a wasted girl who wasn't feeling well.\n\nNTA",
   "created_utc": 1700844145,
   "score": 147,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakycdm",
   "message": "“I’m drunk and can’t get home” **is not an invitation for a hook-up**. If you sleep with someone who says that, then get accused of rape, everyone who heard her is going to testify against you.",
   "created_utc": 1700843876,
   "score": 177,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakn29f",
   "message": "[removed]",
   "created_utc": 1700839092,
   "score": 40,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal3181",
   "message": "Question: So was Kara sober in the other room while you were hooking up with Ashley? Or was Kara actually drunk and expecting you to take advantage?",
   "created_utc": 1700845794,
   "score": 63,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal05ci",
   "message": "Your cousin and her friends thought letting their drunk friend throw herself at you while drunk, then use drunkenness as an “excuse” to hook up rather than actual words was a good idea? NTA. And please explain to your cousin why this was a bad plan so they don’t do it again. So many mixed messages, no candor, deception, and a lack of culpability make for a very risky situation for everyone.",
   "created_utc": 1700844616,
   "score": 141,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal0dbj",
   "message": "NTA. Not sleeping with a human saying \"I'm drunk\" is the most correct thing another could do. You also weren't into her anyways. If you lead her on that'd be a dick move.",
   "created_utc": 1700844706,
   "score": 45,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakvc5z",
   "message": "Dude you are NTA. Reverse the genders and kara would be a creepy dbag. \n\nYou are a single man and free to hook up with whoever wants to hook up with you, or not.\n\nGuys dont pick up on subtle hints from women. Its a dangerous game to assume “i feel sick and need to crash” means “ i want u to take me home and do me”. Thats incredibly dangerous for a guy.",
   "created_utc": 1700842623,
   "score": 105,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakrj88",
   "message": "I would tell cousin \n\n1 you choose your hook ups\n\n2 your not responsible for Kara’s delusions \n\n3 (optional) you didn’t ask her to be a pimp",
   "created_utc": 1700841018,
   "score": 105,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakzy8p",
   "message": "NTA, informed enthusiastic consent is necessary for any ethical human to engage in sexual contact. her telling you she's drunk and doesn't feel well takes that out entirely. \n\nI would text your cousin something along the lines of\n\n\n \"____ will need to learn better communication if she wants a good man, because only a poor excuse for one would take home a woman who's too drunk and sick to be out with the idea of getting something from her. Admittedly I am sorry if i gave her the impression I was into her, I know she said she's looking for a new Dad for her dog but I'm not going to be it, and she may not want to tell guys that when she first meets them.\"",
   "created_utc": 1700844535,
   "score": 86,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalcp0a",
   "message": "\u0026gt;{dog name} needs a new dad, but he knows how to tell if a guy is good! He has better judgement than me\n\nYeesh",
   "created_utc": 1700849685,
   "score": 25,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal19rv",
   "message": "NTA\n\nNot very smart to use this as a pick up line, guessing more people than you heard why she wanted to leave. If you had sex it could make you look very bad very quickly. Even if she was completely sober",
   "created_utc": 1700845075,
   "score": 17,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal1b9n",
   "message": "Saying you are drunk is not a great strategy to get a man into bed nowadays., if you know what I mean....",
   "created_utc": 1700845091,
   "score": 17,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakinh2",
   "message": "NTA. You're all adults who can make decisions and who you hook up with isn't anyone's business.",
   "created_utc": 1700837069,
   "score": 96,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaksyi9",
   "message": "NTA\n\nKara sounds desperate.  NEVER hook up with someone who is desperate.  It never ends well.\n\nYou and Ashley hit it off.  End of story.\n\nYour friends are wrong.",
   "created_utc": 1700841623,
   "score": 83,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakuwlb",
   "message": "Ask your cousin if you banging Kara will make her feel better. See if that helps.   Rofl\n\nSeriously, I would just politely tell your cousin that you weren't into Kara and didn't want to lead her on. \n\nDepending on where things are with the other girl,  either tell her it just kind of happened or that you really like the other girl\n\nNTA",
   "created_utc": 1700842443,
   "score": 38,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal1vtd",
   "message": "NTA - your cousin was trying to push the \"friend\" that was more at the settling down stage and is upset you went with the party-friend instead.",
   "created_utc": 1700845327,
   "score": 11,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalinvh",
   "message": "Obviously NTA but man what a shit night Kara had. First get rejected by her crush, than tries a super dumb move and still get rejected to lay on a couch knowing (and maybe hearing) that your crush is in the room next door banging someone else",
   "created_utc": 1700852117,
   "score": 22,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakt7bn",
   "message": "These people sound too young for you.  Even the 32 yo.",
   "created_utc": 1700841726,
   "score": 143,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal1jnw",
   "message": "I hate when someone says, “I’m drunk and need a place to stay” and they mean “let’s go to your place.” It’s not the same thing. Also, your cousin wanted you too hook up with her friend, just the other friend. so she isn’t mad about that, she’s mad she lost control of the situation and couldn’t choose.",
   "created_utc": 1700845187,
   "score": 16,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalj854",
   "message": "NTA, but I wouldn’t fuck around with friends of family. Things can get too weird…",
   "created_utc": 1700852351,
   "score": 9,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal2dfu",
   "message": "Think for a second… they are mad at you for a. Not giving a chick a pity fuck or b. Not taking advantage of someone. It’s gross. \n\nNTA. You are free to have sex with whom you choose, not who people want you to.",
   "created_utc": 1700845524,
   "score": 20,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaky1oz",
   "message": "I mean look, you’re a guy in his thirties that got all fucked up with them so some of the group that are in their early twenties probably already think that you are a giga dbag, and not their peer. the ones that saw you not go for the age appropriate person your cousin tried to fix you up with and then nail someone in their peer group think it even more.  You aren’t an ah but you have to rethink how you are likely perceived here by your cousins friends and how it looks to your family that also probably do not see you and your little cousin as peers.",
   "created_utc": 1700843752,
   "score": 59,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalkdvs",
   "message": "For not making out with Kara you are N T A. \nFor making out with Ashley, you are N T A, although 10 years at 20 is a bit creep, but ok. \n\nFor making out with Ashley while knowing that Kara had a crash on you next door to Kara, you are TA. This was very inconsiderate. \n\nFrom Kara, pretending to be drunk to make out isn't very cool, her dog thing was weird too, maybe she was very nervous or whatever. But even though this behavior might have turned you off, it is no excuse for your behavior. You could have gotten Kara a car to your cousins place or met another time with Ashley. Imagine you have a crush on a girl, and she makes out with another guy and you have to endure it all the time.",
   "created_utc": 1700852829,
   "score": 25,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal6tai",
   "message": "\"I'm drunk\" was code for \"take me home and let's hook up\"???\n\nHere I have lived my life to believe the total opposite. If a chick is saying she is drunk and not feeling well, she is not able to consent. You are not the AH here",
   "created_utc": 1700847326,
   "score": 12,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalc7ah",
   "message": "NTA,\n\nFirst off you are under no obligation to hook up with someone just because they are into you. If the situation were reversed and a guy was into a women would anyone expect the women to sleep with him just because of that? Of course not!\n\nSecond, Kara told you that she was drunk. At that point there would be ZERO chance that I would do anything sexual with her. I would give her a safe place to rest, a bottle of water, and a clear path to the bathroom in case she needed to vomit.",
   "created_utc": 1700849487,
   "score": 12,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaku5nq",
   "message": "NTA, but dude, you need to find your own girl and not depend on your almost-decade-younger cousin for hookups because it always leads to drama. Always respectfully decline.",
   "created_utc": 1700842130,
   "score": 119,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kane5gg",
   "message": "NTA. Chick said she was drunk, this is a full stop scenario. If she uses this as a ‘signal’ to take her home, massive red flag and legal risk for any guy involved. Run from that one. Keep having fun with Ashley.",
   "created_utc": 1700881254,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal73e8",
   "message": "Why didn’t you have your cousin take her drunk friend home to their place instead of you since you were planning on sleeping with the other woman?",
   "created_utc": 1700847437,
   "score": 14,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kam1cfs",
   "message": "NTA.\n\n1. If family says you shouldn’t have hooked up with your cousin’s friend, explain that because your cousin had given her blessing on you dating one friend, you assumed that meant you could date her friends.\n\n2. Kara made it clear that she was unavailable (at least for that night) the second she said she was drunk and not feeling well. Ask your family if they’re suggesting you should have come on to someone who couldn’t consent and had said she wasn’t feeling well.\n\n3. You still ensured Kara was safe: you not only got her someplace safe, you *let her crash at your place.* That’s incredibly generous.\n\n4. Ask how you should have conveyed your disinterest to Kara. You had a polite conversation where you responded to her questions and engaged politely when she brought up her dog; that’s just being respectful. Does your cousin wish you’d told Kara “I don’t want to talk to you, you’re not my type” rather than politely finishing the conversation and moving on to talk to other people?\n\n5. I would even go so far as to say that when a woman you hardly know tells you she’s drunk and doesn’t feel well and she wants to go to your place, your safest options are 1) safely help her get home without allowing her to stay with you, or 2) have a witness if you are going to let her stay with you. She clearly wasn’t taking the hint that you weren’t interested, and the accusations she could have raised if she’d made advances and been rejected are a real concern. You wanted to be kind, so you gave her a place to stay, but you accepted the company of a mutual acquaintance/friend who could ensure things didn’t go a very negative way. \n\n6. Ask your family if they would hold your cousin to this standard: if you tried to set her up with one of your friends and she didn’t hit it off with him, would you think she had to take your friend home and hook up with him or not flirt with anyone else because he wanted her? No. This is a gendered expectation: people think guys should just be grateful for any opportunity at sex regardless of their interest in the woman, but they’d never pressure a woman to hook up with a dude they weren’t into or make the woman responsible for the dude’s feelings. \n\nThe only reason Kara had to see you hit it off with someone else is because she made you responsible for her safety. If she hadn’t said she was drunk and sick and needed a place to stay to recover, you never would have taken her to your place and she never would have seen you hitting it off with someone else. And if your cousin doesn’t want you dating her friends, she shouldn’t be trying to set you up with one of her friends. I personally don’t understand when people think they can control what two consenting adults do just because the adults are friends, but if anyone does think you needed your cousin’s blessing, your cousin conveyed that she didn’t expect her friends to be off-limits when she tried to set you up with one of them.",
   "created_utc": 1700859630,
   "score": 8,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal4pik",
   "message": "I’m drunk and can’t get home” is not an invitation for a hook-up.",
   "created_utc": 1700846477,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal6kr3",
   "message": "NTA. Someone says they are drunk then it means a hook up is off the table. Kara needs to work on her game, and your cousin and her friends need to grow up.",
   "created_utc": 1700847231,
   "score": 4,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalcmpx",
   "message": "Your dong \u0026gt; Kara’s dog",
   "created_utc": 1700849660,
   "score": 4,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaljdcp",
   "message": "New pickup line “My dog really likes the smell of your asshole, will you be his daddy?”",
   "created_utc": 1700852411,
   "score": 4,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalkal4",
   "message": "NTA. Telling someone \"I am drunk and don't feel well\" is the exact opposite of an invitation to hook up. I would point out to your cousin that Kara spent the evening talking at you about her dog, that she's a nice person but not your type, and that you do not take advantage of drunk, sick women by taking them to bed.",
   "created_utc": 1700852791,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kall4h5",
   "message": "NTA  \n\n\nNTA for hooking up with the friend at all.   \n\n\nKara sounds like someone you try to avoid. The fact that she slept on your couch and then goes and bad mouths you after is a red flag. \n\n  \nSo is she mad you did not try and hook up with her?",
   "created_utc": 1700853128,
   "score": 4,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kallbnp",
   "message": "Ok...to satisfy the \"friends\", now you should \"do\" them both!  Halfway joking here! Tell he, you don't take advantage of drunk women and ask her for a sober replay",
   "created_utc": 1700853210,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kan4j5p",
   "message": "You're not obliged to hook up with anyone you don't want to. Doesn't sound like you led her on form your post, and if you're not feeling a spark then you didn't feel a spark. \n\nFor the record I love dogs, and I too would feel weird if a woman told me her dog needs a new dad.\n\nAnd to me \"I'm drunk and not feeling well\" means her health is a priority and she cannot consent to anything anyways. That does not sound like a hook up line and it shouldn't be viewed as one.",
   "created_utc": 1700876688,
   "score": 4,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kanat6b",
   "message": "NTA, it sounds like you had no intention in hooking up with \"Kara\", and your cousin/her friends sound like they assumed a lot of what happened.\n\nPersonally I also want to add that a girl hanging around with girls a decade younger than her to me is a red flag and shows a lot of immaturity, along with some of what you mentioned in your post. Those girls are just upset because they probably \"had it all figured out\" for Kara before the night even started and when it didn't go the way they thought it would decided to throw a group hissy fit.\n\nNot here to throw shade, just sharing my perspective.",
   "created_utc": 1700879648,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakr9wv",
   "message": "NTA\n\nYou weren’t into Kara.  You’re entitled to not pursue her if you’re not into her and just bc you’re cousin was trying to set you up with her doesn’t mean that you’re not allowed to find someone else at the party who you actually are interested in.\n\nKara said she was going to help you with Ashley.  She was just trying to go home with you when she said that and not bc you were leading her on.",
   "created_utc": 1700840910,
   "score": 11,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakv0dx",
   "message": "NTA. You're all adults who can make decisions and who you hook up with isn't anyone's business.",
   "created_utc": 1700842487,
   "score": 7,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalnrn7",
   "message": "Any woman that pretends to be drunk and vulnerable and invites herself to sleepover at a strangers home, is not someone you want a future with. Honestly, it was a good thing that Ashley was there as a witness because this situation could have gone sideways very quickly.\n\nnewsflash. Women can be dangerous as well. Especially ones that lie/manipulate others to get what they want. This woman invited herself to your home, pretended to be drunk and planned on hitting on you.\n\nCan you imagine if you had rejected her advances? You have no idea how she would have handled that.\n\nIn respect to the question. NTA. You did nothing wrong by being interested in Ashley. You are both consenting adults. But, in the future, I would be wary of Kara. She’s giving off Fatal Attraction vibes. No one wants to be falsely accused. Protect yourself.\n\nedited for typos",
   "created_utc": 1700854197,
   "score": 7,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakw105",
   "message": "kara is way older than Ashley but she sounds like a 13 years old. yikes, you were trying to be polite by letting her talk about the dog.....",
   "created_utc": 1700842908,
   "score": 14,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal270l",
   "message": "Fuck her too, problem solved /s",
   "created_utc": 1700845452,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal4iu9",
   "message": "IMO NTA. Kara gave off more warning signals than vibes. Meanwhile, you and Ashley had seemingly genuinely connected that evening. I think an asshole would’ve taken advantage of a drunk woman. Although, keep in mind, Kara probably heard you and Ashley banging all night?",
   "created_utc": 1700846403,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalbchz",
   "message": "Kara is a walking talking red flag. You dodged a bullet my guy. NTA.",
   "created_utc": 1700849141,
   "score": 6,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalflgp",
   "message": "\"My dog needs a new mom/dad\" would be a huge turn off for me, and I'm a pet mama. And \"I'm drunk and don't feel good can I crash at your place\" is a HORRIBLE code for \"Sleep with me pls!\" She's basically asking you to assault her, because she's unable to consent if she really is drunk. Yikes all around.\n\nNTA for not dating her, sounds like you dodged a huge bullet. Side eye for dating a girl ten years younger than you that is the same age as your sister.",
   "created_utc": 1700850861,
   "score": 6,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalh9do",
   "message": "NTA but if I was your cousin I’d never invite you to anymore events with friends. Don’t need my 32yo cousin hooking up with my 22yo friends.",
   "created_utc": 1700851541,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kamotuz",
   "message": "NTA, but you are a dope. \n\nYou got involved with a party of people in their early 20s, plus their weirdly older friend with poor social skills and a “crush” on you. And you expected the evening to be drama free and mature?\n\nDelusional.",
   "created_utc": 1700869507,
   "score": 5,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kal3qkv",
   "message": "NTA.  If the genders were reversed and a woman friend zoned some guy her cousin was trying to hook her up with and hooked up with a different guy instead, no one would bat an eye.  People would be talking about how entitled the first guy is in that instance.",
   "created_utc": 1700846084,
   "score": 7,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalqcw8",
   "message": "So, you hooked up with the reasonbly sober consenting woman who didn't say she was looking for a dog dad, and didn't take advantage of the woman who was apparently so drunk she needed a ride outta there and a place to crash and whom may not have been 100% consenting?\n\nYou are not only NTA, you're genuinely a good guy.",
   "created_utc": 1700855243,
   "score": 8,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaknixf",
   "message": "YTA. You should've slept with both of them, Lol.\n\nJokes aside, NTA, you did nothing wrong, you were kind to host the party and let Kara crush at your place. You are free to hook up with whoever you want.",
   "created_utc": 1700839294,
   "score": 32,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalanlu",
   "message": "If she's drunk enough to think this is a good idea, she's too drunk to consent. Clearly impaired judgment.",
   "created_utc": 1700848859,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalf1ou",
   "message": "NTA. Trying to hook up with someone by saying ‘I’m drunk and need a place to crash’ is way outa bounds in my book. It still seems obvious to me in hindsight of your story that that’s what she was trying to do, and I think you shoulda tried to tactfully redirect her elsewhere. But that’s an outsider’s hindsight, and I still don’t think you’re an asshole",
   "created_utc": 1700850635,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaln1nw",
   "message": "My apologies man, sounds like a tough situation. NTA, but you are definitely being set up as one because Kara and your cousin are pissed.",
   "created_utc": 1700853905,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalnp7s",
   "message": "NTA. \n\nShe wanted to hookup with you. You with her. End of story.",
   "created_utc": 1700854170,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaloch8",
   "message": "Sounds like she wants you to fuck her dog.",
   "created_utc": 1700854432,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalsoj6",
   "message": "Ah yes, the classic “I’m drunk, take me home and take advantage of me, but do it in a way I’m okay with and not in a way that’s called rape” technique.",
   "created_utc": 1700856180,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kaltdzg",
   "message": "Nta unless she is your pimp it isn't her business who you sleep with",
   "created_utc": 1700856469,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalv188",
   "message": "NTA. She told you she was drunk and not feeling well. Why would anything happen after that? It’s weird if she thinks that was a way to get you to hookup with her. At the end of the day you and Ashely are both adults and what you did together is none of your family’s business. Your cousin is the AH for telling anyone. Kara has the right to feel how she feels but she can’t say you were into when you clearly were not. Even if you asked about her dog that doesn’t equate to anything.",
   "created_utc": 1700857129,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalvq1q",
   "message": "You dodged a bullet. Her trying to fake drunk/sick so you could hook up? Is she an adult? Quite childish.",
   "created_utc": 1700857400,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kalvvxa",
   "message": "Nta you dodged a bullet, this is the same kind of girl who’ll lose her shit down the line and accuse you of assault because she was drunk",
   "created_utc": 1700857461,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kam8qiu",
   "message": "Ok, putting aside OP having the sexies with girl ten years his junior.....\n\nKara needs to up her game AND her communication skills\n\nSo she wanted some rando to \"take advantage\" of her while she's drunk? At least OP didn't do that, even if she wasn't drunk!",
   "created_utc": 1700862596,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kamby9y",
   "message": "Kara said she was too drunk to stay at the club, and people are criticizing you for not taking advantage of her??  NTA!",
   "created_utc": 1700863923,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kamgkfr",
   "message": "NTA- \n\n1. she said she was drunk… thats its own bag of worms \n\n2. Your dick your rules",
   "created_utc": 1700865852,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kamj3dc",
   "message": "Hey, NTA for not sleeping with her, good job. \n\nBut question - why did you offer to take stranger girl you don't know or like who's drunk to your house? She has a group of people with her, who know her, who should assist her. You guys are strangers, and you shouldn't offer your home unless you want her in it - because, had it just been you two, it could have gone south, if she was drunk and tried something. You need to be smarter and think on things.",
   "created_utc": 1700866930,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kan2h3d",
   "message": "NTA\n\nKara wasn’t direct. Telling someone “I’m too drunk to travel to my place” does NOT mean “let’s go hook up”.\n\nBeyond that, if Kara really WAS “too drunk”, then she would not be able to consent to a hook up. And she could have gone the other way with it and been like “I can’t believe you took advantage of me when I was so drunk”.\n\nShe’s just mad that you hooked up with someone else, who also happens to be a decade younger than her. She’s jealous and maybe embarrassed.\n\nBut you didn’t do anything wrong, OP",
   "created_utc": 1700875750,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kan421i",
   "message": "NTA: Crazy red flags from Kara, you did nothing wrong here. Focus on the lack of consent and anyone in your family who’s not stupid will understand and you’ll be fine.",
   "created_utc": 1700876472,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kan6m65",
   "message": "Just be very explicit. \"Kara told me that she was drunk and needed a safe place to rest. Ate you suggesting that drunk people are capable of consent?\" I'm sure there's a better way of wording it. \n\nSee Ashley again, but invite Kara over again first so she can sit outside and listen.",
   "created_utc": 1700877647,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kanbqak",
   "message": "A couple consenting adults hooked up.  If your family has an opinion as to within whom you are sticking your dick, they are weird and gross.",
   "created_utc": 1700880083,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kanh87e",
   "message": "Not at all.\n\nAnd when a woman says \"I'm drunk\" I immediately hear \"I'm not capable of legally consenting to sex\" so I dunno what she was hoping for.",
   "created_utc": 1700882743,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kanu1x7",
   "message": "Yeah, unfortunately, “I’m drunk and I need a ride home” is a very common Irish Catholic mating signal in NJ.   I glad I missed that signal a few times.",
   "created_utc": 1700889498,
   "score": 3,
   "submission_id": "182tj1y"
  },
  {
   "comment_id": "kakj2ni",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "182tj1y"
  }
 ]
}