{
 "submission_id": "182vnkn",
 "title": "AITAH for not wanting my fiancés friends on our honeymoon?",
 "selftext": "A few weeks ago my fiancé(29M) and I (28F) went for dinner when he asks me if he can ask me something but I can’t get mad. So I said ok just tell me. He proceeds to say that he was talking about our trip to Japan and his friend over heard and asked if he can come. I look at him already just upset because this isn’t just a trip?? It’s our honeymoon. We’re getting married the beginning of February and leaving a week later for our honeymoon which is a week in Thailand and a week in Tokyo. I tell him why he would think it’s okay for his friend to join when it’s our honeymoon he then got upset and said I can never say anything without you getting upset it’s like walking on eggshells with you. Honestly after that we didn’t speak and after a day or two he apologized and said he told him no to coming because it was our honeymoon. We left it at that which brings me to yesterday. He was gone helping his dad do some yards around the neighborhood when I here’s where I know most won’t agree but I decided to go on his laptop and snoop. I see a group message that’s named “Tokyo boys” when I begin to read the message I realize that all his friends are going to Tokyo the EXACT same week we are going. There on there talking about places to visit and where they’re staying. I was livid!! Of course I couldn’t keep it to myself that I knew so I text him and ask him what that was about and of course his first answer is why are you looking through my things. Then saying how he told them he wouldn’t be seeing them because it’s our honeymoon and that they still decided to go and that he doesn’t own Japan. I’m honestly sooo upset about this and due to it being thanksgiving yesterday I had to suck it up and pretend we were okay when honestly I’m so mad and hurt that he ignored me and my feelings. I know when we’re there they’re going to be calling him to go places and I will be the asshole if I don’t want to go.",
 "created_utc": 1700842606,
 "permalink": "/r/AITAH/comments/182vnkn/aitah_for_not_wanting_my_fiancés_friends_on_our/",
 "score": 110,
 "url": "https://www.reddit.com/r/AITAH/comments/182vnkn/aitah_for_not_wanting_my_fiancés_friends_on_our/",
 "comments": [
  {
   "comment_id": "kal2r9y",
   "message": "NTA\nI had a friend with a similar dilemma. Fortunately she was handling all of the logistics and without letting him know, she revised their honeymoon itinerary to ensure they were never in the same location as the tag along “bros”. \n\nShe said the look on his face was priceless when he realized they were boarding a flight for different city than their original plan. \n\nShe stuck it out for almost two years, before she dumped the man-child.\n\nNeedless to say she is now married to a wonderful guy.",
   "created_utc": 1700845681,
   "score": 62,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakylc1",
   "message": "NTA. I hope he is going to be your ex fiancé soon. Do not marry a man like that. He is disregarding your feelings about your own freaking honeymoon. What’s next ?  He does not prioritise you.",
   "created_utc": 1700843979,
   "score": 211,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakye4w",
   "message": "Thank God you're seeing this side of him *before* you get married.  This type of behavior will not change.  Rethink your future with him.  NTA.",
   "created_utc": 1700843897,
   "score": 179,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakzlxc",
   "message": "You shouldn’t marry him. It’s that simple.\n\nIf you are determined to go through with it, get a watertight prenup to protect yourself when things inevitably collapse - and for the love of God change your honeymoon plans.",
   "created_utc": 1700844395,
   "score": 106,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakw89l",
   "message": "[deleted]",
   "created_utc": 1700842992,
   "score": 22,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal0zlo",
   "message": "NTA.\n\nYou know he's not ready to be married yet, right? Getting married means forming a new family with a partner, ideally for life. That new partner is supposed to be your priority. That new partner is supposed to be the person you want to protect and keep happy. That new partner is someone that you shouldn't care about sharing details of the other parts of your life (except for surprise parties for said partner - those you can keep secret).\n\nI've been married as long as you've been alive. That's what marriage means to me. What you've described in your post is a childish man-baby that is looking to retain the \"freedom\" of his single life but add a \"label\" of being married. He's absolutely not ready.",
   "created_utc": 1700844960,
   "score": 228,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal434g",
   "message": "Okay, so he:\n\n1. Got upset because you don't want something that is completely unfair*.\n\n2. Accused you of having a bad attitude because of that, saying \" I can't say anything without you getting upset\".\n\n3. Lied to you saying he told his friend not to coming. \n\n4. Went behind your back and keep planning the trip with his friends \n\n5. Got angry because you looked through his things, a.k.a discovering he was LYING.\n\n6. Doesn't care about your wants or what is important to you\n\n7. Prefers spend time with his friends than you\n\n\nDo you really want to marry him? Do you really want to marry someone that lies to you,  goes behind your back and has you as the last priority? \n\nNTA, but you will be TA if you marry him.\n\nEDIT: typo*",
   "created_utc": 1700846224,
   "score": 0,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kaky4bd",
   "message": "Nta don't marry this bloke he literally doesn't care about you it's sad, it's your effing honeymoon and that spiel you cant get mad like what ! Is he 5 or something, he knows he is wrong and the fact he constantly disrespect you is disgusting.",
   "created_utc": 1700843781,
   "score": 28,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakzfz5",
   "message": "NTA\n\nI hope you would reconsidered the wedding at the least, and the relationship at the best.\n\n Wanting to be alone with your partner during your honeymoon is a very standard and basic demand. The fact he got angry for that doesn't boad well for the rest of your life together. As the fact you say 'No\", but he still make plan with his friends.",
   "created_utc": 1700844327,
   "score": 98,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal18jy",
   "message": "Nta, it's basic knowledge that the honeymoon its about the couple\n\nBut reconsider your relationship, he said that he can't talk to you, that he is always on eggshells, that's a serious statement, you don't want to marry a man that will resent you. \n\nAnd that put his bro's before you, on your HONEYMOON, you and I knows that is bs that he will not see them on the trip, and that if you force that to happened, he will resent you, because you don't let him see his friends, boohoo \n\nHe is not ready to get married",
   "created_utc": 1700845061,
   "score": 61,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakybj5",
   "message": "NTA\n\nTell him you want to change the honeymoon plans.",
   "created_utc": 1700843866,
   "score": 116,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal1bjo",
   "message": "Just throw the whole fiancé out.",
   "created_utc": 1700845094,
   "score": 58,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal0mhd",
   "message": "Sweetie you are nta here. His question was a way to soften you up to the fact all his friends are going there and he'd essentially spring all this on you when you got there. Please for the love of your own self worth, do not marry this man. Your wants and needs will never come first. No one besides you and him should be going on this honeymoon. He's had it pre-planned and doesn't care about your feelings here. It sounds like he hasn't left the bros club nor is acting like a person you'd want to spend the rest of your life with. How many times will you be told to suck it up? To compromise on his behalf. He's a prick for this.",
   "created_utc": 1700844810,
   "score": 127,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakznp1",
   "message": "NTA, wouldn't marry the man.",
   "created_utc": 1700844415,
   "score": 38,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal24eu",
   "message": "NTA. Girl do not marry him!! When someone shows you who they are, believe them. He’s shown you that he will lie to you, mislead you, manipulate you, and twist situations to try to make you the bad guy instead of him. He will not magically change after you get married, statistically speaking he will actually probably get worse. Don’t marry him!!",
   "created_utc": 1700845424,
   "score": 39,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal248g",
   "message": "Do not marry this lying child man. This would be your life. He only wants what he wants",
   "created_utc": 1700845422,
   "score": 38,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakxyee",
   "message": "I wouldn’t marry him. He does not prioritize you and it’s your freaking honeymoon. This is also a preview of coming attractions… he will keep doing shit like this in the future. He’s gaslighting you like a pro.",
   "created_utc": 1700843714,
   "score": 163,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakzo7o",
   "message": "NTA How stupid does he think you are that he expects that to work? You should call his bluff by telling him you want to change your honeymoon plans.",
   "created_utc": 1700844421,
   "score": 28,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal3pax",
   "message": "\u0026gt;he asks me if he can ask me something but I can’t get mad\n\nReject this manipulative bullshit.   \nI mean, you should never be getting so mad at your spouse or child that they will not want to tell you something important, etc. \n\nbut when someone starts like this, if meant they know you *should* be angry to at least some degree. \n\n\u0026amp;#x200B;\n\n\u0026gt; he then got upset and said I can never say anything without you getting upset it’s like walking on eggshells with you. \n\nMore manipulative bullshit. \n\nHe needs to be able to handle it when you’re annoyed; if he’s in the right and you’re wrong, then surely he can hold his own and you can work through it.",
   "created_utc": 1700846069,
   "score": 28,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal2skx",
   "message": "Do not go through with the wedding. This man clearly does not respect you. Cut your losses.",
   "created_utc": 1700845696,
   "score": 24,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kala8s7",
   "message": "\u0026gt;I can’t get mad.\n\n\u0026gt; he can never say anything without you getting upset it’s like walking on eggshells with you.\n\n\u0026gt; he doesn’t own Japan\n\n\u0026gt; I know when we’re there they’re going to be calling him to go places and I will be the asshole if I don’t want to go.\n\nI know it’s a cliché, but it’s much cheaper to dump a loser than it is to divorce one. Losing your deposits is a drop in the bucket compared with court fees and lawyers fees and paying off his debts, etc.\n\nHe’s already lying to you. He’s already trying to control and manipulate your responses. He’s already decided he’s going to do what he wants to do and you are going to be the asshole if you don’t give him what he wants. Do you think it’s going to get better after you have a ring on your finger? Or are his resentments going to pile up until you’re afraid to breathe so you don’t upset him?\n\nIs that how you want to start your marriage?",
   "created_utc": 1700848696,
   "score": 22,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal4812",
   "message": "Reddit standard answer number 1. NTA, dump him.\n\nHe has shown you who he will be when married, so make your next decision considering that he would rather see his mates in Japan than just spend time with you, but you need to put him back in his box or this will continue.",
   "created_utc": 1700846280,
   "score": 18,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal15jh",
   "message": "NTA\n\nMy friend did this. Took his wife years to learn she was secondary to his friends and she left him.",
   "created_utc": 1700845027,
   "score": 31,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal445r",
   "message": "Are you sure you want to marry someone this dishonest?",
   "created_utc": 1700846236,
   "score": 18,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal65pi",
   "message": "VERY large RED flag here. Asking or planning to have a “Tokyo Boys” meetup while on your honeymoon really makes me wonder if he wants his friends over his wife. \nAny other red flags in your fiancé??",
   "created_utc": 1700847064,
   "score": 13,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal6m6z",
   "message": "NTA\n\n*If* you plan to still get married you absolutely need premarital counseling. You have at least two major issues to work through:\n\n1. His plan to have friends on the honeymoon. (Honestly I think this is actually more of a symptom, you need to get to the root of *why*, the why is the real issue.)\n\n2. His claim he feels he is always walking on eggshells with you. Whether that's a problematic behavior on your part or a problematic reaction on his, either way it is *NOT* a healthy dynamic to start a marriage on. And if he just said to say it, well that in of itself is a major issue.",
   "created_utc": 1700847248,
   "score": 15,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kalavnc",
   "message": "The walking on eggshells comment is classic control and gaslighting statement.  How often does he tell you that you are crazy or too sensitive.  If you still want to marry him after talking to friends to join your honeymoon behind your back,you are settings yourself up for a life of lies and control.  Hope you can work this out but there are so many red flas here.",
   "created_utc": 1700848950,
   "score": 16,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kakzz4d",
   "message": "No, no, no, no, no!  He CANNOT bring his friends on your honeymoon.  Period!  This is a dealbreaker",
   "created_utc": 1700844546,
   "score": 28,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal22t4",
   "message": "We would be pushing that wedding back…",
   "created_utc": 1700845405,
   "score": 12,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal2v3l",
   "message": "NTA change your honeymoon plans. Call the company now and ask if you can  change the tickets for another week. Go to your honeymoon one week after them. \n\nIf your fiance doesn’t want to, call off the wedding. This is only the beginning. Even his friends have no respect. They have everyday to go to japan, why do they go when you are on your honeymoon? \n\nBecause they want to spend time with him and will call him 100%.\n\nGood luck and take care, you can do better than that gaslighting POS",
   "created_utc": 1700845724,
   "score": 26,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal5ynl",
   "message": "Post pone the wedding with a view towards canceling. What woman would want to marry a guy who invites his drinking buddiesmon the honeymoon? None. Im a guy….on my honeymoon all imwanted to domwas make a baby with my wife, not drink with my pals. The fact he doesnt tells you what married life will be.  One looong disappointment.",
   "created_utc": 1700846984,
   "score": 12,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal46fp",
   "message": "NTA please tell me you’re not marrying this man child. Bc this is wild. I’ve had my two best friends marry each other and it never crossed my mind to ask to go on their honeymoon. \n\nIt’s fine to be close to friends but there’s a line somewhere. See if you can refund your ticket to Japan for airline credit and dump this loser.",
   "created_utc": 1700846262,
   "score": 8,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal6in6",
   "message": "hell no NTA 1. he thinks he can tell you how you are allowed to feel and react to things he tells you 2. he thinks he can gaslight you when you have a reasonable reaction to something and make you out to be abusive with anger issues, 3. he thinks he can unilaterally make decisions even when you said no and hide said decisions\n\ndump his ass you deserve better, or at the very least cancel/postpone the wedding and make couples therapy a requirement to stay together",
   "created_utc": 1700847208,
   "score": 10,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal8ei8",
   "message": "34 years ago I married someone that invited his friends on our honeymoon. Been divorced for 33 1/2 years. ✌🏻",
   "created_utc": 1700847962,
   "score": 7,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal94ny",
   "message": "Save yourself the lawyer's fees and don't get married to this bozo.",
   "created_utc": 1700848250,
   "score": 6,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kalpxuj",
   "message": "Why is he marrying you if he doesn't want to spend time with you?",
   "created_utc": 1700855073,
   "score": 10,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal28ds",
   "message": "Jeez, screw him, he can go marry the buddies if he’s wanting his honeymoon with them so badly. NTA OP, sorry babes.",
   "created_utc": 1700845468,
   "score": 7,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal63z2",
   "message": "It might be time to discuss whether getting married is the right decision as your priorities are completely misaligned.",
   "created_utc": 1700847045,
   "score": 8,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal6cul",
   "message": "He is already choosing his bros over you for the most intimate couples vacation there is.. I would question whether you want to marry him. Is this a red flag? Foreshadowing? Think long and hard about it OP. He is either immature or not as in love as you’d hoped.",
   "created_utc": 1700847144,
   "score": 7,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal6de0",
   "message": "NTA and I would dump them for this!\nA honeymoon is a time to be together as a couple and just be all about your partner…\nwtf",
   "created_utc": 1700847150,
   "score": 8,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kalk28o",
   "message": "NTA. Young woman, this is the BEST GIFT that young man could possibly give you. He is showing you exactly where you stand with him in relation to his buddies. Even on your honeymoon, his boys come before you. This is not the sort of situation that improves over time. If that's not okay with you . . . RUN FAR AND RUN FAST.",
   "created_utc": 1700852697,
   "score": 7,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kam5420",
   "message": "NTA - OP how have you not noticed, that every time, he turns it back on you and makes you the look crazy, unreasonable and controlling. I would be more worried what he tells people behind your back and also what he gets up too, because he’s already proven, he keeps secrets. \n\nHonestly I would end the relationship and then add salt to the wound by telling him you’re going on the trip with a male friend, and call it a friendmoon! lol 😂",
   "created_utc": 1700861135,
   "score": 7,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal0py7",
   "message": "NTA time to change the week you two go.",
   "created_utc": 1700844850,
   "score": 6,
   "submission_id": "182vnkn"
  },
  {
   "comment_id": "kal7hk7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "182vnkn"
  }
 ]
}