{
 "submission_id": "182wfu5",
 "title": "AITAH for making my wife leave her family's Thanksgiving?",
 "selftext": "My wife (29 F) and I (39 M) went to her parents' house for Thanksgiving yesterday. We are a blended family and each have two children from previous relationships who we brought with. She has two sisters and one brother. Her brother and I are quite close. Her sisters are quite loud and opiniated. My perspective is that one sister in particular, \"Lisa\" (32F) is extremely judgmental and insulting, while being the type of person who has no place judging others. She cannot seem to hold down a job. She has an almost two year old daughter. She only works one day every two weeks, but she pawns her daughter off on other members of the family 50-60% of the time. We watch her daughter for her as often as we can, and our kids love spending time with their cousin. I do not have a problem with responsible cannabis use, but she and her partner use constantly while they are responsible for their daughter. They often smoke around her and she quite often smells strongly like weed and cigarettes. She's the type of person who benefits from social safety nets and then complains about people who \"don't work\" and \"use the system.\" She will loudly (because loud is her only volume) make racist or transphobic comments, or use slurs referring to people with developmental disabilities while we are out to eat at restaurants. With all of this, I do my best to get along with her and have a positive relationship, as it's my wife's family.   \n\n\nAfter Thanksgiving dinner, my stepson (8M) threw a balled up napkin at his aunt Lisa, trying to play with her. This annoyed her, and she has every right to not want him to throw a napkin at her, regardless of if it was meant to be playful or not. She told him to stop. My wife told my stepson to stop, so he stopped and sat next to his mom on the couch. That was not the end of it, though. Lisa began incessantly making comments about him and his behavior in front of him (basically shit talking him), and going as far as to say that she was going to \"throw him off the deck.\" I believe he perceived it as playful teasing and, in his mind, the game was on and he threw the napkin at her again. Lisa lashed out at my wife to \"control her child\" and started going off about how she needs to discipline her children. Now for the record, my wife is actually a quite strict parent. She would never be abusive toward the children, but she is quite a stickler about holding them accountable. She has done wonders for my children.   \n\n\nMy wife was upset by her sister insulting her child and her parenting and she removed herself from the situation. She went outside to decompress. During that time, Lisa continued to rant, making comments about my stepson and my wife's parenting. It was bad enough that my stepdaughter (11F) went outside to console her mom and tell her what Lisa was saying. My wife came back in after a few minutes and went to the kitchen to help her mother with the dishes. Lisa came up to my wife and \"apologized\" with an, \"I'm sorry... but sometimes you need to discipline your kids.\" At that point, my wife stood up for herself and told her sister that she was the adult and that you don't tell an 8-year old that you're going to throw them off the deck. That the adult should not be expecting the 8-year old to control themselves when the 32-year can't even control what is coming out of her mouth.\n\nThat was it. Lisa lost it and went full on insult mode, starting to just berate my wife. My wife walked away and went into one of the bedrooms. Up until this point, I had stayed out of it as I saw it as an argument between sisters and didn't feel it was my place to insert myself. I went after my wife to try to console her. She was crying and quite distraught. During this time, Lisa continued to loudly rant about my wife. This went on for a few minutes where she was non-stop talking, insulting my stepson and my wife. The kids were becoming upset and were beginning to cry at the way she was ranting about their mother. I had enough. I went back out into the kitchen and told Lisa that she needed shut her mouth and stop talking. She immediately attacked back, telling me that I'm not part of this family and that I need to stay out of it. My MIL also told me to stop. She obviously did not want things to escalate, but also never asked her daughter to stop as she was incessantly ranting about my wife. \n\nAt that point, I told the kids to get their stuff on and get into the car. My MIL said \"Please, no. It's Thanksgiving.\" And I responded, \"No. We are leaving.\" My wife didn't want to go, because she felt bad for her mom and didn't want to ruin Thanksgiving, but I insisted she go out into the car. As I was trying to get everyone out, Lisa continued to rant about how I was not a part of the family but was going to ruin Thanksgiving by making my family leave. As I was getting the kids out the door, Lisa tried to call my stepdaughter over so she could give her a hug and \"make things better.\" I told my stepdaughter, \"No. Ignore her.\" and I could tell by my stepdaughter's look that she was 100% with me on that after the way Lisa was berating her mother. We got in the car and left.   \n\n\nNow, of course, the  family is upset that I removed my family from their family gathering. They think that my stepson \"needs to understand\" that his aunt \"can get like this\" so he needs to be more aware of when it is and isn't okay to play with her. Personally, I am baffled that the responsibility for appropriate behavior is being placed on the 8-year old and not the 32-year old, but AITAH for removing my wife from her family's Thanksgiving?",
 "created_utc": 1700844708,
 "permalink": "/r/AITAH/comments/182wfu5/aitah_for_making_my_wife_leave_her_familys/",
 "score": 112,
 "url": "https://www.reddit.com/r/AITAH/comments/182wfu5/aitah_for_making_my_wife_leave_her_familys/",
 "comments": []
}