{
 "submission_id": "182x03e",
 "title": "AITAH for ignoring my sister and threatening to move out because she keeps calling me an incel?",
 "selftext": "My (23M) younger sister (15F) is currently on her phase where she thinks she's the most unique and special person in the world. Because of this, she's also developed some sort of superiority complex against other people's hobbies and especially if she doesn't like them.\n\nThe problem started when she started using the word \"incel\" to insult me and my hobbies out of nowhere. She seemed to notice that this word hurts and disturbs me, so she keeps calling me an incel just to illicit a reaction from me.\n\nI'm playing a video game? I'm an incel.\n\nI'm watching anime? I'm an incel.\n\nI'm building a Gundam? I'm an incel.\n\nI've talked to her about it and asked her if she knows the meaning. She knows it perfectly well and she thinks that I fit the description well. I asked her why she thinks so and she tells me that she \"just knows that I'm an incel.\"\n\nBecause of that, I've just been ignoring her. This seems to piss her off because she began to annoy me on another level such as pulling my headphones off just to call me an incel and even just using incel as a general nickname for me.\n\nI talked to my parents last night and told them that, if they don't do anything about her behavior towards me, then I will move out of the house.\n\nMy dad and I pay 50/50 for everything because his salary alone can't sustain all of the bills. My mom is a volunteer worker in an animal shelter and refuses to seek a job because we come from a culture where men are expected to be the sole providers.\n\nMy mom justifies my sister's behavior as just being a \"typical teenager\" and is begging me to be more understanding because I'm the older and more mature one. My dad, on the other hand, knew that I was serious and agreed that they need to punish my sister.\n\nI don't like ultimatums, but I feel like I don't have other choices anymore. I don't want to yell at my sister or even fight with her because I know that it will simply make her attitude worse towards me.",
 "created_utc": 1700846203,
 "permalink": "/r/AITAH/comments/182x03e/aitah_for_ignoring_my_sister_and_threatening_to/",
 "score": 102,
 "url": "https://www.reddit.com/r/AITAH/comments/182x03e/aitah_for_ignoring_my_sister_and_threatening_to/",
 "comments": []
}