{
 "submission_id": "182xkwn",
 "title": "AITA for \"leaving\" my boyfriend's family without a turkey on Thanksgiving by not showing up?",
 "selftext": "\r  \nEnglish is not my first language. I(F38) broke up with my boyfriend Joey (40M) because I feel lonely within the relationship. He makes zero effort to help me feel appreciated and I’ve had 2 situations in which I’ve realized that he doesn’t see me as a priority. \r  \n\r  \nThe first one was that I have anxiety and closed spaces make me really nervous. I was in a stressful situation and that obviously spiked my uneasiness when I had to enter an enclosed area. Of course, I could leave but I needed to complete a procedure, so I had to stay. Because I’ve always been there for Joey, I felt comfortable texting him and letting him know how I felt. He didn’t reply until 3 hours later and simply said “of shit! Just scream and cry until your fit is over with”. I was very confused by the fact that once we talked, he said he was busy and never addressed what happened. \r  \n\r  \nSecond, my family sold two buildings that were a burden. I took on the responsibility of emptying both properties, unwinding my parents' business, helping them move out of town, getting everyone a health plan, etc, while they focused on other things that needed their attention. It wasn’t “horrible”, but it is time consuming. So, I dealt with my career, my kids and with people hiring cleaning companies or someone to help empty out the properties. It took me almost a year, and never once did he offer to keep me company. Info: one of the buildings is in a secluded area and driving away at night could be kind of scary. I enabled a small living space to sleep over if it gets too late to drive home while I straighten things out. I’ll admit that the area isn’t picture perfect, but it has utilities, some furniture and kitchen and bedroom basics. Of all the things he could have said, he called my place “ugly” and “tacky” and “cheap”, immediately commenting that he could never bring friends over. I was very hurt but didn't say anything until sometime later. His answer was more a justification than an apology.\r  \n\r  \nI had my space professionally cleaned but the floors are stained, and investing wasn’t an option. \r  \nI made time for us, listened to his work-related problems, but wasn’t taken out on dates or allowed to tell him when I was feeling less than happy with my health. His response was to criticize my family, despite me opening up about my reasons to help them with their burdens. This is where I began to dislike him as a person, and I told him since all he talked about was that he expected me to get a “cut” from the sales of the properties. \r  \n\r  \nWe had planned a Thanksgiving dinner with his family. I said I would join but only after I spent time with my kids and my family. My kids would spend the night with my parents so that they could spend more time with my sister’s children, so I would get back home after dinner with Joey’s family.  I would go see Joey at night for his family’s dinner (my family always serves turkey by lunch time). I agreed to bring the soda and fricassee turkey (his family is big), but he asked me to bring some alcohol and bring the soda. This was one week before the event.\r  \n\r  \nI’m on my way and he called asking me to bring a pie from the pastry shop. I was mortified that he already checked that it was open, and I felt pressured. Then he asked me to bring a few bottles of a specific wine. Honestly. I’m noticing that I’m already over $280 which I consider to be a lot for a guest. He called again and I called him out and mentioned that I had made some seat placement ornaments and would love to have a chance to sit down and write each person’s names. He broke my heart when he said, “oh no” and scorned my gift for being “homemade” and that he meant no offense but in other words, he preferred his family get commercial ornaments. Info: I own a very small online shop. I sell these things. They were handmade for his family and could be used as a Xmas ornament. I know maybe I was wrong, but I exploded. He didn’t pay for anything that I was bringing and was insulting me. I immediately turned around and told him I wasn’t going. I was too embarrassed to tell my family, so I ended up donating the turkey and the pie. I broke up with him, nevertheless. He said I left his family without a turkey. I honestly find it very hard to believe that his family would rely on a newcomer for their entire Thanksgiving dinner. \r  \n\r  \nThis morning, I told him that I can’t be with him, and the fact that he’s so preoccupied with my family shows his parents did a very poor job raising him.  I’ve noticed that he wants to give to his family but resents me and other exes for taking care of their own. Also, he’s of no help and while I’m hurt, I’ve decided that he’s not up to my level of dedication so please never call me again. His friends have tried to contact me, but I’ve blocked them. Now I’m a bit surprised at what I did and I’m wondering if I was too harsh. AITA?\r  \n",
 "created_utc": 1700847794,
 "permalink": "/r/AITAH/comments/182xkwn/aita_for_leaving_my_boyfriends_family_without_a/",
 "score": 94,
 "url": "https://www.reddit.com/r/AITAH/comments/182xkwn/aita_for_leaving_my_boyfriends_family_without_a/",
 "comments": [
  {
   "comment_id": "kal914n",
   "message": "NTA and the only thing you could have done better is breaking up with him sooner. He’s the only one who should be feeling guilty.",
   "created_utc": 1700848211,
   "score": 243,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kal9f7l",
   "message": "He sounds like a user and very selfish. \n\nDo not allow him to weasel back into your life.",
   "created_utc": 1700848366,
   "score": 44,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalbgdw",
   "message": "OP you are a boss! Don't speak with him, keep everyone who wants to speak for him blocked and enjoy your life without this dead weight loser dragging you down.\n\n\nNTA! I'm glad you hit your limit. I'm extra glad it inconvenienced him and his choosing beggar family. Great timing in my opinion.",
   "created_utc": 1700849185,
   "score": 145,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalf5uz",
   "message": "NTA sounds like he was using you and got exactly what he deserved. Also, I highly doubt they were relying on a guest to bring the main dish (the turkey.) Unless that’s where your BF gets his entitlement from.",
   "created_utc": 1700850684,
   "score": 51,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalhf7l",
   "message": "There was already one turkey at his Thanksgiving dinner.\nNTA",
   "created_utc": 1700851608,
   "score": 46,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalo1ld",
   "message": "A forty year old man had his *friends* try to text you after a breakup? Oh my god, how cringe.",
   "created_utc": 1700854309,
   "score": 91,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalusgo",
   "message": "Thank you for donating the food to people who need it and appreciate it, OP.  Well done!\n\nAnd well done for ending things.  I mean he doesn't sound monstrous or anything...  just selfish in a thoughtless way and very indifferent. And why be in a relationship with someone who's indifferent.",
   "created_utc": 1700857031,
   "score": 39,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalatf7",
   "message": "NTA!\n\nHe doesn't respect you. I'm so glad you broke up with him. You deserve so much better! Don't feel sorry for how things went. You did absolutely nothing wrong, he fucked up big time with his behaviour. So proud of you for standing up for yourself. You really don't want a man like that around your children",
   "created_utc": 1700848925,
   "score": 62,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kal9klg",
   "message": "NTA. That isn’t a partnership that is more along the lines of a parent/child relationship\n\nYou deserve someone who loves and appreciates you not someone who sees you as an ATM and therapist",
   "created_utc": 1700848425,
   "score": 19,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalt58j",
   "message": "Who on earth would have a thanxgiving and expect the guest to bring the turkey.  You were only obligated to bring one thing.  A bottle or a desert.  His family doesn’t deserve a turkey with raising a son with no manners!  RUN DONT WALK!!! Chalk this experience as a lesson.",
   "created_utc": 1700856369,
   "score": 17,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalo8s0",
   "message": "Nta you quit a job with no pay on short notice.",
   "created_utc": 1700854390,
   "score": 16,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalvuzj",
   "message": "NTA. You found your brand new shiny spine. Brava!👏👏👏",
   "created_utc": 1700857452,
   "score": 12,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalg21x",
   "message": "Nta. He's a douche canoe. You can definitely find better. I'm the cook and I love to bake. I take lessons from my mom on being more artsy and craftsy. \n\nMy bf loves it and basically pimps my skills out to his friends to get out of buying gifts from stores. Honestly I kind of like it lol. No one ever complains and feels homemade means more than store bought",
   "created_utc": 1700851050,
   "score": 7,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalkcev",
   "message": "NTA, he sounds like a waste of time and space",
   "created_utc": 1700852812,
   "score": 7,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalxc8y",
   "message": "I’m very happy for you in that you won’t have to be dealing with this rude selfish person any more. NTA. Oh, and they already had a turkey… your ex!",
   "created_utc": 1700858032,
   "score": 6,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam1l9g",
   "message": "Well done, you. \n\nNTA. It's always good to cut the toxicity out of your life.",
   "created_utc": 1700859727,
   "score": 6,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam5k6x",
   "message": "So you took care of yourself by dumping this loser and took care of others by donating the food!  Well done, OP, well done!  NTA.",
   "created_utc": 1700861304,
   "score": 7,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalwspa",
   "message": "I’m really proud of you. You deserve so much better ❤️",
   "created_utc": 1700857814,
   "score": 5,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalurxh",
   "message": "NTA and this guy was using you",
   "created_utc": 1700857026,
   "score": 5,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalhcj9",
   "message": "NTA.",
   "created_utc": 1700851578,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaluwel",
   "message": "NTA. He sounds like a POS",
   "created_utc": 1700857075,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalvktr",
   "message": "Good. For. You!",
   "created_utc": 1700857345,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalw4wa",
   "message": "He sounds like a real douche. Using and abusing yous kindness and perhaps also your willingness to accept his crappy attitude.\n\nI think you did exactly the right thing, pigmy shake is you didn't dump that loser earlier!",
   "created_utc": 1700857557,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalyb82",
   "message": "NTA. Next step is to block him on everything and anyone related to him.",
   "created_utc": 1700858416,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalyoxf",
   "message": "NTA and good for you for standing up for yourself. You deserve far better.",
   "created_utc": 1700858567,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalz3dr",
   "message": "NTA and I think you are a hero. Nice work, sister.",
   "created_utc": 1700858727,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalzdwj",
   "message": "OP, you did the right thing.  Please don't ever doubt yourself when you are cutting out toxic people in your life.  He is a user and a taker and he does NOT deserve any of your attention or love, so is his family.  Who would ask a guest to bring the main (turkey) AND dessert (pie) AND alcohol AND soda.  My mom would be petrified that if one of the guest was being requested to bring all that.  AND his family were okay with that?? Hell NO!!!Sounds like  You seriously dodged a gigantic. Bullet!!!",
   "created_utc": 1700858845,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalzpyy",
   "message": "NTA you deserve better!!  Don't look back.",
   "created_utc": 1700858983,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam43qb",
   "message": "NTA -- he invited you to his family's dinner and then told you \\*YOU\\* had to bring the dinner, dessert, drinks, and decorations?  What on earth?",
   "created_utc": 1700860733,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamavh2",
   "message": "I'm just so shocked to that they expect you to bring the turkey, the pie, soda, and wine?! Who does that to a guest?",
   "created_utc": 1700863475,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamk2tu",
   "message": "I can only imagine their faces when they found out there will be no turkey 😂😂😂 You hit him where it really hurts, you did well, definitely not the AH",
   "created_utc": 1700867358,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamotyv",
   "message": "NTA. It’s very tacky for his family to expect a guest to bring the turkey to Thanksgiving. The most a guest should bring is a single bottle of wine or a side. He was a bad boyfriend.  You were right to dump him.",
   "created_utc": 1700869509,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamp6bt",
   "message": "NTA. He wanted you to bring drinks, desserts and a damn turkey. What did he bring? Sending hugs and glad you ended things.",
   "created_utc": 1700869664,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kanf5z2",
   "message": "NTA- I'm happy you chose to break it off. This dude sounds like all he does is uses his partners until they have nothing left to give. I'm curious, How long you have been in this relationship? Was he more attentive in the beginning of the relationship?  You need a partner who puts in the same effort and who values you, just as much as you value them. \n\nGOOD JOB, kicking him to the curb. That takes courage and strength. Do not feel guilty he was in the wrong and does not RESPECT YOU. \n\nKeep it moving girl, You have a great future ahead of you.",
   "created_utc": 1700881745,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalnvgd",
   "message": "Nope, definitely NTA.",
   "created_utc": 1700854240,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalny5g",
   "message": "NTA. I'm very proud of you, and YOU should be proud of you, too!!! Well done!",
   "created_utc": 1700854270,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalnzxh",
   "message": "NTA, I can only imagine what lies he tells his family and friends about you. If this is how he treats you now, what would your future be when married.",
   "created_utc": 1700854290,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalorpl",
   "message": "NTA this guy sucks and he seriously should have been paying for all the stuff he asked you to bring for his family dinner.",
   "created_utc": 1700854600,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalouoa",
   "message": "NTA and good for you for refusing to take his poor treatment any longer. The trash has been taken out; leave it there to rot and walk - no, skip! far away from that pile of nastiness.",
   "created_utc": 1700854634,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaloxny",
   "message": "NTA - His family didn't deserve anything from you.",
   "created_utc": 1700854667,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalphm7",
   "message": "NTA. Congratulations 🎈🎉🎊",
   "created_utc": 1700854892,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalq6xa",
   "message": "NTA. Your first responsibility is to yourself. You did the right thing by taking care of yourself and your needs. To be perfectly honest, he sounds like a piece of shit who was taking advantage of you. Your gut told you all you needed to know. Don't second-guess it.",
   "created_utc": 1700855176,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalqcv9",
   "message": "Nta he is a jerk",
   "created_utc": 1700855243,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalslnb",
   "message": "When you realize you would rather be alone than deal with his bs, it's time to drop the rope  NTA",
   "created_utc": 1700856148,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalt39h",
   "message": "NTA. Good for you! He sounds like a terrible partner.",
   "created_utc": 1700856347,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam0lc3",
   "message": "NTA. You’re right.",
   "created_utc": 1700859329,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam39xv",
   "message": "NTA",
   "created_utc": 1700860406,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam4uar",
   "message": "I’m so proud of you and please don’t look back. Hope you have a great rest of your holiday season!",
   "created_utc": 1700861026,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam5fas",
   "message": "Nope,  definitely not TA OP.",
   "created_utc": 1700861252,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam7gf6",
   "message": "NTA. Your boyfriend was a narcissistic asshole and you're much better off without him.",
   "created_utc": 1700862065,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam9gmm",
   "message": "NTA and you are right, who asks the guest to bring the entire dinner? Sounds like he told his family he would bring everything but meant you.\n\nYou dodged so many bullets. Never talk to this jerk again.",
   "created_utc": 1700862892,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamaplb",
   "message": "NTA. If anything, you let it go on too long. He didn't treat you the way you deserve, you have nothing to feel guilty about. Always stand up for yourself.",
   "created_utc": 1700863407,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamc814",
   "message": "Don't look back and don't feel guilty. He sounds vile.",
   "created_utc": 1700864034,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamefst",
   "message": "NTA - you did good kid",
   "created_utc": 1700864959,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamg9bk",
   "message": "Absolutely NTA They had made a decision to expect the guest to bring basically the entire Thanksgiving meal (well all the expensive parts) That’s on them. Not your responsibility.",
   "created_utc": 1700865723,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kami65q",
   "message": "NO, NO, NO, NO, NOT TA\n\nYou deserve someone who loves, cares for and supports you, not this spineless user.\n\nLet him stew in his own self-pity and have your revenge on him by being happy in your own beautiful skin",
   "created_utc": 1700866535,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kami9my",
   "message": "NTA! You made the right decision. You deserve so much better than your ex.",
   "created_utc": 1700866575,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaminws",
   "message": "NTA. Good job on taking care of your needs and realizing your value.",
   "created_utc": 1700866745,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamiud9",
   "message": "NTA sounds like it was about time",
   "created_utc": 1700866822,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamjasc",
   "message": "NTA you did great and your respond to him was amazing. You do not need to care about him anymore since you have broken up. Dude can take care of himself and the aftermath he caused.",
   "created_utc": 1700867020,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamnyw2",
   "message": "NTA - he used you as a resource to improve his life. But gave nothing of value back. \n\nHe’s lucky you stuck around this long.",
   "created_utc": 1700869111,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamqbac",
   "message": "NTA he didn’t want a girlfriend he wanted a servant! He’s an entitled selfish man child! You absolutely deserve better!! Take care and don’t give him another thought 😞",
   "created_utc": 1700870177,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamrypq",
   "message": "NTA and proud of you.",
   "created_utc": 1700870935,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kams721",
   "message": "His family wasn't relying on a guest for their turkey, they were relying on him. \n\nHe just off-loaded all his responsibilities onto you like you just exist to fetch stuff for him. I'd bet he wouldn't have been too sad if you said something came up and you couldn't do dinner...as long as you first delivered the turkey. And pie. And wine.",
   "created_utc": 1700871042,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamxi5c",
   "message": "What a shower of free loaders!!  You’re well rid of the lot of them.",
   "created_utc": 1700873455,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kandoo1",
   "message": "Bravo, OP.  Bravo!  👏👏👏👏👏🥳",
   "created_utc": 1700881034,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kanjza8",
   "message": "NTA good for you!",
   "created_utc": 1700884131,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kanquyg",
   "message": "NTA. You did well to leave a man who treats your terribly. Well done 👍🏽",
   "created_utc": 1700887733,
   "score": 2,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalfobl",
   "message": "NOT!!!! True…why are you lying??? They did have a turkey, YOUR  EX!!! Lol, NTA,",
   "created_utc": 1700850894,
   "score": 3,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam7j6h",
   "message": "NTA. What a b@stard. He probably is better looking and more confident than you, but an absolute pr@ck and a waster.\n\nDon’t be with a man like that. He just wants to boss you about. He has no respect for you.",
   "created_utc": 1700862097,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalm8wz",
   "message": "NTA\n\nBut….\n\nWhy would he help you do a task you took on yourself? You didn’t *have* to assist your parents with their business….you chose to. Why should he be expected to help?",
   "created_utc": 1700853583,
   "score": 246,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalsh43",
   "message": "NTA. You truly burned the bridge with his family though so hopefully you are good with staying broken up.",
   "created_utc": 1700856097,
   "score": 254,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kal9tsx",
   "message": "ESH. He’s an asshole and you’re just a mess",
   "created_utc": 1700848528,
   "score": 222,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamj0yv",
   "message": "It's good to break up with him, but it's definitely weird and dramatic to break up with him on your way to Thanksgiving dinner. Like I understand that he offended you and you needed to break up with him then, but you could have handled it a lot differently: by saying no to picking up extra stuff. A simple word. No. But well if you didn't feel like going and it's a large event with many people I suppose it was okay not to go.",
   "created_utc": 1700866902,
   "score": 254,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kampnjq",
   "message": "There is nothing wrong with breaking up with Joey if you need to. But his family didn't do anything to you, it was all Joey. So they were told you were bringing the turkey and you cancelled on the way to their home for the dinner? That was an asshole thing to do to the family when it is Joey who is the problem. All of the additional things he asked you to bring were what he wanted, the family was not involved. So in your haste to break up with Joey, you hurt his family who had nothing to do with what he was doing to you. There is nothing you can do about it now.",
   "created_utc": 1700869878,
   "score": 252,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalj5cz",
   "message": "I’m not sure, it would have been considerate for you to make an appearance to drop off the turkey, say hello, then fake some illness so you could leave and THEN dump him. \n\nIt also sounds like there are kismet expectations and lack of communication likely from both sides here. I don’t think it makes you or him an AH, but worth it to figure out how to communicate better.",
   "created_utc": 1700852319,
   "score": 235,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalpbzw",
   "message": "\u0026gt;I made time for us, listened to his work-related problems, but wasn’t taken out on dates\n\nDid you take him out on dates?",
   "created_utc": 1700854828,
   "score": 244,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamrr67",
   "message": "YTA. Bigtime . Huge. You ruined his family thanksgiving .",
   "created_utc": 1700870840,
   "score": 250,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kalyau4",
   "message": "Oof, Reddit will make a miserable cat lady out of you in no time! Good luck!",
   "created_utc": 1700858412,
   "score": 250,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam8ada",
   "message": "NTA. They expected you to bring the turkey even though you weren’t hosting?? Plus pie and wine? Wtf was he bringing to his family’s dinner? He should have been too embarrassed to admit that you were central to the feast. What a bunch of mooches!",
   "created_utc": 1700862411,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam8ryz",
   "message": "NTA, you just saved your own life!! Good on YOU.",
   "created_utc": 1700862612,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kam9nal",
   "message": "You sound like a hard working and thoughtful person and your ex sounds like he got exactly what a person like you described deserves.\n\nYou did the right thing, I'm sorry you wasted the time, care, and cash on those ingrates.",
   "created_utc": 1700862969,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kama43l",
   "message": "I don't know you, but I am proud of you.",
   "created_utc": 1700863159,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamafts",
   "message": "From the way you have described this man, he sounds absolutely like bad news. I can't believe he let you spend $200 on things to bring to a Thanksgiving dinner. That is absolutely not right! Sounds like he was using you. I'm glad you're getting away from him, you deserve much better",
   "created_utc": 1700863293,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamaq67",
   "message": "NTA. Well done on dumping his sorry, condescending ass!",
   "created_utc": 1700863414,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamarpw",
   "message": "NTA\n\nDude sounds like the kind of guy who thinks he's the man and therefore can do whatever and gets the last say.",
   "created_utc": 1700863431,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamatff",
   "message": "NTA screw him for snubbing your ornaments",
   "created_utc": 1700863451,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamb1fv",
   "message": "You are, of course, NTA. But he certainly is a huge, flaming asshole.\n\nWell done on you for recognizing what was happening and how he was using you. That is not OK. Absolutely not a healthy relationship, and I’m glad you are out of it.\n\nPlease stand your ground. He sounds like the type who will try to love bomb you. If so, please don’t fall for it. You sound like a very kind and generous and giving person.\n\nPlease remember that you deserve the same qualities back from somebody that you are in a relationship with.",
   "created_utc": 1700863544,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamc3h7",
   "message": "NTA  It sounds like this was a long time coming but he finally broke it with his superior attitude.",
   "created_utc": 1700863982,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamcprh",
   "message": "You dodged a bullet. Now stick to your guns",
   "created_utc": 1700864237,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamcq8z",
   "message": "I hope they actually *were depending on the turkey you were bringing!* \n\nIn fact? I hope they had no turkey, no wine, no pies, and no kind and caring guests! \n\nThey are all selfish assholes, with your ex being the king asshole! \n\nNTA!",
   "created_utc": 1700864243,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamcrjm",
   "message": "NTA.  Glad you dumped his abusive, messed-up ass. Along with his equally messed-up fam. GOOD LUCK!",
   "created_utc": 1700864258,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamcxts",
   "message": "NTA. They can go to the shop  and buy a turkey themselves. I feel handmade gifts are more personal, so never stop doing that.",
   "created_utc": 1700864330,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamd2t5",
   "message": "You seem incredibly emotionally healthy. I wish everyone could see as clearly as you were when you broke up with him. NTA.",
   "created_utc": 1700864388,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamdiib",
   "message": "NTA. Good for you for setting boundaries and following through. Break ups suck, but being treated poorly and your partner acting like you, your family or your lifestyle as 'less than' is FAR worse. I can't wait until you're on the other side of this break up and you're wildly happy for yourself!",
   "created_utc": 1700864569,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamdqjm",
   "message": "NTA. That guy is rude and not husband material. You did the right thing! I hope you have a much better man that comes along who shows you what love really means ❤️",
   "created_utc": 1700864664,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamdz4o",
   "message": "Definitely NTA!  He is.",
   "created_utc": 1700864765,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kame101",
   "message": "NTA, the way you describe him, I would have thought we were dealing with a 15 year old in a teenage relationship; certainly not a 40 year old whose parents clearly failed.",
   "created_utc": 1700864787,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kame9wf",
   "message": "NTA. \n\nYou didn't leave his family without a turkey for Thanksgiving. They had him.",
   "created_utc": 1700864890,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamea5z",
   "message": "NTA. You want a partner, not a man-child to take care of.",
   "created_utc": 1700864893,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamf4g3",
   "message": "NTA. You are so much better off without this inconsiderate leech.",
   "created_utc": 1700865248,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamfi7k",
   "message": "NTA.  You made the best decision ever!!!",
   "created_utc": 1700865408,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamfmzi",
   "message": "When someone is a jerk and treats you bad, please do not ask if you are an asshole for breaking up with them. You did it late but you did the right thing, do not question it.",
   "created_utc": 1700865462,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamgq88",
   "message": "NTA. I though my head be in his 20’s, then I went back and realized he’s 40? Yeah, move on girl.",
   "created_utc": 1700865921,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamgrdv",
   "message": "NTA. He’s a user, he never supported you or from what it sounded like he didn’t even like you.",
   "created_utc": 1700865934,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kami4ry",
   "message": "NTA",
   "created_utc": 1700866518,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamkuht",
   "message": "NTA. Relationships are about give and take. But not when one partner gives and the other just takes.",
   "created_utc": 1700867699,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamlcjw",
   "message": "NTA it sounds like you should have done this a long time ago. Also I hope his family didn’t have a turkey, or any pies or any drinks, I hope they had to sit drinking tap water, eating sides and glaring at ur ex, it would serve him right and maybe show his family what a selfish pos he is. Either way, you deserve better, you can do better, go spend time with ur family, kids and friends, build up ur confidence knowing that you dont have to put up with a selfish man baby. You will b better off alone, that’s already an improvement on what you had, when you date again if they don’t bring you happiness, joy and positivity move on. Life is too short to waste time with people who only take from you, people who are negative, being alone is better than being treated badly. Go have some fun, enjoy yourself and if you meet someone who adds to your life great, if not your more than enough on your own.",
   "created_utc": 1700867924,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kammh2p",
   "message": "Are you serious? Your ex is a total jackass! Just reading about him makes my skin crawl. You are so thoughtful and kind. Please don’t ever speak with him again. And do t date anyone else until you learn to love yourself. Never let anyone treat you bad.",
   "created_utc": 1700868430,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kammud6",
   "message": "NTA. What a leech. Good for you!",
   "created_utc": 1700868600,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamv3wm",
   "message": "GIRL, I am so proud of you. This guy sounds like utter trash. GOOD for you for throwing him out. I always host big events for around 15 people at least because our family is big. And while I appreciate people bringing a bottle of wine or a little something, this is insane. They're absolutely screwing you over. You're literally bringing the whole dinner? NTA.   \n\n\nI almost hope this is a fake story because if people like this exist, I have no hope for humanity.",
   "created_utc": 1700872361,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamv82d",
   "message": "Wow this sounded exhausting and heart breaking . And he was more concerned about not having turkey than you being upset. He prob thought you never leave even though he is treating you like crap . Good on you. You have your family, your kids, what do you need him for?",
   "created_utc": 1700872414,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamvdm9",
   "message": "NTA - he was offloading his responsibilities for the dinner onto you so he didn’t have to do jack NO ONE expects a guest to supply the main dish of a meal! That’s insane!",
   "created_utc": 1700872483,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamwukb",
   "message": "NTA\n\nThe doormat has finally found a nice shiny spine. Good for you.",
   "created_utc": 1700873153,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamxqdf",
   "message": "NTA. And I'll just say my wife makes and sells handmade works all the time, since before we were even dating. I've always thought it was the best ever when she gave me something she'd made, or gave them to people as gifts - don't you let your ex'es attitude stop you making things.",
   "created_utc": 1700873561,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kamy72a",
   "message": "NTA. He was taking advantage of you, and treating you like shit. He deserves no turkey or pie.",
   "created_utc": 1700873779,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan0i7n",
   "message": "NTA\n\nHe was using you and belittling you for your efforts.",
   "created_utc": 1700874845,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan2buv",
   "message": "NTA. Your ex boyfriend was a selfish jerk, and you are well rid of him. I hope that your friends and family can step up and show you extra love and support, what with  all you do for them - you sound like a wonderful and generous person and you deserve to be cherished for that, not taken for granted. Sending you a big hug and the hope that the year to come will bring you wonderful things! 🧡🌻🌟",
   "created_utc": 1700875682,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan4wgn",
   "message": "Good!      \nFor!     \nYou!!!!!",
   "created_utc": 1700876857,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan958d",
   "message": "NTA. You endured more than most women would have... start fresh and find someone worth their salt.",
   "created_utc": 1700878848,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan96zb",
   "message": "I see no fault in your actions.  NTA",
   "created_utc": 1700878869,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan9jzb",
   "message": "Omg what a douchebag good riddance! NTA he sounds like a narcissist entitled a hole. Do not go back!",
   "created_utc": 1700879040,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kan9xw6",
   "message": "Nta it doesn't sound like he brings anything positive to your relationship",
   "created_utc": 1700879231,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaneasn",
   "message": "NTA, so glad you are out of that relationship. Yeah, he is a user. You deserve better.",
   "created_utc": 1700881326,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaneqb7",
   "message": "Should have dropped him ages ago. \n\n\u0026amp;#x200B;\n\nNTA.",
   "created_utc": 1700881535,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kanid5k",
   "message": "Nta",
   "created_utc": 1700883311,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kao07t2",
   "message": "NTA, everything you described sounds like a man using you. You’re much better off.",
   "created_utc": 1700893198,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kao8kos",
   "message": "You totally did the right thing your boyfriend (ex) didn't treat you right at first u should talk about it to him but then in the Thanksgiving incident you had to break up like tells the guest to get the turkey and wine and soda and pie and count the people who are coming to a guest",
   "created_utc": 1700899056,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaobrqx",
   "message": "NTA. He sounds like a horrible and selfish user. What kind of family asks the son's girlfriend to bring the turkey and pretty much everything else?",
   "created_utc": 1700901429,
   "score": 1,
   "submission_id": "182xkwn"
  },
  {
   "comment_id": "kaoct5w",
   "message": "NTA - He sounds like a gold digger.",
   "created_utc": 1700902242,
   "score": 1,
   "submission_id": "182xkwn"
  }
 ]
}