{
 "submission_id": "1830ryc",
 "title": "I called the police on my Grandmother",
 "selftext": "To preface, Grandma had a stroke and a heat attack in late Spring. While is most of the way healed, she still isn't back to herself 100%. I'd say maybe 90-95%. Her short-term memory is what was mostly affected. For instance, she still can't remember when all of her doctor's appointments are scheduled. She has been medically cleared to go back to all regular activities, i.e. handling money, up and down stairs, ect. However, she still has to take a driver's retest to determine if she can have her driving privileges back. This means that the rest of the family is supposed to split up driving duties for Grandma. But Grandma is much too impatient to wait for one of us to have a day off or get out of work so she can go run around. Mind you, when she grocery shops, she only buys groceries for that day and maybe one or two days after. I just found out that Grandma is driving herself around town and her children aren't actively doing anything to stop it. They are of the thought that , \"Well, that is less work that I have to do\".  Granted, I don't think that she was caught but now the police are aware of the situation and will be on the lookout for her. \n\nMany friends and family drive without a valid license. Usually because fines and fees from minor tickets are outrageous and they can not afford to pay. But Grandma lost hers due to a serious medical issue. I seriously worry about her safety and the safety of others. The woman hasn't managed her own medication since her stroke and can't even drive a motorized wheelchair at the store. My spouse and 1 sibling know that I have done this, but i know for a FACT that the rest of my family would be up in arms if they ever knew. Please tell me that I am not the AH for \"anonymously\" calling the police!",
 "created_utc": 1700856376,
 "permalink": "/r/AITAH/comments/1830ryc/i_called_the_police_on_my_grandmother/",
 "score": 89,
 "url": "https://www.reddit.com/r/AITAH/comments/1830ryc/i_called_the_police_on_my_grandmother/",
 "comments": [
  {
   "comment_id": "kalvlqy",
   "message": "NTA. You likely saved someone’s life, perhaps your grandmother’s. I’ve had two elderly neighbors die in accidents because they should not have been driving. One of them killed another person along with herself.",
   "created_utc": 1700857355,
   "score": 86,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kam6rhw",
   "message": "Recently in my city, an elderly man drove up onto a sidewalk and killed two women eating dinner at a sidewalk table. Very sad. \n\nNTA",
   "created_utc": 1700861784,
   "score": 153,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamp6dy",
   "message": "You are very much NTA. I hope the story I’m about to tell you helps you really understand just how much you’re NTA. Back in September of this year, my coworkers cousin was traveling home with two of her sons plus a nephew. It was about 10pm, they had had a great evening together until an elderly woman with dementia hit them head on. The elderly woman had just left her daughters house, pulling out of the subdivision onto the wrong side of the highway without her headlights on. She didn’t make it very far, but unfortunately she was not seen by my coworkers cousin or any of the children in the car until it was too late. The last words of the driver were, “what is that?” The driver (my coworkers cousin) and her 11 year old son passed away instantly. The other two children in the car were horribly injured physically, and will never be the same mentally. As for the demented old lady, not a scratch on her body. She was laying in the hospital after the accident without a clue in the world what she had just done. She doesn’t remember the wreck at all. HER FAMILY takes zero accountability, they don’t think this accident is on them at all. It’s sickening. THANK YOU for caring enough about your grandmothers safety, and the safety of others enough to do the right thing.",
   "created_utc": 1700869664,
   "score": 108,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kaly04o",
   "message": "You are NOT the AH. Your family on the other hand? Full of AH’s.",
   "created_utc": 1700858293,
   "score": 232,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamjbt0",
   "message": "NTA. I'd be hiding granny's keys or taking the battery terminals off so she couldn't leave on her own without someone connecting the battery. She's a danger. You love her but you did right in ensuring the safety of those she shares the road with. \n-sincerely someone who's been hit by two elderly women that weren't supposed to be driving .",
   "created_utc": 1700867032,
   "score": 74,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kalwl5b",
   "message": "NTA. She could hurt herself or someone else.",
   "created_utc": 1700857731,
   "score": 59,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kam2301",
   "message": "The safety of others. If she wants to kill herself, that’s on her. Driving is a privilege, not a right.",
   "created_utc": 1700859925,
   "score": 69,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kam6p9r",
   "message": "Realistically you are NTA. You are trying to keep your grandma safe as well as others. Memory loss from dementia or stroke is difficult. It can make people aggressive and that makes it so hard to reason with them logically.\n\nHonestly, the inactive attitude of everyone else has forced you to be the designated AH, because you aren't willing to just shrug and neglect your grandma. They should be ashamed of themselves. If there were an accident they'd either be acting devastated or scrambling to not take the blame for her driving herself so much.",
   "created_utc": 1700861759,
   "score": 55,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamgs3z",
   "message": "NTA. She is going to kill someone or herself.\nWe took my Pop's car keys off him as he refused to stop driving and he was dangerous. No keys meant he couldn't drive. In the end he gave in and we sold the car.",
   "created_utc": 1700865943,
   "score": 26,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamdwaf",
   "message": "NTA\n\nFamily members who enable this kind of dangerous activity in a person who is obviously impaired should be held responsible for that inaction if something awful happens.",
   "created_utc": 1700864731,
   "score": 26,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamj10q",
   "message": "As somebody whose grandmother drove after medical issues and had numerous collisions, you are NTA\n\nIf I'd had the opportunity to call the cops on my grandmother I would have.",
   "created_utc": 1700866902,
   "score": 19,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kampp0k",
   "message": "NTA. My father has Alzheimer’s. He was diagnosed year and a half ago, but he has been declining for some time. My parents hid it very well until my mom passed in December 2020. \n\nAt that time, he gave me a POA for everything. It’s still took me a year and a half to get all of his darn vehicles away from him. It is not as easy as people think. \n\nAnd in my case, mainly, because even when I got them down to a vehicle, I knew if I took it, he still presented well enough, that he could have removed me as his POA, and if he did that, he would not appoint anyone else. And that literally would have meant that he would’ve lost his home and everything shortly thereafter because he has no idea of what his bills are or the fact that he runs in the rent every month and I make up the difference.\n\nIt can be such a fine lime when parents start declining. He had not been formally diagnosed until I took over and got all the testing done, and even then, because of the pandemic, it took almost a year to get the final test done and get the diagnosis of Alzheimer’s. \n\nAnd even after I got that last vehicle away from him, he still had friends who would just loan him vehicles. It is so much harder than people, realize, and you are walking this fine line of wrangling things that they shouldn’t have away from them, without pissing them off enough that they go into court and manage to get themselves out from under what is a very necessary safeguard for them.",
   "created_utc": 1700869896,
   "score": 22,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamiy1k",
   "message": "NTA, ever, for something like this. Reporting a loved family member due to concern for their safety and the safety of others takes guts. \n\nAnyone who knowingly looks the other way, and would condemn someone for speaking up would be an asshole. \n\nRisking ones own safety is one thing. Actively risking other people's (without their knowledge) is another.",
   "created_utc": 1700866866,
   "score": 17,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamvnjg",
   "message": "NTA - In August, a man that shouldn't have been driving veered across the road, around tree stumps, around the corner of a house and into the backyard of my parents' house.  That man hit my father and my 15 year old nephew killing them both.  My mother had only just walked away and saw it all.\n\nI wish someone had cared enough to take his keys.\n\nThank you.",
   "created_utc": 1700872605,
   "score": 14,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamel1z",
   "message": "NOT the AH. You are protecting her and many others that she could come in contact with. Maybe the family could come up with some sort of Grandma calendar with days, times n errands so that Grandma can also see n understand what she should prepare for. Talk to her about writing a list every couple days for groceries(try for a week). Maybe she's lonely n just wants to socialize. Any senior care centers she could attend? Good luck, I take care of my parents so I understand the struggle",
   "created_utc": 1700865020,
   "score": 13,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamhwyp",
   "message": "NTA - God forbid you save someone’s life. 🙄",
   "created_utc": 1700866426,
   "score": 13,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamt76w",
   "message": "Yeah hi, been there, we all called the police on my grandmother. Still had her license, but didnt have all her head (we were in process of getting... Custody? Anywhose, a mandate)\n\nAfter twice driving up to the gas station that is litteraly 30 meters away from her house and calling us to get a ride because she was lost, scared, and she had NO IDEA where she was, we decided to start calling the police fhe moment she left her home by car.\n\nNTA",
   "created_utc": 1700871504,
   "score": 11,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamq2jr",
   "message": "I wish I'd done something like this for my grandmother. When I was 17 she and I were on our way back from the grocery store stopped at a stoplight and she asked me what color the light was. I was concerned but unsure of what to do. A few minutes later she informed me that she couldn't really feel her feet anymore most days. I told her to pull over and I drove us the rest of the way and drove her everytime I was with her but I lived 2 hours away and couldn't always be there. My dad and uncle did nothing when I spoke to them so MawMaw kept driving. Fortunately she never hurt anyone or herself but I hate to think now of the danger she was in and putting people in.",
   "created_utc": 1700870066,
   "score": 11,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kaluooi",
   "message": "You didn't do it anonymously.  The minute Granny gets popped, your sibling is going to totally rat you out.  So be prepared for the fall out now.  \n\nYou're not the asshole, but that doesn't mean the rest of the family isn't going to crucify you.",
   "created_utc": 1700856990,
   "score": 17,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamrs42",
   "message": "NTA. Caring for aging loved ones is a thorn patch of awful decision making. You had to protect her and others. You made the call out of love. Keep holding onto  that love. She needs you now more than ever.",
   "created_utc": 1700870852,
   "score": 10,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamvtii",
   "message": "My friend's father started forgetting how to get places and had a silver alert out on him before she and her sibling discussed taking his keys away. He had made it to the Canadian border trying to go to Arizona when they found him. (We live in Wisconsin. He was very confused.) \n\nThey had to take his shoes away because he wandered badly. He just took theirs that he could find instead.\nOne night in the middle of winter, we got a call that he'd been missing several hours. (Friend's dad is a friend of my family.) I was afraid we'd have to let his family know we found him frozen to death on the side of the road. \n\nThat's when they finally got help to find him the help he needed. The man was calling car dealerships to try to get a new key made for his car behind his children's back. They'd remove parts to try to keep the car from starting. As the car was in his name only and he was widowed, he was the only one who could do anything with the car. \n\nThe police would watch for him driving, but they didn't put him in jail. They just told the family that if they didn't get him help or take better care of their father, they would have him taken away for elder abuse. \n\nYou are NTA. Your enabling family is. Grandma could be seriously injured and hurt someone else. Lots of older adults start experiencing confusion after that. Good on you helping her out when you are able to. If nothing else, maybe help her planning her shopping, or start sending the supplies to her via Instacart or something? It sucks being stuck at home, and maybe a home-carer would be something your family might be willing to plan out for her together?",
   "created_utc": 1700872681,
   "score": 9,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamym96",
   "message": "NTA I'm sorry but your family members who are turning a blind eye to grandma driving sound so very selfish. It's less for them to do but I'm sure that everyone in your area values their safety as much as they value their free time. That law is in place for a reason! I understand, more than I'd like to, that is annoying to have to revert back to waiting for a ride just to run to the grocery store for a couple things. A head injury/seizures have put me in the same position for the last 4.5 years after I was hit by a drunk driver who passed out on a heavily traveled road. ANY accident is bad but knowing that your life is uprooted, has been for half a decade and will continue to be for the foreseeable future, all because someone you didn't even know existed, was selfish, did what he knew he shouldn't because he didn't give a damn about anyone but himself. Is your grandmother and your family ready to have that on their conscience? I was lucky and didn't die but now I have to worry about injuring my head further due to the effects of my head being injured! Is your family ok risking doing that to someone-so they can have a few minutes of down time?! If they are, or just refuse to think about it, hopefully if your grandma causes an accident, she hits one of them and not a child or some innocent person who didn't know they needed to avoid your grandmother's area. \n\nThis may sound harsh, but it's a sorry/not sorry type thing. My life is still messed up, I still can't even babysit my niece on my own because I could have a seizure and if it were me and her alone, she could get hurt or scared and I can't risk it with her. But the man who was at fault, his life is back to normal now. He's off probation already and I still don't know if this will ever go away for me. I guess it doesn't bother some but it would have killed me to think I did this to someone because of my own stupidity.",
   "created_utc": 1700873976,
   "score": 7,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamkily",
   "message": "NTA, sounds like you should work on getting her keys through.",
   "created_utc": 1700867552,
   "score": 6,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamrz1l",
   "message": "You're possibly saving lives by doing it. Definitely not the AH",
   "created_utc": 1700870939,
   "score": 5,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan20jl",
   "message": "You are NOT TAH\n\nA stroke is a very serious medical condition that can have many complications which are not obvious.  You mentioned that she has short-term memory issues which could manifest in her driving.  You did the right thing and may have saved her life and the lives of innocent people.\n\nYou do not have to out yourself to your family but if they find out don’t let them berate you for taking action to prevent a potential accident.",
   "created_utc": 1700875534,
   "score": 6,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kammynl",
   "message": "NTA. Head on over to r/AgingParents where you can rant and maybe get some sympathy and coping tips. I say maybe because those darn parents have a mind of their own - very aggravating.",
   "created_utc": 1700868654,
   "score": 5,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamnjm4",
   "message": "NTA. The fact that your family is aware of the situation and is doing nothing to prevent grandma from driving actually puts them at liability if she gets into an accident and it’s determined she shouldn’t have been driving in the first place. Kids have been successfully sued for their elderly parents causing wrecks and injuries. You did what you felt necessary to protect grandma and everyone else on the road.",
   "created_utc": 1700868920,
   "score": 6,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamzl48",
   "message": "NTA!!!!! In my town, we had an elderly couple go missing for three months last year. They should NOT have been driving, neither of them! They both exhibited memory issues and had a slew of health issues. And they didn't even have their licenses legally revoked yet. They were found on an barely used maintenance road, an hour and a half from their home, dead from the cold. They had gotten lost. You may save your grandmothers life with your actions. At some point, safety MUST come before her pride. It's an unfortunate reality but a very crucial one.",
   "created_utc": 1700874425,
   "score": 4,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan25ls",
   "message": "NTA. My old next door neighbor was a nasty, bitter woman. She had 2 kids that never came to see her unless, you guessed it, they need something. But even so, the day she showed up at my house to cry that she couldn't run the washer, I went into action. I put out messages for her kids, picked up mail, etc. She drove a big truck, \u0026amp; tried to continue driving. Oh, hell no. So one night I called all the neighbors \u0026amp; told them NOT to let her drive. I was letting the air out of all 4 tires as we spoke. There was no way, nasty or not, that I was gonna let her behind the wheel of that truck! Even so, it still took her kids over 2 months to finally get in touch. Don't be mean to your kids, folks. It may come back to haunt you when you're older.",
   "created_utc": 1700875600,
   "score": 5,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanjisl",
   "message": "NTA.  You'd be the asshole if you didn't call.\n\nLook, Grandma isn't thinking clearly and just wants to go back to life as usual, but she can't.  A car is a massive weapon and she is wielding it without judgement and care.  It's like being drunk or texting, your attention is not where it should be when you are behind the wheel.\n\nHow would you feel if she crashed and killed herself?  Even more, how would you feel if she took out a family just crossing the street?  Smashed up a school?  I remember an old guy mixing up the gas and brake pedals who plowed into a farmers market while he was trying to park.  He took out like 20 people.\n\nDon't let anyone guilt you for this.  They are busy doing what is expedient for themselves, not what is right.",
   "created_utc": 1700883897,
   "score": 5,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamoy85",
   "message": "NTA honeybee, my grandfather was not medically there with sight and when crossing off the freeway he ended up rear-ending someone and was upset that he lost license. My grandmother begged me to help him drive but the thought of someone else INCLUDING his safety, would be at a high risk!",
   "created_utc": 1700869562,
   "score": 4,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kams0fy",
   "message": "You not the AH you might have to say someone’s life I live in a state where I tried to call on a senior citizen who should not be driving and they have no laws and that is scary",
   "created_utc": 1700870956,
   "score": 5,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamzlzu",
   "message": "NTA. Disconnect the battery of her car or slightly dislodge the starter fuse so the car won't start and conveniently misplace the car keys somewhere in the house where she is not likely to find them. In the electric pannel door on a little nail or hook. Who will think of looking there lol! She is a danger not only to herself but to others as well. Your family is the asshole not doing anything about it. And please don't tell anyone about what you do because at some point or another they will rat you out.",
   "created_utc": 1700874436,
   "score": 4,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanb3sj",
   "message": "NTA, You're good dude.",
   "created_utc": 1700879787,
   "score": 4,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanh7xm",
   "message": "NTA \n\nYou are saving your grandma and anyone from potential harm incase something was to happen to her behind the wheel. \n\nYour family should not be turning a blind eye to this. \n\nMy MIL has a bunch of medical issues, she can still legally drive but they recommended she drive less, so now at least half of her outtings include her being picked up in an access ♿ transit vehicle or cab/Uber to take her to wherever she is going that day (usually one of her church events). \n\nMy husband has to talk her out of going out when she's sick because she grew up constantly working hard and still going out on her errands or wherever. \n\nLuckily she lives with us (we have a basement suite she lives in with her two dogs) so it's easier for us to check on her and make sure everything's fine. \n\nYou did the right thing.",
   "created_utc": 1700882739,
   "score": 4,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kao7ayk",
   "message": "NTAH \nMy father was being tested by a neurologist for Lewy Body dementia. He was always eccentric, headstrong and drove like a fiend even at his best times. My mother allowed him to drive. After he got lost driving from my grandmother’s house to home (a 2 hour drive, he was gone for 6 hours and came home angry and crying because he got lost,) my brother came to the house and removed his car battery and hid it. \n\nSometimes you have to do the right thing when every one is doing the easy thing.",
   "created_utc": 1700898117,
   "score": 4,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamuahd",
   "message": "I have a history of seizures and am not yet legally cleared to drive. If I was reckless enough to get behind the wheel, I'd hope my friends and family wouldn't enable that behavior. She can get hurt and that's one thing, but waking up after an accident to find out you've ended somebody's life is a terrible possibility. It's so much worse than the inconvenience of being unable to drive.",
   "created_utc": 1700871996,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamvsk5",
   "message": "I can't imagine how it will feel if I someday get to the point that I can't drive. That's my freedom and has brought me so much happiness. I don't know if I'll ever be willing to give that up. \n\nThat being said, NTAH. I hope if I ever get to the point that I'm a danger and liability, and refuse to give it up, my friends or family do that before I hurt someone else.",
   "created_utc": 1700872669,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamyxv7",
   "message": "You could practice test with Gramma before she has to take the test as a refresher.  Not sure I could pass without practice. It is offered in our state DMV online for practice. This would help a lot to give her back her independence as she probably feels like she is a burden. Of note our small town grocery store is a social center and often provides needed contact for senior citizens here",
   "created_utc": 1700874128,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamyyof",
   "message": "NTA. You potentially saved her life and someone else’s - at minimum, you’ve saved her from a costly and stressful accident if both parties are unharmed. Safety comes first. \n\nOlder individuals can become more stubborn as they age and lose their independence. Having a hobby, a set date every week, or a “purpose” can help keep them calm as they lose their sense of normalcy. Maybe help her find something she likes to do (painting, puzzles, etc.), watch a show that airs weekly, meet with her for lunch once a week, etc. if you can to help with the transition.",
   "created_utc": 1700874139,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan33uv",
   "message": "NTA.. The thought of a woman who can't safely drive an accessibility scooter at a store driving a 2 ton vehicle is horrifying.",
   "created_utc": 1700876040,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan6wzu",
   "message": "NTA\n\nMy FIL has dementia and moved in with my SIL and her husband. They “hid” the car keys from him but he somehow kept finding them 🙄 I told them several times what a big issue that was and offered them tons of options about how to keep him from getting behind the wheel. \n\nHe ended up taking the car one day and hit a van with a woman and her child, luckily everyone was ok. The in laws did a much better job of keeping the keys from him after that but I was livid how lax they had been in the months leading up to the incident. \n\nThen they wanted my help with questions they had about the lawsuit that was filed against their insurance. I refused and told them to pay an attorney to answer them since they had been irresponsible enough to let him keep getting behind the wheel even though they knew he was a danger and didn’t want my help to actually prevent this from happening at all.",
   "created_utc": 1700877789,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan7jpb",
   "message": "NTA, I recognize why people would be upset but it’s the same as taking the keys from a friend who’s planning on driving under the influence, they’re a danger to themselves and others and until cleared to drive safely I think that was a good thing to do",
   "created_utc": 1700878092,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanjp4j",
   "message": "Call your grandma's doctor and see if they will report her to MVA as unsafe to drive. Some states allow a doctor to get a senior's license revoked. May go over easier with the family if it comes from the doc/MVA.\n\nYou're NTA. Thank you for protecting others.",
   "created_utc": 1700883986,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kao517d",
   "message": "I'll never forget the day when a woman left her elderly husband in the car while she went into the store. She left the keys in the car to keep the heat on for him. After a bit he decided to go look for her but just slid over on the seat and drove the car into the store. Right through this plate glass windows into the cashier bagging area. He killed a mother, toddler and injured others. He had Alzheimer's.",
   "created_utc": 1700896492,
   "score": 3,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamxqmb",
   "message": "NTA but honestly you should be calling the cops on your other non-licensed relatives too. If they have so many \"minor\" infractions that they aren't allowed to drive then they clearly don't know how to properly drive either",
   "created_utc": 1700873565,
   "score": 5,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamosqd",
   "message": "We had to physically take the keys from my grandmother when she started going. NTA all the way",
   "created_utc": 1700869493,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamp2vh",
   "message": "NTA. She could kill someone.",
   "created_utc": 1700869621,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamp9he",
   "message": "NTA. You care. That's it.",
   "created_utc": 1700869703,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kams4dv",
   "message": "Definitely NTA. A lot of old people cause a lot of accidents that turn into deaths. You’re saving someone’s life",
   "created_utc": 1700871008,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamtxxk",
   "message": "As someone who works in this environment - the laws are there for a good reason. Her ability may be impaired and that's the need for the testing.",
   "created_utc": 1700871838,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamu4jl",
   "message": "You're a HERO for saving innocent lives (including Grandma) and her car insurance is not valid if she is not licensed.  That means any damage she causes whether medical or property is on her.",
   "created_utc": 1700871921,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamu61h",
   "message": "NTA. Ur probably saving lives and her's I hope she is able to get off the road quickly",
   "created_utc": 1700871940,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamyst4",
   "message": "NTA. They'll probably know it was you but someone has to be the grown-up here.",
   "created_utc": 1700874062,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamz644",
   "message": "Easy fix: move Grandma's car to someone else's house and take the car key (and any duplicates) and keep those at said house too. Do not mention who has vehicle. Problem solved for now. And NTA.",
   "created_utc": 1700874234,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamzyp4",
   "message": "We simply took the keys away from my grandma when she was no longer capable of safely driving. She was pissed, but dealing with some anger was better than her hurting or killing herself or someone else. NTA.",
   "created_utc": 1700874598,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan1ehp",
   "message": "If my child died because someone like that was driving...hell would be unleashed.",
   "created_utc": 1700875253,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan4nfa",
   "message": "When my grandfather was suffering from dementia,  my family took and bid his keys and pulled the spark plugs.   We refused to let him kill himself or others.  NTA, but like others have said,  your family is full of AH.",
   "created_utc": 1700876742,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan79db",
   "message": "NTA\nIf she can't manage an electric cart she 100% should not be driving a car.",
   "created_utc": 1700877952,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan7z11",
   "message": "The fact you have to hide this act from your family should tell you all you need to know.",
   "created_utc": 1700878296,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kancsmi",
   "message": "NTA\n\nI have been and will continue to be vocal about if my kids every feel it's no longer safe for me to drive, tell me. I would rather my feelings be hurt than hurting someone. I've already lived thru not being able to drive for 7-8 months due to medical issues, so I'll cope again.",
   "created_utc": 1700880605,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kand9dt",
   "message": "Nta ... your grandmother could kill herself or someone else . Her children or grandchildren need to take the keys and the car and park it at one of their places or in storage. If she calls the police to claim theft explain the situation . Also someone trustworthy in the family should have power of attorney if she needs help managing her affairs. Does she have a caretaker ? Many elderly and disabled people can get one through department of human and social services. They come out do an evaluation and say how many hours you get a month to help with activities of daily living.  Then she would have someone to drive her around.  Also getting her a bus pass and set up to ride the shuttle may not be a bad idea . It'd sad to see her kids aren't stepping up here but I suspect everyone is burnt out . You did the right thing. Don't feel bad. If you live in a small town most likely they will take her keys call someone and give her a warning maybe a ticket . Some states offer paid FMLA but either way family members can apply for intermittent leave so they can care for her without notice to work. You are federally prot3cted and cant be fired for using it.  I wish you luck caring for family is never easy .",
   "created_utc": 1700880829,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kandf5x",
   "message": "When I was young I helped an older gentleman get his groceries into his car because he seemed a little wobbly. He thanked me, slowly got into the driver's seat and floored it completely diagonal across a busy two way street. A lady with her 6yo in the back-seat copped it to the side of her trunk, spun out and pinned a pedestrian against a parked car (he jumped up in a split second so only had his legs injured thank god) and the gentleman appeared to never touch the brakes as he slammed straight into a brick wall.\n\nTake Nana's keys.",
   "created_utc": 1700880907,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kandstv",
   "message": "NTA - just do yourself a favor and don't tell your family.",
   "created_utc": 1700881089,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kang3n8",
   "message": "NTA.  You are protecting your grandmother and others.  Who is going to allow Grandma to move in when she loses her house and all her assets to pay a court judgment?  When you are responsible for someone else's property damage and bodily injuries, they can accept money from the insurance company OR they can go after you directly, take your house, your property and garnish your wages to pay a court judgment. \n\nIt is hard to give up one's independence and rely on others, but there is a time when it must be done.  I'm mid 50s and last year, I was hospitalized several times and knew I was unsafe to drive.  I couldn't safely walk from one end of the house to the other.  Not being able to drive was frustrating but what was more frustrating were the friends who told me \"call me any time if you need anything\" but were always \"too busy\" to drive me even though everywhere I needed to go was within a mile radius of my home.  I've cut off contact with those \"friends,\" so I understand your grandmother's frustration with her family and her \"eff it, I'll do it myself\" attitude. \n\nEveryone needs to step up and help her get out of the house. Find out if your city's transit department has a special bus for seniors/disabled that can be scheduled for pick up/drop off so she can go to the store and to her appointments/activities. My city also has a plan in which seniors can use a taxi at a greatly reduced rate.",
   "created_utc": 1700882199,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kang7w9",
   "message": "Aaaaand this is why my parents and I long ago had The Conversation. They flat out said if I decide they shouldn’t be driving someday, I should take away their keys. They gave me “permission” while in full control of their faculties and said I should remind them when the time comes that we agreed to this. I appreciate this a lot because I am an only child so it will be all on me to make decisions about their care when the time comes. Fortunately, they are both just early 70s and quite busy, but I know life can change in a flash. My mother-in-law was the opposite - we had to force the issue and move her against her will when a neighbor called to say she wasn’t going out to shop or get her meds or anything and she clearly couldn’t live safely on her own. She lived 12 hours away from us so my husband flew there, told her to pack a bag, and drove her to an assisted living I had arranged near us. She was devastated. She was fiercely independent and being stuck in a single room for Covid broke her. It’s so important to plan for your future. She just wanted to stay in her own home and be independent until she died, so she never made any plans for any other possibility. So my folks and I are talking about what they want and how they feel about things because of everything I’ve learned not to do from my mother in law.",
   "created_utc": 1700882257,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanl132",
   "message": "NTA\nRealistically we should be retesting after a certain age anyway but that’s a different text. I’ve seen way too many crashes and out comes an older person who has no clue what just happened. It’s dangerous for other people on the road but *also* for her, what if she’s fine but can’t react in time to someone else?\nYou did the right thing \u0026lt;3",
   "created_utc": 1700884672,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanukqq",
   "message": "NTA. This is such a hard decision but you’re on the right path. Now please go take the car keys and disable the car. I have a friend who took the keys from his mother once she was declared legally blind. She contacted the dealership and had them send her a new key. He had to disable the car to stop her from driving. My husband and I had to take the keys from his mother. She was really out of it near the end. We had one big scare and that was it. We took the keys. We felt horrible but we knew it was the right thing to do.",
   "created_utc": 1700889795,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanv6ze",
   "message": "When my grandmother was aging, we had to get her doctor to write a letter to the state asking them to revoke her license because that was the only way we could keep her from driving. NTA you’re keeping her and everyone else safe.",
   "created_utc": 1700890152,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanx526",
   "message": "I called the cops on my mom, stroke victim, but paralysis on the right side.... i have no idea how she was able to get into the car. But found her powerchair next to the parking spot. \nThey found her behind a target. She ran into a dumpster and was trying to figure out how to get back...... i was 18, she was 43...... weird time of my life.... dunno why im posting this. Good luck\nNTA",
   "created_utc": 1700891291,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kao3xdl",
   "message": "I'd be extremely pissed off if one of my loved ones was hit by someone who shouldn't have been driving. \n\nMy 78yr old dad doesn't drive and we don't let him. He's got medical issues. He understands this too. \n\nNTA",
   "created_utc": 1700895725,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kao85i6",
   "message": "Licensing employee here; you're doing the right thing, genuinely. Safety is our priority, and we put in a lot of work to make certain our populous is healthy and able to drive. Not everything is perfect of course; but such a phone call could help keep her and others from being seriously hurt. NTA",
   "created_utc": 1700898745,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kao89ml",
   "message": "Fortunately my Grandma retired herself from driving before it became a problem.\n\nOp, NTA\n\nIs there a rideshare service in the community, or a senior day program that takes trips to stores regularly? Another option is food delivery which ranges from groceries to fully prepared heat and serve meals.\n\nLast option is an apartment in a senior residential complex that offers both meals \u0026amp; shopping trips.",
   "created_utc": 1700898826,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kaoadba",
   "message": "You are saying that many of your friends and relatives drive without a license?!?!?!  You should call the police on them too!  \nNTA for protecting the public.",
   "created_utc": 1700900394,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kannjhk",
   "message": "INFO: your friends and family with revoked drivers licenses due to citations are a *demonstrated* hazard on the roadway. Your grandmother’s loss of ability is theoretical. Why the double standard?",
   "created_utc": 1700885978,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan29oo",
   "message": "NTA We just had a teenager hit and critically injured on his motorcycle because some 85 year old grandma was driving and decided to commit a hit and run at a traffic light.",
   "created_utc": 1700875652,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamucgt",
   "message": "ESH Geez. Just disable her car. It’s not that hard. Her kids are ridiculous \u0026amp; dragging the police in seems like overkill to me.",
   "created_utc": 1700872021,
   "score": 0,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan91nh",
   "message": "NTA but why don’T you just take the day off and take her down to do the driver’s retest so she can get her license back. Then she’d be licensed and no one would need to drive her around and you wouldn’t be potentially getting her in trouble.",
   "created_utc": 1700878802,
   "score": 0,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kangvlg",
   "message": "NTA. Granny is. Why these old women can’t change one thing when they get older of the habits they had when they were younger m, I don’t know. But they don’t.",
   "created_utc": 1700882573,
   "score": 0,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamtpx5",
   "message": "This story, slightly altered was just posted on here yesterday.  The difference was that grandma got caught, got her warning, but was determined to drive again and no one was planning to stop her.   I think some of these stories are being generated using ChatGPT or something similar, possibly testing is function or possibly using this platform to get some experience.  I could be wrong, but once I gave it some thought, I realized the many of the stories are very similar in style and structure with story lines that often run parallel.  If anyone else has noticed something a bit odd here, hit me up and we can compare notes and possibly discover something interesting.  Thanks.",
   "created_utc": 1700871738,
   "score": 255,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamk0hn",
   "message": "I can't wait to see how yall reap what yall sow then. Cause literally there are places that deliver your groceries. Or even have food delivered to their grandma. And the resort is calling the cops.. what kind of shit! \nKarma will come back to yall!",
   "created_utc": 1700867329,
   "score": 251,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kaoadix",
   "message": "YTA! That was a messed up thing to do. Mind your own business!",
   "created_utc": 1700900398,
   "score": 254,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kaob7t2",
   "message": "Mind your own business. Yta",
   "created_utc": 1700901020,
   "score": 254,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kalvu6h",
   "message": "Yes, I think getting her incarcerated is far better than offering your services proactively so she stays safe.\n\nYTA",
   "created_utc": 1700857443,
   "score": 239,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kame29c",
   "message": "Why didn't you offer to take her on more of your time, honestly that's crazy to me. \nYou prefer to see your grandma in jail, then to make sure your available more often to make sure she isn't on the road.",
   "created_utc": 1700864802,
   "score": 242,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan3l4t",
   "message": "The cops are not the good guys and you should treat them as a use of deadly force. If you wouldn't shoot someone over something, you shouldn't call the cops on someone doing that thing",
   "created_utc": 1700876258,
   "score": 250,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamn1y0",
   "message": "YTA. There are other ways you could have handled that other than setting your grandma up to get in trouble. Like take her for her test to get her properly evaluated to see if she is ready. If you were my grandkid, I’d disown you.",
   "created_utc": 1700868697,
   "score": 246,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kammd3u",
   "message": "you are a complete asshole I hope the family disowns you",
   "created_utc": 1700868380,
   "score": 244,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamxao8",
   "message": "You're not the asshole. But you definitely should not have told anyone else in your family. You definitely don't want that getting around because no matter how right you are for what you did there's always going to be a Karen in the bunch",
   "created_utc": 1700873359,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamxlpv",
   "message": "Can she get a scooter and still go grocery shopping? My mother-in-law had to do that and she loved it once she tried it. She could drive it right into the grocery store.",
   "created_utc": 1700873501,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamxslr",
   "message": "I’m torn. You just left an old woman stranded. If you and your husband are going to provide all her transportation, then NTA. But if she is stuck immobile with no more extra help, then yeah, YTA.",
   "created_utc": 1700873590,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kamz814",
   "message": "NOT the AH at all. anyone in your family who would be upset are the AHs for sure. you’re an anonymous hero. you may have saved many lives",
   "created_utc": 1700874258,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan0a6f",
   "message": "Absolutely NTA. You are doing the public a service by keeping a dangerous driver off the road.",
   "created_utc": 1700874743,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan5hsh",
   "message": "Did you talk to her about it before you called the police. Hey grandma my concerns are A. B. C. I know you don't want to wait on everyone but until you are cleared you absolutely can not drive anywhere. I'm concerned that since you aren't 100% so maybe you don't realize the dangers but A. B. and C. could occur if you continue. If not, then you're an A. H. If , you did and she refuses to stop that's different.",
   "created_utc": 1700877129,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan6g8c",
   "message": "NTA\n\nThat's a very difficult situation you've been put in. I'm sorry for you to have to make such a hard call like that. I hope she fully recovers.",
   "created_utc": 1700877570,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kan6uoj",
   "message": "I'd talk to her first, give her an opportunity to fix the problem.",
   "created_utc": 1700877759,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kane1jc",
   "message": "NTA my grandfather’s doctor was very clear, driving against medical advice is not only dangerous for the patient, it could be fatal to an innocent bystander\n\nWe all hid is keys afterwards, it feels awful, but not worse than having an innocent person’s death on my consciousness",
   "created_utc": 1700881203,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanerge",
   "message": "You care more about your grandmother than some other relatives do.  You are NTA.  Sometimes one has to call the cops on the ones they love to keep them safe.",
   "created_utc": 1700881550,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanfuq1",
   "message": "Maybe start with Adult Protective Services or equivalent instead of cops? Just trying to avoid getting poor sick grandma hit with a felony or something.",
   "created_utc": 1700882081,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanjp4q",
   "message": "NTA. You had considered the safety of others. You can't go wrong with that",
   "created_utc": 1700883986,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanjqw2",
   "message": "NTA at all. You literally did the correct thing and probably saved a few lives. \n\nI was in a car accident a few years ago and who hit me was someone who definitely should not have been behind the wheel at all.",
   "created_utc": 1700884011,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanlazc",
   "message": "There’s been a terrible case here in Australia where a man having a medical episode ( diabetic) hit and killed 5 people and injured another 5 , 2 of them seriously. Devastating for the families involved and the small country town it happened in. \nNot the areshole",
   "created_utc": 1700884812,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanldce",
   "message": "NTA.  Also, look into having groceries delivered to her \u0026amp; local senior transportation services.  That is what my MIL does since we took her car away.",
   "created_utc": 1700884847,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanm03x",
   "message": "My 92 year old mil is still driving and my husband doesn’t think she should be. While going to the grocery store she hit a curb and blew a tire. Doesn’t sound bad but she was never a good driver. My kids refused as children to ride with her. She scared them half to death. She drove to our house a few weeks ago and got lost. We’re worried in general. She will never stop until she is forced to do so. We want to quietly let the police know too. Her other son thinks she’s fine. Our fear is obviously that she’s going to hurt a person. Im really glad you did that. My husband is torn right now.",
   "created_utc": 1700885179,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanq286",
   "message": "NTA.\nThere are SO many horrific accidents caused due to medical issues. You possibly saved your grandma's life, as well as others.",
   "created_utc": 1700887303,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kant81r",
   "message": "NTA\nA friend on a motorcycle took a highway exit that was going down, so with limited view, and was surprised by an incoming elderly lady who took that exit for the entrance. By luck, he didn't freeze and was able to pass between the wall and the car. But hey, she was so sorry.\n\nAlso, just having a medical issue or medications can be a problem. A guy killed a pregnant woman by passing out when he wasn't to drive with his medical condition.\n\nIf family are mad, ask them to put their child in the car every time grandma drive.",
   "created_utc": 1700889030,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kantec1",
   "message": "You're not. Thanks for saving my life with her not driving anymore. I had to report a lady driving up the off ramp of a highway. We took my MIL license and car away.",
   "created_utc": 1700889129,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kanti3j",
   "message": "NTA\nHow can she drive a car at all if she can’t even drive a motorized wheelchair at the store? The police should just impound her car until she gets her license back.",
   "created_utc": 1700889187,
   "score": 1,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kantkh7",
   "message": "NTA. Good for you for doing what you had to to keep her and others safe. We struggled getting my dad to stop driving. Luckily the police pulled him over and noticed he seemed out of it one night and said he'd need to take a special driving test (there's no way he could pass it at this point). I was so relieved. \n\nJust make sure to keep it to yourself. Sometimes folks fess up to stuff as to feel less guilty. If these family members let her drive to avoid having to drive her around, there is no way they're going to ever be alright with what you did.",
   "created_utc": 1700889225,
   "score": 2,
   "submission_id": "1830ryc"
  },
  {
   "comment_id": "kaohjyd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1830ryc"
  }
 ]
}