{
 "submission_id": "1831eam",
 "title": "Aita for leaving with the kids and not bailing my (soon to be ex) husband out",
 "selftext": "My husband and I just went on vacation with our kids (6, 3, 10mo). My SIL was supposed to pick us up from the airport. We texted when the flight landed and she liked the text so we waited in baggage claim for her. \n\nAround 30 minutes passed and we decided to call her after multiple texts. She told us that she couldn’t pick us up because her kids wanted to go mini golfing. It was 9:30 at night. My husband snapped. He was cursing and started throwing bags around. I panicked. I put my 6 year old in the stroller and we ran. I called my brother, he picked us up, and we’ve been staying with him. \n\nMy husband was arrested. The bags injured a few people and he got into a fight with security when they tried to stop him. He called me and asked me to bail him out but I refused. I decided I didn’t want to be around him after what he did. I filed for divorce and his mom bailed him out. \n\nNow he’s asking to see the kids but I don’t feel safe letting him go near them. Everyone except my brother is saying he’s their dad and he has a right to see his kids. He’s gone to my sister’s house and my brother’s house to look for us but my brother covered for me and said we’re not here. He’s helping me get a TRO but I’m not sure that I’m doing the right thing by trying to keep him away from the kids",
 "created_utc": 1700858080,
 "permalink": "/r/AITAH/comments/1831eam/aita_for_leaving_with_the_kids_and_not_bailing_my/",
 "score": 130,
 "url": "https://www.reddit.com/r/AITAH/comments/1831eam/aita_for_leaving_with_the_kids_and_not_bailing_my/",
 "comments": [
  {
   "comment_id": "kam4sot",
   "message": "I mean, lucky you--there's almost 100% certainly airport security cam footage to show the divorce judge.\n\nThis can't be the first time he's flipped his shit and acted like this--your gut is telling you the right thing.  Protect yourself and your kid.  If he does this in a highly secure area, he's going to have no problem escalating in private.",
   "created_utc": 1700861008,
   "score": 158,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kalygn3",
   "message": "NTA\n\nThis was an insane reaction. I can understand if he threw his own hat onto the floor in frustration, though even that is not advised near customs, but his reaction is insane and dangerous and he did that in front of the kids.\n\nAt this moment, just get a lawyer and ask for legale advice",
   "created_utc": 1700858476,
   "score": 124,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kam8uvf",
   "message": "NTA. His reaction raises legitamate questions about his ability to control his anger and actions, which could potentionally pose a threat to your children. You should be speaking with an attorney immediately regarding custody, but I would be pushing for supervised visits only for now, based on that event. There's a record of it, so it shouldn't be too much of a stretch for people in your life to understand why you don't want your kids with him unsupervised. If they don't, ignore them. It's your kids and your family and you have to do what's best for you.",
   "created_utc": 1700862646,
   "score": 164,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamameh",
   "message": "He could have called an Uber and calmed his tits.",
   "created_utc": 1700863370,
   "score": 103,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kam6hzh",
   "message": "Nta there is something wrong with your husband if he's responding like that. And reading your comments, he isn't very involved with the kids, it's surprising he wants to see them.",
   "created_utc": 1700861676,
   "score": 63,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kambnin",
   "message": "NTA. Supervised visitation only if that. This dude is a ticking time bomb.",
   "created_utc": 1700863800,
   "score": 32,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kambp4h",
   "message": "NTA\n\nTalk to a lawyer to help you file for emergency custody. Do not let him take the kids until you go to court because if you do, he legally has the right to hold onto them as he is their father. You have the same right. \n\n Now, IANAL and don’t know the laws everywhere. My advice is US based. Not all states are the same so check the laws in your area.",
   "created_utc": 1700863819,
   "score": 34,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamfez1",
   "message": "\u0026lt;sigh\u0026gt;  \n\nI have a relative who always completely loses their shit when they're upset about something.   My feeling is: yes, I understand your frustration and why you're angry, but what you're **not** going to do is have a fucking temper tantrum like you're a child when you're a grown-ass adult.  Not with me, not near me.  \n\nYour husband chose the absolute WORST place to have a temper tantrum.  Anyone who's taken a plane since 9/11/2001 knows you do not fuck with TSA.  You *will* be arrested.  This is not a game.  Plus those bags he was throwing arond belonged to other people and he could've been damaging their shit.  \n\nI'd have left his ass there too.",
   "created_utc": 1700865371,
   "score": 14,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kambv4s",
   "message": "Are you the AH for leaving your abusive husband?  No.",
   "created_utc": 1700863887,
   "score": 12,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kaly58a",
   "message": "Seems like the guy has a Neanderthal brain. \n\nI mean NTA for wanting to protect your kids from someone who can’t control their temper, but how is he most days with the kids?\n\nCould this be a one off incident?",
   "created_utc": 1700858349,
   "score": 52,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamkq4t",
   "message": "INFO:  Where does one go to find young children just heading off to mini golf at 9:30pm?\n\nThis doesn't sound real.",
   "created_utc": 1700867645,
   "score": 10,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kam9lnu",
   "message": "as an adult I no longer talk to anyone in my family that used to guilt my mom into forcing us to be around a man we weren't safe with. for years this included my mother because instead of apologizing like a normal fucking human she would double down and say she was just doing the best she could. which I understand was the best she understood how to do but I also needed her validation that in hindsight we deserved better, all of us, her included\n\nnta",
   "created_utc": 1700862949,
   "score": 20,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kam5v2u",
   "message": "NTA. If he did that in a public space with security people with weapons nearby and probably tons of security cameras around then god only knows what he’d do in private. Good on you for not sticking around to find out",
   "created_utc": 1700861422,
   "score": 9,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamc951",
   "message": "You are absolutely doing the right thing.  Imagine if one of those flying pieces of luggage had hit your child....",
   "created_utc": 1700864047,
   "score": 7,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamhhn6",
   "message": "OP, this situation calls for the help of a lawyer, a good one. If you want sole custody or primary custody, you have to get it through family court, you can't just hide the kids from their other parent over the long term.\n\nSo - lawyer.  NOW.",
   "created_utc": 1700866247,
   "score": 9,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamiyri",
   "message": "He just snapped because he didn’t get picked up from the airport? Was this the first time he’s done something like this?",
   "created_utc": 1700866874,
   "score": 7,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamvdv6",
   "message": "There has to be more to the story. I'm not buying the story at face value here.",
   "created_utc": 1700872486,
   "score": 7,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamzevp",
   "message": "You would need to file an emergency protection from abuse and an emergency custody hearing and ask for supervised visits for him due to his aggressive outburst.",
   "created_utc": 1700874345,
   "score": 7,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamavxo",
   "message": "Sooo was this a one off or he acts like this in general? Also what did you do about your AH sister that left you stranded?",
   "created_utc": 1700863481,
   "score": 13,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamd050",
   "message": "NTA. Your husband has serious anger issues. Yes, he's their father and yes, he needs to see them, BUT it absolutely needs to be supervised. He also needs anger management.\n\nUntil you can get a TRO in place and honestly, an attorney files paperwork, he can FaceTime the kids.\n\nYour job as a mom is to keep your kids safe. You're doing exactly what you need to do. Thankful that you have a good brother.",
   "created_utc": 1700864357,
   "score": 5,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamwjqp",
   "message": "If it was 930 pm I just wanna know where tf they went mini golfing",
   "created_utc": 1700873016,
   "score": 7,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamfm8e",
   "message": "This seems so fake. Your sister took her kids mini golfing instead of picking you up.  1. You are cool with that 2. Your husband hated\"ragged out\" and you ran with the kids and filled for divorce 3. He called you to see the kids and nothing else.",
   "created_utc": 1700865454,
   "score": 11,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamme7d",
   "message": "Terrible creative writing exercise. 0/10\n\nNext time make it more believable, and make sure your timing of events make sense.",
   "created_utc": 1700868395,
   "score": 24,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamt7tj",
   "message": "This story screams as being fake",
   "created_utc": 1700871512,
   "score": 8,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kameu2p",
   "message": "No you’re NTA for leaving an abusive POS who lashed out IN FRONT OF HIS CHILDREN and PHYSICALLY HURT people. Protect your children!! Get a GREAT lawyer be ready for false claims about you and parental alienation if he (or his family) gets access to the kids.",
   "created_utc": 1700865127,
   "score": 5,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamfu9x",
   "message": "Fuck him. And yo fuck the SIL. Sounds like that whole family is trash",
   "created_utc": 1700865545,
   "score": 4,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamp382",
   "message": "For some reason I’m the most posed at the sister in law.",
   "created_utc": 1700869626,
   "score": 5,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamher2",
   "message": "Lazy one",
   "created_utc": 1700866213,
   "score": 4,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamyn0c",
   "message": "NTA. My ex husband had a temper. His mother had money so he paid for his right to see his kids. He beat my youngest unconscious. She recovered physically but not emotionally. He never once became physically violent before I filed for divorce, just lots of screaming and calling names. Think about this every time someone tries to guilt you into giving him the right to see his kids unsupervised. Your husband became physically violent before you left him. They only get worse not better!",
   "created_utc": 1700873985,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan2wns",
   "message": "Sounds like a wacky family you married into.\n\nThat said, you can't just kidnap and hide the kids like this",
   "created_utc": 1700875947,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanhnk1",
   "message": "NTA There is a hierarchy of rights and a child's right to be safe is well above a parent's right to be present in a child's life.",
   "created_utc": 1700882954,
   "score": 5,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamk8rg",
   "message": "So, you've obviously been with the guy for almost a decade and this was the first time he's done anything like this.. and you're just immediately done with him? And before anyone gets at the ass over me saying this, she herself commented that he's never done anything like this and has only \"*talked about beating people up.\"* Does it sound like he has an anger issue? Sure. But if he's never done anything against you or HIS OWN KIDS then you're def the asshole from not allowing him to see his own children.\n\n\u0026amp;#x200B;\n\nIf this post didn't already seem fake with kids mini-golfing at 9:30 PM",
   "created_utc": 1700867430,
   "score": 7,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamm8d5",
   "message": "YTA for posting this bogus story.",
   "created_utc": 1700868320,
   "score": 9,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamgem8",
   "message": "NTA..... BUT... you may want to check into your state laws regarding children and parental alienation. While I understand your fear, no need to possibly cause further issues for yourself.",
   "created_utc": 1700865785,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamnlci",
   "message": "\u0026gt;Now he’s asking to see the kids but I don’t feel safe letting him go near them.\n\nI've got bad news for you. What you've described in this post is likely not enough for you to get full custody without visitation.  Of course you should do what you think is best to keep the kids safe, but in the long run he is likely going to get to see his kids. \n\nI am not a lawyer, but have been around a lot of them and heard stories. One common them of family law issues like this is that as bad as your situation is to you, the court has seen situations completely worse. For example, in one situation, the father literally killed one kid on accident. He still got supervised visitation.\n\nWhat you've described is definitely not good, but it's likely not enough to keep him from his kids permanently.",
   "created_utc": 1700868941,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamuebu",
   "message": "The statistic I read in my domestic violence class was the average women was hit 34 times before filing a report.   NTA.",
   "created_utc": 1700872045,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamx58s",
   "message": "NTAH \n\nHow are you \u0026amp; the kids doing now? This must be a lot for them to take in.",
   "created_utc": 1700873289,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamxbwe",
   "message": "Good idea to cut and run. But you bred with him three times?",
   "created_utc": 1700873375,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanebpp",
   "message": "No one gonna talk about the POS worthless sister who bailed last minute and started all of this?",
   "created_utc": 1700881338,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanhfek",
   "message": "This sounds like a tall tale. No one takes little kids to mini golf late at night, which is the excuse given for sister not picking them up. Then husband goes loony tunes in the airport, injuring people with thrown luggage? Nope. This would have gone viral. Either there’s a ton of missing information or this didn’t happen.",
   "created_utc": 1700882841,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanxj44",
   "message": "Feel like there is a whole lot missing as this went from 0 to 60. Missing leap from incident throwing bags goes to must divorce him to keep kids safe. People with temper problems do not have one off incidents. Is there history you are leaving out? People at end of their ropes do have one offs which begs the question of why was he at end of rope. What are you leaving out?",
   "created_utc": 1700891526,
   "score": 3,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamhqt9",
   "message": "This is 100% fake lmao",
   "created_utc": 1700866355,
   "score": 5,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kam5qgi",
   "message": "This is more fake than wrestling. Lol.",
   "created_utc": 1700861373,
   "score": 19,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kameizr",
   "message": "Ok , obviously NTA , it's just a shame it took this long to see his true colors\n I would say he is absolutely the AH , BUT your sister is also a selfish idiot for leaving you stranded ( not justifying the husband's reaction , but just a shitty thing to do ) hope you stay safe.",
   "created_utc": 1700864996,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamiocs",
   "message": "Very much so NTA. The only way he should see the children is with a 3rd party present. Someone who is willing to go ape shit in public over what would've been an easy fix with a taxi or Uber, shouldn't be trusted around small children. It's not even just that he could hurt them, it's about what your children witness their dad doing.",
   "created_utc": 1700866750,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamje87",
   "message": "NTA but your husband and SIL are.",
   "created_utc": 1700867061,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamjjdq",
   "message": "NTA. He could have hurt one of the kids acting like that.",
   "created_utc": 1700867122,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamjjgd",
   "message": "NTA get legal advice but ffs don’t let him around your children unsupervised not unless you legally have to which I very much doubt considering what’s happened. Ask your lawyer about setting up supervised visits with a social worker or whoever it is where you are if he has to see them otherwise no,  no, no and again no.",
   "created_utc": 1700867123,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamshr8",
   "message": "You need to see an attorney asap. Trust me",
   "created_utc": 1700871179,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamsi8l",
   "message": "Tell your brother you're grateful.",
   "created_utc": 1700871185,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamtdgs",
   "message": "NTA you need to push for anger management and supervised visits. And by a neutral party\n\nLuckily you weren’t hurt. But this family sounds horrible. Your STBX fighting at the airport. And your SIL leaving you stranded at the airport. Count your blessing that you’ll be able to get away.",
   "created_utc": 1700871583,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamtlh8",
   "message": "Get a lawyer and discuss this with them please. NTA",
   "created_utc": 1700871683,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamyyv3",
   "message": "NTA \n\nEven if this was a one time event, likely not, that’s really excessive. If a person is unable to control their body and physical reaction, the best people to help are the authorities. \n\nWhile he’s likely pissed, he’s hopefully humbled by his experience. \n\nKids wise, it’s not about your husband or you for that matter. It’s about the protection of the children. Any court will say that. If that means they don’t see him for a little while until it’s legally sorted out, then so be it. \n\nThat being said, get on that order asap. Last thing you need is an unstable person saying you’ve taken his kids. Yes, there’s surveillance of his behaviour, sadly it’s always act first when it comes to the safety of children. And last thing you need is an Amber alert (assuming you’re in North America)",
   "created_utc": 1700874142,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan2bko",
   "message": "Make inquiries with District Atty as to possibly of mental health or Anger Management as a condition of husbands hearing on charges. He needs help",
   "created_utc": 1700875678,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan2wi6",
   "message": "Congratulations on leaving the abusive POS.. get your lawyer to subpoena the airport footage.\nThen let the judge decide what visitation he gets. If you have medical records for you and the kids from physical assaults that strengthens your case.\nThe judge can decide from evidence an testimony if he gets supervised visitation or custody. \nSounds like he's a \"hands off\" parent when it come to the raising part and a hands on when it comes to abuse. \nDon't let him know where you are till the judge says so.",
   "created_utc": 1700875945,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanus5b",
   "message": "there is a huge chunk missing. Like I will assume this is not his first time losing his temper. Has he had previous arrests for the same things? Something tells me there is a history of some kind of verbal or physical abuse. Not just this post.\n\nYou could ask for supervised visits or simply ask that he not have visitation until he shows he has gotten therapy for his anger issues.",
   "created_utc": 1700889916,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kao96vz",
   "message": "I'm sure this story is 100% true and not bias bs",
   "created_utc": 1700899520,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kao9bx7",
   "message": "NTA. How much rage and little self-control does it take to get like this in an *airport?* He's lucky he didn't get shot by security. Going to guess this is a very unstable person who has made you afraid before, of not caused actual harm. Protect yourself and your kids.",
   "created_utc": 1700899626,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamntyx",
   "message": "NTA.\nHe sounds unhinged and dangerous. Request the footage from the airport so it isn't lost or over-recorded. Divorce him and get a restraining order asap.\n As an aside, the person who pissed off mini-golfing without bothering to tell you that she'd reneged on the lift is a tool. Who pulls a trick like that?",
   "created_utc": 1700869049,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamoil7",
   "message": "NTA. When he started letting loose, your instinct was to. Panic and run. You knew reasoning and de-escalating was not an option. That tell you right there that he is a volital, dangerous person. Keep your kids safe.",
   "created_utc": 1700869365,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamfe2t",
   "message": "Fake. Mini golfing at 9.30? And then no taxi or Uber? Faaake",
   "created_utc": 1700865360,
   "score": 1,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kammvyh",
   "message": "NTA - I’m gonna assume this isn’t his first extreme overreaction am I correct? I do have to say that the fact that the sister just decided to not pick you up and instead go mini golfing (wtf?!) and not inform you of the change in plans, speaks volumes about the family you married into.",
   "created_utc": 1700868620,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamt0e5",
   "message": "TBH we need more context like is this the first time he's ever done this or does he snap often, was there a major build up of several extremely stressful events events or just the sister being a ass and deciding to go mini golfing after saying she'd pick y'all up.\n\nIf it was a build up of several different events till he eventually snapped and this was the first and only time it ever happened you're a asshole everyone has a limit and men typically has decades of built up stress from the weight of the responsibilities they have to carry without sufficient support from people around them because if you need help you're perceived as weak and a unfit partner and this isn't a opinion this is a unfortunately satistic from a majority of people. This is especially considering his outburst wasn't target at you and the kids but just a general outburst around.\n\nIf it's anything else like no build up or this has happened before then they're justified in the divorce but if he's not been violent or abusive the kids ever before then you're weaponising the kids against him because the outburst was targeted at you and the kids in the first place.\n\nI do get the feeling you left out a lot of context and details like most people on here do to make things look more favourable towards you.",
   "created_utc": 1700871417,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamv0sb",
   "message": "So everything has been great and you went on vacation together and he had some weird outbreak that is not normal and you decided at that moment to let him go to jail, not bail him out, and divorce him?",
   "created_utc": 1700872323,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan19ad",
   "message": "NTA. He can’t control himself. Nobody is safe with him.",
   "created_utc": 1700875188,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamnumf",
   "message": "Do not let him see the kids until you have a order in place.",
   "created_utc": 1700869057,
   "score": 2,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamo32q",
   "message": "God I hate reddit takes whether this is real or fake. She is dead wrong. If he's never hit or abused anyone it's an total overreaction and he has legal rights to his children. \n\nNot the asshole for leaving him at the airport. The asshole of the year for parent alienation. Women don't own their children. They are not possessions or pawns.",
   "created_utc": 1700869166,
   "score": 1,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamkss8",
   "message": "NTA. If this is real, set up a visitation schedule. He’s never shown physical abuse to you and the kids(from what you’ve said) but he has a temper.\n\nSo supervised visitation and you don’t have to see him.",
   "created_utc": 1700867678,
   "score": 1,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamn8gv",
   "message": "NTA\n\nBut by god your SIL and husband are",
   "created_utc": 1700868780,
   "score": 1,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanbmmj",
   "message": "You won’t get  a tro. Hiding your children is not going to,look good when you go to court to settle custody. He’ll probably get 50/50 if he asks for it",
   "created_utc": 1700880035,
   "score": 1,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kaoe8yh",
   "message": "Go back to sleep, Liz!",
   "created_utc": 1700903370,
   "score": 1,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamktc0",
   "message": "NTA.  You are doing the right thing.  Your kids will not be safe with such a person.  It does not matter that he is their father.",
   "created_utc": 1700867685,
   "score": 255,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamf0fx",
   "message": "He literally does have a right to see his kids, until you get a legal way to prevent him all you're doing is illegally keeping them from him. Arrange visitation, do it somewhere public, limit the time and have someone else go with you and supervise the visit if you don't want to stay with him. Like go with your brother, brother stays with kids and husband, you wait outside and a few hours later, over. denying acecss looks terrible in front of a judge.\n\nYou say he's never been violent before or with the kids so you have no genuine reason to fear for their safety, denying access will just look like you're punishing him or the kids, either way it will look bad. AS yet the thing from the airport is nearly zero chance of allowing him partial custody during a divorce  either. Almost your best bet of him losing custody is if during a supervised visit now, he acted out and got violent again but it's unlikely.",
   "created_utc": 1700865203,
   "score": 255,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamla2w",
   "message": "Stop questioning yourself. You ran with your kids cause you knew he would flip out and you’re obviously scared of him. So you know the answer, your abusive partner should not be around your children.",
   "created_utc": 1700867893,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kammm8l",
   "message": "Get out, stay out and protect the kids. Have someone else pick up your stuff when his isn't home, don't go yourself. Get the TRO and make sure you keep a detailed diary of any conversations etc from him or from people on behalf of him. Keep copies of any emails and texts. Buy a small gopro type camera, they are cheap.",
   "created_utc": 1700868496,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamy65v",
   "message": "Op has to be from some backward ass part of the world.  When the guy your married to doesn't exist except to provide a paycheck that's some hills have eyes shit going on. Your a baby factory and that's it.\n\nLemme guess, he supplied the birth control pills?",
   "created_utc": 1700873766,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamxrmh",
   "message": "Wow, you truly acted as a very bad wife and mother. He is wrong to have that kind of emotional outburst, but to divorce someone for one incident is insane. You lack empathy, love and respect for your husband and you are wrecking the lives of your kids, your husband and your own over one incident. \n\nYou truly don’t understand the purpose of marriage and need a serious reality check. YTA majorly.",
   "created_utc": 1700873578,
   "score": 254,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamncym",
   "message": "NTA \n\nYou're protecting your kids.",
   "created_utc": 1700868837,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan5r3h",
   "message": "This didn’t happen. 😂",
   "created_utc": 1700877246,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kangc6x",
   "message": "This post and comments are the epitome of many Reddit subs. People making wild and harsh judgments based on so little info. Husband gets angry because his sister failed to pick up the 5 of them (including 3 young kids) after a flight arriving after bedtime so wife flees with kids and files for divorce and restraining order?? We are left to speculate about previous actions of husband and other things. Scared enough to flee with kids, refuse visitation of kids, and file RO, but not scared enough to not take kids and self outta town alone with him for vacay? I know domestic abuse cases can be unusual and tricky, but nothing here makes much sense.",
   "created_utc": 1700882315,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kanqkd8",
   "message": "Divorce over a meltdown?? He didn't attack her. Something dosent make sense. \nThis is a made up situation or something. \nThat little tantrum never would warrant a Divorce or having someone's kids taken away that's absolutely f.ked up over such a petty thing. I'd be out looking for my kids who were stolen from me as well.\n\nI'd be curious to know the real story here.\nThis lady sounds overly nuts and overreacting from. What little information was given. \nCompletely abandoned her life partner when she was needed the most. Definitely a major wife failure.",
   "created_utc": 1700887574,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamf0e2",
   "message": "NTA but let him see his kids",
   "created_utc": 1700865202,
   "score": 254,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamvn6y",
   "message": "He has a right to see his kids. Why do mothers allways think they are more important? \n\nHave he ever hit the kids or been abusive towards them?",
   "created_utc": 1700872601,
   "score": 254,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamrakq",
   "message": "Not bailing out is fine imo. Divorce may be pushing it and preventing him from seeing his kids is definitely a dick move.... At least judging on what you wrote",
   "created_utc": 1700870629,
   "score": 255,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamq3cl",
   "message": "So after a stressful trip, the cunt of the SIL decided to go minigolfing and leave 5 people stranded at an airport. His reaction while extreme is the only extreme reaction he's had and the bitch of an OP is going straight to divorce. We're missing so much info and divorcing over this is insane.",
   "created_utc": 1700870076,
   "score": 253,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan4673",
   "message": "Without any more context YTA. Not letting a father see his children? Better be more than this.",
   "created_utc": 1700876525,
   "score": 254,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kan3q9m",
   "message": "YTA for not consulting a lawyer about how to handle the kids issue. He *does* have rights to see his kids and messing around now can f up custody stuff. You have to dot all the Is and cross all the Ts.",
   "created_utc": 1700876324,
   "score": 255,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamrhq2",
   "message": "YTA. What you’re doing is called parental alienation and it’s not ok.  You sound very controlling.\n\nDon’t want him to be around the kids, go get a court order for full custody. At least then he’ll have a chance to plead his case.",
   "created_utc": 1700870721,
   "score": 251,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamm0qp",
   "message": "Nta but I would be pissed at your sister because damm what a bit!!",
   "created_utc": 1700868223,
   "score": 0,
   "submission_id": "1831eam"
  },
  {
   "comment_id": "kamzcy8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1831eam"
  }
 ]
}