{
 "submission_id": "1832zrm",
 "title": "AITAH for laughing at my friend's \"perfect plan\" for after their baby arrives?",
 "selftext": "Hi all, so I already think I'm an AH \u0026amp; bad friend for this, but wanted to take to reddit to verify.\n\nI (28f) have a best friend, M (28f), who is pregnant with her first, \u0026amp; possibly only, child. M has had a very rough pregnancy \u0026amp; I've tried being there for her as much as she wants/needs me to be. I've given her plenty of hand-me-down baby things that my child (2m) has grown out of or doesn't play with any longer.\n\nRecently she's told me her \u0026amp; her husband (28m) have come up with the \"perfect plan\" for after the baby arrives. She will take care of the baby for the time her husband is working (3rd shift), he will relieve her when he gets home so she can sleep \u0026amp; then he'll wake her so he can get some shut-eye before going back to work.\n\nI admit, I laughed at this when she told me, not maliciously or mockingly, I just found it kinda funny. She asked me what was so funny \u0026amp; I responded that my partner (30m) \u0026amp; I came up with some \"perfect plans\" only for them to fall through once the baby was actually here. I told her that I slept when the baby slept, let my house go for a few months unless I had family over helping \u0026amp; fantasized about some not so nice things regarding my partner while he slept peacefully while I was up with the baby. \n\nShe got upset \u0026amp; responded that just because we couldn't work it out, didn't mean she \u0026amp; her partner couldn't. I told her that she was completely right, that while our plans had fallen through didn't mean that theirs would, BUT that she should consider a contingency, just in case.\n\nShe got mad \u0026amp; told me they could do it. I replied that I'm rooting for them.\n\nI have no doubt that they'll be amazing parents. I have no doubt they'll be a great team. I just don't think they should have \"perfect plans\". Anyone with kids will tell you that babies absolutely RUIN \"perfect plans\" \u0026amp; it takes some getting used to. Every parent has had to learn this, but just like majority have told us before, \"Until it's real, you have no idea what you're getting into. So go ahead \u0026amp; make your 'perfect plans' \u0026amp; watch them go out the window 2 seconds later.\"\n\nSo AITAH for laughing at her \"perfect plan\"?",
 "created_utc": 1700862270,
 "permalink": "/r/AITAH/comments/1832zrm/aitah_for_laughing_at_my_friends_perfect_plan_for/",
 "score": 213,
 "url": "https://www.reddit.com/r/AITAH/comments/1832zrm/aitah_for_laughing_at_my_friends_perfect_plan_for/",
 "comments": []
}