{
 "submission_id": "1833g50",
 "title": "AITA for leaving my dad house after he invited his new girlfriend?",
 "selftext": "So it's very important to note that my (30M) mom (51F) died 3 months ago. My dad told us last week that he's met someone new and wanted to invite her to Thanksgiving. This is the first family holiday where we could all get together and I was hoping we could honor and grieve my mom as a family, and I can't do that if he brings this new woman. My sister and I put our foot down about her not coming to Thanksgiving, and he kind of honored our wishes. He did ask my two sisters (29F) and (21F) multiple times on thanksgiving during the day if she could come to dinner which really irked me but they held strong against that idea. Instead he invited her today to meet us all. We were supposed to continue the tradition of putting up Christmas decorations the day after Thanksgiving because that's what Mom always loved to do. Since she was coming to meet us my dad said we could put up the decorations next week which pissed me off since he was so adamant about keeping our traditions. \n\nWell I was planning on leaving before she got there because I really didn't want to meet this new woman 3 months after my mom passed. She was supposed to arrive at 11 and I was packing to leave before then, but she showed up at 9 instead. I was pleasant and nice, but I could only stay an hour before I felt my temper rising. It's clear she wants to replace mom. My 29F sister is pregnant and this woman wants to be a part of the process because \"every grandchild needs a grandmother\". My sister doesn't want any part of that but she's better at hiding her feelings in the moment than I am so I felt it best to leave. \n\nNow my dad and youngest sister are texting me saying my leaving so early was rude. Idk I'm still incredibly mad at the entire situation and don't know if I'm thinking clearly about it.",
 "created_utc": 1700863444,
 "permalink": "/r/AITAH/comments/1833g50/aita_for_leaving_my_dad_house_after_he_invited/",
 "score": 169,
 "url": "https://www.reddit.com/r/AITAH/comments/1833g50/aita_for_leaving_my_dad_house_after_he_invited/",
 "comments": [
  {
   "comment_id": "kamct56",
   "message": "NTA. I’m sorry for your loss OP, I can’t imagine how hard it’s been. Your dad disrespected you and your siblings by inviting this woman to the holidays so soon after you all lost your mom. If he wants to move on that’s great for him (a bit soon imo) but he doesn’t need to force it onto all of you. I’m sorry.",
   "created_utc": 1700864276,
   "score": 195,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamc7u5",
   "message": "You made your feelings clear, and your dad (who is an unmitigated ass) chose to disregard them.  I don't blame you for leaving.  That's better than being rude and/or ending up in a big fight.",
   "created_utc": 1700864032,
   "score": 79,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamghg7",
   "message": "First, I'm sorry for your loss.\n\n\u0026amp;#x200B;\n\nBut, I need some context, sorry.\n\n\u0026amp;#x200B;\n\nWere your parents separated or divorced for a time prior to this? It seems odd he is already back on the market and has a new girlfriend and shit given how this happened recently.",
   "created_utc": 1700865817,
   "score": 20,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan5sb2",
   "message": "\u0026gt;every grandchild needs a grandmother\".\n\nRun.",
   "created_utc": 1700877261,
   "score": 19,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamhsoh",
   "message": "NTA.\n3 months is ridiculous.\nHe should have respected your wishes properly. Not only that he should have never even thought about introducing her at this point.",
   "created_utc": 1700866377,
   "score": 30,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaml6qq",
   "message": "NTA\n\nI'm so sorry for your loss. Clearly you love your mum and three months is a really short time.\n\nYour Dad sounds like a complete AH. My FIL had a new relationship a year after my MIL died and that felt like an AH move. But three months, and expecting you to meet her? No way!\n\nIt's okay for you and your sisters to set boundaries and hold them. It's okay to want nothing to do with her. You may want to get in and collect all her things from your dad's house before he either gives them to the new GF or gets rid of them. \n\nTalk to your sisters about changing some of your traditions - get together at each other's houses instead of your parents' house, start remembering your Mum together without waiting for your Dad.\n\nI hope you and your sisters can navigate this together and look after each other.",
   "created_utc": 1700867850,
   "score": 9,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamngcd",
   "message": "NTA but dad is. \n\nWonder how long he’s been involved with her",
   "created_utc": 1700868879,
   "score": 10,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamqcns",
   "message": "NTA. Just text your dad and sister that the time line isn't matching up. That should be all you need to say.",
   "created_utc": 1700870194,
   "score": 7,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamrgoi",
   "message": "My condolences on the loss of your mother. You are NTA, but your father sure is. My MIL died 10 years ago this past August, and my DH and I still have hard feelings and don't spend many holidays with his father because he was dating less than a month after she passed, and they're still together. They were married over 50 years, and he didn't have the decency to mourn her at all.",
   "created_utc": 1700870708,
   "score": 4,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kamz8pc",
   "message": "NTA - so sorry for your loss. I would not have been able to remain so calm! 3 months is crazy to have a new partner that you want to essentially slot into the family. I understand grief can be a strange one at times (on your dad’s side there) but the need to keep pushing when you have set firm boundaries. I would be livid… and I also have questions around this timeline",
   "created_utc": 1700874267,
   "score": 5,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan13lj",
   "message": "\"Every grandchild needs a grandmother\". This woman needs to put in her place immediately, not only for this comment but for showing up 2 hours early to meet all of you and wanting to be a part of the process. And since you feel that she wants to replace your Mom, best to pay attention to that gut feeling. This just really seems like she has been in the picture a lot longer than they are letting on. Be on the look out at all times, you kids are in for a rough ride with these two. Wish you the best.",
   "created_utc": 1700875116,
   "score": 5,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan29ou",
   "message": "You and siblings get to decide how dad's GF is in your lives. \n\nShe doesn't get to play grandmom, that is reserved for a woman who deserves the position.\n\n((HUGS)) Sorry for the loss of your mom. Dad needs to learn; his GF isn't to be thrown into the family. You all have a voice and 3 months is way too quick.",
   "created_utc": 1700875653,
   "score": 3,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan53ez",
   "message": "NTA Ugh. That is waaaaaay to soon to be introducing a new SO to your kids. Especially children who are still grieving. Your dad is being incredibly insensitive and clueless as is his girlfriend.",
   "created_utc": 1700876945,
   "score": 3,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kao2pp7",
   "message": "12 weeks and she calling herself grandma… 🚩I’d be running too. NTA.",
   "created_utc": 1700894859,
   "score": 3,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kangtb3",
   "message": "As a widower, I get it. Three months after a major loss like that leaves a hole in you that doesn't heal. And the final step for mourning a spouse is finding a new relationship...eventually.\n\n\u0026amp;#x200B;\n\nThat said, I wouldn't introduce her to my kids that quick. On a holiday. When I barely know her myself. Hell, it's been a year and almost three months and I haven't even gotten back into dating yet. NTA.",
   "created_utc": 1700882542,
   "score": 4,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan4lpz",
   "message": "NTA. Wow your dad sounds just like my dad. He started dating not even 3 months before my mom passed unexpectedly. Hate to tell you that he was engaged two months later and then married 4 months after that. So yeah it sucked. I was very very close to my mother so this was really hard for me and my brothers. We were able to have our first Thanksgiving without my stepmom because he hadn't met her yet but he met her right before Christmas. Of course that's the last time we ever had any holidays together on the actual day because my stepmom insisted on spending everyone with her two kids and we were never invited or included so we did our own thing separately with my dad and her after each holiday. This did not endear her to us. I didn't meet her until they got engaged in February of course my dad wanted us to be buddy buddy. Yeah my mom hadn't been gone 6 months I wasn't in the mood to have a new mother figure. I was 38 at the time. Plus some other stuff was going on with one of my kids who is very ill and I just didn't need his love life on top of everything else. Yeah I resisted big time. But he did know I had a lot going on. My kids were in the wedding as she insisted and they were excited to do it. But yeah I don't know what to tell you except do it at your pace and don't do it on your dad's timeline. I had to be blunt with my dad and just say Dad I'm not going to be buddy buddy with her, she's not my mom, she will never be my mom and she's not going to replace mom. I never had a chance really to mourn my mother too much because of my child getting ill. I just threw myself into taking care of my kids and never really dealt with my grief. I'm still sad about it at times because I miss her and it's been 20 years. What's weird is my step mom looks a lot like my mom, same height, same body frame, totally different personality but I know that's what attracted my dad to her. My dad unfortunately passed several years ago. And my stepmother turned out the the gold digger we always suspected she was. She put up a good face though for 14 years. We'll keep in touch because she still has some things of my dad's that we hope to get later. I think her kids will be reasonable about it at least I really hope so.",
   "created_utc": 1700876721,
   "score": 2,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kani9zp",
   "message": "NTA. It was very inconsiderate of your Dad to expect you to be okay with this so soon after losing your Mom. My condolences.",
   "created_utc": 1700883268,
   "score": 2,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kani5jn",
   "message": "I’ve said it here before and got put on blast, my grandmother told me years ago, “Women mourn, men replace”. Now you can’t generalize all men, but we only know one man who stayed single after death/divorce of a spouse, and can name a dozen women without much thought.",
   "created_utc": 1700883205,
   "score": 0,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kanpprh",
   "message": "NTA but it’s not all about you and your sisters. Everyone grieves differently and your dad is doing this in a way you would prefer he doesn’t. You can grieve how you want but be careful not to push your dad away",
   "created_utc": 1700887118,
   "score": 0,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kanyawl",
   "message": "Devil's advocate here, but my mom always said you could tell when someone had had a good marriage because they immediately started looking for another one. She and my dad were married over 60 years.",
   "created_utc": 1700891995,
   "score": 255,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaoc8eh",
   "message": "YTA. Your father have sexual needs.",
   "created_utc": 1700901789,
   "score": 255,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan0iv6",
   "message": "Nta. Sorry but this women has been dating your dad for less then months (???) and shes already talking about being a grandma. Nope your dad should of shot that down then and there. \n\nYou wasn't rude. Your dad was extremely rude and wrong.\n\n\nEta sorry for your loss",
   "created_utc": 1700874853,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan646q",
   "message": "Too fucking bad. Your Dad will get over it. He was disrespectful to you and your siblings.",
   "created_utc": 1700877414,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan7zwf",
   "message": "NTA but, do not spare her feelings ever again. You need to set her down and politely state your feelings and boundaries. Do not let her believe for one second she is welcome, a part of your family, and her meddling will be tolerated. If you do her bizarre fantasy will only get worse. \n\n\n You don't owe anyone who is so blatantly disrespectful any respect or consideration. They might as well be screwing on your mom's grave with the level of disrespect your \"dad\" and his sex are showing all of you.",
   "created_utc": 1700878308,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kan9dcu",
   "message": "Nta\n\nGiven the context that your parents werent seperated its crazy that he found someone after 3 months.\n\nBut besides that\n\nIts not your job to entertain this woman.",
   "created_utc": 1700878953,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kanbrzy",
   "message": "NTA and guess you and your sisters are gonna start low contact with your dad from here in out.\nYour dad will definitely throw a hissy fit, claiming by our breaking his heart and showing his new girlfriend that she's unwanted which you can happily respond with yes your correct and so what dad ?",
   "created_utc": 1700880107,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kancnrr",
   "message": "nta a lot of times older people move\non super fast and i get it they know what a full life with love feels like and they just want that feeling again. but it’s a horrible thing for the rest of the family. they should be more understanding to the family and keep it separate until it’s appropriate for everyone",
   "created_utc": 1700880540,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kanhlx1",
   "message": "NTA might be time to cut your cheating dad off, I highly doubt he was not already with this woman for awhile. New dates are unlikely to try and be this involved this quickly, possibly years he has been cheating. Stop being nice at all to them both",
   "created_utc": 1700882931,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kanm6na",
   "message": "As someone who unexpectedly lost her mom around the same time as you, I am just cringing at your dad’s actions. Is it possible that any of this is misplaced grief on your dad’s behalf ? This is very odd behavior.",
   "created_utc": 1700885273,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kano2yb",
   "message": "NTA  Tell dad and sister that trying to replace your mom 3 months after she died was more rude and disrespectful than anything you did or said.",
   "created_utc": 1700886255,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kantm5c",
   "message": "Your dad is totally disrespectful and you need to let this woman know she is not a grandmother. She’s just dating your father.",
   "created_utc": 1700889251,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kao198q",
   "message": "NTA\n\nYour father on the other hand seems to be in a big rush to move on. \n\nIf there was anything your mother left to you and your siblings I’d suggest you all make sure you take whatever it is home.  Especially things like pictures which may be the first things gone.",
   "created_utc": 1700893874,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kao48ud",
   "message": "NTA. \n\nI'm so sorry for your loss. Losing your mom is the hardest loss of all, I know.\n\n3 months is fresh, very fresh. No one should be shocked at your reaction. Indeed, the surprise is with the lack of reaction to your Dad. But, that's not my business.\n\nHonestly, when my mom passed in June of 2021, my brother invited me to his house for Christmas. I told him I wasn't celebrating any holidays that year and he didn't understand. But I didn't shop, eat a meal, decorate or anything. 6 months was too soon. \n\nYou're not the AH. You're the grieving child.",
   "created_utc": 1700895945,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kao66ig",
   "message": "Absolutely NTA\n\nI can't even begin to imagine dating a woman whose partner had died three months previously, much less attend a family dinner and be introduced to her adult children and expect them to be happy with my presence. That's almost delusional\n\nYour dad may have many extraordinary personal characteristics but this seems heartless and insensitive to me. Maybe not his own relationship with her as people grieve differently, although this seems like a bit of a push, but to introduce her to you and your sisters? Nope.",
   "created_utc": 1700897302,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaodomj",
   "message": "If you want to send a clear message, you must be a United front and go no contact with your dad. Let him know this is the way it will be until y’all are able to properly grieve your mom.",
   "created_utc": 1700902915,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaoe5wk",
   "message": "NTA. I’m so sorry for the loss of your mom",
   "created_utc": 1700903299,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaoeakp",
   "message": "NTA it does sound like your dad was in a relationship with his girlfriend before your Mum passed. For her to be so comfortable meeting his family, especially so soon after your Mum's death and at such a special time of the year. It gives me the ick.\n\nUpdateme!",
   "created_utc": 1700903406,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaog5w5",
   "message": "I'm sorry for your loss.  I'm sorry your dad cheated on your mom. And I'm sorry he's an insensitive AH. Now you know who he really is.",
   "created_utc": 1700904941,
   "score": 1,
   "submission_id": "1833g50"
  },
  {
   "comment_id": "kaogj79",
   "message": "Your mom thought he was cheating before she died.  I'd trust her instincts. NTA",
   "created_utc": 1700905227,
   "score": 1,
   "submission_id": "1833g50"
  }
 ]
}