{
 "submission_id": "18339eb",
 "title": "WIBTA if I told my daughter (28F) she is not allowed to live with us anymore?",
 "selftext": "Two years ago, my daughter moved back in with us, insisting that she had a mysterious disease called \"Chronic Fatigue Syndrome.” She has now been lying in bed for the last two years, only rarely venturing outside for doctors’ appointments (during which she makes us use a wheelchair to transport her to + fro the office). She fears that any exertion will make her worse and she will “end up on a feeding tube.” She makes my wife cater to her by bringing her food and water at least twice a day.\n\nIt is my suspicion that my daughter’s mental health history contributes to this disease she is so fixated on. She was diagnosed with BPD several years ago after a suicide attempt, and though she denies having it now, I have done my best to inform her medical team of that diagnosis, as well as her other past mental health disorders including anorexia several years ago, which was so severe that she needed to be hospitalized. I love her and want the best for her, and think it benefits none of us to hide this history from her doctors.\n\nI think she has moved back in with us as a way to escape the stresses and responsibilities of real life, and she is using this new diagnosis of CFS as an excuse. She never had a full-time job and seemed content to coast on part-time jobs after her graduation in 2019, and (conveniently) the pandemic of 2020 interrupted her search for work. After this, she never went back to work again, not even part time. She claims she tried to find work in the year after the pandemic and before she became bedridden, but my daughter does not have the most trustworthy track record. (See: BPD diagnosis.) She did apply and get into grad school, but in my opinion this is still a step down from finding a fulltime job in terms of the \"stages of life.\"\n\nShe has thus far managed to manipulate both of her doctors—her GP and her “CFS specialist”—that she indeed has \"Severe CFS\" caused by a Covid infection. She's done this with the help of a psychiatrist who also specializes in Long Covid related situations, and who seems to be very easily manipulated himself and treats my wife and I as though we are abusers. (Of course he would, given that he has consistently heard my daughter’s side of the story. Even when we spoke to him in private, with my daughter’s consent, and I tried to get my point of view across and to be heard, he was adamant in painting me as the villain, and he did not seem to “hear” me at all.) Before the psychiatrist spoke to the GP, the GP seemed ambivalent about whether my daughter’s condition was physical or psychological, but now the GP insists, along with my daughter and the CFS specialist, that she does indeed have CFS. My daughter has manipulated other psychiatrists in the past as well, for example, making them believe that I am a \"Bad Guy.\"\n\nOn the practical side: my wife and I are in our late 60s and we are not getting any stronger. I recently had back surgery which is very painful, and it is quite the experience hearing my daughter wailing from upstairs for her food while I have a gaping wound in my back for which I was prescribed opiates. My wife has bad knees and it pains me to see her going up and down the stairs in order to wait on my daughter, whom I genuinely believe is perfectly capable of getting her own food and water herself, despite what she has told herself and convinced her doctors to tell her. She asked for me to bring up some water the other day and when I told her that she is capable of getting it herself, she became very angry and called me an \"asshole\" (ironically)\n\nMy daughter is nearly 30 and while I understand how comforting it may be to stay in the nest, she needs to learn to be self-sufficient so that she is not depending on her parents as we age into our 70s, 80s, 90s. So: WIBTA if I told her she needs to stop blaming everything on CFS, get back on her feet and learn to support herself?",
 "created_utc": 1700862979,
 "permalink": "/r/AITAH/comments/18339eb/wibta_if_i_told_my_daughter_28f_she_is_not/",
 "score": 218,
 "url": "https://www.reddit.com/r/AITAH/comments/18339eb/wibta_if_i_told_my_daughter_28f_she_is_not/",
 "comments": [
  {
   "comment_id": "kamkiui",
   "message": "If she is bedridden and you can't provide the care, she should be eligible for medicaid, whatever it's called in your state, and then placed in a nursing home covered by that program would be next logical step.",
   "created_utc": 1700867554,
   "score": 52,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamnajs",
   "message": "You need to tell her drs., she needs assisted living, you and wife can't take care of her anymore.",
   "created_utc": 1700868805,
   "score": 68,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamv5ht",
   "message": "I think you should stop trying to put her diagnosis in question. \n\nMds see a ton of people with chronic fatigue and post Covid. Figuring who is simulating, who has comorbid psychiatric disease, and who has undiagnosed medical condition is part of their job. \n\nThe question is where you go from here. And your concerns about your own health are very valid.",
   "created_utc": 1700872382,
   "score": 248,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamgzu7",
   "message": "also, if OP’s daughter ends up reading this, or anyone similar to her, there is state run organizations called vocational rehab- or workforce solutions. \n\nthey take in people with mental and physical illnesses and either coach them into how to be productive into society, or they get them resources that they need if they physically cannot work. depending on the individuals situation they can even help with schooling. \n\nOP, if you like your daughter even a little bit, direct her into this route. if they determine she is able to work with accommodations, they will help her with that. if they determine she cannot, they will give her the support she needs such as disability income or whatever it may be.",
   "created_utc": 1700866035,
   "score": 61,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kanh5nz",
   "message": "As someone who actually has CFS, it can 100% become debilitating. She will most likely NEVER be able to support herself or hold down a job through no fault of her own. And let me add that having CFS makes my depression and anxiety so severe that I’d rather die than wake up with CFS another day. No one understands what it’s like to have a great day and then literally sleep for days on end afterwards. I’ve been accused of “making it up,” faking it, manipulating people into believing me and my favorite is being just plain lazy. I’ve heard it all in the past 20yrs since my diagnosis and it only makes me feel 1000x worse…to the point of several suicide attempts. I’m lucky to have a supportive family and husband. Most people with CFS don’t.",
   "created_utc": 1700882708,
   "score": 108,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kampxgu",
   "message": "Your assertion that your daughter has manipulated her primary care physician, psychiatrist, and a specialist into each issuing a false diagnosis prompts a question. Do you have access to your daughter’s medical examination and test results? Did you witness her interactions with her physicians? If so, which specific results or interactions led you to conclude that the three doctors reached a false diagnosis?\n\nYou acknowledge that your daughter suffers from a serious mental illness. However, without concrete evidence, your skepticism about  her doctors’ diagnosis of severe chronic fatigue seems unfounded. Symptoms of severe chronic fatigue syndrome include extreme exhaustion, sleep disturbances, cognitive impairments like memory loss and concentration difficulties, muscle and joint pain, headaches, sore throat, and enlarged lymph nodes. Have you considered the possibility that your daughter might be severely ill and unable to care for herself?\n\nIn the absence of compelling evidence supporting your suspicion that she is feigning illness due to laziness and a reluctance to care for herself, it would be callous to evict her from her home. She is your daughter, and she needs your love, compassionate kindness, and empathy. Without justification, your assumptions that she is manipulatively lying to her doctors and others seem unfounded.\n\nYou seem to carry a lot of anger and disdain for your daughter — the tone of your post borders on outright contempt for her. Have you considered whether family therapy might help the three of you work more effectively together to find a better life for your daughter both now and for after you and your wife’s deaths? Your daughter’s life now seems miserable, and doubly so if you express contempt and disdain for her in the household.  Counseling might give the three of you a way out of your current mess.",
   "created_utc": 1700870001,
   "score": 133,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamoz3a",
   "message": "ME/CFS is a serious and extremely debilitating medical condition. \nIt's most significant symptom is PEM (Post Exertional Malaise) \nThis means any form of exertion causes excessive amount of fatigue. \nA walk to the letter box could cause fatigue resulting in the need to lay down for hours or even days. \nListening to music could result in the same for many with this condition. \n\nhttps://www.cdc.gov/me-cfs/index.html \n\nUnfortunately many doctors are still not educated in ME/CFS. It often is poorly understood and poorly treated.",
   "created_utc": 1700869573,
   "score": 232,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kanbr9p",
   "message": "I also have CFS due to Long Covid and would do anything not to be in this situation. I’m also bed bound and experience severe post exertional malaise from doing a very small amount of activity. I never leave the house and my husband has to bring me most of my meals in bed. Before experiencing this, I would never have believed it was possible. It’s close to a living hell and I wouldn’t wish it on anyone. I don’t believe anyone would ever choose this as a lifestyle. I’m sure it’s very frustrating for you but it’s way more difficult for your daughter. A long term care facility would be an extremely difficult place for someone with this condition due to the noise and commotion. Unlike your daughter, I had to give up a great career and social life. I had to hire 2 lawyers to get disability coverage. I would encourage your daughter to apply and seek advice from a lawyer if necessary. Please feel free to contact me directly for more information.",
   "created_utc": 1700880097,
   "score": 49,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamgkea",
   "message": "There's really two separate issues here:\n\n1) You accusing your daughter of lying and manipulating and insisting that you know what's going on with her body better than herself and several medical professionals. In that regard, Y*T*A, but that's not the issue you asked about.\n\n2) You feeling that your wife and yourself cannot keep up caring for your daughter as you have been. That's completely fair. NAH.",
   "created_utc": 1700865852,
   "score": 218,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamqc76",
   "message": "Ok. I stopped reading your post the third time you put CFS in quotation marks. Chronic Fatigue Syndrome is a very real and very serious disease. It can literally make you feel as though you can not get out of bed. I do not know your daughter, or her condition, but I do know that even a mild case of CFS can be debilitating. Having not dealt with it yourself, you have no right to downplay it!!!!",
   "created_utc": 1700870188,
   "score": 238,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamjwku",
   "message": "Your daughter is disabled. I realize that’s hard for you to accept, but multiple doctors have confirmed it, and its the reality you’re living in right now, whether you think your daughter is lying and manipulating them all, or not. She’s ill, and she can’t care for herself, and multiple specialists have said so. You need to accept it, even if you wish it were different. YTA on that one, but I say that gently, because I realize how devastating it must be to think about the prospect that your child will never have the life you dreamed for her. \n\nWhat’s also true is that you and your wife can’t care for her anymore. You have back issues and your wife can’t do stairs. And you’re both getting older. And if her condition isn’t improving, she needs to work with her team to come up with a longer term plan. \n\nRight now, how is she paying for medical care? She needs to get signed up for Medicaid. Which means applying for SSI. She may not be able to do all of that herself, either physically or emotionally. So you either need to help with the applications (and usually it takes a lawyer and a couple of appeals, but it’s worth it for the benefits, because otherwise she either ends up living off you forever, or she’s homeless and she dies) or you need to notify her team that she needs a referral to a case manager to help. That’s how she’s going to become self-sufficient.",
   "created_utc": 1700867283,
   "score": 83,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamls53",
   "message": "BPD is persistently misdiagnosed by healthcare providers, especially for young women who are having mental health difficulties.\n\n\nSo to recap, your daughter had an eating disorder severe enough to need hospitalisation, attempted suicide, had covid and now has long covid and has been diagnosed with CFS. \n\nCFS is thought to be an autoimmune disease wherein the body attacks itself causing extreme fatigue, pain, including but not exclusively muscle spasms, nerve irritation and headaches. Brain fog, difficulty with walking, balance, slurred speech and neuropathic pain are some of the symptoms. It is thought to be triggered by a serious illness and is more commonly diagnosed in women, but men are affected too. Worth noting that trauma survivors, like your daughter, are also more likely to suffer from CFS. There is no known cure.\n\n\nI could tell you that YTA and all the reasons why. It won't matter. If watching your daughter suffer as an adult and nearly losing her to suicide and an eating disorder when she was younger doesn't inspire you to care and comfort her, nothing I write here will change your mind. \n\n\nGoing by your grammar and spelling I'm guessing you're in the USA? I'm not, so forgive me if I get the available services wrong - here in the UK I would advise you to contact your local council - if in America I think Adult Protective Services may be your port of call: call them and tell them that you are not longer willing or able to care for your adult, disabled daughter and tell them she will be on the street by X date. Do this much at least to try and procure help for her.\n\n\nI can guarantee that the \"nest\" you provide is not a comfort. Living with someone who consistently, repeatedly calls you a lazy, lying drain on them does not want to be there. Having her father deny her illness in the face of multiple professionals saying otherwise is likely at least as painful as the CFS. Do her a favour and kick her out. You are the very, very last kind of person she needs in her life. \n\n\nBy the way, I don't think your back pain is severe enough to need opiates to treat it. I think you're just milking it to get good drugs from your GP and lie on your lazy arse while your wife runs around after you. Maybe you're jealous of the attention your daughter gets and you made the whole thing up... Or maybe you're pissed that YOU couldn't fool the psychiatrist that you're a good dad and he saw the true villain inside. Can you prove me wrong?",
   "created_utc": 1700868116,
   "score": 53,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kampv1t",
   "message": "I was originally going to comment NTA. But, after reading your comments and seeing how much you hate your daughter, you're definitely the asshole. You obviously don't really care for her, and are probably only feigning care out of some form of responsibility you feel you have to own up to. You're just looking for validation from strangers for your hatred at this point.",
   "created_utc": 1700869971,
   "score": 99,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamdftv",
   "message": "I think folks are being a bit harsh with you. It sounds like you’ve been frustrated with this for quite awhile. Definitely have her apply for disability and give her a heads up that she will need to move out. This sounds like a complicated situation.",
   "created_utc": 1700864539,
   "score": 81,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamm6fn",
   "message": "I get your frustration but you’re absolutely nuts if you think your daughter “manipulated” not one, not two, but THREE healthcare professionals (one of whom specializes in the disorder she has) that she’s actually sick. She IS sick, you just don’t choose to believe it cause it inconveniences you. YTA.",
   "created_utc": 1700868296,
   "score": 63,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kana55m",
   "message": "Dude, you are more than a simple AH. You are blatantly cruel. \n\nI’ve had CFS for almost 20 years, and I honestly you get to experience it’s joys and pains. Literally sleeping for 18 hours, then taking 2 hours just to crawl to the bathroom, and going back to sleep for 12-18 hours. I was almost fired from my job, and both of my bosses were friends. They saw me outside of work (they’d come and visit and help me). They saw what was happening, but they still almost had to fire me because I straight up disappeared for 3 months. \n\nYour daughter is NOT manipulating that many medical professionals. They are TRAINED to spot people faking/seeking. She really is that sick, start believing her before you lose her.",
   "created_utc": 1700879328,
   "score": 59,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kammqhd",
   "message": "The way you talk about your daughter and CFS makes YTA.\nIts a legitimate disorder and people who end up truly bedridden often keep declining until they pass away young. Something to consider....",
   "created_utc": 1700868550,
   "score": 206,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kampbhq",
   "message": "Well if you're going to be insistent that you're smarter than all the doctors who are so easily manipulated and that CFS doesn't exist, I'm going to go ahead and tell you I do not believe you have any back pain, and you manipulated your doctors into giving you opiates because you just want drugs. Hope that makes you feel about as lovely as you make your daughter feel. Have the day you deserve. YTA",
   "created_utc": 1700869729,
   "score": 182,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kaml8bs",
   "message": "So multiple of her trained doctors are wrong but you are right ? Ok.",
   "created_utc": 1700867870,
   "score": 78,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kan19tq",
   "message": "You don't have any pain in your back, you're just faking this mysterious pain to the doctors in order to get opiates so you don't have to deal with your life. Obviously I am qualified to make this assessment considering I am not a doctor and the people who performed surgery on you and prescribed you opiates are, therefore my unqualified diagnosis is superior to theirs. Now stop complaining about this phantom \"pain\" that you're faking.\n\n\u0026amp;#x200B;\n\nObviously YTA. Why do you think you are better at diagnosing people than actual doctors?",
   "created_utc": 1700875194,
   "score": 29,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamhbc6",
   "message": "  I don't necessarily think YTA for wanting her to gain some independence. But chronic conditions are real \u0026amp; hard. Writing her off as lying with significant proof of medical issues is what makes YTA. \n  My dad treated me (32F) like my anxiety didn't exist. \"Just don't be anxious\", as if I could control it. Her \"handpicked doctors\" sound like professional experts in their fields. If you know something is wrong with your body, but no one believes you, you seek a second opinion. Or third, or fourth. If I hadn't pushed \u0026amp; gone to another ER when they wrote me off 2 1/2 years ago, I could have died from a lung clot. If you have an idea of what the issue is, why not see a specialist to confirm if you can? You wouldn't see a dentist for mental health. \n  Yes, she should apply for disability. But could she maintain a home without assistance as she is? If you'd like some independence or privacy, perhaps some sort of assisted living or group home may be an option. Otherwise, she might need an aid of some sort to have her own place.",
   "created_utc": 1700866172,
   "score": 221,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamx091",
   "message": "I’m disabled but look fine. \nMy sister has convinced our dad that I’m either faking it or mentally ill. I used to have a 6 figure salary package and now get a government disability pension of $24k per year. I spent almost 3 years barely able to get out of bed until my neurologist was able to find a medication that has helped. I still managed to feed myself and my cat even if no housework etc got done for weeks because I had to. My parents are in their 80s and have helped when I’ve needed it ie driving me to medical appointments or helping me by making sure I had enough food to see me through the week that i didn’t need to actually cook.\nHonestly, ESH in your case. \nYou are dismissive and contemptuous of your daughter and her doctors. I don’t understand how people think those of us with invisible illnesses suddenly become Oscar award worthy actors who can fool multiple doctors (and in my case multiple government officials). \nYour daughter however does need to do stuff for herself.  I found the depression and anxiety my condition caused was almost as debilitating as the actual condition but once I got the right medication things improved.",
   "created_utc": 1700873225,
   "score": 36,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kan2g4h",
   "message": "YTA \n\nShe is literally chronically ill. Alot of people with chronic fatigue syndrome have another underlying disease that has not been diagnosed yet. \n\nI thought i had cfs but i got lucky and my ophthalmologist noticed something was very wrong with my eye muscles so they reffered me for genetic testing and it turns out i have a form of mitochondrial dna disease. \n\nNot saying she has mito but there are thousands of medical conditions that cause similar symptoms and are hard to spot/diagnose.\n\n\nAlso chronic stress causes oxidative stress/damage to dna. Im 18 with a history of cptsd and my condition would probably not be as severe if i had not been through years of chronic stress. Bpd is basically just cptsd but more socially stigmatised see the uk charity [mind](https://www.mind.org.uk/information-support/types-of-mental-health-problems/post-traumatic-stress-disorder-ptsd-and-complex-ptsd/complex-ptsd/) website. \n\n\"Misdiagnosis with BPD\n\nSome of the symptoms of complex PTSD are very similar to those of borderline personality disorder (BPD), and not all professionals are aware of complex PTSD.\n\nAs a result, some people are given a diagnosis of BPD or another personality disorder when complex PTSD fits their experiences more closely. Professionals disagree about when it's helpful to diagnose someone with a personality disorder or when another diagnosis or description is better. To find out more see our page on why personality disorders are controversial?\"",
   "created_utc": 1700875738,
   "score": 39,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamvy88",
   "message": "Everything else aside, there is nothing \"mysterious\" about the disease she says she has. \n\nIf you don't want to take care of your own daughter that's up to you. But if she's that bad she needs facility care.\n\nEdit: grammar",
   "created_utc": 1700872741,
   "score": 133,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamtpy3",
   "message": "I have CFS. I'm not severe, I'm Moderate and I am bedridden some days. Severe M.E/CFS is bedridden. BPD has nothing to do with your child's CFS.\nCFS is a neurological disease. \nBPD is often caused by childhood trauma.\nI would recommend your child looking into a career if possible.\n\nEdit to add your child should also look into disability.",
   "created_utc": 1700871738,
   "score": 62,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamlsow",
   "message": "Caretaker fatigue is a real thing. That being said, you're pretty gross for your opinions on your daughters illnesses.",
   "created_utc": 1700868123,
   "score": 190,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kanh1lm",
   "message": "YTA. Not for telling her she can no longer live with you, but for every other example you gave of your relationship with your daughter.\n\nYou accuse her of using the pandemic as an \"excuse\" for not having a full-time job a year after graduating. Assume she is lying about having long-term symptoms triggered by covid. Complain that she uses a wheelchair when she leaves the house. Criticize her for going for an advanced degree (which potentially may enable her to get a physically easier job she could do with physical limitations) instead of getting a job.\n\nDo you even like your daughter?\n\nBecause my teen has bipolar disorder, it's almost impossible to get a doctor to take complaints of physical symptoms seriously; everything is automatically assumed to be the result of anxiety or an eating disorder. If your daughter has a GP who says there is something physically wrong with her, either something IS wrong with her body (maybe not CFS, but many disorders are difficult to diagnose outside of TV dramas) or she's an excellent and extraordinarily persuasive actress.\n\nNevertheless, I hope she figures out how to move out - maybe with the help of disability income or a social worker. Isolated in her childhood bedroom and dependent on an unsupportive parent is a sucky way to live.",
   "created_utc": 1700882654,
   "score": 11,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamnxon",
   "message": "YTA. OP's daughter is in her bed (does OP thinks it's enjoyable?!) and needs a wheelchair. She can't even go downstairs. Sounds like a serious mental or physical illnness. I'm not a doctor so no idea about which it is.  \n\nSo the girl is miserable and OP just wants to throw her out. Has he tried a clinic or anything really? She can't walk! That's very conserning.",
   "created_utc": 1700869096,
   "score": 31,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamnes3",
   "message": "Perhaps it is time to look into care homes (nursing homes) where insurance pays and she would have medical attention. You can cite that you and your wife are no longer able to care for her.",
   "created_utc": 1700868860,
   "score": 48,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamljkm",
   "message": "YTA already 😂. People like you are the type that used to dumped their family members in institutions to get abused and experimented on.",
   "created_utc": 1700868011,
   "score": 63,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamjcnu",
   "message": "For telling her you don't want her living there anymore NTA.\n\nBUT\n\nYTA for dismissing her diagnoses. The truth is that BPD is a result of significant childhood trauma. Your attitude would suggest that you are likely a contributing factor to that trauma.",
   "created_utc": 1700867042,
   "score": 164,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamq47d",
   "message": "In regards to your actual question about telling your daughter she will need to move out, NTA. You aren't able to continue to physically care for her, and that's understandable. However, your post as a whole makes it very clear that you are an AH in general and a terrible parent. CFS is a real disorder and unless your daughter is a master manipulator the likes of which we only see in TV shows there is no way she has convinced 3 different medical professionals, one of which is an expert in the condition, that she has a rare chronic condition. And I really doubt she has \"manipulated\" multiple psychiatrists into thinking you're a \"bad guy,\" more likely you actually are a shitty person and you just don't want to admit it.",
   "created_utc": 1700870087,
   "score": 8,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kan22dy",
   "message": "Chronic fatigue is a long covid symptom. There are many such cases. You're an asshole.",
   "created_utc": 1700875558,
   "score": 44,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kampllb",
   "message": "Or maybe you could acknowledge that according to the professionals she has a disabling condition.  And instead of kicking her out onto the streets help her get on SSI.",
   "created_utc": 1700869853,
   "score": 32,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kampfdn",
   "message": "YTA for your gross attitude about BPD and dismissing how difficult it is to get on disability. BPD is a personality disorder in part caused by significant childhood trauma. From the Mayo Clinic “in addition to environmental factors such as a history of child abuse and neglect BPD may also be linked to genetics and brain abnormalities”\n\nYou seem like you’ve contributed to her abuse and neglect tbh. You’re so focused on dismissing her health I wonder how much of her life that’s been happening from you",
   "created_utc": 1700869777,
   "score": 27,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kane1ka",
   "message": "I think this is above reddit paygrade\n\nI'm disabled due to covid and I was bed ridden for a couple years till doctors found the right medication to make me SOMEWHAT able. I'm still considered disabled and even was granted SSI from the government, and that's REALLY hard to do.\n\nPoint being...not saying your daughter is not lying, but coivd CAN do this to a person. I have dysautonomia, more specifically POTS, all due to covid. Even though I am partially able, I still flare once or twice a week, have close calls from fainting episodes while sitting, ...yes...sitting, but I decided that since I could sit somewhat, I wanted a full time or partime job that was WFH. I am lucky a place has accepted me, and knows I have a disability, but not everyone is lucky or futunate.  And this was after I was accepted for SSI, I ended up only asking for back pay. I still wanted to feel \"able\", but some people don't get that luxury.\n\nI tried working in office before, but I kept fainting and loosing the jobs. So I'm very lucky that I found a WFH. Most lunches and breaks are me recovering from sitting. \n\nDon't discount her. Covid has made a LOT of people have invisible disabilities. If she has a whole team of doctors accepting her condition, it's probably real. \n\nHer mental past plus this WILL make it worse. \n\nMy advice is to not discount her all too much, but also that if she is truly that severe, look into adult care facilities. If you keep your mentality that she is \"faking it\", you may loose a loved one. Sit her down and talk about options in regards to homes and all, but be also accepting. \n\nMany programs out there that would pay for her housing, SSI as well.\n\n\nEdit. I realized I kinda vented, sorry. It hit home for me for when my dad tried to kick me out for being disabled. He didn't like seeing me in a wheelchair because he felt second hand embarrassment apparently for me being newly disabled. When a cardiologist did a table tilt and I fainted and had a seizure, he finally believed me. I almost went homeless due to my father not believing me and thinking that If i was kicked to the curb, i'd somehow get motivated to not be disabled anymore. Hearing your story struck a cord within my soul. \n\nHonestly, I feel bad for the both of you.",
   "created_utc": 1700881203,
   "score": 9,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamk15w",
   "message": "YTA. She's disabled. And she's not wrong about how hard it is to get on disability.",
   "created_utc": 1700867337,
   "score": 48,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamd5vp",
   "message": "Wow, either your daughter who lays in bed all day is secretly the world's best actress and manipulator, able to convince a dozen doctors of different specialties across multiple years that she is ill -or- you're an asshole.\n\nI know which I think is true. You are definitely an asshole though for your question, you don't have to support your daughter forever.  Give her notice so she can plan.",
   "created_utc": 1700864424,
   "score": 158,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamtwe5",
   "message": "Getting bait post vibes from this",
   "created_utc": 1700871818,
   "score": 7,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamy4jm",
   "message": "Wow I’m watching for the update when OP’s age related disabilities start to kick in, maybe he will develop some empathy for invisible disabilities.  Meanwhile I’m just sorry his daughter has such an asshole dad that clearly hates her.  No wonder she has mental health struggles, growing up in that toxic environment.  YTA, OP.  A huge one, that lacks compassion and hates his child.",
   "created_utc": 1700873745,
   "score": 8,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamm89s",
   "message": "YTA\n\nDo you even LIKE your daughter? CFS is real, is debilitating, and she has medical experts saying it is real and she HAS it. You don't seem to know a thing about CFS or what it's actually like, and you're accusing your child of being manipulative, lying, and being lazy. I'm absolutely baffled that you think you know more about her body, her mind, and her limitations than she and her medical team.\n\nI hope she moves out and cuts you out of her life. You are toxic, and your attitude toward your own child is truly disgusting.\n\nTo OP's daughter, if she ever reads this: Apply for disability again. You have enough years of medical evidence from multiple specialists to give it a good try. If you're in the United States, you are very likely able to qualify for SSI (which doesn't require significant work history, unlike SSDI). SSI is \"needs based\", and you sound like you need it so you can get out from under your toxic parents. Social Security has a ton of services you probably qualify for, including housing and rehabilitation help. Give it a try!\n\n\\*\\*\\*\\*Close family member has worked for Social Security for many years",
   "created_utc": 1700868319,
   "score": 70,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamg52p",
   "message": "hi there. I know this is gotta be hard on you \u0026amp; your wife. I’m sure this is not what you wanted for your daughter. I have multiple sclerosis, which presents symptoms of chronic fatigue. I also have mental health (anxiety \u0026amp; depression). with the help of my doctors \u0026amp; resources I was able to go on long term disability. I get a small income \u0026amp; am able to take care of myself. I’ve been learning from occupational therapy, physical therapy \u0026amp; all the other resources available to me to make my life livable. my family does not take care of me \u0026amp; I would never expect them to. I feel it is time for you to let your daughter learn to live her life w/her limitations \u0026amp; learn how others do it with even worse conditions \u0026amp; no family to lean on. I’m sorry but she sounds like a POS \u0026amp; an AH.",
   "created_utc": 1700865673,
   "score": 158,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamoi7x",
   "message": "I have lived with Fibromyalgia and Chronic Fatigue Syndrome since 2004. Although it can be very hard for families of sufferers to understand I assure that both conditions are very genuine, and very hard on the sufferer.",
   "created_utc": 1700869360,
   "score": 14,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamr5hc",
   "message": "Regardless of who the AH is no one in this situation is happy or will be happy until she is out of the house. \n\nIf she really can not get up to get herself a glass of water she should likely be in an assisted living home.",
   "created_utc": 1700870563,
   "score": 7,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kana1cx",
   "message": "CFS is a very real and very debilitating condition. Why do you think your child wants to be bedridden? What?!",
   "created_utc": 1700879277,
   "score": 9,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kanzszx",
   "message": "Gosh. Your daughter must be incredibly talented if she can manipulate all of these doctors in to believing she has a disease she obviously doesn’t have because faking that for years so you can stay in bed all day every day and not even have to walk is definitely most people’s life goal. \n\n\nYTA for saying she makes it up and manipulates doctors. \n\nNTA if you can’t care for her and need to get her put on disability and alternative living arrangements.",
   "created_utc": 1700892938,
   "score": 7,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamqgqs",
   "message": "This sounds like a VERY complicated situation. Your daughter could totally have CFS as a result of long COVID, but that doesn’t mean she can treat you guys like paid support. I think you should sit her down (or up as the case probably will be) and have a serious conversation about her needing to plan for her long term future. If there is no end in sight for this illness, she needs to get disability, get on the list for section 8 housing, and all the other supports available. It will be a slow process (because government), but you need to insist. That being said, she truly may not have the energy to get through all the paperwork and if you really want to do what is in her best interest and yours, it may mean filling out paperwork on her behalf and bringing it to her for signatures.",
   "created_utc": 1700870245,
   "score": 14,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamyaoy",
   "message": "It’s not as trivial as who is an AH. I hear your exhaustion. It’s time to get a social worker in and make a plan. Social workers know how to do this kind of thing. It’s not asking her to leave; it’s giving her resources so you don’t flush money down the toilet by haphazardly financing the various, predictable yet seemingly inevitable, threatening, traumatic and potentially tragic crises of the adult disabled child. (Source: adult disabled child) Throw up the white flag by bringing in the professionals. (…good luck locating them but they are out there).",
   "created_utc": 1700873825,
   "score": 5,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamzlha",
   "message": "First of all, she needs to apply for disability because she’s going to need those resources. Her counselor can probably help get that ball rolling, or an attorney that specializes in disability cases. That will take a good long time no matter what avenue you take, even more reason to get the ball rolling ASAP. Her medical team can help with this too.  \nThere’s no way any of us can understand her situation objectively but if you kick her out what will happen? If she’s on disability she will be able to have Medicare/medicaid as well as other types of assistance that can help her and take at least some of the burden off you and your wife.",
   "created_utc": 1700874429,
   "score": 6,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamieuf",
   "message": "\u0026gt;insisting that she had a mysterious disease called \"Chronic Fatigue Syndrome.”\n\nThis makes you YTA. It sounds like you don't belive in the illness at all.\n\nWhat does she do all day? If she's in bed in a dark room with no sounds, I seriously doubt that she fakes it. No one can do that without getting bored out of their minds. If she can watch TV or play games, she can most likely also walk down the stairs.\nWith the right treatment some people with CFS can get better. Sad enough not all of them though.",
   "created_utc": 1700866638,
   "score": 48,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamhku7",
   "message": "ESH. Your daughter is *diagnosed* with those illnesses, whether you think she’s making them up or not.\n\nHowever, as a fellow CFS sufferer, also Long covid, physical disabilities, social anxiety, severe depression, PTSD, etc etc she cannot continue to do this to the pair of you. I have 3 autistic/ADHD/disabled kids and a house to run. While I can’t work because I’m too ill I also can’t stay in bed - as much as I utterly struggle (to the point of pain and tears most days) to get out of my bed. She can and should claim disability if she’s that impacted, and move out. You guys aren’t her slaves. Enough is enough. She needs to learn to live and support herself for when you guys *can’t* - and the sooner she does this the better for all of you.",
   "created_utc": 1700866284,
   "score": 113,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamd3x0",
   "message": "So, your daughter has multiple medical specialists confirming her diagnosis, including her mental healthcare, and you still insist you are smarter and know more than multiple doctors?  I understand you being frustrated with the situation, but at this point, if you think she needs to move out, you should direct your daughter to applying for disability and looking into some sort of assisted living situation.  You are the one here who doesn't look quite right mentally with your refusal to believe multiple medical professionals.  Usually people in your daughter's situation struggle with getting the medical care they need.  Your daughter is lucky to have the medical care team that she has.  Yes, YTA.",
   "created_utc": 1700864401,
   "score": 135,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kamvihu",
   "message": "Damn, do you hate your daughter? Sure seems like you do. 😳",
   "created_utc": 1700872542,
   "score": 15,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kami4hi",
   "message": "I get that it's hard for you but this is your daughter who has a genuine condition and you are just making it harder for her mentally when it's already so difficult for her! If you don't think you can manage with caring responsibilities then maybe help her to apply for social housing and support workers but don't for a second disregard her conditions that  it's so difficult living with without the people you depend on disbelieving you. My sibling lives with chronic fatigue and it sounds very simolar, it's been a lot worse since having long covid and it's really debilitating including the mental health issues that come hand in hand with any debilitating disease. Honestly try and see it from her perspective and be more supportive. If you can't cope caring for her fine but support her to get the help she needs you don't need to be nasty about it!",
   "created_utc": 1700866514,
   "score": 27,
   "submission_id": "18339eb"
  },
  {
   "comment_id": "kankrme",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18339eb"
  }
 ]
}