{
 "submission_id": "1834c2a",
 "title": "I asked my daughter to clarify why she was crying.",
 "selftext": "So I (31m) have been at my parents house with my wife (31f) for the thanksgiving holiday where my daughter (3.5f) was playing upstairs with my father (57m). At one point my daughter came downstairs crying saying my father was “on top of her”. I asked her to clarify which she meant and they were rough housing. After I came to the kitchen where my wife and mother were and I said something along the lines of “it’s a shame that no matter where or what situation we are in we need to clarify what happened when our daughter says something like that”. My mother wondered what I meant and I explained that no matter how much or how long you’ve known someone, you need to clarify things like that because you never know and statistically it’s the way things are. She became very offended along with my wife who both defended my father as if I was a judge putting a sentence on him. I clarified saying no I don’t believe dad could ever do such a thing but if my daughter says something like that I would be a bad father and very ignorant not to clarify. Fast forward an hour later they are very upset with me and my father even chimed in saying that I’m being ridiculous. Am I crazy or the AH just trying to clarify that my daughter is safe? There was nothing accusatory and I tried my best to explain to them where I was coming from.",
 "created_utc": 1700865844,
 "permalink": "/r/AITAH/comments/1834c2a/i_asked_my_daughter_to_clarify_why_she_was_crying/",
 "score": 1,
 "url": "https://www.reddit.com/r/AITAH/comments/1834c2a/i_asked_my_daughter_to_clarify_why_she_was_crying/",
 "comments": [
  {
   "comment_id": "kamhidn",
   "message": "First and foremost you can never be too careful protecting your kids. Now to think her grandfather would do something like that is very unlikely but sadly it’s always possible. \n\nI’ll be honest the first time I read it since I went back to see if I missed anything. My first thought was he might have been playing with her and collapsed on her like he had a heart attack or stroke.",
   "created_utc": 1700866256,
   "score": 168,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamu9di",
   "message": "My grandfather abused me for years, often within the next room full of adults. \n\nClarify as much as you need to. Often our abusers are known to us.",
   "created_utc": 1700871982,
   "score": 200,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamugf0",
   "message": "First, you do not ‘know’ your father wouldn’t do anything. My FIL was a pastor, my daughter was 5. The detective on her case said his daughter takes naps with his dad and he was brokenhearted that he couldn’t trust it anymore. This was almost 20 years ago and still brings tears to my eyes. You did the right thing and don’t let anyone make you feel bad for protecting your daughter.",
   "created_utc": 1700872071,
   "score": 97,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanrkqc",
   "message": "Damn skippy if I heard someone was \"On top\" of my daughter\" or son for that matter, I would make sure I knew what was going on.  Your wife is crazy.",
   "created_utc": 1700888117,
   "score": 23,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamhqyd",
   "message": "The clarifying was correct but why the hell bring up the implication?  We're you trying to get a best dad ever pat on the head from the women?  Every woman ever would ask the clarifying questions too but we wouldn't then enter the kitchen and announce you were suspicious your father in law is a pervert.  Of course they are mad.",
   "created_utc": 1700866356,
   "score": 9,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanqna2",
   "message": "The girl is 3.  There's no reason the grandfather should be on top of her. I have a daughter, and my partner, father, and brother play with her, but no one is rough housing with her. It's just picking her up, playing it toys, but nothing that involves putting weight on her.  If it were other kids around her age, I could see it, but a grown man rough housing to the point that she cried?  Ehhh, I'd watch him extra closely. Don't put anything past people these days, especially with your daughters. Sometimes, family members are the worst ones because you allow them access to your children, and you don't expect them to be offenders. This happened to me by my cousin. It often happened in the next room, and no one would notice. I'd be running around with the other kids, then he'd get me alone on purpose. All I can say is protect your kids! \n\nAnother thing, allow your kids to say no. Forcing them to hug or be hugged by people they reject is problematic. Sometimes the rejection is the red flag. Im glad you asked follow-up questions.\n\nMy friends daughter (11y) came home crying because a boy \"touched her\". My friend called her a drama queen and brushed it off. I was like, how do you ignore that? She had never complained about that before, but because she kept crying, she was a drama queen? It's wild.",
   "created_utc": 1700887618,
   "score": 81,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan38e3",
   "message": "I think you need to reconsider your approach. It isn’t that you asked your daughter, that would be normal. It’s that you brought it up to everyone. That’s the weird part. Situation was over, no one was questioning anything, everyone had moved on, and you wanted to bring it up and make it something more than it was. You are the stage for awkwardness going forward.",
   "created_utc": 1700876097,
   "score": 173,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kand9u3",
   "message": "NTA but a fantastic father",
   "created_utc": 1700880835,
   "score": 12,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan3dma",
   "message": "OP, NTA. I supervise a lot of those dark individuals. People that others have greatly trusted, then things happened. A father should sometimes worry about the what if's when thinking about the safety of their child. I do the same with my son because some people have different preferences. What would hurt worse, offending someone or finding out years later that something happened.",
   "created_utc": 1700876164,
   "score": 10,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamtwuh",
   "message": "You were not wrong in asking your daughter to clarify, unfortunately we have learned it's best to do this instead of sweeping something under the rug. There should be concern that a grandfather felt it was okay to treat his 3.5 year old granddaughter so roughly that she began crying and felt the need to find her father for protection.",
   "created_utc": 1700871824,
   "score": 121,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamoxlf",
   "message": "NTAH. It's a sick world we live in. I would have been asking the same and not caring if someone (no matter who) thought IWTAH. It's your child and as parents it is our job to question and protect.",
   "created_utc": 1700869554,
   "score": 52,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao6qa7",
   "message": "I don't like the situation you describe. She's 3 and she came back down alone, crying? After they'd been roughhousing, and because of something that happened? He didn't bring her to you and explain the situation? If it was my child, I would not leave her alone with him.",
   "created_utc": 1700897696,
   "score": 10,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfua4",
   "message": "NTA. I'm trying to wrap my head around the fact that a grown adult was on top of a small child. \n\nThousands of people think a family member would not do something untoward to another family member. \n\nHistory has shown  and proven to us that humans are capable of the most vile and heinous if activities.\n\nJust ask your daughter in private when she calms down about how she felt. She will know.",
   "created_utc": 1700882075,
   "score": 20,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfqco",
   "message": "As a dad I would want clarification in a situation like this as well. You did the right thing and I applaud you for that.\n\n My son fell and hit his head requiring a trip to the ER and while stitching him up, and he's screaming the cops arrived and hauled me into the hallway wondering if I was abusing him.\n\nIf it works for them, it works for you.",
   "created_utc": 1700882023,
   "score": 10,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kancpma",
   "message": "Abusers usually know their victims, victims usually trust them. At no point should any grown ass man be anywhere near 'on top' of any child. Keep an eye out, your first instincts and intuition is usually correct.",
   "created_utc": 1700880565,
   "score": 8,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kandsvk",
   "message": "NTA they should be glad you did.  What would have happened if she had done that in public.  People would automatically assume one thing.",
   "created_utc": 1700881090,
   "score": 8,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanic41",
   "message": "Family members are the worst and are the ones that cover up for other loved ones so the abuse cycle can continue.  Dad did the right thing.",
   "created_utc": 1700883296,
   "score": 7,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kannn3w",
   "message": "I think the scenario you described seems suspicious enough to ask your child for clarification. Also I would watch her behavior around him very closely. If something is off, she will most likely try avoid any interaction with him. You are not the AH for taking the safety or your child seriously.",
   "created_utc": 1700886027,
   "score": 8,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanowg2",
   "message": "NTA You’re being a good parent. I’ve got pedos in my family that groomed the kiddos right under everyone’s noses because everybody “didn’t want to rock the boat”. Hurt feelings don’t matter when it comes to the safety of your kid, that comes first. Don’t be a polite, passive parent.",
   "created_utc": 1700886685,
   "score": 7,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamwah1",
   "message": "NTA It has been proven that most children who have been molested or raped. It is usually a family member or family friend. Nobody wants to think it could be their family member/family friend....but it could. We can NEVER be too careful with the safety of our babies.",
   "created_utc": 1700872897,
   "score": 27,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamrwud",
   "message": "Why was the conversation with your daughter not the end of things? Why did you need to labour the point with the adults at all? They hadn't challenged you or disagreed with you.",
   "created_utc": 1700870911,
   "score": 57,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfrvp",
   "message": "It's actually more likely to happen than anyone wants to think.  The stats are public, look em up.  \n\nNTA and you should be prepared to hear and believe your kid should they say something like this. Clarification is always needed.  Nta nta nta",
   "created_utc": 1700882043,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kangxes",
   "message": "My grandfather tried molesting me 3 times before i was 14... sadly it can happen. \n\nI don't know if it was because his parents were first cousins, or that he was developing alzheimers, but he still tried any chance he got. \n\nYou can never be too safe",
   "created_utc": 1700882597,
   "score": 6,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanihtr",
   "message": "NTA. I’m a mom of two, going on three, and I watch every. Single. Person. Who comes near my kids. I observe my husband, father, FIL, BIL, and everyone else. I do not believe for a second any of them would hurt my kids, but like you, statistically, it’s the most likely. Never TA for protecting your children!",
   "created_utc": 1700883375,
   "score": 6,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanngkb",
   "message": "They completely missed the point. You used that as AN EXAMPLE of how statements like these need exploration. JFC, why are they so sensitive?? Makes me wonder! Also, it’s rarely a stranger. :/",
   "created_utc": 1700885936,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanrf8g",
   "message": "NTA 70-90% of sexual assaults happen by people the children know family/family friends. You can never be too careful. To protect your kids you should use appropriate names and let kids know that there are places people should not touch and to tell you if anyone does. One of the best ways to prevent abuse is to teach age-appropriate sex education from very young",
   "created_utc": 1700888034,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamuv8s",
   "message": "Absolutely not … that makes you an attentive parent",
   "created_utc": 1700872254,
   "score": 17,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kands86",
   "message": "I’ve never fallen on top of a child.  Why didn’t he immediately come to you and tell you there was an accident and he ended up on top of the child.  Why wasn’t he attending to your child, who was crying and potentially injured under his body weight? \n\nHave you ever fallen on top of a child or even another person for that matter?  Hard enough to make them cry?\n\nThis story gives me the icks. Keep your antenna up.",
   "created_utc": 1700881081,
   "score": 13,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamx0d5",
   "message": "NTA. Your daughter is getting the message that you listen and will believe her. Doesn't matter if it's grandpa or anyone else close, she knows dad will be there.\n\nPlus, she didn't like whatever happened anyway, so whether it was actual assault or not respecting boundaries, you're reinforcing what's acceptable and not and again, that you will always listen.",
   "created_utc": 1700873227,
   "score": 22,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamwihe",
   "message": "NTA. As somebody who was left in the care of their grandparents every weekend from the age of 0 to 5 and was sexually abused by the male grandparent I completely understand why you have to clarify.  It doesn't matter how much you trust someone. You just never know.",
   "created_utc": 1700873000,
   "score": 14,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanjc5w",
   "message": "I work with sex offenders. 99% of the time it’s a family member or very close “like family” friend.",
   "created_utc": 1700883802,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kank002",
   "message": "You did the right thing.",
   "created_utc": 1700884140,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanoe5z",
   "message": "Bro you’re not crazy you need to protect your daughter, not your Dad’s gentle fee fees",
   "created_utc": 1700886416,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao6gsn",
   "message": "\"Rough housing\" covers alot of ground. Tickling is a particular favorite amongst some...\n\nNTA. And frankly grandpa shouldnt be rough housing eith LO away from parents.",
   "created_utc": 1700897507,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan4qsj",
   "message": "NTA. You MUST clarify for your child’s sake. Period. You did good, dad.",
   "created_utc": 1700876786,
   "score": 9,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan7353",
   "message": "Soft YTA, not for asking your daughter to clarify, but for mentioning it to your Mom.\n\nAsking your daughter is A-ok, because you never know. But mentioning it to your Mom was definitely TMI, and she definitely took it the way you'd expect.",
   "created_utc": 1700877870,
   "score": 26,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamqwbl",
   "message": "NTA. You could have saved yourself the grief by doing what needed to be done, and then skip the commentary. No one challenged you for checking on your daughter.",
   "created_utc": 1700870445,
   "score": 22,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan69y9",
   "message": "Nta my sister was abused my her own dad do not leave your daughter alone with him again it’s usually around 3 they start to abuse",
   "created_utc": 1700877489,
   "score": 8,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfe5v",
   "message": "NTA - Never apologize for being careful with your child’s safely, NEVER. I would also want to have clarity about what was happening with my child, even if it was my parent, who I wouldn’t think was a bad person, but like you said you never know. You job is to protect her.",
   "created_utc": 1700881857,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfvvt",
   "message": "NTA. You did the right thing. Your wife and daughter are lucky to have you.",
   "created_utc": 1700882096,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kangj2i",
   "message": "NTA you’re wife is very nieve and it’s honestly really unsettling how she didn’t have your back on this and most importantly how she just brushed it off and defended him, not saying your dad would EVER do something like that but you can never never be too careful with your babies",
   "created_utc": 1700882406,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanq8j1",
   "message": "So when I read this story I took it this way: When his crying daughter said \"he was on top of me\" dad zeroed in on those words and his mind went to the worst BUT not thinking any logistics like who she was talking about, etc. Once he had clarification and the rest of his brain kicked in, of course he knew it was something innocent. Then he told the mom \u0026amp; grandmother in my of a \"it's sad that there's so much bad in the world that those words immediately freaked me out and I couldn't think past the worst for a second\" I don't think it even dawned that she was talking about grandfather, it was more about what she said happened. \n\nThe reason I say this is because that's exactly how I would've felt. Hear that sentence and have a terrible moment of horror then when I think rationally for a second, I'd be so saddened that so much evil exists that my mind always goes straight to the worst.\n\nI hope I'm explaining this in the right words and am understandable lol",
   "created_utc": 1700887396,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanqbq3",
   "message": "You are ABSOLUTELY NOT the asshole here jfc they're all living in a fantasy land if you can't see why you need to ask that",
   "created_utc": 1700887445,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanqk0g",
   "message": "You are NTA. The world needs more fathers like you.",
   "created_utc": 1700887569,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanrgr4",
   "message": "So they are mad at you because you're protecting your daughter? Your wife should be on your side. You're absolutely right. You never know someone 100%.",
   "created_utc": 1700888058,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kansip3",
   "message": "NTA \n\nIf any of the little kids in my family said something like that, questions are being asked. Unless we can see with our own eyes what has actually happened (ie: roughhousing) \n\nRegardless of who it is. \n\nSadly, a lot of child SA is perpetrated by family members, and it is unexpected 90% of the time. \n\nThere is no accusation present when asking for clarification on a statement. It’s also teaching your daughter better communication skills.",
   "created_utc": 1700888636,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanuhhk",
   "message": "The mom's and grandma's response could be....telling. Meaning that lots of people disclose SA and get told \"HE wouldn't do THAT!\" even though the person just experienced HIM doing THAT. \n\nHave you and your wife taught your child the proper terms for her private areas? It is necessary. Very necessary in fact when there is even the slightest question of someone touching her inappropriately. Even Grandpa.... in so many of our experiences...ESPECIALLY Grandpa.\n\n It's the difference between her being able to have a good life or a life built completely on survival. Choose your child over their protests. If you do find there are issues, get her away from him and keep her away from him at all costs. I assure you your marriage is far less  important to any of you versus your baby's mental, physical and emotional health.",
   "created_utc": 1700889744,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao5kuo",
   "message": "NTA there is no reason for an adult to be on top of a 3.5 year old. Especially to the point of making them cry. Sounds like something went too far. I’d be pissed if someone- even a family member did that. \n\nAlso, like others have said, molesters will do things while the rest of the family is right there. While they are in next room, a grope while in the same room as others. It can be a way to test how far they can push and get away with things that can lead to other things. \n\nAnyway, NTA and don’t let this experience let your guard down. And I hope no one shamed the kid for speaking up about what she didn’t like. Kids have every right to not have anyone, especially trusted adults, cross their body boundaries.",
   "created_utc": 1700896876,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao5wqp",
   "message": "NTA and I’d still be suspicious/cautious.",
   "created_utc": 1700897111,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan03l3",
   "message": "Been a rough holiday in America, judging by all these family-related posts",
   "created_utc": 1700874660,
   "score": 7,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan545y",
   "message": "It's your job to ask the hard questions when your child is concerned.",
   "created_utc": 1700876955,
   "score": 7,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamwx79",
   "message": "You’re NTA, you’re the MVP GOAT of your family. Keep doing what you’re doing and being aware.",
   "created_utc": 1700873187,
   "score": 16,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kani281",
   "message": "What reason can you think of that a male would end up on a little girl? Take the terms  daughter and grandfather out of it. Take “my” out of it. Look at the story now. There is no reason. None. \nAnd rough housing? That’s foreplay to pedos. Trust me. Please. Don’t leave her alone with him. Ever! Do not let the “my” blind you. Don’t feel guilty. Don’t. Read up on pedos  and what they do to break the ice with victims. Then share with your wife. Obviously mom won’t believe you. Let it go with her for now. \nAnd have a talk with your daughter. Tell her never to be led off by him. Never go anywhere with him. Watch carefully now when he’s around. You may see things you didn’t before. \nShe was crying. Perhaps he touched her in a way she doesn’t understand. Don’t push her for answers. She doesn’t understand except something wasnt right. But something wasnt right.  Until she’s old enough and able to yell out to stop or to come to you, you have to be the stop. \nYou will be the only stop on this. Set rules with your wife. Non negotiable rules. Daughter is NEVER  to be out of her sight when he’s around. Or she can’t go there unless you’re there.",
   "created_utc": 1700883159,
   "score": 9,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamlhe4",
   "message": "Yea exactly. I sincerely tried to explain that this was nothing against dad and that I wasn’t going into it with anything accusatory whatsoever. I was simply asking her to expand on what she was saying. I wasn’t accusing anything of anything and never even approached my father about what happened. I told them if my daughter said something way out of the ordinary then that would be something different but how could I not at least ask? This world is a lot more dark and sick than most people like to admit and having daughters really exposes the fact",
   "created_utc": 1700867985,
   "score": 12,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanunqz",
   "message": "A 57 yo man should know to not rough house inappropriately with a toddler.  He inadvertently scared her.  Maybe tickled her or rolled around on the floor.  \n\nSomething to keep an eye on.  I think you should inconspicuously always join in if he seeks her out on their own.  He can play with her around the family.  \n\nI think you are uneasy for a reason.",
   "created_utc": 1700889843,
   "score": 6,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamhdxn",
   "message": "NTA, and glad you’re protecting your daughter. I can get MIL defending her husband, but your wife is the AH for not listening to your daughter.\n\nYou need to have a 1:1 conversation with your daughter away from everyone else - including your wife - to get to the bottom of what was going on. Make sure your daughter knows she can trust you and can talk with you about *anything*. And finally, keep an eye on your FIL.",
   "created_utc": 1700866204,
   "score": 23,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanlxes",
   "message": "NTA. Do you believe if your daughter said that to one of them they wouldn't have asked the same question?  It would be horribly irresponsible of them not to.",
   "created_utc": 1700885140,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanmz5w",
   "message": "The context of every detail is extremely important here, and we are only getting your description here.\n\nAt the trails end, if I were in your shoes, IDGAF how people view me when I'm in the defense of one my children.\n\nNot Wrong, Not The Asshole.",
   "created_utc": 1700885691,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao8j99",
   "message": "NTA for clarifying with your daughter. But there’s this thing called “inside thoughts.” It sounds like you brought it up to everyone in the kitchen unprompted. You can think safety things like that, but no need to announce them, which pushes you into a soft YTA territory.",
   "created_utc": 1700899026,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kamyza6",
   "message": "NTA\n\nAs a mom of two young girls, I worry about things like this too, *even though* I have no one in my life that would ever hurt my children. (Yes, it seems silly to worry if there’s never been a reason to worry or no apparent reason to worry) \n\nBut SA is my all time biggest fear, even as an adult,  and so I project that on to my girls inadvertently.",
   "created_utc": 1700874147,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan0xyx",
   "message": "NTA Your reaction was the right one, and your sadness at the situation is valid. If your daughter ever does actually end up in that situation, she will thank you for caring enough to clarify. \n\nMay not have been a great idea to say that in front of your mother/his wife though.\n\nETA: Just saw your explanation of why. Ok so like in their generation many people just don’t know how widespread that kind of abuse can be. Either she’ll get over it or she won’t, but either way you didn’t do anything wrong.",
   "created_utc": 1700875044,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan1jln",
   "message": "As a grandchild who was assaulted/sexually harassed by my grandfather, you're not an asshole. I never thought he would do something like that, and yet, he did. Always stuck up for your kid.",
   "created_utc": 1700875319,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan6m3l",
   "message": "NTA. A conversation like this from my mom would’ve saved me years of abuse. She just never asked. You’re a good dad!",
   "created_utc": 1700877646,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan72fs",
   "message": "NTA. Having worked with the SO population I just want to say I think it is absolutely amazing that you heard what your daughter said and then clarified what she ment even though it involved your father.  It is a very challenging situation to be in. Kudos to you. You are absolutely correct, statistically speaking, it's a family member or friend commiting the offense. You asking your daughter to clarify hopefully makes her more comfortable coming to you. 👏👏👏",
   "created_utc": 1700877860,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kandeh3",
   "message": "Why were they offended ??? You did the right thing. They sure should not be offended if it was an innocent situation . Kuddo’s to you dad.",
   "created_utc": 1700880898,
   "score": 5,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kandm7m",
   "message": "Often times the one person that you would not expect to abuse a child is the very one to hurt them. There are some sneaky ass nasty abusers!",
   "created_utc": 1700881001,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanp7q0",
   "message": "Also to the people who are making this dad feel bad for feeling the need to explain why he was checking in- take a step back- yes this was an awkward thing to explain but what if he didn’t? What if there was something strange going on that somehow related? He didn’t accuse anyone of anything - but it is scary having your daughter come down and say her grandfather was on top of her. What if something happened? He had every right to panic and then feel the need to explain.  Back the F off",
   "created_utc": 1700886850,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan27t3",
   "message": "NAH\n\nYou should not have said that, but clarifying why she was crying was the right thing to do. It was just better left not said because there was no harm in the end. No need to tell someone you had to check if they were sexually assaulting a children when you find out they weren't, that must feel horrible.",
   "created_utc": 1700875629,
   "score": 6,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan3dos",
   "message": "NTA.  Protect your kids at all cost.",
   "created_utc": 1700876164,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan6rsm",
   "message": "NTA. Encourage your daughter's voice. You're a good dad.",
   "created_utc": 1700877721,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kan83vn",
   "message": "NTA for asking the question, but why say what you did to your mom? What was the point? Yes, we need to watch and question our children and make sure they’re safe, but you had to know you were hitting a hornets nest with that comment.",
   "created_utc": 1700878361,
   "score": 3,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao4miy",
   "message": "This is like a lot of these posts. \n\nYou’re not the Asshole for your intentions. YTA for the way you said it. \n\nSaying “I need clarification for because you can never be too safe” sounds like an implicit accusation. \n\nSaying “we can never be too safe, so we are working on getting all the details from any scenario like that so we know she can convey to us if someone were to do something” makes it sound like an actual parenting strategy. \n\nThis seems like w case of foot in mouth / not thinking before speaking to say what you mean in a non-accusatory manner",
   "created_utc": 1700896203,
   "score": 4,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanf088",
   "message": "Nta. Good parenting for finding out the difference of what a child says and what they mean.",
   "created_utc": 1700881669,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanf4pt",
   "message": "NTA and good on you for clarifying! Even though your father may never do *that*, it’s still best to triple check everything because it’s almost always the people we would swear “would never do that”. The worst man I’ve ever met (so far) who absolutely did do “that” to one of my closest friends growing up? Also the quietest, most well-to-do, accomplished, handsome man in the area. The exact picture of “he would never”. So as offended as your family may feel at the observation, they need to face facts (and maybe adjust the rough housing a bit).\n\nI had a grandfather who never ever did “that” to me, not even remotely close—but he did have a rough housing tackle technique he called “mustard” and did I think it was hilarious? Absolutely. Did my mother tell him to stop? Yes. As an adult, am I a bit horrified that any grown man *or* woman would know how to pin down a child like that, AND do it, even if just for fun? You bet! To this day it makes me sick to my stomach just thinking about it. (Side note: turns out we’re pretty sure he “unalived” two of his own children; they were written off as “accidental” and “self-inflicted” despite the tons of contradicting evidence. So even though he wasn’t a CM, he still wasn’t innocent.)",
   "created_utc": 1700881728,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfiqp",
   "message": "NTA. What if she repeats that to other people? Like preschool or daycare? OP , you did exactly the right thing. And I agree that it is sad that we have to do this. Hopefully your family will figure out what you really meant.",
   "created_utc": 1700881919,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanfrt6",
   "message": "I'd rather clarify it every time than miss one and have a scarred child. Nta",
   "created_utc": 1700882042,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kangpqy",
   "message": "Better be safe than sorry..nta",
   "created_utc": 1700882494,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kangs2b",
   "message": "NTA. You did the right thing and you’re exactly right, statistically, it’s usually people within the family or people who are close to the family that commit those type of crimes against children. It’s always shocking and 100% unexpected. I’m not saying your father did anything at all btw, just that you 100% did the right thing. Too many parents ignore simple statements from their children like this and there was something horrible happening.",
   "created_utc": 1700882525,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanh5zc",
   "message": "NTA. You should always clarify what is going on. It gives the child a chance to learn and practice the right language if, god forbid, something was done to her. It’s not about the adult, it’s about the child, and the adult getting offended is why so many incidents go unreported.",
   "created_utc": 1700882712,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanh61h",
   "message": "Definitely NTA. I completely understand where you're coming from. While yes we can assume we know a person and think they would never do such a thing. We never truly know, and it's unfortunate that it's usually the people close around us. \n\nBottom line you were trying to understand what exactly happened to your daughter and her safety comes first before anyone. \n\nIt's understandable to also be hurt by the implication that you would do something, however they have to see it through your eyes to or even remember when you were younger and had said such a thing.",
   "created_utc": 1700882713,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanhgfn",
   "message": "You absolutely did the right thing. NTAH. Proud of you.",
   "created_utc": 1700882855,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanix7j",
   "message": "NTA at all!",
   "created_utc": 1700883590,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanj2or",
   "message": "Protecting your daughter is the most important job you'll ever have. Super happy to hear you're taking it seriously.",
   "created_utc": 1700883667,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanj2si",
   "message": "Seeing as statistically it’s almost always a family member or family friend I’d say you’re just trying to do right by your daughter and no one should fault you for being diligent. For me as a child, it was my own cousin. You just never know.",
   "created_utc": 1700883669,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kank85s",
   "message": "NTA. You are doing exactly what you should be doing and it’s the rest of your family who are not. It sucks that this is the world we live in and as parents we have to consider these things but it is necessary. I’m sorry they can’t see what an awesome dad you are for following through and always clarifying, but please know that you are and continue to do it.",
   "created_utc": 1700884258,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanl2oh",
   "message": "NTA - you literally asked your daughter to clarify so you didn't jump to conclusions. After it was clear it was just an accident and not the worst case scenario you made an awkward comment to release the tension you were feeling. If anything you're a better parent for knowing that it could happen even with a relative you don't suspect would do that.",
   "created_utc": 1700884694,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanlc79",
   "message": "I would be very mindful of how she behaves around him in the future.",
   "created_utc": 1700884830,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanlfu1",
   "message": "Nta",
   "created_utc": 1700884882,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanm2vp",
   "message": "You’re a good dad, and a good man/person. The fact that it was your own father and you were still willing to ask the hard questions is proof of this. I wish all dads were like this. I commend you Sir",
   "created_utc": 1700885219,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanm5wf",
   "message": "NTA\nHonestly its always vetter to be safe than sorry because it is a horrible reality for so many people. I'd rather be aware or even overly aware instead of dismissive",
   "created_utc": 1700885262,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanmqvm",
   "message": "It’s usually someone close to the family.  Never overlook the possibility.  Never.",
   "created_utc": 1700885572,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanmu8t",
   "message": "My blood ran cold when my 5 year old daughter told me she had blood in her pants. \n\nShe had been playing on the monkey bars at school and had fallen badly. I’m still at a loss as to why her teacher didn’t mention anything when I picked her up from school. They received my wrath for not letting me know what happened. \n\nI agree that no matter what the circumstances, you need to check who, what, where, when and why",
   "created_utc": 1700885619,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kano3yv",
   "message": "Trust! - but verify.",
   "created_utc": 1700886269,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanof40",
   "message": "You can never be to careful! As someone who's grandfather was a horrible person and used to GRape his daughters and abuse his sons, always clarify about stuff like that",
   "created_utc": 1700886431,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanonnp",
   "message": "You are absolutely NTA OP. When you have a child your sole responsibility in this life is to protect that little baby (yes even into adulthood). They become the top most number one important thing. I saw another comment say they were concerned he may have collapsed in pain (heart attack maybe or something similar) and that thought did also cross my mind. But once you make sure the person is okay, my next thought is also “wait, on top of her how?” Also why he is rough housing a 3.5 year old anyway? Like a tickle fight? Anything else seems odd to me but I’m not someone who can speak on normal family dynamics anyway. Point is that you did the right thing for your daughter and your wife will likely understand that is the case once the situation has settled and she has time to think.",
   "created_utc": 1700886557,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanov13",
   "message": "Always!  Check your kid(s).  Getting the right info better than ignoring or assuming.",
   "created_utc": 1700886665,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanp0v1",
   "message": "You did exactly right, don’t second guess this one.",
   "created_utc": 1700886749,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanpfdb",
   "message": "NTA 1000% and they can deal with it. \nSigned, also a survivor of CSA from a FAMILY MEMBER.",
   "created_utc": 1700886963,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanpszl",
   "message": "NTA. Good job Dad 👍",
   "created_utc": 1700887167,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanptiw",
   "message": "NTA",
   "created_utc": 1700887175,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanpysq",
   "message": "Not the AH. Good job Dad.",
   "created_utc": 1700887253,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanqgjj",
   "message": "They are being unreasonable almost every pedophiles is seen as a good person until they are not.\nI think that still sounds wrong omho, why would she cry? Even rough house with adult man ? That sounds wrong.\nI think maybe she is in fact getting molested bro.\nBut I don't know you should do.\nI would at least keep her away fron him and I don't know if you can trust your wife either this stinks badly.\n\nVery rarely kids even understand that it's wrong to be touched, because pedos use the excuses of playing and such and the kid does not understand that it's being abused sometimes.\n\nOp I will be clear here maybe she is being abused, maybe your family knows it.\n\nBut you were kinda stupid to bring it up if you were not meaning to accuse.",
   "created_utc": 1700887517,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kans676",
   "message": "NTA. You're a good Dad. You could try telling them that you would ask her to clarify if she said that anyone was on top of her. Women, teenagers, and other children can abuse too \n\nGood luck and please keep protecting your daughter like this",
   "created_utc": 1700888444,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanu1ct",
   "message": "NTA. But them all getting defensive and offended is a red flag to me. If he did nothing wrong then there's no need to be defensive. That's the immediate sign of someone who is guilty of something.\n\nI'm not saying he did anything, but I would 100% ask her to explain how he was on top of her. Grooming behavior often happens with family and not a stranger. Again, that's just to be cautious. Regardless, whatever he did she didn't like, as long as he doesn't do it again then it'll be OK. But you did everything right and they're the ones being shady about it.",
   "created_utc": 1700889489,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanvjnk",
   "message": "i’m so glad you clarified with your daughter because i tried telling my mom about my grandpa when i was 3 and she dismissed me about it saying i was being silly when i was in fact assaulted and can remember everything clearly to this day. her not listening created big trust issues for me",
   "created_utc": 1700890356,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanziu9",
   "message": "NTA for asking,  but you are for saying anything else about it after.  The drama isn't from asking your daughter, it's about bringing it up to the rest of the family that you asked.",
   "created_utc": 1700892756,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanzoox",
   "message": "NTAH thank you for listening to your child.",
   "created_utc": 1700892858,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao0k8p",
   "message": "I said and thought the same thing about my daughters and their grandfathers. Till my fuckin ex father in law groped and kissed my 14 year old. Found out about it while I was at a movie with my 17 year old who then proceeded to break down and tell me he’d done the same to her a month prior. \n\nLet them be mad.",
   "created_utc": 1700893419,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao1qql",
   "message": "NTA.\n\nHowever, it is a good time to start teaching her about her body and establishing boundaries with other people, that she can always say no to people touching her, no to hugs if she wants to, what the correct terms are for body parts etc and that she can and should go to a trusted adult to talk about things if she ever feels uncomfortable about anyone. Also about good ‘surprises’ (like for a birthday present) versus bad ‘secrets’ and how an adult should never ask you to keep something a secret. \n\nThere are resources and books available that you can get to help you start the discussions if you’re not already doing it. There are some great songs like ‘I Love My Body’ by Mother Moon and The Boundaries Song’ by Hopscotch Songs and other good videos in TikTok and YouTube that are age appropriate.\n\nAnd also, strongly suggest that you discuss with family, especially your father about how he needs to respect your daughter’s personal space and listen to her if she isn’t enjoying the ‘rough housing’ even if she’s not using her words to say it. A lot of people, especially older men don’t understand that consent, even for things like playing around, can be shown with non-verbal ways and if it’s not a continued enthusiastic yes then it’s not a yes. \n\nEven if 3-year-olds do cry over silly things sometimes it is because they don’t always have the language to be able to express complex emotions (as well as being tired, overstimulated etc). So if she is starting to get upset while playing she needs to be taught the tools to be able to advocate for herself and the adults in her life need to respect it.\n\nI grew up with adults, usually older men, who didn’t do any abuse but wouldn’t stop when I was asking them to stop tickling, and then I would get hurt because it was taken too far. I was seen as a kid who complained a lot, I’m sure, but I would get hurt a lot when playing with people because they didn’t listen that something was hurting me, then I’d get upset and people would get annoyed at me for complaining because they were ‘just having fun’ or ‘he’s old and it’s what they know so just put up with it’.\n\nI have therefore made sure that I advocate for my own kids to make sure that they don’t have to hug anyone they don’t want to, know they can always leave a situation where they are uncomfortable, that I will always believe them and and have felt empowered to speak up if someone is creeping them out.\n\nKids are never too young to educate on these kind of protective behaviours because yes, unfortunately statistically it’s likely to be someone you know or are related to who will take advantage of proximity and abuse kids they have access to.",
   "created_utc": 1700894193,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao413b",
   "message": "What kind of grown man rough houses with a toddler by laying on top of them?  It’s not funny to make a child cry… its inappropriate for a grown man to wrestle/rough house with a little girl… and it’s just wrong to lay on top of a child for any reason.  Even harmless rough housing can lead to unnecessary injuries. You aren’t wrong for asking questions…and I don’t think they should be allowed to be alone together again.  Don’t let anyone gaslight you.",
   "created_utc": 1700895797,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao5iyn",
   "message": "The defensiveness they displayed is extremely concerning…NTA",
   "created_utc": 1700896840,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao5r53",
   "message": "No,  NTA!",
   "created_utc": 1700897000,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao6858",
   "message": "**NTA**\n\nYou did what every parent should do - made sure that your daughter was safe.  Parents, grandparents and other family members are the most likely to inappropriately touch a child or SA them\n\nNothing wrong with what you did and with all the SA that goes on in families your wife and parents should understand you were concerned when you daughter came in crying saying your Dad was on top of her and making sure she was safe   \n\nYou were not accusing him of anything, but you would have been wrong to not ask your daughter what happened",
   "created_utc": 1700897338,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao6be8",
   "message": "It was my grandfather that attacked me. Never ever be too careful.",
   "created_utc": 1700897400,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao6q4c",
   "message": "NTA - always make sure the kid is and remains safe.",
   "created_utc": 1700897692,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kao7kyi",
   "message": "A 57yo man \"rough housing\" on top of a 3.5yo child? Alone?\n\nNTA. Even if you are certain of your father, his intentions, his actions and his predilections (as you all seem to be) this still sounds like a questionable choice to make. You have a right to be protective of your child and teach her right from wrong, bad touch/good touch/okay to say no to touching at all. \n\nYMBTA for making a statement of it to the rest of the family though.",
   "created_utc": 1700898320,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kaodno7",
   "message": "We need more parents like you 🙌🏻",
   "created_utc": 1700902895,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kaoe31k",
   "message": "Eh, I'd still be concerned about the grandfather's definition of rough housing if he's causing a 3 year old to cry.",
   "created_utc": 1700903234,
   "score": 2,
   "submission_id": "1834c2a"
  },
  {
   "comment_id": "kanvwj5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1834c2a"
  }
 ]
}