{
 "submission_id": "1834kqf",
 "title": "AITAH for telling my wife we don’t need to have another baby?",
 "selftext": "I (32m) love my wife (36f) whole heartedly, but I’m nearing my wits end…\n\nShe had a child when she was 13. She vowed to not have another until she was married. So as she turned 30, she was starting to think she’d never have any more kids because she’d never get married. But we get married in February 2021 and had our first child in April 2022. When we were dating, we agreed to two - three children. Now, I love my little guy to DEATH! Being a father is more joyous than I ever dreamed of…But I started having feelings of wanting him to be our only one shortly after he was born.\nMy wife is a stay at home Mom since earlier this year (with periodical help from her Mom). But neither of our energy levels are up there. I wake up at 5:30a to get to work by 7, make it home by 4p, and I’m beat. But I come home and do more work around the house. I know being a stay at home mom is no walk in the park and I’m happy to alleviate certain chores she acts like she can’t do during the day. But when I’ve stayed at home with our son, I was able to get all kinds of shit done…So that started concerning me.\nAround May, I mentioned to her that I don’t think we need another child and she lost it…It was like WW3. So, seeing how upset it made her, I agreed to having another if we get pregnant by the end of the year.\nSince then, there have been more and more indicators that we don’t need to have another child…She cannot keep up around the house, and I can’t keep up with her messes and the baby’s messes. We just moved into a bigger house beginning of this year, and it still hasn’t been completely organized yet. I’m the only one taking initiative to do all of this. I’ve sleep trained the baby by myself, cook his meals (she might cook breakfast, but will just give him bottles while we’re trying to ween him off the bottle), clean up the kitchen every day, straighten up, cook my own meals, etc etc. I never wanted her to be an overwhelmed SAHM, but you have to meet me halfway! Plus she just became the president of this organization’s chapter, which will be time away from home. PLUUUS, after the baby, her sex drive tanked, so we don’t have anywhere near as much sex as we used to; and this makes me feel uncomfortable like you don’t even want to have sex with me, but you want to have a baby? AITAH or should I stop complaining?\n\nEDIT: So my wife has experienced some things as a youngster that she has told me she needs therapy for and I’ve encouraged her to go. She also lost her father a couple years ago. I am very sympathetic towards everything she has been through; and she never has tried to burden me with any of it. I just want us both to put forth our best efforts.",
 "created_utc": 1700866491,
 "permalink": "/r/AITAH/comments/1834kqf/aitah_for_telling_my_wife_we_dont_need_to_have/",
 "score": 18,
 "url": "https://www.reddit.com/r/AITAH/comments/1834kqf/aitah_for_telling_my_wife_we_dont_need_to_have/",
 "comments": []
}