{
 "submission_id": "1836bo0",
 "title": "AITA “You should have died too”",
 "selftext": "\n**My son was NOT driving the car!**\n\n\nLast summer my son and two of his were in a car accident. One of them passed away, the other will be paralyzed and have disabilities for the rest of his life. My son was the only one who wore a seatbelt but suffered injuries as well. When school started is when the harassing and bullying started. Mainly from the brothers of the boy who died. They were relentless but I told my son they would get tired of messing with him and move on. I genuinely thought it would blow over, it hasn’t. Months later it’s still an everyday occurrence. I‘ve spoken with the boy's parents, I’ve gone to the teachers, school counselors, principal, deans, and the school board. They all respond with “The boys are grieving and they are only focused on your son because he was the only survivor”. Every single time that is the excuse. \n\n\nLosing someone is tragic, the loss of a child is a nightmare. But that doesn't mean they should be able to terrorize my son DAILY. It happens mostly before and after school but also during class changes. They tell him horrible things like “You should have died too”. He hears it every.single.day. I suspect more is going on but he doesn’t want to tell me. I've noticed a huge change in my son. He has lost weight. He has horrible anxiety. He can’t relax at home because all he can think about is school the next day. I tell him he can take mental health days but he says “No they aren’t taking my education”. \n\n\nI’ve gone to the school to tell them this is serious and last week before Thanksgiving break I was told that since he hasn’t attempted to take his life or nothing physical has happened on school grounds nothing can be done. Why in the f*ck does it have to get that bad?!? I’m furious. I started looking into homeschooling or alternative schools but my son wants to graduate with his class next year, not a GED. The nearest highschool is over 30 minutes away and no bus runs there. He is a great student, despite everything he is an A/B student. \n\n\nHis school does offer a “home bound” option that is usually for students who can’t be in school for medical reasons. It is offered to regular students but the parents must pay a $200 refundable deposit for the school chromebook. A regular laptop/desktop/chromebook/tablet is not able to be used. It has to be the school issued one.  There is no way around this and no exceptions. I’ve tried getting his doctor to write a letter to try and get the medical exemption but they won’t. He would be able to do his schooling from home but I also can’t afford to feed him during the school week. He gets free breakfast and lunch at school but that wouldn’t be an option. \n\n\nI hate that money is the only thing holding him back because I’m so worried about him. I’ve tried saving but every time I get close I need new tires or the cat gets sick. He constantly says his cat is his only friend right now. He promises to get all his schooling done and make sure the house is cleaned and dinner is made. I just can’t swing it right now. I feel like a huge asshole.",
 "created_utc": 1700871010,
 "permalink": "/r/AITAH/comments/1836bo0/aita_you_should_have_died_too/",
 "score": 53,
 "url": "https://www.reddit.com/r/AITAH/comments/1836bo0/aita_you_should_have_died_too/",
 "comments": [
  {
   "comment_id": "kamu7v3",
   "message": "Approach the school and ask them to put their policy in writing that they will not do anything unless your child attempts suicide. Tell them that you really want to understand their 100% Tolerance Policy towards harassment. In fact, put all of this into a letter. Explain that you fear for your child's safety, and you want it clearly explained to you why they will not intervene. You can mention you haven't secured lawyer services at this time but you want to make it easy for them in the future.\n\nEdit: Use registered mail. You want them to sign for receipt of the letter. Perhaps copy the school board.",
   "created_utc": 1700871963,
   "score": 72,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamuu5t",
   "message": "I would see a lawyer and investigate what you would need to do to establish grounds for a restraining order against those kids. Let *their* parents pay the homeschooling fee. Communication from a lawyer might at least get their attention to it as a problem they might see as in their best interests to address. Right now they think there is nothing you can do about it. Well, find out.",
   "created_utc": 1700872241,
   "score": 245,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamuq31",
   "message": "If they are attempting to hand wave \"you should have died\", you need to escalate beyond them. They aren't reasonable and they should probably lose their jobs over this.",
   "created_utc": 1700872192,
   "score": 211,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamuox7",
   "message": "Go to the police and start a harassment suit and a RO",
   "created_utc": 1700872177,
   "score": 28,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan3ikg",
   "message": "I worked for years as an advocate for kids just like your son against public schools. GET EVERYTHING IN WRITING. Give your son a notebook. Tell him to write down as many facts about every single instance of bullying as he can. Where it happened, who was the bully/bullies, what time and day it was, what happened or what was said, and if there were any witnesses (other students or teachers). It's important he is as detailed as possible. Tell him you won't read it if he will just write exactly what happens. If you take this to the school they have to investigate. If they don't, get a copy of their bullying policy from them and go to your county's board of education. Your school is being lazy and they are lying to you. Get him an IEP if it would help. Put a request in writing to the school, state the ways his education is being affected (he's becoming anxious at the thought of school, etc) and list your concerns (his mental health, anxiety, depression) and that you think special education may benefit him at this point. He won't be pulled from his classes and his good grades cannot be used as an excuse to deny him special education. But an IEP can give him accommodations like being able to change classes before the bell rings when no one is in the hall, let him leave class to go to a safe place or a counselor's office any time he feels anxious/overwhelmed/is being harassed, and let him and friends of his choosing eat lunch in a teacher's room of their choosing (the teacher will have to be on board with this since it's their lunch period, but if he has a teacher he likes that likes him a lot, they usually will be happy to let their favorite student eat in their room to get them away from bullies). \n\nYou have options that will not cost you a penny.\n\nPLEASE PLEASE PLEASE READ THIS. Feel free to send me a message with any questions.",
   "created_utc": 1700876225,
   "score": 192,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamt7p9",
   "message": "Bullying needs to be stopped. Put into writing if the bullying \u0026amp; harassment does not stop then you’ll get the police involved.",
   "created_utc": 1700871510,
   "score": 50,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamt339",
   "message": "Please get that poor kid in to at least talk with a therapist. He too is grieving on top of all the rest. Perhaps even some survivors guilt too. Take care of his mental health and don't stop trying to make his situation better. NTA here. Clearly the school is though",
   "created_utc": 1700871451,
   "score": 223,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamydn6",
   "message": "Criminal harassment.",
   "created_utc": 1700873863,
   "score": 112,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan0gxr",
   "message": "If $200 is all that is holding you back, I’ll pay the school directly for his needed study material and technology.",
   "created_utc": 1700874829,
   "score": 162,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan2lim",
   "message": "Does your son have a phone? If do, have him pull it out and start recording as soon as the \"grieving\" kids show up. Even if he can't get much useful video, catching the audio may be useful. With three or four of these recordings, take them to the school. If the school still sides with the bullies, take them to the police. Kids can still be arrested for assault.\n\nThey are not greiving; they are assholes and bullies.",
   "created_utc": 1700875806,
   "score": 40,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan8n5u",
   "message": "In  addition  to  following  advice  of   u/Glittering-Nerve-987,  contact  your  state  department  of  education  for  help. I  used to  be  a  school  district  administrator and  we  paid  attention  when  the  state’s  department  of  education  called  because  they  could  hold  our  funding  while  investigating a  serious  complaint.",
   "created_utc": 1700878614,
   "score": 32,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamu3xb",
   "message": "You should get a lawyer.",
   "created_utc": 1700871913,
   "score": 58,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamx9p9",
   "message": "His mental health is as vital as his physical health -- is your son in therapy, because survivors guilt is real and the bullying cannot be helping it.  \n\nWhat the holy fuck he has to actually attempt to kill himself before they'll try to stop it -- they will let bullies destroy a person before they do anything stop it.  \n\nAnd no one is helping those boys grief by coddling them and allowing them to be bullies. Grief is not a pass to be an asshole.  \n\nNTA",
   "created_utc": 1700873347,
   "score": 20,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamsuvw",
   "message": "I would contact private and religious schools in the area and explain the situation.  I was in a similar situation growing up, not a driving scenario but a conflict I wasn’t fully at fault and my mom was able to get me into a Lutheran middle school at reduced tuition due to charitable help.  You may be able to at least get donations for the home bound computer.",
   "created_utc": 1700871347,
   "score": 41,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan6973",
   "message": "NTA. I’m speaking 100% from experience here as a 50 year old adult who was bullied relentlessly in high school to the point of attempting suicide as a teen and living with chronic depression and self esteem issues to this day. \n\nContact an attorney and have them send cease and desist orders to the principal, the school board, and anyone else in positions of authority at the school. Then send additional cease and desist orders to the parents of the bullies, and the bullies themselves. Sue for damages. File for restraining orders. Involve the courts and the police. Be relentless. Use the courts to protect your kid. \n\nI wish my parents had taken steps to stop the bullying when I was in high school instead of trying to fix it by pulling me out of that school and sending me to another In my junior year and then sending me to a counselor. It made me feel that it was my fault I was bullied. \n\nThere are times even today that the only reason I am still walking the earth is that there will be no one to care for my cats if I’m gone and they will end up in shelters or worse out on the street to fend for themselves.\n\nEdit to add NTA…forgot what sub this was lol",
   "created_utc": 1700877479,
   "score": 18,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamsw0a",
   "message": "NTA \n\nYou need to go to the school board or the district manager. The school is allowing your son to be harassed and bullied because they are too lazy or scared to intervene. Yes. This was a horrific tragedy. However, their trauma is not an excuse to further traumatize your son.",
   "created_utc": 1700871362,
   "score": 33,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan1wje",
   "message": "Honestly, I’d escalate at school. If that means going to the school board with a lawyer, so be it.",
   "created_utc": 1700875484,
   "score": 14,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan1mrl",
   "message": "You need 2 speak to parents and explain he already has survivors guilt these boys need help but bullying your son is making a bad situation even worse",
   "created_utc": 1700875359,
   "score": 10,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan3y3a",
   "message": "NTA- get a lawyer and get the local media involved.  Nothing motivates a school board more than having their inadequacies aired to the general public.  And telling a parent that they can't do anything until their child tries to kill themselves is just about the biggest inadequacy there is .",
   "created_utc": 1700876422,
   "score": 9,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamwqol",
   "message": "You need to get him out of that school. If it means moving to another school district, then do it. Move somewhere close to that school.",
   "created_utc": 1700873104,
   "score": 38,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan5ahh",
   "message": "You need to go to the news about this. Shame them to the maximum degree. Sue them. Move your son to another school. This is going to be another classic \"the school wont do anhthing until a student unalives themself THEN they make changes\". Please dont let this happen. Financially ruin that school until they fire all the horrible people and make new policies. NTA.",
   "created_utc": 1700877036,
   "score": 6,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanawd8",
   "message": "I have 2 ideas you may want to consider. First, set up a go-fund-me. That may get you the $ you are short. Secondly, feed your story, everything that has happened to him while in school and what was said when you went to the school, to a local reporter.",
   "created_utc": 1700879690,
   "score": 7,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanwhrv",
   "message": "File a police report and ask that they speak to both the boys that are bullying yours as well as the parents. Yes, the family is grieving but bullying your son won’t help them heal. \n\nIs your sons father in the picture, grandparents? There are resources out there that can help your son with grief counseling and to help him deal with the loss of his friend and the injury to the other. The United Way is an excellent resource to start with mental health and education, they may be able to get him the computer he needs and food so he can take advantage of the off campus education until this stops. They can also point you in the direction of others resources you would qualify for.\n\nDon’t give up Mom, you got this.\n\nNTA",
   "created_utc": 1700890905,
   "score": 7,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan5x6i",
   "message": "Why do they think your son isn't grieving too? He was in the car and saw one of his friends die and the other get paralyzed. He's going to be just as sad as everyone else, and likely has ptsd and survivor's guilt on top of it. Why does only your son need to prove that he's suffering? Why don't the bullies need to prove that they're suffering? This is so messed up and I'm sorry this is happening. Do you not have any friends or family who can help out with this situation?",
   "created_utc": 1700877323,
   "score": 6,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan4qvy",
   "message": "NTA  See a lawyer about a lawsuit against school, parents etc. for condoning abuse, bullying of your son. Schools hear the word lawsuit and sit up and listen then.",
   "created_utc": 1700876787,
   "score": 4,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kana3ii",
   "message": "Is this not a matter for the police?",
   "created_utc": 1700879306,
   "score": 4,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanbg6r",
   "message": "Your son experienced an extremely traumatic event, and no doubt already carry’s around survivors guilt. What these boys are doing is unacceptable. Grieving is not an excuse to traumatize your son further. This is a failure on the parents part for not getting these boys therapy. I’m so sorry your son experienced this in the first place, and is being forced to relive it daily. That’s absolutely disgusting and even more disgusting that the school won’t do anything.",
   "created_utc": 1700879950,
   "score": 4,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kank7li",
   "message": "Your son wore a seat belt, the others didn't. He survived because he was smarter than the other kids. He's not dead and he isn't paralyzed.  Those boys may be grieving but so is your son. Survivor's guilt is a thing. See about therapy for him.",
   "created_utc": 1700884250,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kao92a1",
   "message": "Go to the media with this shame the school. No wonder there are so many shootings in the USA. Im guessing S stand for sh*tty. \n\nYour boy does not need to get to that stage. It's so unfair. First he went through a traumatic accident and now this.",
   "created_utc": 1700899422,
   "score": 5,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kao9wfm",
   "message": "NTA \n\nTell the school that they have a duty of care to protect your son and they are currently failing at that. Tell them that his mental health is deteriorating and you fear for his life and wellbeing. Tell them that if anything happens to him you will be going after them civilly and criminally.\n\nLet them know that the brothers are entitled to grieve but not to harass your son. You should also make a report to the police and see if they can get the family to back off with a warning. \n\nYou should try and contact a community law centre to see if they will help you with this. It might also help you to write to the Secretary of Education in your State and your local Congressperson. \n\n\u0026amp;#x200B;\n\nWhen your son is confronted he should tell them, if their brother had worn a seat belt he'd be alive too.",
   "created_utc": 1700900045,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaobh0r",
   "message": "Get restraining orders against the kids doing this.",
   "created_utc": 1700901210,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamzul7",
   "message": "After you ask for their policy in writing and they don’t respond (they won’t, they haven’t written one). A little bit of their own medicine might make them stop.\n\nThis is going to sound/be cruel, but maybe someone needs to ask these boys how their brother is and when they have that shocked look on their face, respond “oh yeah, no seatbelt.”\n\nI bet the school pays attention at that point.",
   "created_utc": 1700874544,
   "score": 10,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan5b7e",
   "message": "It's time to get an attorney.",
   "created_utc": 1700877045,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan6v9v",
   "message": "Get loud with that school. Make them show you in writing where it states they can’t intervene with the bullying going on. Have your son visit the school counselors to document each time the bullying happens to him. Threaten lawyers and the media if nothing is done.",
   "created_utc": 1700877767,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan9ez8",
   "message": "*”No they aren’t taking my education”*\n\nI want to give this kid the biggest of hugs. He sounds like such a good kid and I wish I could do something to help even though I’m just a stranger on the internet. All the shit he must be going through right now even without the bullying, damn. And he’s still being strong throughout. My heart goes out to him.",
   "created_utc": 1700878974,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanakzm",
   "message": "Move him to a different school.  And then get him into counseling.  Don't let your son have to live like that.  I moved my son for lesser reasons and it was the best decision I made for him.  It changed his life trajectory.  \n\nEDIT:  And to respond to the financial situation, I can almost guarantee there are resources out there to help you move him.  But the school won't tell you that because having him stay means they get more money every year.  You'll have to do some sleuthing to find those resources.",
   "created_utc": 1700879540,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanb6fr",
   "message": "All I can say is how very sorry I am for your son. I lost my best friend in a horrific car accident beginning of my senior year and it destroyed me. I wasn’t in the car with her but she was like a sister to me and I almost did the unthinkable in my grief. I know what your son is going through on some level and I’m so disappointed in your school system for not doing better by him, he does not deserve the torment on top of everything else.",
   "created_utc": 1700879822,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanbkcm",
   "message": "Go to the next school board meeting and address this in person with an audience. Also get ahold of the superintendent and, as others have suggested, get everything in writing.\nBest of luck, sending strength and well wishes to both you and your son. Please remember that you are doing everything possible to help him through an impossibly difficult situation, you ARE doing right by him and a wonderful parent.",
   "created_utc": 1700880004,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanc0fc",
   "message": "I would write weekly letters to all the members of the school board asking why they are allowing the bullying and harassment of your son stating they won't do anything unless he tries to kill himself. Ask why they are making that his only option for them to do their job. I would also write letters to your county and state representatives of the situation asking for their help in getting the school to do something to help make it stop",
   "created_utc": 1700880223,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanch0l",
   "message": "Nta.  Get your kid out of that school asap.  The mental damage is not worth it.  He was already traumatized when kids right next to him in the car were killed/maimed.. Switch schools or do home/online school.  The school admin will not take appropriate action - and, they can't protect anyone all the time.",
   "created_utc": 1700880449,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kand04c",
   "message": "NTA, but get him out of that school. The school will obviously do nothing to stop it, the parents aren't stopping it, so stop sending him there. Transfer him to another in the district, report the bullying to the school board, to the police, whatever. Your son does not deserve the constant harassment. I know that making sure he is fed is an issue and absolutely he needs to be taken care of, but he is being traumatized. \n\nLet's put it this way, you harass the school, the school board, the doctor(s) until you get them to listen. You report to the police and if they don't do something, harass them too. You fight for your son. You do every damn thing you can, and you do not stop until it stops.",
   "created_utc": 1700880705,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kandhkc",
   "message": "If it is in the US, you have options. Funds should not stop access to educational options. Call the county or state board of education. Then call the local press if the school doesn't change its mind.",
   "created_utc": 1700880939,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanei0w",
   "message": "Your son is grieving and I'm sure has survivor's guilt. My brother had it after his girlfriend died in a car accident with him. He tried to hang himself some years later after he had returned to what on the surface seemed like being perfectly \"normal\". \n\nLet him know it's not his fault, you're glad you didn't lose him and be there in any way you can. It would seem you are already doing this but I truly hope he opens up to you. \n\nIt was a hard journey but my brother survived and was sent to therapy and HAS come back from it to find someone new in his life. It hurts, it's hard and when you're down it will always come back to bite at your heels but you can make something new and still find happiness. These boys need a reality check. You don't kick someone when they're down or blame something on them that wasn't their fault. \n\nThe school absolutely needs to be reprimanding these boys and having them talk to a school counselor. I get they're hurting and feel robbed themselves but this isn't how you handle those emotions. \n\nI am sorry for you and your son, I am sorry for the victims' families. I'm just a stranger sending love and well wishes your way.",
   "created_utc": 1700881423,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaneo2t",
   "message": "“They are grieving.”\n\nYeah…but so is the kid who was in this horrible accident that claimed his friends lives. Also…survivors guilt.\n\nLike holy shit. How does the school no recognize this?",
   "created_utc": 1700881505,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanir1e",
   "message": "I am so sorry about what is happening to him. Tell him this Australian is super proud of him wearing his seatbelt, when most Americans refuse. It saved his life.\nCan he move schools.?",
   "created_utc": 1700883502,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanivhb",
   "message": "Go to a local church explain the need for the money get resources to help your kid and also contact a school that has law available and ask for them to do this for you learning XP for them and someone in your corner. Contact local news with your letters and if you have to confront the kids and parents together with the principal and make sure all of them understand should anything happen to your son who was not responsible for the accident that they will all pay dearly. Destroying their brothers friends is not a good way to memorialize their sibling or child.",
   "created_utc": 1700883565,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanjy73",
   "message": "I'd say get the news stations involved. I understand they are grieving, but that understanding goes out the window when they are harassing my child, especially if it's been occurring for months.",
   "created_utc": 1700884115,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kankazj",
   "message": "I don’t have any advice but I just wanted to say my heart is with you and I understand. I had bullies in school that terrorized me daily and nothing was ever done about it until one of them broke my leg. I’m sorry your school has failed your son, they never want to get off their ass for anything until somebody threatens legal action. The safety of the students should be top priority.",
   "created_utc": 1700884299,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanls51",
   "message": "Involve the police , file an order of protection with the courts for stalking and harassment, find a lawyer that works on contingency and file a civil suit",
   "created_utc": 1700885063,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanlx3r",
   "message": "Ma'am, please go to the school board. Go above and beyond every single one of those administrators, go to the superintendent, go to school board, go to the news outlets. I am a teacher, high school, and this is so widely and totally mishandled on every single front. I am so incredibly sorry your son is going through this, the trauma is unimaginable. Unfortunately, I can kind of relate on a personal level, and I can tell you absolutely not. Go screaming and shouting and demanding in every other thing you can do to get as much attention as humanly possible to protect your son.\n\n(Spelling edit)",
   "created_utc": 1700885135,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanmdyg",
   "message": "Find a lawyer and see if they take your case pro-bono.\n\nGo to the police and report the kids every time they harass your son.\n\nGo to the local news station.\n\nDidn't you get any money from the accident that would pay his school fees?",
   "created_utc": 1700885382,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanr5kk",
   "message": "Hire an attorney \u0026amp; watch how things change!!!!",
   "created_utc": 1700887890,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanraub",
   "message": "Stop going to the school and families. Contact an attorney ASAP! This is harassment.",
   "created_utc": 1700887968,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanvsgc",
   "message": "Escalate to the school board. And look, if you need to call the news and tell them you'd like to do an interview to expose your son is being bullied and the school said they can't do anything until he attempts suicide. I'm pretty sure that will get *someone's* attention with a quickness.",
   "created_utc": 1700890497,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kao3ls3",
   "message": "If you can get a lawyer, have them contact the school directly.  Show them you’re not messing around.",
   "created_utc": 1700895497,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kao3z16",
   "message": "Additionally, I would look for a reporter you could include in the conversations. This unusual strategy would undoubtedly pique the curiosity of the media.",
   "created_utc": 1700895756,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kao9okw",
   "message": "Call the superintendent and if nothing is done contact a lawyer.",
   "created_utc": 1700899883,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaoasr7",
   "message": "NTA but If you continue to do nothing you will be. You need to go to the school and ask for a copy of their policies and also the log for all the complaints/meeting you’ve had with them about the issue. Contact a local lawyer for a free consultation and be upfront with them about your financial situation. Someone might represent you pro bona some might point you in the direction of a pro bona lawyer. \n\nThe school is failing your son and you are failing your son by continuing to push this rhetoric that they are grieving and will get bored/redirect later. It may be true but in the present you are allowing more damage to be done to your son, you need to step up and advocate for him. Clearly being nice is doing absolutely nothing so you need to lawyer up.",
   "created_utc": 1700900708,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaobdv6",
   "message": "You need to make sure that damn school protects your son or take him out before something horrible happens like what happened here in my town when the school turned a blind eye to one too many bullying situations. \n\nThey would always say if they didn't see it, they can't do anything about it, in spite of the obvious trauma it was inflicting on the victims. And when the victims would fight back, THEY were the ones who got punished because everyone saw them. \n\nEarly this year, a young man, just 14, walked into the middle of the only intersection in town with traffic lights and blew his brains out in front of stunned motorists and gas station customers. \n\nHe was the baby of the family and I swear I heard his mother's anguished screams when she found out what happened to her baby because of the unrelenting bullying in person AND online. \n\nThere is little accountability when it comes to online bullying and when they are hiding behind screen names and firewalls, the bullying is absolutely horrendous. \n\nSAVE YOUR SON AND YOURSELF FROM THIS AWFUL FATE.  Get the cops involved. Do everything in your power to keep him from thinking they are right. I only hope he's not already thinking that. But from the sound of it, it might almost be too late. \n\nThe anguish of losing your child unexpectedly is more horrible than you can imagine, especially if it could have been prevented. I would never wish this anguish on anyone. Please believe me.",
   "created_utc": 1700901144,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaobird",
   "message": "Get your kid out of there. I get that youre struggling financially and I'm gutted for you but that is an extremely toxic environment and you are right in trying to get him out. Take care and good luck\n\nNTA",
   "created_utc": 1700901245,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaobj2u",
   "message": "Talk to a lawyer and get your son counseling.",
   "created_utc": 1700901251,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaoc4lr",
   "message": "Get a restraining order against the bullies for harassment.  (You will need evidence). \n\nGet son in counseling.\n\nTalk to a lawyer",
   "created_utc": 1700901705,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaocehu",
   "message": "Why would you in any way think you’re done something wrong? Bullying aside, your son is also suffering due to loss of a friend and permanent disability of another in an accident where he survived with few injuries. If you put the both of them together he’s really struggling but also wants to prove he can handle it all on his own.\n\nAs others said, go after the school and make them show you the written policy on harassment. Harassment is almost definitely not allowed. Also let them know they’ve done nothing to help *a grieving boy*.",
   "created_utc": 1700901921,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaocr1m",
   "message": "Kids can be such jerks but does he have friends that are part of his support network there too? Not being on school campus could be isolating. \n\nWhat if he got a part-time job to help pay for it?\n\nHe'd be around people, contribute financially and even just doing fast food pt he would get some free meals.",
   "created_utc": 1700902195,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaod9vo",
   "message": "Lots of people are giving advice and that's great. I can't give any because all I can see here is a broken system that is failing a child. I do want to say that you are an amazing parent. Your son is so lucky to have you on his side. I'm sure part of what's keeping him going is knowing you are supporting him and fighting for him. Keep talking to him, empathise, console. Keep being incredible. Like I said, I can't give any advice, but know that across the world there are people in awe of your strength.",
   "created_utc": 1700902599,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan4zcm",
   "message": "You know, while it would in no way excuse the behaviour, I could at least understand their anger and viciousness had your son been driving and at fault. I mean were that the case he would have literally been responsible for the accident that took their brother from them. But he wasn't at fault. He wasn't driving. Presumably the brother who died was your son's friend. All of these things make the bullying behaviour nonsensical and, for me at least, that much more inexcusable. \n\nYour son was a victim in an accident and they are choosing to continuously re-traumatize him by projecting the anger they have over their loss onto someone who they consider more fortunate than their brother. It's like some twisted externalized version of weaponized survivors guilt. \n\nWhy does the school consider their grief more significant than your son's grief and trauma? I think this question needs to be posed to the school administration and to the board in a written enquiry that's clear in establishing the question being one you expect an answer to as it's not rhetorical. Your son absolutely needs to know you have his back, but also that those in positions of authority should too, and can be held accountable if they don't. Escalate, escalate, escalate - all the way to the Governor and local media if you have to. And don't be sympathetic to the brothers… yes they've suffered a loss, but that's in no way an excuse for what they're doing, especially after having months to come to terms with what happened. Now they're just bullies who no longer deserve any quarter. Even if it means more grief for their parents, that's not for you to worry about, your son's future mental health, well being and success are what must matter to you. Time to show your son how to fight back.",
   "created_utc": 1700876894,
   "score": 3,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kamzopp",
   "message": "This sounds a lot more than just focusing on him because he is the survivor. Therapy for everyone is clearly in order. 1. To help everyone deal with the grief. 2. To help everyone deal with the obvious blame they are laying at your son's feet, whether it is warranted or not. Blame won't help anyone move on. 3. To find better avenues of expression of emotions than bullying.",
   "created_utc": 1700874470,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan4m1i",
   "message": "If OP can't afford the $200 deposit for the school laptop, they certainly can't afford a lawyer.\n\nThe advice from the retired principal seems helpful, and so does the idea to switch schools.\n\nIn fact, I'm surprised that OP hasn't tried this sooner. That boy is suffering badly, not only due to the accident but due to peer abuse and school administration incompetence.\n\nOP, do you have coverage for therapy? The boy needs it soonest.",
   "created_utc": 1700876725,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan67jw",
   "message": "NTA.  Your heart is in the right place.  You're doing what you can.  Have you applied for EBT or other public assistance?  Do you qualify for free or reduced price lunches?  If you are so broke as to not cover daytime lunches, there is a good chance you would qualify.   A GoFundMe for the deposit could also work.",
   "created_utc": 1700877457,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan7p4g",
   "message": "Get a doctors certificate from a psychologist. Most GPs don't understand mental health.",
   "created_utc": 1700878165,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan7vp0",
   "message": "I feel like you need to speak to the school psychologist AND principal about the impact of survivors guilt as well as the impact of social bullying. That this needs to be addressed NOW and not when it becomes too late. If they still refuse? Let them know you will let them know that they can deal with the public news. Report that this child lost his friends in a car wreck and is being bullied daily simply for surviving. Schools don't like the media getting involved. It may change their time fast.",
   "created_utc": 1700878252,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kan9xdm",
   "message": "You need to go to the school board meeting.. your son definitely will have some trauma already from being in the accident with the boys and have survivors guilt. Having the boys who passed aways brothers harassing him and bullying are definitely added on to the mental anguish that your son's going to go through. And no you don't want to deal with that, because that your baby.. your baby doesn't deserve to go through this because of an accident that kids had. He lost his buddies in this, and now he's losing his education.. You go fight like hell. I don't care if you have to go down to school and raise hell every damn day, call the police. Call the police and get a PPO on the boys that are hurting your child. Make it to where they can't go to school. Then maybe their parents will come to the school and have that conversation and actually have reality of what's really going on in the school.\n\nAnd honestly I know that the other schools far away, if this isn't going the way that you need it to go.. I probably would just make that drive everyday, he needs normalcy. He needs to make new friends, a new start and leave the mental anguish at the old place.\n\nI'm very sorry that you're going through this and all I want to do is give you a hug and your son.. being a mom my heart strings are with you guys. And I'll be honest I probably wouldn't be able to contain myself to go to the school and knock some little punks out and then scare the daylights out if I'm going to let them know that they'll be with their brother if they don't leave mine alone. And I know that's an a****** thing to do, I am the a******.. But I want my child here with me as long as I can, and I'm not going to let you little punks take that away from me because you're upset. Their parents need to get them in counseling and therapy and maybe they don't need to be in a school where they have free rein on terrorizing your baby.",
   "created_utc": 1700879224,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kana1jj",
   "message": "File a police report for harassment. And a restraining order.",
   "created_utc": 1700879280,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kananty",
   "message": "Give him mace to mace the tormentors.",
   "created_utc": 1700879576,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanaq8l",
   "message": "I’m sorry to hear this is happening to you and your son but I don’t feel like this is the appropriate subreddit to be posting this in",
   "created_utc": 1700879609,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kancaz1",
   "message": "Yeah you need to sue them at this point. Sounds crazy but it at that point.",
   "created_utc": 1700880367,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanczfq",
   "message": "Try the police for harassment.  These children lost a brother but that doesn’t absolve them of harassment and bullying. If police showing up at home forces their parents to get their children help so be it.",
   "created_utc": 1700880696,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kand855",
   "message": "If the school and the parents aren't doing anything go to the cops and the education department file for a restraining order and keep taking it higher with education department",
   "created_utc": 1700880812,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kandbl5",
   "message": "I’m so sorry for what your son is going through! I completely agree that you need to request from the principal their bullying policy in writing. Then write a letter to the school board, attaching a copy of the policy from the principal and send it certified mail!! \n\nMe personally, I’d go scorched earth here! I’d have this all published on social media and on the news outlets in my area. What the school is going is negligible!! Yes they’re grieving but that is not an excuse to bully anyone. \n\nIf you’re in the US, most states have county level free or lost cost legal services that are based on income, please look into in your area if you are!! Please also look into some counseling for your son if he’s isn’t already!",
   "created_utc": 1700880858,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kandmud",
   "message": "Ask the school about Title IX. Your son has a right to an education and the bullying is interfering with that, therefore the school has a legal obligation to ensure it no longer interferes.",
   "created_utc": 1700881009,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kaneddl",
   "message": "Where is OP's son's father in all this?",
   "created_utc": 1700881360,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanfcls",
   "message": "This is insane. Your son’s school is out of line. \n\nPlease look into homeschooling programs. Out School, Venture Upward and others provide you with funds to homeschool and will allow your son to graduate with a high school diploma, while doing school from home.",
   "created_utc": 1700881835,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanfebq",
   "message": "Email the school principal or board and ask to see the policy that states that they cannot do anything to stop your son's bullying until he is armed. \n\nBe relentless in your pursuit to get this policy do not let them ignore your emails or wave you off. Warm them that if something happens to your son, you have all these email communications as proof that you made the school aware of your son's bullying and you will sue them. \n\nChances are they will retract their statement and apologize but don't stop. Tell them if they don't make changes then you will go to the media and show them the email communications and let the public know how unsafe that school is. \n\nI would recommend even contacting a reporter and getting the media involved if they brush you off one too many times. \n\nProtect your boy! My heart goes for him. It was an accident and he is just a kid!",
   "created_utc": 1700881859,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanfwxa",
   "message": "Schools in the U.S. are so useless. When my older daughter was in school she was getting harrassed and inappropriately touched by a kid. We told the school and they gave the same basic excuses that they’re giving OP and did nothing. I told my daughter that if he touches her again, she better hit him in his face until he runs away or is on the ground. I then went to the school and told the teacher and principal that she has been told to hit him until he is unable to touch her again. They gave me some bullshit about how wrong that is BUT she never had to hit him and he never went her her again so they did something.",
   "created_utc": 1700882110,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanfx16",
   "message": "What state are you in? Many states have adopted zero or near zero tolerance policies for bullying. They’re supposed to have a hotline and an anonymous way to report incidences to the school board. They are also supposed to have a plan to deal with the bullying once it is reported. It sounds like you are in a small town school district that doesn’t follow the rules because they think no one will notice. If nothing is done, you can always report the school, the individual teachers and the district to the state board of education. In addition, targeted harassment is against the law. See what your local and state laws are regarding their actions. I would hate to add insult to injury, but besides a lawyer, you may also need to get the police involved. Yes, the kids are grieving,  but this not a normal response. Ask the district or the county agency that supports the district if there is any possibility to get grief counseling services made available during the school day. There is an agency called Fernside near where I live that provides grief counseling to students for as long as they need it. See if there is a similar agency near you.",
   "created_utc": 1700882112,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kani755",
   "message": "take your son to a different school?",
   "created_utc": 1700883227,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanipd9",
   "message": "My step son was being bullied. I got the same bs response from the school. He went to the guidance counselor and told them he was having suicidal thoughts. They immediately sent him to the hospital for an evaluation. He was released the next day. I went back to the school and spoke with them again. Because it had finally “became an issue affecting his mental health” they finally did something about it. They spoke with the bullies and their Parents warning that they would be suspended indefinitely if the bullying continued. It stopped. It ducks that our children are not better protected from these types things until it gets to a dire point. I’m sorry your Son is going through this. He probably already has survivors remorse and having to hear these terrible things spoken to him daily has to be extremely difficult.",
   "created_utc": 1700883478,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanklhn",
   "message": "Go to the school board. If you have to, go to the news. Don’t implicate the other boys but let them know they aren’t protecting yours from bullying.",
   "created_utc": 1700884448,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kankns7",
   "message": "No, you’re not an asshole, you’re actually a far better person than I am. Because, I’d be confronting those kids and telling them that their brother killed himself, paralysed his friend, and injured your son. \n\nYou should go to the police. This far exceeds bullying, and is into criminal harassment and assault. These kids need to have some fear of consequences put into them, because at the moment they have absolutely none. Their brother fucked up, and now they’re punishing your kid.",
   "created_utc": 1700884481,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kankyz3",
   "message": "NTA- you need to file a complaint with the school board.",
   "created_utc": 1700884644,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanlcha",
   "message": "I might be TAH here, but this smells suuuuper scammy. \n\nSincere apologies if it turns out that I’m very much TAH, but also hoping ZERO people have reached out to the OP offering to pay the $200.",
   "created_utc": 1700884834,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanlyko",
   "message": "🫂\n\nPut everything in writing. Send requests to the school via traceable mail. Get ready for a lawsuit.",
   "created_utc": 1700885157,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanm4fs",
   "message": "Lawyer up ASAP! Please call around and schedule some (free) consultations and inform them of the situation. I wouldn’t be surprised if one takes your case pro bono (for free) because the school’s behavior is completely unacceptable!",
   "created_utc": 1700885241,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanp6zv",
   "message": "Get a lawyer start a suit.",
   "created_utc": 1700886840,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanp99p",
   "message": "Get a lawyer. See if there is a local legal aid near you if you can't afford it. Or maybe if a law school is nearby they might have some \"clinics.\" Find someone preferably that has experience dealing with schools. You could also talk to a personal injury lawyer. Ask him or her about something called \"intentional infliction of emotional distress.\" Obviously your son could benefit from therapy, so look into that. The parents or the school may step up if they realize they're about to pay for years of therapy for your son. And a restraining order may be a possibility.",
   "created_utc": 1700886873,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanqtwt",
   "message": "File for an order of protection with the court. Not a restraining order. If you are in the u.s. violating an order of protection is a criminal matter. If you can get an order then the school has to enforce it.",
   "created_utc": 1700887718,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanr16d",
   "message": "You need to go to the police and press harassment charges and also threaten to sue the school. Also talk to your son's doctors about how bad this is and get them to push the forms to be at home through. This is LITERALLY life or death. Also change your son's phone number and block all the harassing parties",
   "created_utc": 1700887825,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanr6jd",
   "message": "Time to lawyer up and threaten lawsuits against the school and families that are harassing your son he is your top priority if they don’t stop you sue and sue them for everything your sons life may depend on it",
   "created_utc": 1700887904,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanrvyv",
   "message": "NTA. \n\nIt’s ridiculous the school’s policy is he has to try to commit suicide. Make them write it down and sign it",
   "created_utc": 1700888288,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kans139",
   "message": "K12.",
   "created_utc": 1700888365,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kans9dn",
   "message": "Fuck this, DM me your Venmo and I’ll send it to you. You and your son have been through enough",
   "created_utc": 1700888493,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kantcyv",
   "message": "Lawsuit. 100%. Get everything in writing.",
   "created_utc": 1700889106,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kantlxz",
   "message": "NTA. \n\nOP, you may be able to sue the insurance carrier of the vehicle owner therapy expenses for your son.",
   "created_utc": 1700889248,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kantr3h",
   "message": "Not saying your child would do this but holy shit no wonder we got people harming others in schools. The second a kid sneezes they gotta go home but a real issue comes up and it's swept under the rug.",
   "created_utc": 1700889328,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanu1ar",
   "message": "I would move heaven and earth to get my kid out of that school.  If it’s literally $200 for a Chromebook and $100 worth of groceries a week find a way-second job, door dash, sell plasma, call every church in town to find a food bank that can help you feed your kid.  Petition the school district to move schools.",
   "created_utc": 1700889488,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanvbok",
   "message": "You need to get a lawyer and sue the school district \u0026amp; the school but go after everyone civilly as well. Just be a nothing has happened yet doesn’t mean it won’t. You’re noticing changes in your son physically, mentally \u0026amp; emotionally so guess what, something has happened.\nPlease get your son into therapy if he isn’t in it already. \nI hope that you’re able to get this resolved soon \u0026amp; that your son is able to heal from this abuse",
   "created_utc": 1700890226,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanvkmo",
   "message": "I am so sorry this is happening to your son at school, and you feel helpless to protect him. I don't have any advice, but I have 4 kids, and I can't imagine the frustration from all this. All these recommendations look good and can definitely get you all in a better place than you are with the school. I just couldn't scroll by without telling you that you should be proud as a mom to be so involved, and your son has an awesome mom trying to get help/advice to do what it takes to make his life better. I'm not religious, really, but this breaks my heart to the point I want to pray for your son's healing through this. Good luck, and please take care. 🙏",
   "created_utc": 1700890371,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanvsgd",
   "message": "NTA\n\nSadly the food chain of administrators are unwilling to do anything and their parents clearly have no interest in parenting. Based on apparently being in a rural area, not really sure what options are either.\n\nThe problem is somewhere along the way people decided “grieving” is an acceptable excuse for unacceptable behavior and the expiration date doesn’t need to exist. It’s not. Don’t care if suffered a loss an hour ago, it does not give carte blanche to be an asshole.",
   "created_utc": 1700890497,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanwk09",
   "message": "Please try and get a lawyer.  I work at a school and whenever lawyers get involved, the school stays to take things seriously.",
   "created_utc": 1700890942,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanwrra",
   "message": "Get your kid out of that school. Move if you have to.",
   "created_utc": 1700891066,
   "score": 2,
   "submission_id": "1836bo0"
  },
  {
   "comment_id": "kanxpkm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1836bo0"
  }
 ]
}