{
 "submission_id": "1837i54",
 "title": "AITA if I kick my 16 year old son out?",
 "selftext": "I'm at my wits end with this kid. He's not always honest. He sneaks out a lot. His anger can sometimes get the best of him. I know he vapes. He thinks he's way more mature that he actually is. He's a know it all, and he's also got one hell of a chip on his shoulder. With all that said, he does adore his girl friend (17) and from what I can tell, he mostly does right by her. He's in 'love'. They're in love. It's gross and sappy but sometimes precious (until now). They've been 'together' (as much as kids can be) since he was 12.\n\nGiven his history, it should surprise absolutely no one, least of all me (yet somehow it does), that she's now pregnant with his child. She's almost 20 weeks along and just found out. She's in foster care, so again, it's not surprising when I say she has inadequate healthcare and a limited knowledge of her own body. I'm sick. I'm sick, guys. I wanna scream and rage and tear the world apart because my son's life as he knows it, is over.\n\nWanna know the kicker? He's excited. They're excited! And I am very VERY angry. They won't even consider adoption. Which, you know, fair enough. I get it. I'm a father. I would have destroyed entire universes to keep my son safely bundled in my arms. But look where those instincts got me. I'm gonna be a grandpa and I'm only 34. Even worse, I can hardly judge since I was 18 when he was born. It's actually quite miraculous he didn't arrive years sooner. Honestly, my boy really takes after me. Should I be proud?!\n\nNEVERTHELESS, I got the tough love treatment. My parents kicked me out. They said if I wanted to act like a man then I needed to BE a man and provide for my family. \n\nThe problem is, my son is no man. He's little more than an overgrown toddler... plus rents are outrageous and he's been begging me to let his girlfriend move in since she ages out of foster care in a couple months. \n\nLogic tells me I need to send him on his way so he can get up onto his own two feet and do what I did, but also, my heart and gut tells me my baby isn't quite there yet. He's not ready. I don't want to see him struggle. I don't want to set him up for failure. I want him to be a kid for a little while longer. I can help, monetarily and otherwise. \n\nBasically, I'm at war with myself. \n\nWould I be an asshole if I kicked him out? \n\nIt's a different world now. Things are harder. Life is harder. Yet, he needs to fix his own problems, right? He needs to man up, get a job, and find an overpriced apartment he can barely afford, like we all do! He shouldn't get to take the easy route because dad wants to save him. He needs to learn and he can't learn if I do everything for him. \n\nIt needs to be done. Kick the kid out. I'm not an asshole. \n\n...Right?",
 "created_utc": 1700874296,
 "permalink": "/r/AITAH/comments/1837i54/aita_if_i_kick_my_16_year_old_son_out/",
 "score": 194,
 "url": "https://www.reddit.com/r/AITAH/comments/1837i54/aita_if_i_kick_my_16_year_old_son_out/",
 "comments": [
  {
   "comment_id": "kan4htg",
   "message": "Read this BestofRedditorUpdates post for an example of a father who did the right thing when his 16 year old son got a girlfriend pregnant. With dad's support as a bedrock, and their own hard work and cooperative parenting, the teens and their young daughter are thriving: [I 16(M) have a 4 month old daughter - ex gf wants to go to college and I am worried](https://www.reddit.com/r/BestofRedditorUpdates/comments/16m8o6u/new_update_i_16m_have_a_4month_old_daughter_ex_gf/?utm_source=share\u0026amp;utm_medium=web2x\u0026amp;context=3)",
   "created_utc": 1700876672,
   "score": 144,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanatp4",
   "message": "Where's that best-of post by that kid who knocked up his gf and father was basically the most amazing human ever?\n\nBasically, the father let the gf move in but insisted the kids had to go to and do well in school, follow rules, take care of their own baby instead of sloughing it off on him. He helped then save up money for things they needed, encouraged the kid to get a trade cert and the girl was going for a nursing degree...\n\nAnyway, OP, find that post and do what that father did. Your son's life doesn't have to be over, if you help him to handle this issue, BUT your son has to really lean into fatherhood as well as committing to growing up and being a decent person and not taking advantage of you.\n\nYou owe him a place to live until he's 18. After that, if he won't follow the rules and makes bad choices that sabotage their progress, you can kick him out.\n\nI suggest if you go this route, make therapy one requirement of his staying, and he has to actually *do* it, not just go and sit in silence in the same room with the therapist. Because the anger issues, rebelliousness, etc. do not sound like they'll help him achieve success even with your help. There's only so much you can do if he's not willing to act right.\n\nMaybe family counseling, if for no other reason than to convince him to trust you when you give advice instead of following his own (bad) instincts.\n\nETA: someone else had the link to [that post](https://www.reddit.com/r/BestofRedditorUpdates/comments/16m8o6u/new_update_i_16m_have_a_4month_old_daughter_ex_gf/)!",
   "created_utc": 1700879655,
   "score": 61,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan09w0",
   "message": "YWBTAH homelessness is dangerous enough for adults, let alone kids. He's likely to experience drug issues, physical and sexual assault, and it's almost impossible to dig yourself out of homelessness once you're in it. You also had a kid, you have a responsibility to be a parent until he's an adult. You criticize his decisions, but you're not setting a good example yourself.",
   "created_utc": 1700874739,
   "score": 52,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kank5wm",
   "message": "YTA even if the “tough love” approach worked for you (spoiler alert: it didn’t,) you were 18 and that was 16 years ago. If you kick him out, he won’t get an overpriced apartment he can barely afford. He will be homeless. Plain and simple. At 16, he’ll be lucky if he can get any job that’s not minimum wage, and at least in the US, there isn’t a single state where someone working minimum wage can afford to rent an apartment. Of course, even if he could afford the rent, who is going to offer a lease to a minor? You won’t teach your son anything by throwing him out except that you’re an awful parent who he cannot depend on.",
   "created_utc": 1700884225,
   "score": 20,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan1obj",
   "message": "Re read what you wrote and you’ll have your answer.",
   "created_utc": 1700875379,
   "score": 188,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan0ajq",
   "message": "Yes, YTA if you kick him out. You KNOW how much he needs a father right now and THAT is not the answer. \n\nI’m sorry people didn’t support you in the past, but that’s no reason to continue that. \n\nWouldn’t you rather a happy son in your home, with your healthy and supported grandchild growing and thriving, or what? \n\nDo you want to be alone and upset in ten years, or should you MAN UP and gather your family around them and support them? Show them how to be a strong supportive man. Please.",
   "created_utc": 1700874748,
   "score": 196,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanu6yf",
   "message": "YTA.  \n\nDamn Americans and their need to kick kids out of the home completely unprepared the second they turn 18. The rest of the world *does not do this*. \n\nListen to your gut instinct. Rent and cost of living is insane, jobs are minimum wage, they don’t add up. Your expectation for him to step up is reasonable to an extent though- he needs to start looking out for his partner and child- which, to be fair, it sounds like he’s doing. \n\nConsider taking them on as tenants with a proper contract, but at a rate they can afford with your son working. If you don’t need the money, maybe think about putting the money into a savings account. The adult thing to do here is to sit down with your son and his partner and talk it out- not kick them all out into the cold.",
   "created_utc": 1700889576,
   "score": 55,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanbcqa",
   "message": "Rage bait",
   "created_utc": 1700879904,
   "score": 67,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kamzvld",
   "message": "You WBTAH. He’s 16, he’s a child. And the fact that she’s pregnant just means you didn’t drill into his head to wrap it. \n\nYeah he’s a teenager. He’s gonna be a butthead. \n\nEnjoy your grandchild and let them know they have your undying support as long as they are clean and making good choices.",
   "created_utc": 1700874557,
   "score": 223,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanfigt",
   "message": "YWBTA- My man you grew up in an entirely different world than your son. If you do kick him out and his girlfriend’s parents don’t take him in there is a good chance he will die on the streets. It sounds like he’s doing the typical high schooler things. But if that’s not convincing then think about this. When your parents kicked you out how did you feel? Alone? Scared? Do you want your son to go through that? Can you really call yourself a parent if you are able to prevent your child from going through a hardship and you don’t? Years after your parents kicked you out and you got your life together, did you think wow I glad my parents abandoned me and left me to figure this out on my own? Or did you think, man fuck my parents, I could be in such a better place financially and have more stability if they hadn’t thrown me out? \n\nI’m not saying you have to be happy about how things are going but don’t ditch your kid because he made a mistake. What you should do is be on top of him to get a job and start getting ready for that baby. I understand your inclination to let him be a kid a little longer but unfortunately that is off the table. He needs your guidance and support now more than he ever has and maybe ever will. Don’t make the same mistake your parents made, help him as best you can. Also he’s a minor you should force a paternity test, I know not a popular opinion but you never know especially at that age. Good luck OP.",
   "created_utc": 1700881915,
   "score": 11,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan1pjw",
   "message": "YTA, just the way you wrote this tells me exactly why your son is acting the way he is.  He is 16, a minor, and you want to force him to be homeless to “teach him a lesson”? Dude your just as bad as the worst boomer parents gtfo with this.",
   "created_utc": 1700875395,
   "score": 104,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan4s1c",
   "message": "I have a son who was very difficult and did some things far worse than your son. I stuck by him and made sure he knew my love was unconditional. When he was in prison, I drove 80 miles each way going right through LA to visit him every week \n\n It took him a couple of years to get his footing after he got out, but, long story short,  he now has a great job, 3 awesome sons and a beautiful home and is happily married \n\nI can’t imagine ever kicking him out or abandoning him. \n\n\nWhat you are contemplating is very selfish and destructive. You would be abandoning your son at the time he needs you most. You are abdicating your parental responsibility for YOUR child in order to make your life more comfortable. \nAnd how can you not have some joy and excitement at having a grandchild, even with all the stress and difficulties, the grandchild has done nothing wrong and will need your support and love. \nMy mom became a grandmother at 36 under similar circumstances and that child was and is pure joy and a gift to all of us \n\nYou need to grow a pair and deal. Your son needs you, his girlfriend pregnant with YOUR grandchild needs you. This is the risk you sign up for when you become a parent. Quitting when it gets tough says far more about you than your son.",
   "created_utc": 1700876801,
   "score": 26,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan0hb4",
   "message": " YWBTAH\n\nHe’s 16 years old. \n\nRealistically you’ll be condemning him, the girlfriend, and the infant to a miserable existence if you kick them out. No good will come of it and someone, probably the infant, will end up getting hurt. They’re going to need serious help and as the grandparents much of that help will need to come from you.",
   "created_utc": 1700874833,
   "score": 40,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanu5oo",
   "message": "OP, you fucked up. You had to have known what they were doing. And you just stuck you head in the sand. Why not buy them condoms? Make sure the gf was on birth control?",
   "created_utc": 1700889557,
   "score": 6,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanf8qn",
   "message": "As a teen mom I can confidently say that you are uniquely posed to ensure this young family gets a strong, healthy start. It sucks and it will be hard, but if you can help them by providing a home while instilling a sense of responsibility, you absolutely should. Had my parents not stood by me through all my bloated teenage entitlement and idiocy, I would not be where I am today, and neither would my children.",
   "created_utc": 1700881783,
   "score": 16,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan6bo1",
   "message": "This is fake rage bait. Wtf. Anyone with half a brain should be able to see through this",
   "created_utc": 1700877512,
   "score": 19,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan1we1",
   "message": "Clearly your parents kicking your ass out didn’t make you a real man by what you wrote. YTA",
   "created_utc": 1700875482,
   "score": 37,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanggpz",
   "message": "You're an asshole and you know it.\n\n\"Tough love\" is not love, just tough.  Your parents were assholes to you, and now you are talking about continuing that generational cycle of abandonment and being the same kind of asshole to your son as your parents were to you.\n\nYou could be better than your parents were, or you could kick your son out, so that when your grandchild gets pregnant or gets someone pregnant fifteen years from now, your son kicks them out.  Feel free to keep the cycle of destruction going if you want to.\n\nOr do better.\n\nYTA.",
   "created_utc": 1700882374,
   "score": 10,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan0wa3",
   "message": "Yeah you'd be the asshole for that. You're not obligated to care for your grandchild, but your son is still 16 and I think you're well aware that kicking him out will *not* be what is best for him in the long run.",
   "created_utc": 1700875023,
   "score": 12,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanth7s",
   "message": "Most states it's illegal to kick your underage child out. This isn't the same world you were born into. He needs a vocation asap and a job. You need to take him to the store with a note pad and he needs to write down everything his is going to need for this child and how much it will cost. He needs to know what current rents, utilities and insurance costs are.",
   "created_utc": 1700889174,
   "score": 4,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kantpit",
   "message": "You’re some what responsible for the way he is",
   "created_utc": 1700889302,
   "score": 5,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao011m",
   "message": "Don’t kick your kid out, treat him like an adult in your home. Which means yes give him a place to stay because wether or not you like this is your grandchild and unless you wanna be completely heartless and just don’t give af you’ll be also leaving the baby out to dry. Not saying you HAVE to let her move in because she’s not your daughter but maybe sit down with them and have a genuine conversation. Show them how much formula and diapers cost. Tell them although he can still live there you’re not covering anything financially. Show them things the state offers(WIC,Food stamps,housing) and let them take it from there. Not saying the he should be fully dependent on those things but it’ll help until they get a job. Tell him that it’s up to him to wake up, and figure out school and work and a baby on his own and don’t come asking to for anything since he obviously isn’t understanding how serious this is. I had my second at 24, had my own place and good job and it was STILL difficult money wise and time wise. It’s hard asf and I really think most don’t see it until they’re in it when they’re that young unfortunately and usually it’s because they think the parents (you) will help them when they need it. Show them you won’t help them and they have to figure it out but don’t kick him out. He’s 16 and needs guidance more than ever",
   "created_utc": 1700893078,
   "score": 4,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan2kov",
   "message": " WBTAH if you kicked him out at this point.  You have the opportunity to influence 3 lives in a positive direction.  Set some reasonable conditions and rules and try to give some support and guidance.",
   "created_utc": 1700875795,
   "score": 10,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan5d1q",
   "message": "YWBTA. And its a crime to kick a minor child out. Sounds like you are where his bad decision making from.",
   "created_utc": 1700877068,
   "score": 7,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanednx",
   "message": "YTA!! Look at how harshly you're judging him AND his girlfriend for being in foster care you kidding me?! As if it's her fault! You are a disgusting judgemental human being! What's done is done, and as a parent if you don't love your children even through their choices then you have no right being a parent. I stole from my mom, lied to her, abused her verbally. Now she and I have an amazing relationship he's got hormones unbalanced because he is a teenager you're going to throw him out because he made some mistakes and bad choices? Then why did you even become a parent?! Strict parents make sneaky kids and I could tell you that for a fact. You want to lose out on your grandchild's life don't support them don't love them like you're doing right now. \n\nYou are going to lose out on your grandchild. My only recommendation to rectify this is to make a nursery for the baby so that he can also see his child and let him back in don't financially support the baby necessarily make him get a job making pay for the baby I absolutely 100% think that Dad should have rights and be able to support their children. But the same goes for moms. So my recommendation you better turn around and turn it around quick otherwise you're not going to have your son or your grandchild. Not to mention the fact that my sister was a mom at 16 and she is an amazing mom does well to support herself and her child. Because of the love from her family and support from her family.\n\nNo one is going to run to them being so young and the fact that you're willing to throw them out on the streets is disgusting. Tough love doesn't always work you're going to lose your son and your grandchild.",
   "created_utc": 1700881364,
   "score": 6,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanjjzc",
   "message": "His son and GF need to abort the fetus.",
   "created_utc": 1700883913,
   "score": 6,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanb56f",
   "message": "Yeah, this is all still part of what you signed up for as a parent though. Teens being teens. If you kick him out, you're basically choosing your rage over his needs.",
   "created_utc": 1700879805,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanbpxc",
   "message": "This is going to be one of the hardest times in his life. He made a choice that you may not agree with but he’s your young son. You should support him and help him through this time. Consider instead of kicking him out, help them out maybe for the first year or more and have them pay you a small amount of rent (100-300 a month) so he has to enter the work force and learn to work and provide, then once they’ve had the baby and have a grip on things and are ready to move into their own place give them back the rent they paid so they can put a down payment on a place or the few first months rent on an apartment.\n\nAlways strive to support your children the best way you can. Especially in their time of need.\n\nInstead of going to him angry, go to him with love.",
   "created_utc": 1700880079,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanfu4b",
   "message": "Yes YWBTA. Don't repeat the cycle of trauma.",
   "created_utc": 1700882073,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanfvhu",
   "message": "What do you want out of this long term? Because realistically what you choose to do now will determine your life further down the line. Do you want your child and grandchild in your life in the future? Do you have a pension set up and a good support network in case u wake up alone over night? Can you live with yourself doing that to your flesh and blood? Cause you are at a cross roads atm and whatever path you go down determines where you end up. I doubt ur kid wanted to get this girl pregnant but at 16 his brain is not fully developed and neither is hers. Shit happens and because shit happens does not mean you also have to pile suffering on him, from ur post I gather you want him to suffer like you did but that is not a necessity it’s a choice. Do you know why we live in families, tribes and society? In the same way animals live in groups being around people you trust makes the missery of life easier. Why would you have made a family if you did not want to share the load of life which btw goes both ways? I love my family and and my friends we all help each other as best we can my sister is ill I got you, my mom got in trouble I here to help here out my car broke I have a cousin.",
   "created_utc": 1700882091,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanh24v",
   "message": "So, have you actually TALKED to him.\nReally talked. About him, his life, his interests. Do you even know your child? Do you have a bond?\nTalk to him, ask him what his plan is with this child, who is supporting her and the child financially, is he dropping out of school, is he expecting her to move in with you.\n\nI think you just straight up kicking him out demonstrates the same failures in parenting that your parents did you you. It was much easier to kick a kid out than actually put in the effort.\n\nYou're his parent. Your job is to teach, guide and support.",
   "created_utc": 1700882661,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanhk3d",
   "message": "It's illegal to kick him out. You are responsible for his needs until he turns 18. You would also be a shit excuse for a father and grandfather, but you seem to only give a fuck about your own feelings. \n\nThis is not about you. Get your feelings in check. \n\nAnd, for the record, this didn't happen because your son is a bad kid. It happened because you are an immature and selfish father who raised someone who is just like you.\n\nIf you kick him out for doing what you did and not what you said, you are trash. Nut the fuck up and be there for your child and grandchild. If you do literally anything else, you don't deserve to think of yourself as a good person.",
   "created_utc": 1700882905,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanho1t",
   "message": "YWBTA your parents were also TAs. You are suppose to help your children progress in life not making harder on themselves. I would be as pissed as you are. I would set some clear rules and boundaries for things moving forward. That child will not be your responsibility. You are simply providing shelter. If he steps over the boundary or breaks the rules or you see he is not stepping up, then modify your plan as you see fit",
   "created_utc": 1700882961,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kannlf8",
   "message": "Ywbta\n\nThat's your grand baby.\n\n\u0026gt;Even worse, I can hardly judge since I was 18 when he was born. It's actually quite miraculous he didn't arrive years sooner. Honestly, my boy really takes after me. Should I be proud?!\n\n\u0026gt;NEVERTHELESS, I got the tough love treatment. My parents kicked me out. They said if I wanted to act like a man then I needed to BE a man and provide for my family. \n\nDoo better than your parents did. \nLet her move in. \nTalk to her caseworker. \nHave rules... school, work... teach your children well.",
   "created_utc": 1700886006,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanq7n5",
   "message": "He’s not a baby, he’s not a kid. He’s now a young adult, and it’s time he learns responsibility and the consequences of not having any. His life isn’t “over”. He blew it, now he has to live with his poor life choices. There are always jobs. Always. He’s not in a position to be picky. I’d say as long as he has a job, the GF can stay, but he’s got until the day the baby is ejected to find them a place. Don’t give him any slack, because that’s why he’s in the boat he’s in.",
   "created_utc": 1700887385,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kansc83",
   "message": "So what I heard is “My son is acting like a teenager and I want to give up on him. While he’s 16 years old.”\n\nDid I read that right?",
   "created_utc": 1700888537,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kansla6",
   "message": "YTA - Be the father you never had. Good luck man.",
   "created_utc": 1700888675,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kansvu9",
   "message": "I'm under the impression that you can't legally kick him out until he's 18 years old.",
   "created_utc": 1700888840,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanttia",
   "message": "Kid needs to grow the fuck up quick.",
   "created_utc": 1700889364,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanu6n3",
   "message": "Yes you are TA for kicking a 16 years old out with nothing.\n\nIf I were you, I would help with setting up his own bank account, send him to some parenting class to learn how to raise a baby and make sure that he gets a job for after school. Get their own transportation. \n\nHave them pay you rent. \n\nWithout them knowing, put the rent money, that they give you,  toward your saving account for their first apartment together. \n\nThen just surprise them with an apartment of their own with 3 months of rent that is paid in advance.",
   "created_utc": 1700889571,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanu9o4",
   "message": "God I genuinely hope this is ragebait or fake because no father can be this cruel and dense.",
   "created_utc": 1700889621,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanzjyr",
   "message": "I don’t know if you’d be an asshole exactly. You’re drowning in your own history here and wrestling with your own demons. My advice would be to try to be objective. The kid that’s coming, is family. What’s the best course of action you can take to improve your son’s chances of success and the health of your grandchild? Maybe it’s harder, maybe it costs you something in pride, but will any of that matter in 20 years? You’re a father yourself, you have some sense of how long life is and how struggles that seem intolerable at the time, bear fruit. \n\nYou can’t choose much for your son but you can choose what you do. Not based on your history but your rational mind. \n\nI think your best chance of success is to suffer an unfair load as grandpa slash father consultant. It’s going to be hard, but there will be some joy in it. It’s not ideal, it’s not what you wanted, but it’s what you got. Channel some of that nervous energy and outrage into forward motion and make the best of a bad situation again. For family, again.\n\nGood luck.",
   "created_utc": 1700892775,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanzwct",
   "message": "I’m sorry to hear your predicament. When I was in your shoes, I found an expert counseller who dealt with the teenage brain and how to live/deal with it. It helped to turn things around for me and I was able to cope with all the crap thrown at me. \n\nYou are still very much the father of a dependent child. Please try to find some literature or advice along the lines of how to cope. It’s too complex for me to break down in this format of Reddit",
   "created_utc": 1700892994,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao41ga",
   "message": "You fucked this kid up. You are the one who needs to grow up and start parenting. Get yourself a therapist and learn how to be a decent human being.",
   "created_utc": 1700895803,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9osz",
   "message": "YTA. From your vomit of text is safe to assume that you're as dead beat as they go if your son ended up the way he is. \n\nAnd instead of teaching him stuff about life, you'd rather kick him out? \n\nIf anyone needs to man up here, its you. Again, YTA",
   "created_utc": 1700899888,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9q5l",
   "message": "He is 16, and he's the way he is because of how he was parented. Yes, YTA if you kick him out. He NEEDS your support, and he's not obligated to be how you want him to be.\n\nAlso, sorry to be so harsh, but you're a terrible father for even considering that.",
   "created_utc": 1700899916,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan2azh",
   "message": "I would see about letting the girlfriend move in. Focus on the future.",
   "created_utc": 1700875670,
   "score": 8,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan609a",
   "message": "Is it legal for you to even do so in your jurisdiction?",
   "created_utc": 1700877363,
   "score": 7,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kancw3x",
   "message": "a grandpa at 34 is crazyyyy. hope you find the right answers for these problems! good luck.",
   "created_utc": 1700880651,
   "score": 4,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan7v5a",
   "message": "NAH don’t kick him out, he’s your responsibility til he’s 18, but she’s not. You shouldn’t be responsible for her anyways. If you let her move in, you’ll be responsible for her. You don’t know anything about her. He should get paternity test, etc. \n\n\nBut don’t enable him. He wants to have a kid then he needs to grow up and be responsible.\n\nKinda sus she gets pregnant right before she ages out. What if she saw your son as an easy way out? I can’t imagine what her life has been like but these comments expecting you to drop everything to support her when you don’t even know her are insane.",
   "created_utc": 1700878245,
   "score": 6,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanga0r",
   "message": "YTA now if you make clear he’s out at 18 and help him plan a bit it would be better.",
   "created_utc": 1700882286,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kangpx8",
   "message": "EDIT: Looking at the replies, it seems like a snotty teenager wrote this as rage bait.\n\nIs it even legal to kick out a minor? Just because your dad made *you* homeless and abandoned doesn’t mean you need to pass down the misery.\n\nYTA. Get family therapy.\n\nFigure out what a good parent would do to support his growing family, then go do that. Why the hell would you want to take away your son’s support when he needs it most? Making your minor child (and potentially his also-minor girlfriend and your grandchild) homeless. Don’t throw away your kid because of an accidental pregnancy... like the one you experienced yourself.",
   "created_utc": 1700882496,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanh864",
   "message": "My daughter moved home, pregnant at 23. With a college degree. She is still here with our grandson 4 years later. The world is a different place. It's your decision but honestly where has your parenting gotten you this far?? It might be time to change your parenting. You all three need family counseling. IMHO, you will love this child. You just will. If it were me I would take them all in. With reasonable rules that the counselor helps you come up with. They are too young to know how dumb this is. You can love them through it and help. Or you can tough love it. But that will get you nowhere but old bitter and out of your grandchild's life.",
   "created_utc": 1700882742,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanhnqc",
   "message": "YTAH - You, you, you. It's all about you. You don't want him to make your mistakes and yet you're going to set him on your own failed path. So what? He can learn to fail just like you? How about you try to do things differently than the way you were forced to? IF you are able to change and do that, then help the kid. If you're not able to change, then maybe he shouldn't be around you in the first place. You don't seem like a great role model and I wouldn't want my kid growing up around a grandparent like you. Man up and grow tf up! Every generation has had a tough time in one way or another and have overcome it to raise families. Cost of living is just the problem of the moment, but there are millions of people overcoming it. You're just making excuses to suit your needs. Just love your kid and his gf and help them to raise your grandkids. All over the world people live in multi-generational households because it works. Try something different than doing the same thing that messed you up. It'll take work and a change of your attitude and self-centeredness, but you seem tough enough and a big enough man to see that change is needed. Your story and ideas are so out to left field I question if it's just made up.",
   "created_utc": 1700882956,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanhp8k",
   "message": "He's a lil shit but he's your lil shit. Kicking him out now only hurts all 4 of y'all. Im not saying take full care of him but he needs support more now than ever. I wouldn't kick my kid out. Might kick ass but not kick em out.",
   "created_utc": 1700882978,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanllav",
   "message": "It appears to me, that you are seeking validation to kick out your son and wash the matter off to your hands. \n\nYou are saying he should take responsibility for his to-be new family, while you are washing your hands off yours. \n\nHe is your 16 years old son! And he needs your help now more than ever. Do what you would like with this information.",
   "created_utc": 1700884961,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanp07n",
   "message": "Get him into a trade or trucking school or something.  ASAP.  If you kick him out, he will never forget it.  And your relationship won't ever recover fully.",
   "created_utc": 1700886740,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanp9kp",
   "message": "Let them stay. Charge them rent. Save the rent for them for some years, and watch the housing market. When the prices and rates finally drop, help him buy a home. You are not wrong. Shit is TOTALLY different now and he will not make it.",
   "created_utc": 1700886878,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanpkuh",
   "message": "You're NTA, yet. \n\nYou weren't a man at 18 either, just like your kid, you thought you were way more grown than you were. \n\nYour parents were bad parents for kicking you out. Tough love is for when your kid needs rehab and they don't want to go, not when they need your physical support. \n\nOf course they're excited, your kid needs therapy, and so does his GF. I went to school with a lot of kids who got pregnant and were excited about it because they have abandonment issues, and they see a child as their ticket to never being alone. I'd guess that he and his GF trauma bonded, because you don't know what romantic love is at 12.",
   "created_utc": 1700887045,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanqicn",
   "message": "You are proof that when you plant carrots you get carrots…if you want to blame someone for his irresponsible behavior, look in a fucking mirror. YTA",
   "created_utc": 1700887545,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kans69e",
   "message": "He’s a minor you are responsible for!  You don’t get to kick him out\n\nIf you can’t care for him you can look i to boarding school or something but you do not get to kick him out.\n\nYou should be put in jail if you try",
   "created_utc": 1700888445,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanseau",
   "message": "It's not logic telling you to kick him out. It's cowardice. Facing a problem and seeing it through to its solution is difficult. Sending it away is easy. YTA if you wuss out and take the easy way out.",
   "created_utc": 1700888567,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kant3zf",
   "message": "YTA. However much of a fuckup he is, you have legal obligation to clothe, house, and feed him until he is a legal adult.",
   "created_utc": 1700888968,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kant632",
   "message": "Your child is still legally a child. You’d pay child support for him if you didn’t have custody. Because you are legally required to financially care for your children until they reach adulthood. \n\nYou were 18 when you got kicked out. Your child isn’t. Piece of advice… don’t do this.",
   "created_utc": 1700889000,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanu2uj",
   "message": "I think you know YTA if you kick him out. Try to move beyond your own trauma and be better than those who raised you. There’s post here about a kid in your son and his gf’s situation. The dad took them in and just did the best job EVER. He really set his family up for success. You should really look it up and take him as an example.\n\nDo you want a close, loving, successful family that you support unconditionally or do you want to teach your kid he’s alone?",
   "created_utc": 1700889514,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanxg65",
   "message": "You’re absolutely an asshole and sound pretty shitty.",
   "created_utc": 1700891475,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanxhn1",
   "message": "So what you're saying, is that you're going to be a grandfather, and you think the best thing you can do, for everyone, is to make sure your grandchild is homeless?\n\nDude. You need to grow the fuck up yourself. It sounds like being kicked out robbed you of that, and now you're just perpetuating those failings, instead of trying to be better than them.",
   "created_utc": 1700891499,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanzmh3",
   "message": "Uh, have you met teenage boys?? Because this sounds pretty average for one. They’re kind of buttheads sometimes. (Teenage girls too.) You’d absolutely be TA if you kicked him out.",
   "created_utc": 1700892817,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanzsvj",
   "message": "YTA. First of all, you’re legally obligated to provide him shelter until he’s 18 and second, you can’t blame everything the kid is doing on the kid. \nIf you don’t want to let the gf move in, then don’t let her move in. But if she becomes homeless then you’ve punished an innocent baby due to your own messed up upbringing. Place hard boundaries and let them know you won’t pay for anything more than what is required to raise your son but don’t kick him to the curb and expect it will make him a good parent to an infant when he’s clearly an immature child himself.",
   "created_utc": 1700892935,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanzz0n",
   "message": "ESH. you dont have to take care of his new family but he's too young to be kicked out.",
   "created_utc": 1700893042,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao0b9g",
   "message": "The answer is staring you in the face, how is your relationship with your dad?",
   "created_utc": 1700893259,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao2zg0",
   "message": "Legally and morally, you shouldn't kick him out before age 18.\n\nHowever, you can set down some strict rules.  Kid has to get an after school job and bring in some cash to support that baby (since they're so hell bound to keep it).  And he has to at least get his high school completed.  And push him to go for some sort of trade or training program after high school.\n\nAnd, you're not an asshole.  You're just a typical frustrated parent of a teenager.",
   "created_utc": 1700895055,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao32lv",
   "message": "I don't think asshole is adequate to describe what you are.",
   "created_utc": 1700895115,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao34aa",
   "message": "What you have to do is be stricter with him in order to make him mature and face his new reality \n\nKicking him out is ruining his life",
   "created_utc": 1700895144,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao35v5",
   "message": "Well, clearly your approach isn't working so why not have your son see a professional? Just my 2 cents.",
   "created_utc": 1700895174,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao3iv4",
   "message": "It's hell out there right now. Your gut is right. You can't do what your parents did. They will definitely be homeless with a new born baby. Help them until this shitty ass economy gets better and it won't be better for a while.",
   "created_utc": 1700895437,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao3j4b",
   "message": "Please don’t kick him out. Allow the girlfriend to move in and be there to help and guide them. Lay the ground rules, finish school, support and take care of your child, get an education. Respect the house and you. Parenting is the hardest job there is, don’t throw him out and make your grandchild suffer because two teenagers made a mistake.",
   "created_utc": 1700895442,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao3n50",
   "message": "He needs therapy, possibly medication.  Tough love, but not kicking him out of the house.  He's still a child.  It may help if you did family therapy.  The male brain is not fully developed until around age 25.  He needs help.  Obviously, the worst his behavior is, the more help he needs.  I don't see how kicking him out helps.",
   "created_utc": 1700895525,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao3nmx",
   "message": "WYTA\nYou want to aet kids up to have a better life than you did. Dont kick him out but make him get the job and set him up to be a good father. He needs to grow up more quickly now but thats his own fault",
   "created_utc": 1700895535,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao3pdr",
   "message": "Not many 16 year olds can support themselves and even fewer can support a family.  Tough love can fix you but it can also kill you.  My cousin got tough love and he was dead within a year.\n\nYou can teach him and help both of them.  Don’t be the asshole.",
   "created_utc": 1700895570,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao3pod",
   "message": "Yes, YWBTA.\n\nHe's still a minor FFS.",
   "created_utc": 1700895575,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao515l",
   "message": "Title only: what country u in? In the US thats illegal. \n\n\u0026gt; a limited knowledge of her own body.\n\nUr son know about condoms? \n\n\u0026gt;My parents kicked me out. They said if I wanted to act like a man then I needed to BE a man and provide for my family. \n\nDoesnt each generation try to be better than their rents?\n\n\u0026gt;my heart and gut tells me my baby isn't quite there yet.\n\nGut is never wrong. He cant even legally rent in US. Not many jobs hire minors. Pretty likely he'd drop out of school. \n\n\u0026gt;Would I be an asshole if I kicked him out? \n\nYa\n\n\u0026gt;Yet, he needs to fix his own problems, right?\n\nHow? Sellin drugs? \n\n\u0026gt;He needs to learn and he can't learn if I do everything for him. \n\nOr u could put down ground rules for both of them. Give them responsibilities that they must do so they can stay there. They still learn that way. Ever heard the phrase, \"it takes a village to raise a kid\" before?",
   "created_utc": 1700896491,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao5y8g",
   "message": "My 2 cents, you wbta to kick him out at 16...\n\nYou want him to be an adult but seem to be treating him like a child... you have time left to parent him, to teach him, and to help him grow into a successful adult.\n\nHe needs to finish school... help him. Show him how to be better. Let him rent there, sit both of them down, and have a real discussion about the future, the babies future, and your expectations. Help them come up with a plan.\n\nBuild a 2 year plan, help them plan for child care, and learn how to do all the things you maybe had to learn on your own.\n\nYou can send him down a dark path now, or you can help him towards a better future. Hopefully, he will want to work towards this goal.... he has a lot of work ahead.",
   "created_utc": 1700897138,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao6n2j",
   "message": "If you kick out a 16 year old you may go to jail. If he is beyond your control there are things you can do to protect him and yourself . Call cps, if needed there may be something the courts can do (I know here you can file beyond parental control petitions for help, if needed they can even put him in a facility or group home ). It’s okay that he is beyond your control and you can’t help like you need to,  it is not okay to cut him loose but leave him to his own devices is not . I had a long term foster kid that sadly became more than I could handle and it was a hard thing to do but I had to have him removed . I still talk to him and if he makes more progress I’ll be allowed to visit him .",
   "created_utc": 1700897631,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao798m",
   "message": "16 is still a minor, and unless you live in a state where 16 or 17 is the age of consent, you are legally responsible for your son.  If you really don't want him at your house, surrender him to Social Services.  I had to do that with my daughter when she was 15.",
   "created_utc": 1700898081,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7cjs",
   "message": "\u0026gt;I got the tough love treatment. My parents kicked me out.\n\nAnd look how that turned out for you asshole.",
   "created_utc": 1700898150,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7cmn",
   "message": "You support your kid. Does kicking him out support him? No. ESH.",
   "created_utc": 1700898151,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7dzw",
   "message": "YTA. Legally you can't just stop providing for your minor child. Even if he, himself, becomes a parent. Until he's an adult, in the eyes of the law, you are legally required to provide for him.\n\nNow, isn't back when you were his age. I'm older than you and remember well what it used to cost to live back then vs now. It would be inhumane to kick out a child you have, by your own admission, you've ill equipped to deal with the world. \n\nYou say you want him to learn. Did you miss the memo that it's your job, as his father, to teach him? Kids learn by example. Set better ones.",
   "created_utc": 1700898180,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7jih",
   "message": "Yes, you would be the AH.  \nWhat your parents did to you? They are also AH's.  \nBut in your case specifically. He's 16. You kicking him out is literally a crime.   \nYou don't have to have the gf live with you. She is not your responsibility.   \nSupporting your son is your responsibility, and is also your legal obligation until he is 18.   \nHe is literally taking after you. He is going that route because of what your parents did to you.  \nDo better.  \nUntil he starts committing crimes against you (theft, violence etc) or is otherwise abusive, negligent etc... support your son.",
   "created_utc": 1700898291,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7mlh",
   "message": "come on. YTA. why is your reaction to kick him out exactly when he needs help and guidance the most? sit down with the couple. talk to two adults, tell them you expect them to be adults, make plans, organize with them. be strict but loving. kick them out if they absolutely mess up. don‘t do it now when your son is ready to help and excited to be a dad.",
   "created_utc": 1700898355,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7o7i",
   "message": "OP stop and think for a second. Did your parents abandoning you at 18 help or harm you? Do you want to continue the cycle of bad parenting with your child? Do you really believe that kicking him out will somehow lead to improving the lives of your son and grandchild. It fucking won’t. Your son is a reflection of your parenting, good and bad. Being a good father does not require a complex strategy. Love and support, admit your shortcomings, make them right and demonstrate to your child how to be the man you want him to be. You already are but you probably aren’t as conscious as you need to be.",
   "created_utc": 1700898390,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7pfm",
   "message": "So let's see where your parents kicking you out got you. 16 years on you are in the same position with your own son. So it doesn't really sound like kicking you out to stand on your own two feet was the right decision, does it? Letting you stay, letting you benefit from the parenting experience of your parents (not that, frankly, they sound that great since they did in fact just wash their hands of your teenage mistake) and helping you get a better education may have actually done you and your son more of a service. \n\nPersonally, I think YWBTA if you kick him out. And his girlfriend clearly hasn't had a functional family. Do what is right by your grandchild, and don't leave him or her to be raised by just two children, one of whom doesn't even know what a decent family looks like.\n\nHave rules, make sure they are the ones doing most of the work, make sure they are working to improve themselves, better their education and be able to provide a better future for their child. Don't let them wriggle out of their responsibilities. But please support them. Help them break their cycles.",
   "created_utc": 1700898413,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao7pn6",
   "message": "He's still a minor. Both legally and morally, YWBTA.",
   "created_utc": 1700898417,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao862a",
   "message": "Yikes. Just yikes.\n\nDo you even *like* your son? You keep saying you do or that you care for him and his future but all the other stuff you've said *heavily* convinces me that you hate and resent the living fuck out of your child.\n\nOh, and also, you legally cannot kick out and leave a minor homeless. \n\nBut even if you could, he has no job opportunities, no education, no way to afford a child, his girlfriend is in foster care and foster care is complete *hell* in many ways, among other things, she's 20 weeks along so not only is she technically past the time limit to get an abortion in most states after roe v wade was killed, she's probably already grown attached to the child. Plus, she knows that giving the kid up for adoption will very likely throw that kid into the same position she was in.\n\nSo, basically, you say you love your son but you're totes okay with letting him, his girlfriend, and an innocent child die homeless in the winter without food, shelter, clean water, adequate medical care, and fall into a hole so deep they might never climb out of.\n\nBut you love your son? Yeah right. Please. \n\nYTA. The biggest, most swollen, hemorriod asshole I've ever had the unfortunatecy of laying my goddamn selkie eyes on.",
   "created_utc": 1700898756,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao8ewh",
   "message": "\u0026gt;Wanna know the kicker? He's excited. They're excited! And I am very VERY angry.\n\nHe sounds like he'll be a better parent than you tbh.\n\nSupport him or eff off out of his life.",
   "created_utc": 1700898935,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao8t64",
   "message": "you were kicked out and failed as a father, maybe don't kick him out so he doesn't fail as a father, and you can redeem yourself.",
   "created_utc": 1700899232,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9k39",
   "message": "YTA but it's okay.\n\nThis sounds like typical child stuff as far as the attitude. \n\nI get not wanting to be excited for a baby but you had him at 18...2 years difference.\n\nYou could kick him out but you'd regret it. \n\nBest to just deal with this.",
   "created_utc": 1700899791,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9kgq",
   "message": "YTA\n\nHe's a minor. He doesn't magically become an adult because he dropped seed. Crap situation? Yup. But you sure AF can't judge him if your first thought is to dump him. You made him. And now you have a chance to do better than what was done for you.\n\n\nYour choice.",
   "created_utc": 1700899799,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9mez",
   "message": "YWBTA\n\nJust when your kid will need you the most, you think kicking him out will help him grow up.\n\nFather of the year, folks.",
   "created_utc": 1700899839,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9w6m",
   "message": "Obvs YTA.\n\nI was having a conversation with my wife the other day in the ways in which parenting has changed in a generation. With out parents the bar was the kids are \"fed and clothed\", doing a good job. Go back a couple of generations and simply keeping the children alive past infancy was the benchmark.\n\nNowadays we do a better job because we can objectively analyse our parenting (and not take offence when we fall short) then make adjustments.\n\nDo do what your parents did, do better.",
   "created_utc": 1700900040,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao9zzm",
   "message": "YTA. Honestly you sound very arrogant and selfish.",
   "created_utc": 1700900121,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaodk0c",
   "message": "Are you asking AITA, or are you seeking validation/permission? \n\nBecause you would be 10000% the asshole if you kicked your son out. It can fuck up their lives forever. Some do not survive. Some never contact their family again. \n\nOr.. you can help them now and have a beautiful family with a bright future without forcing them to struggle \"like you did\". \n\nI mean, if you broke your leg as a teen, should you break your son's leg now to show him how much it hurt?",
   "created_utc": 1700902816,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaodk9v",
   "message": " YTA. First off, this is poorly written fiction. \n\nIf it was true, you’d be an even bigger AH for being mad at a 16y/o - you created \u0026amp; raised him. How he’s acting at 16 is a reflection of that.",
   "created_utc": 1700902821,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaodmiy",
   "message": "It is not logical to make him stand on his two feet. If you really want to look at it logically, let's break it down.\n\n1) If he does something illegal, the police will be contacting you.\n\n2) If he does cause some kind of civil damage, you will be on the hook for it. \n\n3) Labor laws are very restrictive for 16 year olds. It will be difficult for him to provide rent, food and essentials. Much less insurance and pay for the birth. \n\n4) Honestly, he is not mature enough to do what you want him to do on his own.\n\nI grew up in a house like this. I was out of the house at 18. I was not ready for it, I rented rooms, with friends and eventually strangers. And at one point I was homeless for four months.\n\nI don't know your situation. If you can support these two, please do so.\n\nOf course you have to set boundaries and show him what they need to do to be a good dad. \n\nI know it is a lot to ask, and if you could, this would all have happened differently. But the situation is real now and we all have to manage and deal with what is happening now (as opposed to what we wish the situation is).\n\nAnd I am not saying any of this is your fault or that your genetics or the way you raised him has failed him. There are so many factors that can lead to this situation. And in the end, it doesn't matter. We have to deal with where we are now, right?",
   "created_utc": 1700902870,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaodo43",
   "message": "He sounds like a typical 16 yr old, apart from the getting the gf pregnant.\n\nYou know you can't kick him out, even if it was ok morally, which it's not, it's illegal, he's a minor, you could be in a lot of trouble.\n\nNows the time that you really have to step up as a dad. Parenting isn't easy, and contrary to belief, it doesn't get easier as they get older, it gets harder.\n\n\u0026amp;#x200B;\n\n\u0026gt;*my heart and gut tells me my baby isn't quite there yet. He's not ready. I don't want to see him struggle. I don't want to set him up for failure. I want him to be a kid for a little while longer. I can help, monetarily and otherwise.*\n\nAlways listen to your heart and gut over logic, it's your moral compass, and is always right.",
   "created_utc": 1700902904,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaodtnl",
   "message": "You would most definitely be the asshole.\n\nI'm sorry, but you think they're not taking parenthood seriously, so you'll... Make them end up on the street? Huh?\n\nIs this rage bait?",
   "created_utc": 1700903028,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaody1b",
   "message": "Legally you can't do that and your parents were shitty.",
   "created_utc": 1700903124,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaof8dn",
   "message": "You're either leaving him entirely or wanting to coddle him like he's five years old - do you agree with what your parents did or did they actually burn you? Because you're not looking for a middle ground, just extremes.\n\nYou'll be an asshole as much as your own parents were for basically punishing you for a lack of self guidance and a lack of guidance from them.",
   "created_utc": 1700904184,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaof9o8",
   "message": "NTA - but…\n\nBehave yourself lad. \n\nYou don’t need to repeat your parent’s mistakes. \n\nGood luck to your son and his gf, and the newborn when they greet the world. \n\nAnd to you, Grumpy Granda!",
   "created_utc": 1700904213,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kaofdst",
   "message": "You're setting your son and grandchild up for failure. You already know that he isn't mature enough to handle the world but it's getting thrown in his face rather hard. Don't kick him out but don't make it easy on him. Why would you send him out to pay for an over priced apartment when he and your grandchild can be safe with you. Offer for him to pay you some rent and save it for when he's matured enough to handle his own life. Don't babysit either.",
   "created_utc": 1700904305,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan76og",
   "message": "I mean I wiouldnt kick him out. But I also wouldn’t help provide for that baby and its mother that’s not your responsibility at all. Unfortunately no matter what you do you lose. Hopefully your son doesn’t manipulate your kindness and use you.",
   "created_utc": 1700877916,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kand4e0",
   "message": "Don't make a decision based on your emotional reaction to all this. Give yourself time to feel and then make a decision. \n\nAnd by \"make a decision\" I mean give your damn head a shake. \n\nYou've listed a whole bunch of reasons why kicking him out is the worst thing you could possibly do. \n\nFirst of all, you're legally responsible for your child. Refusing to take care of your child just because things got complicated, is you NOT being the \"man\" or good parent that your parents thought they were forcing you to be, it's quite the opposite. \n\nI'm sorry. This sounds very difficult, all your feelings are perfectly valid. But they're not an excuse for you to abandon your child, OR your grandchild. \n\nYou're allowed to do things differently than your parents did, and still be a good parent. You already know kicking him out isn't the right move.",
   "created_utc": 1700880762,
   "score": 4,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kand9b7",
   "message": "YTA if you kick him out before he turns 18. Let him know that he will have to move out when he turns 18/or graduates HS. Do not let the GF move in. They will never leave. Stay firm on that. Now your son needs to get a job to help support his new baby, or does he plan on you paying and supporting this kid.? Good luck.",
   "created_utc": 1700880828,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kang01m",
   "message": "YTA but he’d probably be much better off without you. You sound bitter and angry that your son is acting like a child… at 16. Yeah it’s pretty inconvenient that they’re pregnant, but it’s not the worst thing to happen to a kid. And it’s certainly not the first time teens have gotten pregnant. With the right support system and care, he could still have a wonderful life. \n\nHave you ever thought your son acts this was as a direct rescue of your clear resentment of him? Kids sense those kinds of things. I think you need to do some soul searching and step up as a mom. It’s a messed up situation, but don’t make it worse.\n\nYou act as if you care his life will basically end because of this child, but you’re willing to kick him out and basically condemn him to a hard life. Which tells me you don’t really care at all how his life goes. You just want it to fit your standards. But because he doesn’t, you want to throw him away.",
   "created_utc": 1700882151,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan57fu",
   "message": "NAH\nKick him out when he’s 18 😗",
   "created_utc": 1700876997,
   "score": 4,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan7jcv",
   "message": "He needs support.\n\nYou can allow him to live with you and tell him needs to step up and provide for his child and GF at the same time.  IT doesn't have to one extreme or another. Parent him, stay in his life, be a support, show him the RIGHT way to do it.",
   "created_utc": 1700878087,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanc1l9",
   "message": "YWBTA. Break the cycle. Don't do what your parents did. Show your son love and support and guidance. You have been through this so you are the PERFECT example and you should be helping him not just throwing him out.",
   "created_utc": 1700880240,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kand1y2",
   "message": "YWBTAH I am 22 my husband is 23 and we can’t even afford an apartment for our little family if my family kicked us out we would be homeless and that’s exactly what is going too happen too your son and his family if you don’t have a home they won’t let you take the baby away from the hospital even do you want your son going through that at 16",
   "created_utc": 1700880729,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kandtr1",
   "message": "Kicking him out because you were kicked out is straight-up vindictive. Repeating past traumas only keeps the cycle going. Fix it or be a great grandpa in your 50s.\n\nYou say you want to keep him close, so do it.\n\nSet some ground rules, maybe consider letting the girlfriend move in IF he gets a job and pays rent and does well in school. Light a fire under his ass without throwing him in said fire.\n\nThere are learning opportunities here if you just look for them, ways for him to learn and grow within a supported and loving environment. \n\nDon't make it easy for him, but don't make it more difficult than it needs to be.",
   "created_utc": 1700881102,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kani0sb",
   "message": "No, you would most definitely be an asshole.",
   "created_utc": 1700883139,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanpoic",
   "message": "NTA, it's called enabling him, he knows you always be there to caught when he falls. Kick him out",
   "created_utc": 1700887100,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanpul8",
   "message": "YTA\n\nYour son may be getting ready to be a father, but he’s also a minor so you kick him out, you suffer consequences. \n\nYou are one to talk. You had him at 18 so you’re no better than he. I bet no one could tell you anything when you were his age either. Kids that age do think they have it all figured out and they make all the wrong choices before they make the right ones. \n\nYou know how hard it is to be a teenage parent and so you know he’s gonna grow up real quick. His life isn’t over. It will be if you kick him out. You want them to be homeless with a baby? He will resent you for the rest of his life and you’ll most likely never see him or have a relationship with your grandchild. \n\nWhat they need now is a support system. Allow them to move in. Tell them they e both got to finish school and get jobs to support themselves. They need to apply for social services so the baby has healthcare and they get WIC and possibly food stamps and daycare vouchers (if you’re in the US). \n\nThink about where you were at 18 when he was born and try to be supportive, since they are going to have this baby. You can be supportive and be firm at the same time. Make them do the work, but be there to back them up.",
   "created_utc": 1700887191,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan6ndh",
   "message": "Just don’t expect him to care for you when old like many asshole parents do and you won’t be that big an asshole. It sounds like you know much about not having the adequate health care and limited knowledge on what being a mom takes so you know everything about being ignorant…. I’m so glad I have very supportive parents, and my heart breaks for kids like yours.",
   "created_utc": 1700877663,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kantes8",
   "message": "I can’t believe you just blamed the young woman for her pregnancy because “she’s in foster care and doesn’t know how her body works.”  Why didn’t you provide your son with condoms and a whole lot of advice? It’s not only the girl’s responsibility to avoid pregnancy.\n\nI would think you would understand this given you became a father at 18.",
   "created_utc": 1700889136,
   "score": 3,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan69ip",
   "message": "Let him go solo - that will shock him to his core and he will need to man up. Easiest way to solve this situation is to just tell him he's his own man now and that he's on his own",
   "created_utc": 1700877483,
   "score": 2,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao6ja6",
   "message": "NTA but give him a reality check - tell him you want him to prepare for being a father \u0026amp; get a job \u0026amp; move out. Take him to apartment buildings. Let him choose a NICE place and view a unit, lol, and get the info on the deposit he needs to save up to move out. Then let him see a unit that he can actually afford to pay for - ha ha! And see the actual neighborhood he can afford to live in. Set an actual date for him to move out \u0026amp; say that you are serious. Let him see that any job he gets he will be working for MONTHS or more to save up and go out on his own. He truly needs to know the cost of rent, food, utilities, etc. Tell him you are helping him to prepare now so that he can successfully move out by the date. Have him give you his paycheck and you open an account for him. (He will see very quickly how good he has it.)\n\nHe needs a serious reality check because right now he thinks you are gonna foot the bill for everything … so that he can go on being in love. \n\nGod forbid something should happen to you, he needs to prepare while you are around to answer questions and give advice.",
   "created_utc": 1700897557,
   "score": 1,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kao8tpo",
   "message": "There’s two things you need to do. Enroll him in a military style program like Youth Challenge in your state so he can get himself together and learn responsibility. This program is free and he will be living on campus out of your hair, he will learn discipline, self respect and self care. After he leaves that program, give him one of three  options. Go to a trade school like njatc, go to college or join the military…\n\nI’ve never understood parents that kick their children out of the home without seeking solutions to help their child, he is only the way he is because you allowed it. He is reflecting back what he is not getting from you. Structure. \n\nI also suggest you get into some counseling because it seems you have some anger problems that you take out on your child. It’s hard to respect an adult that doesn’t know how to handle their emotions. That’s abuse and that fucks up kids more than anything else. \n\nIt’s not too late for him. Here’s the link for the military program \n\nhttps://ngchallenge.org/find-a-program/",
   "created_utc": 1700899244,
   "score": 1,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan5hm2",
   "message": "You raised an asshole and don’t wanna deal with it. It’s your fault they’re the way they are so take of business.",
   "created_utc": 1700877127,
   "score": 1,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kancy0a",
   "message": "I don't think the AH for thinking what you are hy any stretch I'd be thinking the exact same thing. The kid needs a reality check... but sometimes that check costs lives...\n\nYou have the opportunity to give a grandchild such a loving home. In this situation your son will inevitably grow up raising his own child under your roof and come to see just how much you did and continue to do for him. \n\nGive them a chance, give love a chance man. \n\nTho I totally understand where your coming from.. just being from a family watching my cousin go through this.. end up dead, partner hookin and kid gone to God knows where.\n\nIt's worth giving live a shot. \nHomelessness ain't no joke, especially in these times.",
   "created_utc": 1700880677,
   "score": 1,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan7qlv",
   "message": "You’d be breaking the law.",
   "created_utc": 1700878185,
   "score": 1,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kan84y0",
   "message": "Yes, you would be TA.   \nHelp your kid, teach him to parent. Be a good example for him.   \nYou will likely destroy any future relationship with your son and grandchild if you kick him out and remain unsupportive and your actions will likely have rippling effects to your grandchild as well.   \nThey can parent this child if given help and the needed support.",
   "created_utc": 1700878375,
   "score": 1,
   "submission_id": "1837i54"
  },
  {
   "comment_id": "kanwt9g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1837i54"
  }
 ]
}