{
 "submission_id": "183chaz",
 "title": "AITAH for not wanting my husband in the delivery room?",
 "selftext": "I (26F) am currently expecting a baby with my husband (27M) and she is due this January. I have been forming my birth plan for a while now and it states that I don't want my husband in the delivery room, but instead my mom. My reasoning is that I know men often become traumatized from watching their wives give birth and end up losing attraction after watching the birth. It happened to my mom and my mom's mom, and I don't want to ruin mine and my husband's sex life so I felt like keeping him out of the delivery room is for the best. However, he is upset with me because he wants to be in the delivery room when our daughter is born. I've explained that it's for his benefit but he doesn't want to hear it and is now questioning our future together since I don't want to let him be part of the birth. I've offered to let him come in after to cut the umbilical cord or see the baby in the hospital's nursery but he says that \"isn't the same\". My mom agrees with me that I'm making the right choice, but most of my friends say that I'm making a mountain out of a mole hill and that my husband isn't the type to do that. I just want to keep my husband. AITAH?",
 "created_utc": 1700890006,
 "permalink": "/r/AITAH/comments/183chaz/aitah_for_not_wanting_my_husband_in_the_delivery/",
 "score": 39,
 "url": "https://www.reddit.com/r/AITAH/comments/183chaz/aitah_for_not_wanting_my_husband_in_the_delivery/",
 "comments": [
  {
   "comment_id": "kao4721",
   "message": "I stayed up by my wife's head during her two births, on the other side of the sheet partition. He doesn't need to see the baby come out to be in the birthing room.",
   "created_utc": 1700895911,
   "score": 137,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao3nep",
   "message": "It’s not for his ‘benefit,’ it’s for yours. Figure out your insecurities and work forward from there. That will benefit both of you.",
   "created_utc": 1700895530,
   "score": 34,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanw6af",
   "message": "How do you feel about people doing things that you don't want them to do \"for your benefit\"?\n\nYour husband being in the delivery room might, possibly damage your sex life. Denying him the experience of being present at the birth of his baby abso-freaking-lutely will damage your sex life with him, and your relationship in general.",
   "created_utc": 1700890716,
   "score": 14,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanwx4j",
   "message": "Yta. This mentality will ruin your marriage. Just because he is in the room doesn’t mean he is staring at your vagina watching the birth. He could he holding your hand staring at your face.",
   "created_utc": 1700891157,
   "score": 106,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao9dpg",
   "message": "YTA .. Do you realize how unbelievably condescending you sound.. he doesn't know what's best for him but you do so you're taking such an important life moment that he's absolutely entitled to away from him against his wishes because you know best? \n\nThis is how deep resentment starts. It's his first child too and he will never forgive you. Even if he verbally does he will never in his heart forget that you and your mother robbed him of such a beautiful moment. \n\nMy husband was in the room with me the whole time when I was giving birth.  Held my hand. Stroked my hair. Told me I was strong. Spoke to the doctors for me. Wiped my tears. He never looked \"down there.\" Because it wasn't necessary but he was a part of every step and he'll never forget it. We bonded in such a beautiful way. The day we both became parents. Us against the world. It's one of our most fondest memories together. \n\nBtw your mother is only agreeing with you because she wants to be in the room.. some mother in law she must be to support something she knows her son in law aka the FATHER doesn't want.",
   "created_utc": 1700899663,
   "score": 31,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanvwb1",
   "message": "YTA. I have never heard of a husband becoming traumatized from watching their wife give birth, unless their wife or the baby came close to losing their life (which unfortunately does happen). You say you “know” that men “often” lose attraction after watching childbirth but frankly that is ridiculous and untrue. \n\nYour husband my not want to watch the actual event of emerging from the womb - some husbands prefer to be near their wife’s head to hold her hand and that seems like a reasonable compromise if you’re worried about him actually seeing the baby emerge. \n\nIt’s unfortunate that your parents had a bad marriage but putting that on your husband and trying to block him from being present during the birth of his child is not the way.",
   "created_utc": 1700890557,
   "score": 203,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao30v7",
   "message": "Wow.  Yta. I was expecting you to say he was cheating or just a general asshole.  But no he is trying to be loving and supportive and you want to shit on him.",
   "created_utc": 1700895084,
   "score": 44,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao5yit",
   "message": "He should question the marriage. I would because it would hurt me so damn much if I had a wife and she didn't want me to be there. As a dude, I feel bad for the guy. He enjoyed the conception (better have) so why deny him the beautiful moment of seeing the birth. Kinda feeling sad now",
   "created_utc": 1700897143,
   "score": 41,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanwi6k",
   "message": "Your mother only told you that so you would invite her and not your husband to the birth.\n\nDon't fall for her bullshit. YTA.",
   "created_utc": 1700890912,
   "score": 118,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxdlk",
   "message": "YTA, any man like that isn’t worth having. Sorry about you mom and grandmother landing dudes like that, however you can’t devalued your husband based on their “men”. This is super important to him too. Sure you can have who you want, but that’s a super messed up reason. Be prepared for how it changes your marriage if choose to do so.",
   "created_utc": 1700891434,
   "score": 49,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao2zdb",
   "message": "Your mom and your grandmother may not be telling you the truth about what was going on in their marriage. You denying him this is more in danger of causing a serious problem than the other.",
   "created_utc": 1700895053,
   "score": 11,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao0qkp",
   "message": "5 and 2 year old son but I remember when 5 year old was coming wife wanted her mom in the delivery room. Now I like her mom, never any issues and she has always been super nice but by us bringing a child into the world it becomes our immediate family. Immediate family I mean myself , wife and kids. We live in our household and the mother in law becomes extended family. She doesn’t help pay bills or provide for kids or stay up all night when they are sick to lay on my chest while I uncomfortably sit in a rocking chair unable to move so my son can rest and maybe feel a bit better. Instead of condemning him from the room , make it clear he has to stay at the head of the bed with you. YTA by taking away a magical moment that should be between you two who conceived the child, your mom had nothing to do with bringing it into the world.",
   "created_utc": 1700893531,
   "score": 23,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao9r8z",
   "message": "When a woman says she doesn't want her mother in law, or another random person in the delivery room she is told that giving birth is not a spectator sport, and that it is a medical procedure that is about her and not about the baby. Having someone in the room who is making you feel tense/upset is likely to have an adverse effect on your ability to progress in labour, so for that reason the decision should be yours and yours alone.\n\nThat said, telling your husband that his presence will stress you out, and that you will be too worried about how he will see you after seeing you doing something as undignified as childbirth is you telling your husband - I don't trust you. You may be trying to save your sexual relationship, but you are going to destroy your emotional relationship.",
   "created_utc": 1700899938,
   "score": 14,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxmr0",
   "message": "YTA solely because you want your husband to miss out on seeing his child be born, (a chance he’ll never get again) just because you are worried about him losing attraction for you. That’s selfish. And if you follow through then that will be the least of your worries since he’ll probably leave you.\n\n\nAlso, I’ve never heard of a man losing attraction for his wife after witnessing child birth. My husband watched both our daughters being born and the never happened. He wants me now as much as he did 14 years ago. Your mom is projecting her own insecurities and issues in her marriage on to you",
   "created_utc": 1700891585,
   "score": 37,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanz3x5",
   "message": "Stop lying you’re not doing this for his benefit at all . The fact that you actually have a husband that wants to be there and support you during your most difficult and stressful time and you want to deny him seeing his own child come into the world over some bullshit your mom and grandma went through ?? Bruh that’s selfish asf!!! YTA",
   "created_utc": 1700892493,
   "score": 23,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxx6s",
   "message": "YTA - technically you don't have to let anyone in that you don't want to beyond medical personel, but your reasoning for this isn't fair to your husband. He isn't a jerk, you aren't worried about him making it more difficult or stressing you out. You've made up a problem based on input from your mother (while I don't doubt it may have happened with her father and even her husband, times have changed a lot - men used to be kept out of the room a lot more than they are now, and it was viewed differently) and painting your husband with someone else's brush and not considering his feelings or what type of person he is sucks. You need to consider his feelings, this is a major life event for him as well and taking that away from him bc of a problem that someone else had with a different man isn't fair.",
   "created_utc": 1700891761,
   "score": 16,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao2t09",
   "message": "Yea YTA \nTaking away one of the biggest gifts he’ll have in life that he’ll never get back.  YTA",
   "created_utc": 1700894926,
   "score": 10,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao8bs8",
   "message": "YTA. I'm normally on the side of the person birthing in this scenario, but! You're not worried he won't be supportive, he isn't abusive etc. You don't want him there because someone else's husband reacted badly. Millions of husbands watch their wives birth and aren't traumatised because of it. It happens every single day. Don't leave him out because your know two people who are the exception.",
   "created_utc": 1700898869,
   "score": 5,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxy24",
   "message": "Can’t argue with that scientific proof. It happened to your mom and then her mom, it couldn’t not possibly be that maybe they had bad partners, or that perhaps there were other underlying issues? \n\nIs this how you base all your decisions? \n\nI won’t say it doesn’t happen, but he’s your life partner, did you have a conversation before you made this decision?",
   "created_utc": 1700891777,
   "score": 12,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanymb6",
   "message": "YTA. You are ensuring that your husband loses his attraction to you by denying him from being present for his child’s birth. He will hold this against you forever. As he should.",
   "created_utc": 1700892188,
   "score": 13,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanv3o7",
   "message": "yes, assuming he's the biological father then it's his kid just as much as it is yours",
   "created_utc": 1700890099,
   "score": 19,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoecw0",
   "message": "YTA for “deciding” he cannot be in the delivery room. You should be trying to convince him not to",
   "created_utc": 1700903460,
   "score": 4,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxb7q",
   "message": "YTA.  Just tell him to stay up by your head.",
   "created_utc": 1700891393,
   "score": 6,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanzs7h",
   "message": "YTA. Let him love you and your kid",
   "created_utc": 1700892923,
   "score": 7,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao042q",
   "message": "Yta.  He's saying he wants to be there and you're making your judgment based on other men.  Did marry your father?  No?  For that matter, is that your dad's version if events, or your mom's?  You may be throwing away an amazing bonding moment with your husband based on other relationships.\n\nMy husband was in the delivery room.  He helped hold me in position, kept talking to me and grounding me, and I felt completely safe and supported.  He saw everything and is just as attracted to me as ever (possibly more so).\n\nNow, you are not an asshole for choosing your mom - you should think carefully about who will make YOU feel safest and supported.  I hope your husband is a hot contender, but maybe he isn't, or at least not compared to your mom.  You are only an asshole because your logic supposes all men find childbirth disgusting and sells your husband's love for you short  Many men find it amazing: as an affirmation of your strength and motherhood, as a commitment to your partnership and parenthood, and seeing their child born - not just being brought in when it's all over.  \n\nJust think it over.  Maybe your mom is still the right choice, but you should apologize to your husband for assuming the worst of him.",
   "created_utc": 1700893133,
   "score": 8,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao1jd0",
   "message": "I was with my wife for both births, and all I cared about was giving her the support she needed.  I never looked past her face, and it never had any change in attraction.  He wants to be with you and your child, respect that as his partner.",
   "created_utc": 1700894059,
   "score": 3,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoc5mx",
   "message": "For me, as a father of one, the love of my life birthing human life is the sexiest thing I have ever seen. I don’t mean to say I was aroused du ring the birthing process… I mean, that connection between the three of us, those moments, her endurance and fucking willpower… and like we did it together, made it, we’re a unit during birth and then for the long years ahead, idk, please don’t take this away from him.",
   "created_utc": 1700901728,
   "score": 3,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaod3w1",
   "message": "YTA and a shitty wife. Your mom sucks too.",
   "created_utc": 1700902467,
   "score": 3,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaodei9",
   "message": "So your solution to possibly not ruining your sex life is to possibly nuke your entire fucking marriage? Wow. YTA by the way if it wasn't obvious.",
   "created_utc": 1700902695,
   "score": 3,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoeb8t",
   "message": "Yta, robbing him of a moment that he won't experience otherwise. The birth of his child.\n\n\nDickhead",
   "created_utc": 1700903421,
   "score": 3,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao3y8i",
   "message": "YTA~ don't think much of your husband do ya...... women always complain about men not being there for them and here you are pushing him out when he does....... good job 👏",
   "created_utc": 1700895741,
   "score": 5,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanx058",
   "message": "Your husband wants to be there for the birth . Why would you deny him that?He has every right. This is not just your decision. Personally I would have him there instead of mom, who can wait outside while the two of you bond with your baby.",
   "created_utc": 1700891208,
   "score": 8,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kany6lk",
   "message": "YTA\n\nHe deserves to be there for the birth of his child, but you can absolutely say a boundary that he has to hang out up by your head and can’t look at your business, while you’re doing your hard work.",
   "created_utc": 1700891921,
   "score": 5,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanyhuu",
   "message": "YTA You're risking the relationship over a maybe.",
   "created_utc": 1700892113,
   "score": 5,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao4xa6",
   "message": "You can decide that your husband should only stay close to your head and not see anything anyway.",
   "created_utc": 1700896413,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao66u3",
   "message": "My husband was in the room for both our kids births and the second was by C-section. He stayed by my head the whole time except for cord cutting and was first to hold both our kids!\nHe is as attracted to me as before if not more.\nHe wants to be there to be with you, support you and see your child at the same time you do for that shared experience.\nIt might even make you closer!!\n\nAnd honestly, getting to squeeze his hand super, bone shatteringly tight while pushing really does help with the birth and in giving him a bit of an idea just how hard it is (even if you're lucky to birth quickly and easily)\n\nMy brother was also in the room for both his kids births and he was also as in love and attracted to his wife as before, if not more!\nActually, he was the one who convinced my hubby that cutting the cord was something he should do 🤣",
   "created_utc": 1700897309,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao6uh3",
   "message": "You’re more than an AH but I’ll be polite and just go with that!!!!",
   "created_utc": 1700897780,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao7iyx",
   "message": "Just keep him up the head end 🤷‍♀️",
   "created_utc": 1700898281,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao9a5g",
   "message": "To be honest it's significantly more likely that you don't feel like having sex for some time not the other way around. At least that's what happens to a lot of new moms I know for some time. Me as well. I can just say from my experience that my husband was not traumatized and he is pretty sensitive. The real trauma is normally when sthg goes really wrong. And u can't keep that from him either way.",
   "created_utc": 1700899588,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoados",
   "message": "Ultimately your body, your choice, but I sincerely hope you won't punish your husband because other women in your family got married to pathetic assholes.",
   "created_utc": 1700900401,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaocjzi",
   "message": "YTA. You are married to a man who wants to be there every step of the way for you, but you want to deprive him of being there for the birth of your child because you are worried about your sex life. You know, he doesn't have to be on the receiving end, you can compromise and ask him to to stay at your head. If you keep him out of the delivery room, then you might as well go ahead and kiss your relationship goodbye, because you'll have more to worry about than your sex life, because you will lose his trust.",
   "created_utc": 1700902044,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaodfny",
   "message": "Your poor husband. YTA",
   "created_utc": 1700902720,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaodms6",
   "message": "This reads as you telling your husband (from his perspective likely based on his answers to you) \"I know what's best for you because of my parents ' trauma. You don't know what you're talking about so I'll make my decision for you\"\n\nThat's a terrible thing to do to your spouse\n\nYTA",
   "created_utc": 1700902875,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoe4dz",
   "message": "So you're going to \"punish\" your husband because of what some other women's husbands did? That's messed up. He has a right to be upset with you. If HE had shown he was sensitive about things, unreliable, etc. then you cold hold him to that, but it is 100% unfair to hold him to someone else's behavior issues. It is not \"for his benefit\" at all. YTA for sure.",
   "created_utc": 1700903264,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoecoq",
   "message": "YTA. Your husband wants to be in the delivery room for the birth of his child and you are taking that away from him cuz you think he won’t be attracted to you. \nI had five children, last one an emergency C-section which they put me asleep for. \nHubby was there for everyone. This is a time for you and hubby.",
   "created_utc": 1700903455,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoefns",
   "message": "YTA\n\nIt's his baby too, and that matters more your sex life. And there is nothing to say that your sex life will be ruined by him being there. \n\nI couldn't imagine giving birth without my bf present, he is my partner and the father, of course he should be there. Do I want him staring in between my legs? No, because I need his support, so he should be my head. \n\nIntimacy does not stop at sex, and if you can't trust in the love you have with your husband, then why are you having a baby with him?",
   "created_utc": 1700903526,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoipdb",
   "message": "So, not the same thing, but my dad was in the delivery room with me and my mom when my daughter was born. He stayed by my head but he saw everything. \n\nHe was not traumatized by the birth. He saw my vagina and my asshole. The last time he saw either of those was probably 1997 before I finished toilet training.\n\nI gave birth 4.5 months ago. He doesn't mention of dwell on what he saw in the delivery room, which was far more than he saw in 1992 and 1995 when his first two kids were born and more than he saw in 2005 when his last child was born.\n\nHe does remark all the time that his granddaughter was the first baby whose umbilical cord he got to cut. They didn't let him with his two '90s babies and the '05 was an emergency c-section so he'd never done it before.\n\nIf your husband loves you then seeing your child born won't affect your sex life. Labor is a bitch and delivery is quite gross but it's also kind of beautiful. \n\nAs for me, I insisted through the pregnancy I didn't want to hold the baby until she was cleaned off. That went out the window the second I heard that first cry and my primal instincts took over. I was told I could do skin-to-skin as long as I wanted before they took her to do initial intake on her. They took her after 2 minutes. She was perfectly healthy, 9 APGAR, they just wanted to get their stuff over with. And I have had such regret every day since her birth that I didn't get that Golden Hour. I consented because they told me it would be 7 minutes, it was almost 20 when I got her back.\n\nYour husband will experience a similar primal instinct taking over. It will be an instinct to take care of both you and the child. If you deny him that he will never have it. And you will want him there. After my daughter was born I desperately needed a hug but my mom and dad were at the warming tray photographing the baby. My nurse hugged me but I wanted to be held by the people with whom I had a connection. Add to that, you and your husband will most likely find yourselves developing a new kind of love for each other that comes from sharing the moment of your child's birth.\n\nYour wants and needs matter but so do his.\n\nHe was there when this child was created, let him be there as it enters to world. It's a memory you can't get back.",
   "created_utc": 1700906895,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoixod",
   "message": "How sex do you think you are going to have when the resentment kicks in? When he can't look at you without seeing the fact him missed his daughter's first breath because your dad and grandfather were AHs? I'm guessing not a lot. \n\nSee a therapist before you push this backward 1950's ideology onto your poor innocent daughter. Just because you mom and grandmother chose shitty partners doesn't mean you did but I'm starting to wonder if he did. \n\nYTA.",
   "created_utc": 1700907076,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoiz6i",
   "message": "Do not deny a man the opportunity to see his child enter this world. There is more chance he will resent you than loose attraction to you.",
   "created_utc": 1700907110,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao2khc",
   "message": "YTA - you’re an idiot. What a stupid reason and it doesn’t happen. He literally wants to be there - so let him or else you’ll lose your whole relationship.",
   "created_utc": 1700894754,
   "score": 4,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanzx85",
   "message": "That's a very unusual idea your family has.  If you're that concerned about it, have him watch a video.  Watch it with him.  He'll probably be perfectly fine, but you can watch for his reaction.  \n\nI can see men losing attraction due to changed circumstances, stress, finances, being up all night for months, or physical changes that can happen as a result of the pregnancy.  Right or wrong, that's all stuff that happens.  I've never heard of what you're talking about, though.",
   "created_utc": 1700893011,
   "score": 3,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao32jj",
   "message": "YTA. You worrying about his feelings is not a valid reason. I’m sorry, I know you think it is, but it’s not.\n\nYou’re making one of the biggest lifetime decisions for your husband as though he is a child and can’t figure out who he is. I’m hoping you married a better man than your mother or your grandmother. If watching their own child be born was that traumatizing for them, they weren’t ready to be parents.\n\nYou need to take your freaking mother out of the equation, because this is not anything you should even be discussing with her. Your husband’s participation in your child’s birth is between you and him. I think I see where your problem lies.\n\nYou are making a generalization about childbirth and about men in general. And I am a woman I am old enough to be your mom, and I am ashamed that she did not tell you that this was a decision you and your husband need to make together. it sounds like you were a little bit too enmeshed with mommy..\n\nMy ex, and I weathered a stillborn child when I was six months pregnant and then three live births. Yes, we we eventually split, but it wasn’t because of our sex life. And it didn’t happen for another 10 years after our kids were born.\n\nDo you really have so little faith in your husband knowing who he is? Do you really have so little faith in your husband that you think he is really this shallow? \n\nThis sounds like a  _YOU_ issue that you were trying to make his issue. And that is not OK. And that is not fair. And he is absolutely correct. This is a hugely significant event to him as well. And again, you’re not trying to keep him out because you don’t think he can handle it. You are actually trying to keep him out because you don’t trust him. That is the heart of the matter.",
   "created_utc": 1700895114,
   "score": 4,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanyrz9",
   "message": "Oh you a momma girl  cause your momma said it’s ok . You realise you invited her into your marriage and probably  permanently damaged it.\n\nThat child your carrying is as much his as yours  \n\nYTA",
   "created_utc": 1700892287,
   "score": 5,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao4vub",
   "message": "I don't think that's a decision you should make for him based on your fears. I don't blame him for questioning your marriage if you won't allow him to be there. It not like he's horrible or useless. YTA",
   "created_utc": 1700896384,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao80oe",
   "message": "YTA \n\nThe OTHER HALF of that child is being banned from seeing your vagina???\n\nWhat the hell!\n\nHe is literally half of that child and your husband. He should be there.",
   "created_utc": 1700898641,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao8ags",
   "message": "YTA this kid is just as much your husband’s as it is yours. \n\nUnless there are extenuating circumstances like you’re divorced or there are domestic violence/ fears of being unsafe with the babies father then he should be there. Especially if it’s something he really wants.\n\nMy husband stayed by my head when both our kids were born. I had a sheet over my legs (my choice) and it was a very special time for both me and him. You are robbing him of this special time. Get some couples counselling pre-birth and work through your issues rather than punishing him this way.",
   "created_utc": 1700898845,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao9ktd",
   "message": "YTA. He's the father, right? Let him be there for this.",
   "created_utc": 1700899807,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoapwr",
   "message": "So you're already cutting off access to his child at your whim... he needs to divorce you and try to get full custody. \nYou've no business being a mother or wife.",
   "created_utc": 1700900648,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaob5zk",
   "message": "Yta.....because of your reason. It's your right to have who you want in the room with you, but telling your husband he can't be in there because you think he's some weak child that can't handle being in the room when his child is born is just wrong. Yeah, a FEW men that were probably shitty husbands to start with may have been so grossed out they didn't want to havw sex with there wives anymore, or if something traumatic happened it could maybe affect it. But most men handle it just fine. It's really not as often as you're thinking. If you take this away from your husband he's going to resent you and that will REALLY damage your relationship.",
   "created_utc": 1700900984,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaobixt",
   "message": "YTA and have been brain fucked by your stupid family.",
   "created_utc": 1700901249,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoec4a",
   "message": "I was in the delivery room. It was tough seeing everything and yes there was a short phase I lost some attraction to my wife but I wouldn’t have traded being their for my sons birth. My wife’s mom “forced” her way into being in the delivery room and had initially want me out. I’m still bitter to my MIL about that. The attraction comes back. I would never had gotten that first second/moment with my son again. \n\nOther than for your support, let him be there for his child. Forcing him out makes YTA. Yes it’s your choice but hear him out. Otherwise later there’ll be something he’ll force without hearing you out.",
   "created_utc": 1700903443,
   "score": 2,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxy2a",
   "message": "Is it possible to compromise?  Your mom can be there as well as your husband.  Hubby can stay up by your head so he doesn't see anything traumatic.",
   "created_utc": 1700891777,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao0ad9",
   "message": "YTA. You are letting your mother get in your head and that is a huge mistake. You are depriving your husband of being there when his daughter is born because of something that might happen. If you don’t allow him in the delivery room then your marriage will be over. My husband being there when our children were born strengthened our marriage and the sleep deprivation and exhaustion that goes with newborns affected intimacy but seeing the births did not. I think you’re being foolish.",
   "created_utc": 1700893243,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanyyvw",
   "message": "How is it your husband's fault that your grandfather and father are shit men?\n\nDude, you have no right to exclude the father(and husband) of your child. Your excuse is sexist and gross. Why would you marry this man if you couldn't trust him in your most vulnerable moment?\n\nYTA",
   "created_utc": 1700892406,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao118o",
   "message": "My wife had c-sections with all our daughters.   When the youngest one was born, I inadvertently saw the incision and inside my wife.  It never traumatized me where I was no longer sexually attracted to her. \n\nOP YTA.  If your husband wants to be in the delivery room, then you shouldn't deny him this \"for his benefit.\"",
   "created_utc": 1700893728,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao0hlr",
   "message": "YTA.",
   "created_utc": 1700893374,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao0ypp",
   "message": "YTA, but yeah just let your moms \"reasonings\" destroy your marriage... Ive gotten divorced for less.. fuck around and find out.",
   "created_utc": 1700893681,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao4ojj",
   "message": "I can guarantee you that what you say happened to your mom’s mom and to your mom probably didn’t. Sounds to me like the husbands just needed an excuse/a reason to blame their wives for their sad sex life. I think YTA in this situation, sorry.",
   "created_utc": 1700896242,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao5t0g",
   "message": "YTA. I was right by my wife’s side during birth. I saw everything including her shitting when pushing, my daughter coming out her vagina, and the ice pack diaper she wore for a few days after. That was 6 years ago and I still think my wife is hot AF and our sex life is great. Watching the birth of my daughter is and will always be one of the best memories of my life. If that moment was taken from me I would never forgive my wife.",
   "created_utc": 1700897035,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao5zea",
   "message": "My wife death gripping my hand and screaming as she gave birth is a cherished memory that I was there with her at the worst, and would help her shoulder the pain best I could, sort of an unworded renewal in blood and pain of our wedding vows.\n\nTrust him, he deserves the chance to be on the battlefield with you.",
   "created_utc": 1700897160,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao6u49",
   "message": "YTA.\n\nMen used to wait at home for a phone call to pick up the wife and baby after it was over too. Like my Dad did. My uncle had 7 kids and never saw 1 born. \n\nYour husband WANTS to be with you and see the birth of HIS CHILD. How dare you take that away from him.",
   "created_utc": 1700897774,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao8r3x",
   "message": "Yes, YTAH\n\nYou are NOT your Mom or your Gram - your husband is not your father or your grandfather.\n\nOf course your Mom is going to agree with you because she wants to be in the delivery room, but to exclude your husband what he should rightfully be allowed - to see his child born is just mean on your part.\n\nIt is not just your baby and yes you are the one delivering baby, but for the sake of your marriage and the love of your husband  DO NOT keep him out of the delivery room\n\nYour mother's place is in the waiting room and she is the one who can see the baby after she is born -  Your husband, the FATHER of your baby is the one who should be there seeing her born\n\nyour sex life is more likely to be damaged by him not being allowed to see his child born because he is going to start wondering what else you are going to not allow him to do\n\nYour mother is interfering in your marriage and you don't even see it, she's telling you stories that have nothing to do with your marriage so she can be in the delivery room.   \n\nShe is pushing your husband away from you and if she allows you to push him away, you could very well regret that move because getting him back close to you again could be very difficult\n\nit is not unusual for both women and men to not be up to sex after a baby comes into their lives - hormones for mom are wacked out and it's been shown men's testosterone levels can drop.  Lack of sleep, lack of  hugging even can affect both men and women\n\nI've never heard of husbands not wanting to have sex due to watching their child being born, it's not the seeing child being born, it's the massive change in life after you have a baby\n\nread this   [lack of interest in sex after a baby - both women and men](https://www.webmd.com/sex-relationships/features/get-your-sex-life-back-after-baby)\n\nI think you need to kick Mom out of the delivery room and allow your husband to be there to support you through labor and delivery and see his child being born - your mother has already had a child, she's been through childbirth, she doesn't need to be there \n\nyou will be having a baby, your husband deserves to be involved in the process of his and your child coming into the world - saying he can come in the room and cut the cord or see the baby in the nursery is like slapping him in the face - a fuking major insult, yup great he was there to get you pregnant, gee thanks for that hon, but you don't get to see your baby being born -  Wrong\n\nYou need to ignore you Mom and Grams experiences and stories, they have Nothing to do with you, it is not hereditary  and even if it were, it would have nothing to do with your husband, they are not his Mom/Gram\n\nYour mom is filling you with fairy tales to her advantage to where you want her in the room and not your husband,  SHAME ON YOUR Mom for telling you that crap and on YOU for believing it and wanting to deny your husband the right to see his baby born and support your through the process.   It is not going to make him not want to have sex with you - old wives tale -\n\nIF you don't allow him to be in there with you, you are putting a huge wedge between the two of you, he deserves to see his child born\n\nso Yes YWBTAH if you don't allow him to be in the room and let you mother be there instead\n\nDo you want to risk a huge rift in your marriage because the is what you will likely be doing if you don't allow him to be there with you through labor and delivery\n\nMom needs to be in waiting room, husband needs to be with you",
   "created_utc": 1700899190,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao9ofa",
   "message": "Uhhhh. You are not your mom (or your mom's mom) and your husband is presumably not the same as the men involved with either of them. You're not saving him from his future trauma, you're acting on your **own** generational trauma.\n\nThe birth of your child is going to be one of the more important moments in your lives as a couple. So while you're technically allowed to have whoever you want in the delivery room, I don't think it's the best idea to prevent your literal husband from being able to experience it. \n\nYWBTA if you do.",
   "created_utc": 1700899880,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoa1bb",
   "message": "YTAH\n\nThe only men who get traumatized from seeing their wives give birth and lose attraction to them are men in bad relationships to begin with. You can't forbid him from being in the delivery room for his own benefit, it would be a different story if there were another reason that were important to you, but this is taking away his option of seeing his child born into this world.",
   "created_utc": 1700900151,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoax3v",
   "message": "Your baseline of evidence here is that your dad and grandpa were both shitty, immature partners. \n\nSorry that the men in your life are so pathetic. No, their reaction isn't normal. YTA",
   "created_utc": 1700900796,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaodes6",
   "message": "Yta! WHY DID YOU HAVE A BABY WITH YOUR HUSBAND? YOU SHOULD'VE HAD ONE WITH YOUR MOM. I BET HE WON'T HAVE ANOTHER ONE WITH YOU!!!",
   "created_utc": 1700902701,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoduc1",
   "message": "It's amazing to me how little modern women care about what their husband wants. ME ME ME ME ME ME ME ME. That's what you sound like.",
   "created_utc": 1700903044,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoe5w1",
   "message": "NTA. It sounds however like you need to have a serious conversation with your husband about your fears. I know that some women even pee and poop during the birth so some might feel embarrassed with their husband seeing that but if he loves you he should understand that you’re giving birth. Some men are shocked to see when the head comes out but don’t put your husband in the category with other people, he hasn’t done anything to warrant that from what you’re saying.",
   "created_utc": 1700903299,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao0qdd",
   "message": "NAH understandable that he wants to be there for the birth but at the end of the day it's your medical procedure so your decision.",
   "created_utc": 1700893527,
   "score": 252,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao19i7",
   "message": "I don’t want my husband to be there for the birth of his baby but I damn well expect him to be a father. You are one of the worst assholes I’ve seen on here.",
   "created_utc": 1700893879,
   "score": 255,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao297q",
   "message": "NTA. This is not a show and it's not about him, it's about you and the baby. If you feel distressed and anxious during the process, both you and the baby might suffer, the father's job is to make things easier for you, not to throw childish tantrums. A man leaving his wife because she does not want to bleed, fart, piss and shit herself in front of him is not a man worth having children with.",
   "created_utc": 1700894536,
   "score": 255,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao24im",
   "message": "YTA. Why can’t you just let him stand by your head? Why does he need to miss the birth of his child due to your insecurities? This is ridiculous. If you keep him from the birth of the baby then I hope he divorces you. If he was abusive then sure you have every right to keep him out but for fuck sake this is a dad who wants to be there and the only issue is YOUR insecurity.",
   "created_utc": 1700894446,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao32qw",
   "message": "YTA. You are punishing your husband for the sins of other men who have no connection to your husband except through you. How would you like it if your husband said all if his ex’s cheated so you will too?",
   "created_utc": 1700895117,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoam4a",
   "message": "Thank you for being so thoughtful. I didn’t want to be in the delivery room but my wife insisted. I still won’t perform orally years after that horror show.",
   "created_utc": 1700900569,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaobiax",
   "message": "nta.  it's your body the baby is coming out of.  you don't have to let anyone watch that you don't want to watch.",
   "created_utc": 1700901236,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaodr0l",
   "message": "NTA. The birth is 100% about you and your needs. You decide whose there with you and who isn’t. \n\nYou also have to face the consequence of your decision. It’s completely within your rights to deny your husband in that room, but you have to accept the consequence that he may not forgive you. \n\nI’ve heard similar stories of men “losing attraction” to their wives after birth. I’ve also heard men who say they’re mora attracted to their wives after birth. It just depends on who your husband is and how much you trust him.",
   "created_utc": 1700902968,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoef80",
   "message": "NAH You're about to go through a traumatic painful experience one that actually could be risking your life as well I don't want to freak you out but you should know that if you're pregnant.\n\nHe wants to be there and that's understandable.\n\nHave the two of you sat down and watched a video together of someone giving birth? That would be a good starting point.",
   "created_utc": 1700903515,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoaxs7",
   "message": "NTA\n\nYou shouldn't be bullied into submission by Reddit or anyone. It's disheartening to see the harsh tone here adding to the stress of a soon to be mother. Shame on all of you!\n\nIt is your medical operation, so it's your call who is in the room. It's not a spectator sport, so your standard shouldn't be who needs to see the birth. You shouldn't think who would benefit from seeing the birth. Heck, even you won't see the birth.\n\nThere's a difference between having your loved ones inside the room, and having them witness your baby exit your womb. Would your husband want you to be watching him getting a colonoscopy? Both of them are natural, but it may feel degrading or shameful to feeling your romantic partner getting the front row seat for a surgery in the nether regions. I get that. \n\nI was witnessing the birth of my kids, unrestricted. I don't think I got traumatized, though. Your fear may be unwarranted, but the feelings you have are valid, and they are easily accommodated.\n\nYou should judge letting people into the room based on whose support you think would benefit you the most. Do you think it would calm and help you if your mom would be there? What about your husband?\n\nYou can discuss this with them. It's not as much as the baby, but it's about you having a medical procedure. Whoever is coming, will not be watching your bloody huu-hah, they are holding your hand etc. If they are in your corner, they should see the light. If they don't respect this request, then they are to your detriment in the room, and should stay in the waiting lobby for the announcement, seeing the baby 5 minutes after the birth.\n\nCongratulations on becoming a mom soon.",
   "created_utc": 1700900811,
   "score": 255,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanzg30",
   "message": "Usually men would be happy not to be part of it lol",
   "created_utc": 1700892706,
   "score": 253,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao3asn",
   "message": "YTA, you’re the worst.  My husband literally had a deal with the dr that he was going to catch the baby. Unfortunately, things went downhill but he still got to see all of my innards.",
   "created_utc": 1700895270,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao3mw0",
   "message": "YTA. If he was going to be disruptive, different. But your only reservation is he might not find you attractive anymore. So why not have him there but ask him to stay at your shoulder? Can you really blame him for being hurt it's okay for him to make this baby with you, raise this baby . . . but he can't be there when it's born? Please rethink. There are ways to have him there without him getting up close and personal while the baby's crowning.",
   "created_utc": 1700895520,
   "score": 255,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaocvsf",
   "message": "Here’s the thing, it’s your birthing experience. You are the patient. Your life is the life at risk. You get the decide. But honestly with the amount of times on the internet with the husbands passing out, and the nurses attend to him instead of you is ridiculous so I don’t blame you. I plan on having my mom with me and I’m not even pregnant. \n\nBut if he’s going to push on this issue that’s a red flag for me in regard to respecting your boundaries tbh purely cause you are the patient and are essentially the only one at physical risk.",
   "created_utc": 1700902293,
   "score": 255,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kanxmaa",
   "message": "It's very strange that you have the idea like it’s totally your choice. All the comments here feel that as well. \n\nWe are getting (you've been coerced) by the propaganda mulch in the wrong subs vibe. \n\nRelationships are give and take. If he wants to be there, that’s his choice. \n\nDo better  -",
   "created_utc": 1700891577,
   "score": 251,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao5vyj",
   "message": "I was so worried about having my bf in the delivery room bc of this but the idea of asking him not to be present in the delivery room never popped in my head bc that’s just mean. It’s his experience too \u0026amp; really you have no right to take that away from him \u0026amp; if you try he might resent you for a really long time. Plus when everything is happening you both won’t even think of it. I was in so much pain nothing mattered more than getting my baby out lol",
   "created_utc": 1700897096,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kao9pht",
   "message": "Yes the birth is yours but it's his baby and he is gonna miss something amazing. My hubby was there didn't do a thing to diminish our sex life . I could never deprive a loving partner from the birth",
   "created_utc": 1700899902,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoageg",
   "message": "YTA  Give your husband more credit.  My husband literally saw my innards both times my kids were born (surgically), and he still thinks I'm hot.",
   "created_utc": 1700900455,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoai4t",
   "message": "YTA. I'm sorry that your mum experienced a man behaving like that, but its rare and if it did happen, most likely to be a generational thing. Don't let your husband miss out on what is the best experience of life.",
   "created_utc": 1700900488,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoat1e",
   "message": "YTA. Please report back in a year \u0026amp; let us know which of the two of you has lost interest in sex.",
   "created_utc": 1700900714,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoay29",
   "message": "YTA this is an important time in your partner's life. Being there when baby is born is important to him. \nYou will ruin your whole marriage if you don't let him. \n\nYou are treating him like he's the same as these so called men. \nTruth is they likely had issues before the birth of their children. \n\nI've had three kids and it's never effected my sex life. \nMy partner couldn't wait to finally have sex again without a giant bump in the way. \n\nHe watched our daughter come out with her arm at her face, watched the after birth come out. Wiped me up with blood spilling out and within 2 weeks was asking how long till we can do it again. \n\nYou will end your marriage quicker by pushing him away than him being unattractive to him after watching you give birth.",
   "created_utc": 1700900816,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoesct",
   "message": "He deserves to be there",
   "created_utc": 1700903819,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaof1xc",
   "message": "If you are that insecure, then you should question your marriage. \n\nMy husband saw everything during our first’s birth. Top and bottom. He was the best birthing partner I could ever wish for. Then I had twins, again he saw everything inside me. I had a c section. I don’t think there’s a bit of me he hasn’t seen! 😬 and our sex life is better than it has ever been. \n\nYou’re letting your insecurities take over and steal this special moment from your husband. All you are going to achieve is what you are trying to avoid. Because he will resent you for the rest of his life! You can compromise by asking him to stay at the top end. It’s wrong of you and insulting to your husband to assume that he will behave in the same way as your father. Think about that! YTA!",
   "created_utc": 1700904038,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaof8oo",
   "message": "Nta people are saying y t a because they think he is entitled to your body but he isn't. If he was an ex no one would be demanding that he be in the room even though he'd still be the father. \n\nAt the end of the day it is your medical procedure first and \"a once in a lifetime opportunity\" second. For some reason child birth is the only major medical procedure that people demand attendance at. No one expects to be present during heart surgery.  If his presence is going to add stress to you then yeah he shouldn't be there because your health comes before his wants. People are screaming at you to get over your feelings but what if you can't? Surely your feelings should come before his for your medical event.",
   "created_utc": 1700904191,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaofbbz",
   "message": "Don't limit your husband's opportunity to bond with his baby and connect with you and the birth. YTA. Get over these outdated, patriarchal and frankly sexist ideas.",
   "created_utc": 1700904250,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaofm24",
   "message": "just because youre carrying the baby it doesnt mean you can do whatever you want, he is your husband, not a sperm donor. YTA",
   "created_utc": 1700904489,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaofspz",
   "message": "YTA because that is his child and it’s not fair to let him experience his child being born for your own self reasons",
   "created_utc": 1700904642,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoaf1l",
   "message": "I was there cause my ex wanted me there . The truth is I almost passed out for both them . The nurse the first birth told me to sit in the chair because they didn’t want to step\nOver my body on the floor . Ex had epidural . I was never allowed tomsee down there so don’t know why the sex would be different . I just know the room felt like 200 degrees and the smells were not nice . \n\nBut I was technically the first perso. To see my babies not counting the staff",
   "created_utc": 1700900428,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoaoo8",
   "message": "I have worked in LND and with newborns. Of the 1000’s if babies i’ve seen born, I’ve heard of maybe 2 men ever being traumatized. BUT of all the birth plans I’ve seen… I’ve maybe seen a dozen go as planned. For MANY reasons. Often stuff women put in their birth plans is just normal stuff the hospital does.",
   "created_utc": 1700900623,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoawiq",
   "message": "My partner loves me more now than ever, and even though I put on weight and have scars and stretch marks, he finds me even more attractive because I gave birth to his daughter.",
   "created_utc": 1700900784,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaobvuh",
   "message": "Yta I mean it’s your choice ultimately but he’s your husband, I have unplanned c section and my boyfriend walked into the or as they were cutting me open. Wanted to watch that part not hold my hand 🙄🤦🏼‍♀️ said it was cool to see the inside. 🤮 then cut the umbilical cord and held our daughter, I am scarred from my body change and he literally could not wait the 6 weeks. We have still had a few issues regarding our sex life but it’s not bc of attraction.",
   "created_utc": 1700901516,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoc0el",
   "message": "Ur worried about losing ur sex life, but ur going to lose ur relationship instead",
   "created_utc": 1700901614,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaocc98",
   "message": "YTA My daughter and I both nearly died, my husband was forced from the delivery room when they brought the crash cart in for me. He has massive trauma that became a problem BECAUSE HE REFUSED TO GET HELP. (Edit: that trauma didn't affect our sex life, him being a right bastard did.) \n\nI had a close friend who nearly died in her labor, her husband went to therapy and support groups and 15yrs later they still bang like teenagers.\n\nYou are taking something precious away from your child and your husband based on a long set of what ifs. \n\nWhat if he is traumatized seeing me give birth?\n\nWhat if that trauma doesn't pass naturally?\n\nWhat if that trauma causes him to not want to have sex with me?\n\nWhat if he chooses to not get help?\n\nWhat if we can't work through it?\n\n\nI have a what-if for you...what if something happens to you? Eventually your mom will be gone, kids like to hear the stories of their births, especially if their mothers aren't around. I'm grappling with this now as my ex isn't in the picture (unrelated to the birth, he was always an abusive asshole and got way violent in front of the kid, so we dipped) and I have a terminal neurological disorder. I've been telling my closest friends every single thought and family story and memory I can think of so my kid will have as much info as possible when I'm gone, because she will not have me when she is in her mid-20s.\n\nI think that taking away the birth experience is going to do infinitely more harm to your marriage than having him there will. It's your body, but you share the child. You get the choice but I'd be half out the door if I was your spouse, too.",
   "created_utc": 1700901872,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoccyh",
   "message": "YTA. Please, for the love of All that is holy.  Do Not Have More Children.",
   "created_utc": 1700901888,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaocdt1",
   "message": "I still can’t walk around my husband naked without avoiding ass or tit grabbing! He watch me birth our two daughters, and I mean watched! I couldn’t imagine giving birth without him there.",
   "created_utc": 1700901908,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaocf6f",
   "message": "Things were different in your mom’s time (maybe) but definitely in your grandmother’s time. Now I would think it would be pretty unusual for a guy to not want to have sex because he saw his wife give birth. A relationship can change when both of you are dead tired and in survival mode after a baby is born but once you get into the swing of new parent life, you will likely get right back at it.",
   "created_utc": 1700901936,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaod2ba",
   "message": "I get your anxiety about this.  How about just having him stay up close to help you brace your arms when you have to bear down? Out of view of the birth field?  North of the equator, providing you with ice chips and cool compresses.",
   "created_utc": 1700902435,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoe5kc",
   "message": "Wife ended up having C-Section. I don't remember ever getting past this tent they made out of the blankets.  I stayed by her head, so they're was nothing really to see.  Perhaps natural birth is different but unless he's doing everything possible to share at your crotch there's not much to see",
   "created_utc": 1700903291,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoe5vk",
   "message": "I suspect that your mother wants to push your husband out of this experience and insert herself in there instead. She has made up some bullshit to achieve this.\n\nMaybe review the past and see if there have been other examples of your mother behaving like this.",
   "created_utc": 1700903299,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoeru8",
   "message": "YTA. \nI'm also due with my first in January. You should be prioritizing your husband over your mother. If you don't feel you can do that maybe you need to reevaluate your relationship.",
   "created_utc": 1700903808,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoetpt",
   "message": "NTA but maybe find a compromise",
   "created_utc": 1700903850,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoeynt",
   "message": "NTA but maybe you guys could compromises. I know this a cultural proactive for some not sure if it for you. But also if he wants to be there he fully understands the process, he’s a great supporter system and he’s in love with you I don’t think a baby will change that. So if you’re just worried about that you should try to get over it.",
   "created_utc": 1700903964,
   "score": 1,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoh7ng",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183chaz"
  },
  {
   "comment_id": "kaoezz7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183chaz"
  }
 ]
}