{
 "submission_id": "183nd6l",
 "title": "AITA for CCing all family, friends, and coworkers after my husband divorced me via email?",
 "selftext": "I (47F) woke up yesterday morning to an email from my husband of 21 years (50M) entitled \" Working Things Out.\"\n\nVery deceptive title because instead of arranging a meeting or even a phone call, my husband goes on a four paragraph soapbox speech about how marriage is supposed to be \"for the most part\" an in person commitment and that it pains him to say this but this cannot go on anymore.\n\nHe goes on in a very clinical detached tone to describe how us not speaking for a week before our big fight and then not hearing from me for the week afterwards is abandonment for him so he's filing for divorce.\n\nHe then asked me to tell me what things of mine I wanted him to ship and that he wants to do things fairly via mediation. Also said he'd only be responding to calls regarding our daughter and to contact his lawyer for everything else.\n\nThis is the straw that broke the camel's back for me. Because leading up to Thanksgiving he's already been complaining that he's spending the holidays alone and it's all my fault.\n\nFor a little context, I moved with my daughter (16F) from Kentucky to Atlanta three years ago because she wants to get into acting and singing. She's now attending a performing arts HS and trying to make a living acting. My husband was supportive at first- he sent in 60 applications to jobs in Atlanta, but even though he's been a manager at a motel for 13 years here, he only got entry level  interviews.\n\nMy husband initially said there's FaceTime and he has airline points. But soon I saw how inflexible he was. Every conversation was unbearable because if I picked his brain, I knew I'd be running into a brick wall. Instead of learning to enjoy long distance, it was like \" fulfilling marriage= long distance? Nope!\"\n\nHe asked us to move back during the actor's strike. At that time, we had already agreed he could have sex with others as long as he fulfilled his other obligations. He agreed to our arrangement but dumped the woman after a month and got more petty, saying the women he wants wouldn't be into married men.\n\nOur final fight was over when I said we were going to have a virtual Thanksgiving with my mom and wish her recovery from her surgery he said \" why don't you come back and tell her in person?\" He also said instead of me giving input over Christmas decorations to come back and do it in person. He said he had more intimacy with the escort than me because it was IN PERSON and I called him a hospitality manager stereotype- unable to adapt to any change and stuck in his path.\n\nThe fury boiled over after his email and I replied and CCed the extended family, friends who only hear from him and his side, and his coworker/ friend of the family. Just to tell them that the man who says he's the peacemaker is divorcing me over email and that he's been seeing other women and saying that his one month fling with an escort was more fulfilling.\n\nAITA? My only regret is that a friend's kid got a hold of the email and I've had to shield my daughter and explain that her dad is divorcing me.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;",
 "created_utc": 1700929541,
 "permalink": "/r/AITAH/comments/183nd6l/aita_for_ccing_all_family_friends_and_coworkers/",
 "score": 154,
 "url": "https://www.reddit.com/r/AITAH/comments/183nd6l/aita_for_ccing_all_family_friends_and_coworkers/",
 "comments": [
  {
   "comment_id": "kapo11r",
   "message": "You clearly love drama.",
   "created_utc": 1700929797,
   "score": 229,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapumdo",
   "message": "YTA for a million reasons the least of which is abandoning your husband because your 13 year old wants to act and misleading your friends and family into thinking he cheated on you.  It doesn’t even sound like you want to be married, other than the fact that he pays the bills.",
   "created_utc": 1700932387,
   "score": 87,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapuhq7",
   "message": "YTA I mean to be fair you won’t go see him in person. It was either going to be email or a phone call. His lawyer is probably advising him to get everything in writing in case you do something crazy, and you just obliged him.",
   "created_utc": 1700932336,
   "score": 4,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapwga3",
   "message": "If this is your best effort to make yourself sound sympathetic and him sound like the bad guy, then I guarantee every person you copied on that email thinks you abandoned your marriage and he's a smart and lucky man to be starting over without you. \n\nThe one great thing you did was kick start his search for love by informing everyone you both know that he was the decent one in your marriage and now he's single, as well. \n\nYour poor husband. YTA.",
   "created_utc": 1700933100,
   "score": 230,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapusit",
   "message": "You abandoned your marriage to be a stage mom three years ago, *agreed* he could see other women after you did that, and now you're trying to shame him publicly for finally throwing in the towel? YTA, yes. I'm sure he'd be happy to divorce you in person, only you aren't even going home for Christmas so.",
   "created_utc": 1700932454,
   "score": 238,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapu8ss",
   "message": "You're a trainwreck, and honestly a shit wife. YTA",
   "created_utc": 1700932240,
   "score": 20,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapu9qu",
   "message": "Yta. It's not that far from Kentucky to Atlanta. You can easily drive it in a day. Sorry you're losing your atm. I personally believe that you're living vicariously through your daughter.",
   "created_utc": 1700932250,
   "score": 43,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapsugk",
   "message": "You are not the victim here.  I can't say your husband is without fault, but even in your telling of the story, it is all about you and your daughter and never about meeting him halfway or understanding his wants.    \n\n\nAnd your evil and dishonest move of saying 'Why don't you see other women for intimacy', then outing him to people unfamiliar with your arrangement as seeing other people for intimacy is awful.  I hope that costs you in the divorce.  \n\n\nYou are petty, dishonest, selfish, and manipulative.  I would say to be a better person, but I doubt you have the self awareness to do so.  YTA YTA YTA YTA YTA YTA YTA YTA",
   "created_utc": 1700931687,
   "score": 255,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapvypp",
   "message": "YTA\n\nWTH did you expect? You took your daughter and moved so that she could pursue an acting career? You gave up a 21 year marriage for a pipe dream that will probably never happen. Of course he feels abandoned. He was! You have taken complete control of decision making in your marriage and done what you wanted without even think8mg about how your actions would affect others. There’s no reason you couldn’t help your daughter pursue acting from where you were. She could go to a performing arts school in TN, prepared for a college to major in theater in the town you were in and kept your family together. Your daughter would have been fine where you were. \n\nYou did this to yourself and you’re on here playing victim acting all surprised that your husband accused you of abandoning him. I feel for him, I do. It almost makes me wonder how much your daughter really wants to act vs you reliving your dreams through her.",
   "created_utc": 1700932912,
   "score": 160,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapuqz4",
   "message": "YTA it sounds like he’s putting in way more effort than you and you’re just being petty by CCing the entire universe in that email.",
   "created_utc": 1700932437,
   "score": 136,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapw6wk",
   "message": "Here is a fun thought.  Narcissist tend to raise narcissists.  So, in a year or two when the daughter has everything she needs from you, she is going to discard you like yesterday's rubbish.  And by then, you will have already destroyed your marriage and your standing with your friends and even your family.    \n\n\nNot sure you thought this one all the way through.",
   "created_utc": 1700932999,
   "score": 133,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapvr5d",
   "message": "YTA You left him and told him to go fuck other women and now you are mad he wants a divorce lol Guess he got tired of being just a wallet.",
   "created_utc": 1700932832,
   "score": 49,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapoiys",
   "message": "Yes, you are. That was entirely inappropriate to involve others in a very sensitive and difficult moment. You have a right to be upset. But involving others makes you look petty and and was even worse response to what was already a classless email. Given both of your reactions it's probably best that this marriage end. Find a way to do it in a way that minimizes the collateral damage.",
   "created_utc": 1700929997,
   "score": 122,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kappy3w",
   "message": "YTA That’s crossing the line, it’s one thing to send that if he’s claiming about something and lying. But he’s not, he seems like he tried taking to you but you literally talk over him. \n\nThat email is also super out of context and it’s manipulative af for only including certain parts. I’m sure that email doesn’t talk about the agreement you two had regarding the escort. You totally did this to be petty and congrats one more reason to hate you. Imagine in 10 years your daughter asks why daddy hates you and he literally show her the email that you mass send everyone. It’s abusive that you would immediately take the route that potentially socially and emotionally isolates him from his life over private matters.",
   "created_utc": 1700930554,
   "score": 115,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapum65",
   "message": "You shared your intimate business with everyone? \n\nYes, you absolutely ARE TAH",
   "created_utc": 1700932385,
   "score": 106,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kappgjz",
   "message": "Honestly, this divorce sounds like a great idea. It sounds like you’d rather focus on your daughter and his wanting a true partnership (which it sounds like you don’t) does not make him awful. It’s fair. \n\nIt is what it is. You’re not awful for pursuing what you and your daughter want, but you are/would be for continuing to insist that your husband to essentially be trapped in a loveless marriage that’s not working for him or considering his needs because it works for you. \n\nDo you work, or are you just using him as an atm?",
   "created_utc": 1700930359,
   "score": 7,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapqgje",
   "message": "YTA and most people you cc’d will think it as well.",
   "created_utc": 1700930754,
   "score": 169,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaprrhq",
   "message": "YTA. You did abandon him. Absolutely NO sympathy here. You deserve to be divorced through email.",
   "created_utc": 1700931261,
   "score": 10,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapry7p",
   "message": "YTA. \n\nI’d divorce you as well. There was absolutely no reason to send this email to family let alone co workers. He can use this against you in the divorce",
   "created_utc": 1700931336,
   "score": 94,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapv0qk",
   "message": "YTA and I don’t blame the guy.",
   "created_utc": 1700932544,
   "score": 27,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapv3mc",
   "message": "YTA you left him and refuse to even visit for a holiday. How else was he to break up with you. He probably should have done it when you told him to go sleep with other woman. Makes it clear your only still married so he can support you. Now he will be released mid that burren",
   "created_utc": 1700932575,
   "score": 27,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapvvfb",
   "message": "... You and your daughter moved out when she was 13, and you're surprised that your husband feels abandoned?\n\nI mean, you kind of abandoned him.",
   "created_utc": 1700932877,
   "score": 82,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapv4l0",
   "message": "YTA.\n\nYou don't involve random people in personal matters.\n\nBy your account, your husband isn't really the bad guy in this whole mess. You decided to move hours away with your daughter. You decided on a long-distance marriage. You gave him permission to screw around, which is a pretty clear  indication that you don't care. It actually is YOUR fault that he's spending the holidays alone.\n\nHow do you not see that YOU are the one who checked out of your marriage? Be honest -- did you really expect him to accept an absentee wife?",
   "created_utc": 1700932585,
   "score": 43,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapog7z",
   "message": "You seem nice. /s\n\nI think your husband is going to be much, much, much happier when he's looking at you in his rearview mirror.  And I think he deserves to be.",
   "created_utc": 1700929967,
   "score": 109,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapvgsu",
   "message": "Sounds like you want a sugar daddy, not a husband.",
   "created_utc": 1700932719,
   "score": 22,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapx7lp",
   "message": "YTA. Your daughter might be into acting but you my dear are a drama queen.\n\nYou ccing everybody is not going to look good in court.",
   "created_utc": 1700933393,
   "score": 22,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapxirc",
   "message": "What I just read was a tantrum thrown by an adult woman. YTA",
   "created_utc": 1700933514,
   "score": 21,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapsvzc",
   "message": "your coworkers? HAHAHAHAHAHA \n\n\ntherapy babes. 💖",
   "created_utc": 1700931703,
   "score": 42,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapvc1p",
   "message": "YTA. He is right in divorcing you, and you deserve it being via Mail. And you are petty to involve people who have nothing to do with it. You both agreed that he can see other people, so why do you want people to know that he is seeing other women? Want it to look like he is cheating? \n\nYou probably are just angry that you will loose the atm.",
   "created_utc": 1700932668,
   "score": 17,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqaiff",
   "message": "YTA.  Has your daughter not seen her father in 3 years?  Does he not come visit you ***because he's working his ass off to pay for your fantasy of being famous?***\n\nHopefully this \"letter\" will backfire on her.  I'm sure her whole family knows what a shit wife she is, especially after sharing this letter (that makes it look like the open marriage wasn't HER idea).\n\nNot even going home for a holiday to see your sick mother?  Don't be surprised when you end up alone and abandoned in life, OP.  YTA big time.",
   "created_utc": 1700938392,
   "score": 20,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapz9n3",
   "message": "You won't even see your own mother for her surgery.....\n\nSweet Jesus, you're a cruel selfish person.",
   "created_utc": 1700934179,
   "score": 37,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapvy08",
   "message": "TBH…email sounds like the only way to do it, since clearly you were not listening and YTA for the CC thing, you sound very vengeful because you agreed that he could see other women and than made it out that he is cheating…not cool, and shielding your daughter? from what she is 16 not a preteen she can ask dad for the truth!! YTA big time.",
   "created_utc": 1700932904,
   "score": 16,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapw0d6",
   "message": "Huge YTA the guy was alone in the house while hes wife was having her life in another place, plus he asking you to come buy to spend time with him isn't much at all. That what  marriage is for, why will he want a long distance wife? That shit doesn't work!",
   "created_utc": 1700932930,
   "score": 31,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapxy3e",
   "message": "YTA   What we're not hearing about, is if you started seeing other men before you \"allowed\" him to seek out other women when you left for Atlanta, that hotbed of the entertainment industry.\nIf this is a real story, you literally abandoned your marriage, and you used your daughter as the excuse.  Does your daughter *really* want to be in show business, or are you one of those horrible termagants that chivvy and chide their children into it?\nI would not be surprised if you have been diagnosed a narcissist.",
   "created_utc": 1700933681,
   "score": 32,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaps3u7",
   "message": "Why do you want to be married? What are either of you getting out of it? Divorce and go your separate ways. This has already went too far and now it is going to be ugly.  YTA for bringing all of the family into it. You are acting like a teenager.",
   "created_utc": 1700931398,
   "score": 38,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaps5z6",
   "message": "This has got to be karma fishing. Got to be",
   "created_utc": 1700931421,
   "score": 35,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapxoje",
   "message": "Yta",
   "created_utc": 1700933577,
   "score": 12,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapwl1m",
   "message": "You’re pure evil",
   "created_utc": 1700933152,
   "score": 11,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapx5e2",
   "message": "YTA \nFFS grow up.",
   "created_utc": 1700933370,
   "score": 12,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapxqkl",
   "message": "Why do you feed off of drama? If you CC'd me on that email I would cut your toxic ass out of my life so fast.  \n\n\nYou moved away, you don't visit (even for he holidays?), you told him to sleep with other women, he emails you (because you wont come home even when he begged you to do so), and then you send your toxic dirty laundry to everyone he knows - even a coworker? Dumb of you to bring in his job when he's financing your life. SMH.",
   "created_utc": 1700933599,
   "score": 10,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqak58",
   "message": "You are not only the as$hole for refusing to go home to your husband, if only for the holidays, you are absolutely a selfish as$hole for refusing to go home to see your mother after she had surgery. I can not wait until your daughter treats you just like you treat your mother \u0026amp; husband. And she more than likely will. After all, you taught her how to treat those you \"love.\"",
   "created_utc": 1700938410,
   "score": 11,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqap4g",
   "message": "LMAO YES you are the bad guy.\n\nYou abandoned your marriage and moved to Atlanta. I don't care if you supposedly did it to support your child.\n\nNewsflash children grow and move out. Your husband was going to be there forever. \n\nI love my kids too but they grow and make their own families and move away. \n\nIf she made it big were you then going to follow her to California?\n\nYou had this coming then you go on a woah is me victim display to everyone who would see it.",
   "created_utc": 1700938464,
   "score": 9,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapsyh4",
   "message": "YTA - how dare you? He tried to make this situation work and it’s (unsurprisingly) not working. So he’s divorcing you (as you absolutely should have seen coming). How dare you try to humiliate him? It appears he’s kept this private on his end. He hasn’t flaunted his sexual arrangements or run your name through the mud for moving away. So what gives you the right to do that when he’s making a very reasonable decision?",
   "created_utc": 1700931730,
   "score": 17,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaq1flh",
   "message": "Your husband tried to meet you by going more than halfway. You can't blame him for divorcing you through email when you're never around. \n\nI'd be interested to know what your idea of a relationship is and more so a marriage. He has communicated his needs, expressed his unhappiness, and you have dismissed him and his feelings.\n\nNow you're trying to play the victim and turn your daughter against him by just telling her that he wants to divorce you and not bothering to tell her how you let your relationship die. Then you go and involve dozens of other people into your business and try and paint your husband as the problem. You're unhinged.\n\nLet me give you an example of what you've done. You bought a hamster then decided to move and leave it behind in a cage. You mailed food to your previous home where your hamster resides, thinking it could figure it out for itself. Now you're surprised to learn that your hamster has died. The hamster in this scenario is your marriage.\n\n\nI wish your husband eternal happiness.",
   "created_utc": 1700935003,
   "score": 9,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqanhx",
   "message": "Nobody that wants a monogamous committed relationship would okay their partner sleeping with other people.\n\nIt's quite clear all you cared about and wanted from him, was those \"other obligations\" you mention which I am pretty sure were financial.\n\n\u0026gt;Instead of learning to enjoy long distance, it was like \" fulfilling marriage= long distance? Nope!\"\n\nLMAO What? Long distance, for many people is UNDERSTANDABLY a deal breaker.  You are acting like everyone can just \"learn to enjoy it\", you enjoy it because apparently all you care about is if he's sending the checks.\n\n\u0026gt;Just to tell them that the man who says he's the peacemaker is divorcing me over email and that he's been seeing other women and saying that his one month fling with an escort was more fulfilling.\n\nYou literally agreed to letting him see other women and now wanted to punish him for it.  His relationship with the escort probably was more fulfilling than his role as a long distance ATM machine with you.\n\nYTA, over and over.  You are responsible for having to shield your daughter from the fallout.",
   "created_utc": 1700938446,
   "score": 8,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqgw8c",
   "message": "What a petty move OP, you played yourself. Lmao. Clearly, YTA.",
   "created_utc": 1700940811,
   "score": 9,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaq83pz",
   "message": "YTA for sure. I feel so sorry for your daughter. \n\nYour husband had to resort to putting his thoughts in writing in hopes that his words might actually get past your self-important attitude. You show absolutely no empathy or interest in his feeling abandoned all this time. He has missed crucial years with his daughter while being expected to function as an ATM. I could go on but I doubt you’ve read this far. \n\nAnyone who received your bitchily forwarded email probably reacted like most here and will side with your poor husband. They’ve likely sided with him for years and will applaud him for finally pulling the plug so he can pursue a life filled with love and happiness. \n\nShame on you. For everything.",
   "created_utc": 1700937508,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqalwz",
   "message": "YTA, I mean I can see why he'd email you 🤷 You live in another state, don't visit, allow him to sleep with other women....how is this a marriage? Let the man go so he can fully be with someone else who will love and support him",
   "created_utc": 1700938429,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqb8fv",
   "message": "YTA. “Learning to enjoy long distance”! Give me a break, no one enjoys it. It normally fails.\n\nYou abandoned him and took your daughter. Your marriage was over then. He HAS been flexible sticking with this and you.\n\nThose flights ain’t cheap and while you’re off living your best life in the big city up to who knows what, he’s stuck running a motel.\n\nNo women that cared about their husband says gone and sleep with another woman, and they do go home for Thanksgiving.\n\nYou are utterly selfish, and that you would post this illustrates your narcissism. You abandoned him 3 years ago and can’t be bothered to go home.",
   "created_utc": 1700938669,
   "score": 8,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqpjcb",
   "message": "daFUQ did I read?\n\nYTA and a fucking delusional obsessed stage mom.",
   "created_utc": 1700944001,
   "score": 5,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kappmm5",
   "message": "YTA. You didn't need to go that far to send it to everyone you knew, that was going too far and just adding to the drama.   \nIf push came to shove you could've kept the e-mail and if people asked then you could've showed them, but you decided to go above and beyond and show everyone, trying to drag everyone into it, which was a very dramatic a childish move.",
   "created_utc": 1700930427,
   "score": 28,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapof0x",
   "message": "YTA \n\nI’m very big on “My business isn’t show business”.  I also don’t gaf what side of the story gets told or who’s telling it. I’ll be the villain in anyones story as long as I know my truth. \nYou don’t know what was said and just to throw the entire friends and family list in the business is wild.",
   "created_utc": 1700929954,
   "score": 36,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapxbiz",
   "message": "YTA, I’m sure your family and friends have enough of their own life difficulties to endure without getting sucked into your soap opera. Leave them alone and deal with your own shit yourself.",
   "created_utc": 1700933435,
   "score": 8,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapxh9f",
   "message": "Yes YTA and you're so self centered that you will never understand why",
   "created_utc": 1700933498,
   "score": 7,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapyz63",
   "message": "YTA. The one silver lining is that your husband won’t have to justify himself to anyone or try to get them to see is side. Nobody who got that email is going to read it and think ‘she seems so nice, I wonder why he would abandon her?’",
   "created_utc": 1700934070,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapza7t",
   "message": "YTA.  Very tacky move, cc’ing others. And painting him as a cheater. And abandoning him in the first place. A divorce by email is all you deserve.",
   "created_utc": 1700934185,
   "score": 8,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapzhrg",
   "message": "I'm sure I read something like this a while ago, but from the husband's pov. He said he'd bought her a house and paid for everything.  She refused to travel to him and didn't want him to visit her either. Reddits overwhelming advice was for him to divorce her, but it looks like he's only just making a move. Better late than never.\nOP you are a selfish piece of work\nYTA",
   "created_utc": 1700934264,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaq87bt",
   "message": "YTA.\nYou should have kept this between you and your now ex husband..\nBtw, moving hundreds of miles from home so you can have your daughter attend a performing arts school , chasing a dream that has a very slim chance of coming to fruition, is why your marriage is ending .",
   "created_utc": 1700937546,
   "score": 8,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqof5v",
   "message": "YTA, you’re honestly lucky he stayed for as long as he did.",
   "created_utc": 1700943611,
   "score": 7,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaqrzai",
   "message": "Funny thing. I just used this amazing feature called Google Maps; and from Lexington, to say, Atlanta, it's \n\nFive hours and 15 minutes.\n\nAnd you could not be bothered to come home every now and then. Over the road truckers come home more frequently.",
   "created_utc": 1700944868,
   "score": 4,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kar33h1",
   "message": "This post reeks of a horrible stage mom, your daughter is 16, why is she trying to earn a living?  You literally abandoned your husband in the hopes that your daughter would become wealthy and support you accordingly.  You seem to have forgotten any of your wedding vows.\n\nEdit:  Forgot to add, YTA in so so many ways.  Stop trying to use your daughter as a wallet, and the same goes for the man who you rejected as your husband.  You seem to be a terrible person.",
   "created_utc": 1700948971,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kar38k9",
   "message": "When I had read the title, I first thought there was no way he did that,  then I read the rest of it...OMG OP! You're a horrible wife. You try to portray yourself as so wonderful because you were willing to give him all these alternatives, and strangely, maybe you believe it, but seriously,  get some counseling. You're going to be a very lonely old woman. What I read was a husband who misses his wife and family and you dismissed him as nothing more than a bankroll. Intimacy is not about sex,  he wanted that from his wife who blatantly disregarded his desires and turned it against him in the end.  You should be very ashamed of yourself and your choices and I hope you learn from these mistakes before you pursue another relationship in the future. If not, I highly suggest you consider no strings attached relationships yourself because no one deserves a significant other like you.",
   "created_utc": 1700949027,
   "score": 8,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kar58j7",
   "message": "Please, OP, explain how you think you ARENT the ah?? YTA absolutely. Like you abandoned your husband for three years, don't go home on important holidays, and then lie about his actions and reasoning for divorce to a bunch of people. Mind you. Those people had absolutely NO REASON to be involved in your marriage drama. \n\nI really hope your husband has proof to show all those people that YOU are the problem and sole cause of your divorce. Tbh, I think he would've been better off divorcing you a lot sooner bc it seems pretty clear you don't actually care about being in the marriage. \n\nAlso your daughter wanting to be an actress or whatever was never more important than yall staying together as a family. You are the reason your marriage has failed and you need to accept the responsibility of that. Don't push it off to someone else plbc you can't handle the truth.",
   "created_utc": 1700949765,
   "score": 5,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kar5n8k",
   "message": "Gross. Leave this man alone and for his sake never contact him again.",
   "created_utc": 1700949921,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kar61ap",
   "message": "You’re not only TA but just a gross human. Ewe",
   "created_utc": 1700950059,
   "score": 4,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kar68r5",
   "message": "YTA\n\nYou have abandoned him. For three years. You then agreed to an open marriage, but let it look like he was cheating. And you wouldn’t even go back for holidays? Come on. This marriage was over three years ago and you started and completed that. He just put it in writing.\n\nMaybe if you wanted him to tell you in person, you should have made an effort to see him in fucking person every once in a while?!",
   "created_utc": 1700950138,
   "score": 4,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "katpby6",
   "message": "Who moves to Atlanta to become an actor?",
   "created_utc": 1700999669,
   "score": 6,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapr51m",
   "message": "YTA\n\nIMHO you are attempting to shame your husband in front of the important people in his life.  I divorced an arse 20 years ago, and he attempted to shame me by writing letters to my family listing all my failings.  My family lost respect for him at that point, as they saw him for what he was:  mean spirited and small minded.",
   "created_utc": 1700931018,
   "score": 19,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kaptmer",
   "message": "Wonder if her precious daughter is the husbands, she said my \u0026amp; not ours.",
   "created_utc": 1700931994,
   "score": 16,
   "submission_id": "183nd6l"
  },
  {
   "comment_id": "kapu0wo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183nd6l"
  }
 ]
}