{
 "submission_id": "183t4s3",
 "title": "Post-Divorce Update: Financial Infidelity Accusation/Cheating Husband",
 "selftext": "Hi everyone! Not sure if anyone remembers as it's been a few months since my last update, but I originally posted earlier this year about my husband \"Joe\" accusing me of \"financial infidelity\" because I had spent some of my own fun money/savings (within our agreed-upon personal spending limits) on a gaming PC and home office setup. Which then devolved into him (unfairly) accusing me of slacking on my personal appearance, career, and housework, and soon it came it out that he'd been having an affair with a coworker (\"Amy\") who had become pregnant. We separated right after that (he moved out and in with her).\n\nMy last update is here: [https://www.reddit.com/r/AITAH/comments/15u68ur/latest\\_update\\_was\\_accused\\_of\\_financial/](https://www.reddit.com/r/AITAH/comments/15u68ur/latest_update_was_accused_of_financial/) and prior chapters in the story are available on my profile if anyone wants to read from the beginning.\n\n(And, apologies in advance, the next update (below) is quite long!)\n\nLast time I updated, we had thankfully quickly agreed on a divorce settlement that allowed me to protect my most important assets, and I had just met with his mistress Amy at her request. At which time it was made clear that he had lied to her about numerous circumstances, such as that our home belonged to him (it did not, I inherited it from my grandmother), that I was an underemployed high school dropout drug addict (I'm not, I have a master's degree and a high-paying tech job), that we'd been \"separated in spirit\" for years (also not true, I didn't know anything until he blurted out the news about his affair over the summer), and that he had a vasectomy (he did not, we talked about it but he decided not to despite us - him in particular - not wanting kids). I told her the truth and even provided as much evidence as I had on me, but she didn't seem believe me and went on home to Joe. \n\nI know quite a few people have been reaching out for more news, but I wanted to wait until my divorce was finalized to avoid risking any complications, and also just thought it best to let things settle for a bit. The good news is - I'm now divorced! The final decree came through a few weeks ago. It actually all went very smoothly (I'm eternally grateful to live in a \"mutual consent\" divorce state that allows divorcing couples to proceed quickly if they can come to an agreement on finances and property). \n\nOn the Joe/Amy front, after my last post, all was quiet for a couple weeks, until Amy, her due date quickly approaching, reached out \\*again\\* to ask if I'd given any more thought to her offer to pay me $17K to vacate the house quickly so that she and Joe could move in. (Again this is the house I inherited that I own free and clear, but Joe told her he owns it and that he was just giving me time to get my finances together before evicting me.) At this point I decided to package up a lot more evidence of Joe's lies to send on to Amy. I sent her a copy of the deed and property tax records showing the house is in my name only. I sent her copies of my diplomas to prove I am not a high school dropout. I sent her some info on various professional associations I am involved in and awards I have won to show I actually do have a senior-level job and am not underemployed, as well as proof of my income. I sent her copies of all my drug test results for the past 5 years (I have a drug-free workplace and have to test 2-3 times a year) to show I am not an addict. I sent her time-stamped photos and text exchanges to show that Joe was still having a romantic relationship with me until July this year (nothing salacious, just photos of us showing G-rated affection, exchanging loving words over text, etc.). I even found a text exchange from a couple years ago when we last discussed him potentially getting a vasectomy, with his final decision not to proceed with one. \n\nA couple days later she responded - she believed me! However, in the end it didn't matter as Joe convinced her he had lied for Very Good Reasons. The way they both tell the story, they met at work and were incredibly drawn to each other, in a way that felt \"inevitable.\" However, due to Joe being married, he felt that if Amy knew he was (to that point)  happily married she would either turn away from him and miss out on the \"love of a lifetime,\" or she would go ahead with an affair but be consumed with guilt. So, to avoid either of these outcomes, and especially to save Amy from guilt, Joe decided to create an alternative narrative in which he was in a marriage that had ended for all intents and purposes years ago, in all ways but legally, because I was an uneducated addict who kept relapsing and couldn't get my life together. That was she could essentially believe he was single. (How noble of Joe, to bear all the guilt alone! /s)\n\nUnfortunately, Amy said she understood and forgave him immediately. With a baby due any day, I suppose I can sort of understand the desire to justify the lies, even thought the reality is horrifying. I suppose it's also not my problem anymore. Amy did have her baby over a month ago and I guess she and Joe will...make whatever life together (or not) is meant to be.\n\nAs for me, I'm doing very well! Actually got a big promotion at work (not managing people which I don't want to do, but will be working on higher-profile projects - with a 40% raise!) which starts after the new year. The house is really big for just me, so I have a couple roommates now - a friend who is also going through a divorce moved in, as well as a younger (mid-20s) cousin who moved to the city for work. We're all having a lot of fun together. I'm not really ready to date yet (still in therapy processing all the marital fallout) but getting there and looking forward to whatever new adventures life has to offer.\n\nThis will probably be my last post (in this series anyway) as the saga of Joe and Amy, or at least my role in it, is finished; with us legally divorced and having no ongoing financial or other ties, the best thing I can do is leave them to their own story and get on with my Joe-free next phase.\n\nThank you all for listening to my story for much of 2023, I do truly appreciate the support and helpful advice I received along the way.\n\n\u0026amp;#x200B;",
 "created_utc": 1700945267,
 "permalink": "/r/AITAH/comments/183t4s3/postdivorce_update_financial_infidelity/",
 "score": 39,
 "url": "https://www.reddit.com/r/AITAH/comments/183t4s3/postdivorce_update_financial_infidelity/",
 "comments": []
}