{
 "submission_id": "183ulj1",
 "title": "AITAH For telling my boyfriend I am uncomfortable with him referring to my house as OUR house",
 "selftext": "My boyfriend (43m) and I (42f) have been together just under two years. I have two children, both elementary age; I share custody with their father. Until recently, I was renting an apartment after I split with my ex-husband. I just bought a house, and I am so happy to be creating a new comfortable home for my children. Getting this home feels like a major accomplishment for me, and I am proud that I can provide a better home for my kids now than during my marriage. \n\nI care about my boyfriend deeply, but I am not in a place where I want to live together with a partner yet. We have both been in stressful long-term marriages, and dont plan on marrying. We have discussed this many times. He wants us to live together in the future. I told him I want that eventually, but I cant give him a time frame for when I may be ready for that. He gets along with my kids very well, but I am reluctant to have him in a step-dad role for various reasons (mental health issues and alcohol abuse, which he says he is actively addressing).\n\nHe has a living situation that is less than ideal, and has been leaving things in my home every time he stays over. It started with some clothes, now its a keyboard and guitar and spare TV. I feel like this is a method of moving in without officially moving in. He has started using the term \"our\" a lot... our house. Our bed. Our kids.\n\nI started a discussion about how it makes me uncomfortable that he behaves basically like we live together. When my kids are at their dads, he is always over, and I have to basically ask if I can have nights home alone sometimes. I require regular recharge time alone for self care, and dont get that opportunity often. He reacted pretty angrily because he said the terminology \"ours\" doesn't matter, because we are two adults in a loving relationship he sees things as ours because he cares and helps out.  I see it as him not respecting my boundaries. Am I being selfish and immature because I'm not quite ready to share? Am I overreacting to his use of the word \"ours\"?\n\n\nEDIT: thank you to everybody for the mostly supportive comments. Clearly I have settled into old habits and didn't properly establish boundaries in this relationship from the beginning. I am going to spend my evening ALONE packing up his things.",
 "created_utc": 1700949250,
 "permalink": "/r/AITAH/comments/183ulj1/aitah_for_telling_my_boyfriend_i_am_uncomfortable/",
 "score": 48,
 "url": "https://www.reddit.com/r/AITAH/comments/183ulj1/aitah_for_telling_my_boyfriend_i_am_uncomfortable/",
 "comments": []
}