{
 "submission_id": "183ur1g",
 "title": "AITAH for punishing my son 'too much' for making sexist comments on the internet?",
 "selftext": "I have two children, a 17-year-old girl and a 14-year-old boy. Recently, my daughter showed me some comments that my son was making on some online posts with his friends. He was mocking female soccer players, saying they didn't know how to play and that they should go back to the kitchen. In other posts, he made comments about how women only care about money and are only useful for household chores. I was saddened and irritated by his behavior; I've always tried to educate him to respect women.\n\nI confronted my son, and he said it was just a joke, that he wasn't serious and that it was how his friends joked. He said I was overreacting and that I didn't understand the jokes. I didn't accept these excuses; I had a long conversation with him and decided to punish him. I took away his computer, canceled the subscriptions to the online games he plays, and prohibited him from playing anything for a month. I also made him cut off contact with those online 'friends' of his. He tried to protest, but I stood firm.\n\nMy husband agrees that our son was wrong but thinks I was too harsh on him. He says I should have given him a chance to redeem himself, that he's just a teenager, that he will grow and change. He says I should let him play at least on weekends, that he needs a hobby, that he doesn't have many friends.\n\nI don't think I'm overreacting; I believe he needs to understand that his actions have consequences. AITA?",
 "created_utc": 1700949669,
 "permalink": "/r/AITAH/comments/183ur1g/aitah_for_punishing_my_son_too_much_for_making/",
 "score": 122,
 "url": "https://www.reddit.com/r/AITAH/comments/183ur1g/aitah_for_punishing_my_son_too_much_for_making/",
 "comments": [
  {
   "comment_id": "karfz3j",
   "message": "Should have asked him to explain the jokes to you. In detail. Followed up with \"do you think these things are true of me? Do you think they're true of your sister? (And any other close girls/women in his life) Do you really think all I'm good for is chores? Do you think your sister deserves to grow up doing nothing but some random guy's housework for him because that's all she's worth? Would you tell a girl you like that she belongs in the kitchen?\" Really get him to think through what he's saying and why it's not just 'jokes'.",
   "created_utc": 1700953852,
   "score": 215,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karnadg",
   "message": "NTA but I would've made him learn to cook/clean as well as ask if he thinks his sister (or other female relatives) deserve to just stay at home cooking/cleaning for some guy, etc...",
   "created_utc": 1700956728,
   "score": 198,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kar67z4",
   "message": "NTA BUT this isn't actually addressing the behavior. You need to be working to change his behavior, not just punish him for it. Keeping him from playing games and talking to those specific friends isn't changing the fact he thought this was okay to begin with.",
   "created_utc": 1700950130,
   "score": 43,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karfs0w",
   "message": "NTA. \n\nTime to sit down with your son - his brain is forming right now and needs to be educated on why this isn’t cool. \n\nHere’s a hobby - do all the cleaning around the house, laundry, dishes, etc. I would scold the shit out of my kid for that type of behavior. It’s not only disrespectful but also could turn into an issue as he gets older.",
   "created_utc": 1700953780,
   "score": 195,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karqvhm",
   "message": "Just stop cooking, cleaning, and doing his laundry for a month.",
   "created_utc": 1700958127,
   "score": 250,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karhvxy",
   "message": "NTA - His \"chance to redeem himself\" will take place in a month when he gets his access back in a month and has to act appropriately.",
   "created_utc": 1700954599,
   "score": 190,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kari8f8",
   "message": "NTA, but ask him \"what's the punchline? Why are those jokes funny?\". Give examples using the same construction but now with black people as the target, show him that the only purpose of this \"jokes\" is to say bigotry outloud.\n\nUse yourself and his sister as examples in this \"jokes\", people generally react differently when this \"jokes\" focus on people they care about.",
   "created_utc": 1700954735,
   "score": 126,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kargmrr",
   "message": "NTA, you child is joking with lord knows who online and your husband isn't concerned at all??",
   "created_utc": 1700954110,
   "score": 126,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karnlvk",
   "message": "Ask father for *his* opinion on what son said because you might have some serious work to do *there*.",
   "created_utc": 1700956851,
   "score": 230,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kar61oe",
   "message": "NTA, if you go easy on him about this then you send the message that these views are not that big of a deal. He needs to understand how severely wrong sexism is. I would keep having conversations with him about respecting women as well.",
   "created_utc": 1700950062,
   "score": 132,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kasmj2s",
   "message": "No, if your son is being an insufferable cunt on the Internet, it's only a matter of time before he gets emboldened to do it in public. Stopping it is the right thing to do as a parent.\n\nEdit: if he needs a hobby staying inside and playing games is the wrong one, sounds like some volunteer work with actual people is in order.. socialize with good natured people and create a hobby that is beneficial both to him and the people he's helping.",
   "created_utc": 1700972084,
   "score": 33,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kar5nqt",
   "message": "NTA, like at all. He needs to learn and if that’s the way he will listen then I applaud you. You’re being a firm but good mother. I’d worry where he is hearing/seeing these opinions though - there is so much rubbish on the internet. Good luck with him, I hope he learns his lesson, fast.",
   "created_utc": 1700949926,
   "score": 136,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karifiu",
   "message": "NTA. If my father was around and caught me saying something like that, even today at 23, he'd drive to my apartment, yell at me and hit every necessary nail on the head to make me guilty for what I did, then give me a hug and ask \"now how are we going to fix this?\" and come up with a plan with me.\n\nI'm not saying your husband's gotta scream sense into him or anything, but you taking away his stuff is a punishment while his male role model treating him like a disappointment that needs to get his shit together is a stronger motivator. You need to get your husband in on this with you or your son is gonna call from the police station one day after pushing or slapping \"his bitch\" \n\nMisogyny is a learned behavior and it's unlearned not just by removing bad influences but reinforcing good ones. If he respects his father at all, hearing \"you've pretty much disgusted me with how you act and I don't know how you live thinking you're hot shit for it\" is gonna hurt. Not in a resentment way if their relationship is positive, but in an \"oh... I love my dad, and I made him think less of me\" way\n\nJust basing this off how I was raised. I see lots of people saying guilt is a tool of abuse, and while I agree it can be, I think it can also be used to force someone to think about what they did and why they feel bad about it. My dad telling me off hurt so much more than a week of grounding because he inspired goodness and I hated not living up to that. And he wasn't ever even mean about it, just spoke from the heart.",
   "created_utc": 1700954813,
   "score": 49,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kargu20",
   "message": "I’m gonna say NTA. But I do think the punishment doesn’t fit the crime and he won’t learn anything from it, I’ll draw on my own experience to make the point. \n\nWhen I was 14 years old, I went through a phase of being *the worst*. I bullied another girl and called her names the night of our 8th grade graduation, because she had the same dress as me, and wasn’t part of the “cool” crowd. My mom found out about it, and I had to write her a sincere apology note, and sell the dress (which not only had I paid for it with my own babysitting money, I had planned to keep for years because I loved it so much) and use the money from selling it and offer to go get a mani/pedi with her to get to know her. Fun fact-she accepted, and I had a lot of fun. Turns out we were both into the same bands, movies etc. \n\nI never ever forgot that. Now I’m 30 and I’m going to be a parent myself and that one lesson in a punishment not just being proportionate but actively fitting the offense has always stuck with me. It literally made me realize how terrible I had been, and it made me a better person going into high school. \n\nI can’t suggest something exact, but maybe just consider what will drive the lesson home.",
   "created_utc": 1700954191,
   "score": 47,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karlowf",
   "message": "Is your husband okay with your son saying sexist and harmful things? There's no place for that talk. It doesn't belong in jokes in gaming communities and it shouldn't be coming out of your son.\nI would sit down with your husband and ask why he thinks this is a situation where your son should learn that it's okay to be disrespectful to women. \n\nI personally would do the same thing as you did if my son said this. I would put his Pokemon cards up in the garage for a month. He needs to consider how his words affect people.\nDoes your son understand why you have an issue with what he said? Or does he think you are being unreasonable?\nI am slightly concerned if your husband is disregarding your opinions and doing so in front of your son, so that your son thinks that he doesn't need to understand your position. As his dad will not enforce a punishment.",
   "created_utc": 1700956096,
   "score": 45,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kau7nd9",
   "message": "NTA. This needs to be addressed as it can escalate. 19% of STEM students are female. Many are bullied online for being coders and designers. I've seen threats being dished out on different social media sites. In addition to the punishment, I'd asked him to do some research.  The punishment alone will not teach him to do better.\n\nhttps://www.stemwomen.com/women-in-stem-percentages-of-women-in-stem-statistics",
   "created_utc": 1701010051,
   "score": 6,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaudsaz",
   "message": "You are doing the right thing. Keep it up. No need to let a 14 year old be radicalized on the internet by a bunch of incel neckbeards. There’s plenty of them already, and their version of “reality” is disturbing.",
   "created_utc": 1701012687,
   "score": 5,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karm3zz",
   "message": "NTA I’m glad you aren’t letting this slide. \n\nYou should mention in your post this isn’t the only thing he has to face. Your having serious discussions with him as well. \n\nIf he’s isolated in real life and his online friends are a problem, is there another option for him having a in-person hobby?",
   "created_utc": 1700956267,
   "score": 22,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kar7tfv",
   "message": "NTA, but I would perhaps re-think whether punishment is really going to change his mind or just solidify his beliefs.",
   "created_utc": 1700950745,
   "score": 80,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karpto2",
   "message": "I hope that you are teaching your son how to cook, do his own laundry, and other chores! By the time I was 14 I could cook a meal for 12 people.",
   "created_utc": 1700957710,
   "score": 23,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kasq5bc",
   "message": "Nope. NTA. He needs CONSEQUENCES or he will never get it. Just a joke is the most bullshit excuse...",
   "created_utc": 1700973948,
   "score": 18,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaspiz3",
   "message": "[deleted]",
   "created_utc": 1700973623,
   "score": 20,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kasqoy2",
   "message": "Your husband should be with you telling him to respect women more and he should not be brushing it under the rug... A lot of young men get radicalized and it often starts with misogyny.\n\nNta",
   "created_utc": 1700974237,
   "score": 13,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kar5c1t",
   "message": "INFO: How do you think this will change the behavior?",
   "created_utc": 1700949805,
   "score": 63,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kasl0me",
   "message": "The number of boys growing up who think that being upset by something makes *you* wrong and that literally everything and anything is okay as long as it's \"just a joke\" is too damn high.\n\nAny effort to nip this shit in the bud is necessary. The people who grow up thinking this mentality is okay are some of the worst people on the planet. They get too fucking comfortable dehumanizing people and the next thing you know they're acting like extremists and treating people with cruelty to get their jollies.\n\nBut you NEED to get him to understand why this is wrong. It's not merely a punishable offense. He needs real perspective because that boy is blind to the life experiences of others.",
   "created_utc": 1700971347,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kat3mzm",
   "message": "The only way you messed up here is that it should have also come from your husband.",
   "created_utc": 1700982396,
   "score": 5,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "katanqf",
   "message": "\u0026gt;he's just a teenager, that he will grow and change\n\nHe will grow and change *because* he faced consequences for his actions.",
   "created_utc": 1700987802,
   "score": 6,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaub4r3",
   "message": "Definitely NTA. He needs to understand how much it hurt you, his own mom. Young men need guidance to become good men.",
   "created_utc": 1701011571,
   "score": 6,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kauflkm",
   "message": "NTA. Teach him at 14 so when he's 18 he respects women and their rights. You did a great job.",
   "created_utc": 1701013427,
   "score": 5,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaufp9v",
   "message": "My 2 cents: what you say on the internet stays with you forever.   Even if you delete it, it typically can come back to bite you.  Joking or sarcasm on the internet is often hard to interpret.   He does need to understand even if he doesn't actually perceive women the way he did online, people, especially strangers online will assume he does.  This can hurt his future with jobs and colleges.  Look at all the celebrities who were \"canceled\" for things they did online.   \n\nSeriously though, (if he really does have this mindset), he also should know that as an adult, men AND women are capable and should share cooking and cleaning responsibilities.",
   "created_utc": 1701013470,
   "score": 6,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karsd6x",
   "message": "NTA. But your husband really needs some growing up too, because he’s setting an example here. Teenagers who think and talk/write that kind of trash rarely grow out of it, especially if they aren’t helped by their parents. And especially seeing it’s only mom\u0026amp;sis who had a problem with what he was doing, that dad wasn’t bothered … is just going to cement his BS ideas about women.",
   "created_utc": 1700958715,
   "score": 13,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karnd89",
   "message": "NTA. Punishment fits the crime.",
   "created_utc": 1700956758,
   "score": 14,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karpoas",
   "message": "NTA. Better to nip that behavior from the bud",
   "created_utc": 1700957651,
   "score": 2,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karpp9k",
   "message": "NTA. Save him before he thinks these things are okay!",
   "created_utc": 1700957662,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kartrf3",
   "message": "My son did this as well recently. I told him whatever he says about other women, he says about his mother/sister/grandmothers/teachers etc. Not okay with me!",
   "created_utc": 1700959260,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kartvzr",
   "message": "Fair punishment. Gotta be firm when they try to act like little shits, because that pipeline is a strong one and it turns young men into shitstains.\n\nIt’s also important to educate on why that thinking is wrong, and show love and support as well. But yeah, the firm hand is still justified.",
   "created_utc": 1700959308,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karyiar",
   "message": "Mary Shelly not only wrote an amazing horror story thay has stood the test of time, she revolutionized the entire horror genre *and* invented Science Fiction.  Anyone who wants to tell me the writer of *Frankenstein* belonged in the kitchen needs to have a hell of a resume.  Usually it's a sad whiny man-child (Andrew Tate) who basically just whines on the internet. \n\nNTA. Sometimes being a good parent is removing your child from a toxic environment",
   "created_utc": 1700961252,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karzts1",
   "message": "\"I understand the jokes perfectly well. None of them are new or creative and I've heard them a million times. They're not funny. They're used to hurt people and they aren't okay jokes to be making. Until you demonstrate that you understand that these \"jokes\" are inappropriate and unacceptable with no exceptions, then I am not going to let you continue to spread them.\"",
   "created_utc": 1700961819,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kas4wmf",
   "message": "NTA. I'd of done far more. Like make him step up and do what he was poking fun at. I mean boys got to understand that it's highly unlikely he's going to have a woman around to do his beckon call when he comes of age. Ijs reality is a cold mistress. But no it's good to cut him off from those friends. Heck make him earn it back imo. I mean this is coming from me a guy. Sexist behavior is unacceptable regardless of gender.",
   "created_utc": 1700964010,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kata41d",
   "message": "NTA. Teens will grow and change, the way they change are influenced by the perceived magnitude of their mistakes. Sexism is a big mistake, no matter how commonplace it may be.",
   "created_utc": 1700987369,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "katleh4",
   "message": "NTA\n\nAs a girl on the internet who plays vodeo games, we have to put up with this constantly. The first time is nothing, water off a ducks back....but the 1000th time is like someone has poked you in the same place constantly for days on end and worn you down\n\nHecking sucks. He needs to understand that his jokes aren't funny. \n\nAlso, I'd kick his ass at any video game, then tell him to get in the kitchen because he \"can't even beat a girl at games\" and see how he likes it.",
   "created_utc": 1700996555,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaufo71",
   "message": "NTA - in the future if he (or anyone) says you didn't understand the joke, ask them to explain it to you.  It seems to make people really uncomfortable.  Also your husband is right that your son will grown and change, \\*only\\* if he gets consequences to his actions though.  Like being punished.  I don't know if a month is \"to much\" these days.  When I was a kid it'd have been a week but that was a long time ago.  Good for you for standing your ground",
   "created_utc": 1701013457,
   "score": 4,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kar92vt",
   "message": "NTA\n\nWe live in a world where woman hating incels have committed honest to god terrorist attacks. Maybe your son was joking. At that age, I might have done the same to fit in. Reality is the internet has become something of an extremist echo chamber. The more you hear it, the more you believe it.",
   "created_utc": 1700951210,
   "score": 22,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karmoob",
   "message": "If my 14 year old was doing similar, the natural consequences would be separation from the context, opportunity and company in which he was behaving that way. I dont see that as a punishment I see it is a consequence for a choice he'd made. Youre talking to him, talk from the heart. He needs his father to stand with you  and to also talk to him, his father needs to be a resource here if he has the same beliefs you do. If dad doesn't not have the same beliefs you may have just found your issue.",
   "created_utc": 1700956496,
   "score": 6,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karypo8",
   "message": "Your husband thinks you're overreacting because, frankly, it doesn't affect him. Even decent men have enough distance from the effects of misogyny that it's hard for them to understand just how terrible it is.   \n\n\nPlus, tbh, telling a woman she's overreacting about sexism/misogyny is perpetuating sexism. Maybe hubby needs a bit of education himself.",
   "created_utc": 1700961339,
   "score": 7,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kas7ex5",
   "message": "NTA , I beg you, as a woman, please do everything that's in your power to protect other women and young girls from men who were once \"just boys joking around\" and \"boys will be boys\". You did a good thing mama, raise your kid to become a man, make his future wife happy to have him in her life, make her be proud of the man she calls her husband.  You have a big responsability mama, you are making of your child who he's going to become in the future.",
   "created_utc": 1700965152,
   "score": 15,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kasrba5",
   "message": "Opinion from a 63M. NTA. \n\nI don't generally like pink/blue gender role sorts of characterizations but I sure would use them here. \n\nA month may seem like a long time for a 14 year old but it isn't. I personally would have gone further. Clean all the toilets in the house for a month, and the bathroom he uses (regardless of who else uses it) until he moves out someday. Schedule that. If he doesn't do his own laundry, he does now. All the trash in the house out the night before pickup day. He's old enough to contribute to the household that supports him. Does he know how to cook? He has to learn to someday be a self-sufficient adult. All of this is not punishment. It's the realization sparked by his poor behavior that he isn't pulling his weight. \n\nI'd have your daughter start helping with car maintenance. A 17F can learn to change the oil for example. Pushing a lawn mower. \n\n[Grow good adults.](https://www.goodreads.com/quotes/12051-a-human-being-should-be-able-to-change-a-diaper)",
   "created_utc": 1700974567,
   "score": 10,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kargmnx",
   "message": "NTA. A universal truth is that 14 year olds tend to be dangerous mixes of stupid and impressionable. I don’t think removing gaming from his life is the right move. But, he needs to learn from better sources than Andrew Tate. \n\nIf he starts harboring these feelings in secret out of fear of punishment, it’ll be even worse for all the women unlucky enough to cross his path.",
   "created_utc": 1700954109,
   "score": 12,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karceff",
   "message": "[deleted]",
   "created_utc": 1700952496,
   "score": 24,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "karodpl",
   "message": "NTA",
   "created_utc": 1700957147,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kassx6x",
   "message": "This is going to go well. Kid talks shit on women so a woman punishes him. I bet you within 48 hours he trash talking more women. \n\nAs for the punishment. Good for you, your 14 year old is viewed by his father as not having many friends and you just took some more away. Great parenting. Now your kid is bored and lonely and becoming an outcast. I bet that will help him! \n\nNow the reason why your husband didn’t agree with your punishment is because I can almost for certain bet that he has in the last 6 months been online laughing at sexist memes and making sexist jokes with friends. \n\nIn a digital world punishing a kid by taking away his digital items will not teach him to be a better person but to hide his shit better \n\nOh and lastly I forgot in the first part. His sister told on him to his mother. Yeah. That will make him like and treat women better! \n\nPunishment does not = parenting. \n\nYTA",
   "created_utc": 1700975464,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kasz0hq",
   "message": "This is part of a larger question: What is the best way to fight bigotry? My general feeling is that he will improve as he interacts with women more. Sounds like all of his current friends are male. Is there some way to encourage him to add girls to his group of friends?",
   "created_utc": 1700979169,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kau9750",
   "message": "make him do the household chores he thinks you're only useful for until you feel as if he learned his lesson, and you can take his devices until its done to your liking",
   "created_utc": 1701010728,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kau9gao",
   "message": "Watch out for signs of Andrew Tate worship.",
   "created_utc": 1701010841,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaubd42",
   "message": "There are two dangerous things here: 1 is your son's nascent sexism. The other is his being a follower.  If he knew better and did it anyway to 'belong' - that will be terrible for him in his life. So No, I don't think you were too harsh. He's 14 and probably shouldn't have an online presence anyway and certainly not a toxic one. Make sure he is fluent and capable in all those tasks sexists think belong to women - vacuuming, cleaning the toilet, cooking. Make these his chores and give your daughter the mowing, etc. Perhaps he can earn back some privileges when he shows the maturity to do what's right and not follow what others are doing.",
   "created_utc": 1701011672,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaublfe",
   "message": "Scold his ass",
   "created_utc": 1701011770,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kaubrap",
   "message": "NTA.  I wouldn't buy his bs either.  If he wants to grow up to be a toxic incel pos, he can do it in his own house.\n\nGood move banning the online games.  Dudes like that are a bad influence, and there's no real way for you to police who exactly he hangs out with online unless you want to be in the chat with them.",
   "created_utc": 1701011840,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kauc46q",
   "message": "NTA. There is so much Andrew Tate going on here. Stand your ground and use it as a teachable experience.",
   "created_utc": 1701011992,
   "score": 3,
   "submission_id": "183ur1g"
  },
  {
   "comment_id": "kas43o7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183ur1g"
  }
 ]
}