{
 "submission_id": "183vdc9",
 "title": "AITAH for not telling my girlfriend that my brother is a registered sex offender??",
 "selftext": "**I DO NOT CONDONE ANYTHING MY BROTHER DID. I DON'T DEFEND HIM OR SAY HE IS INNOCENT.** One of my brothers is a registered sex offender. He can't be around anyone under 18 ever again, and live or otherwise be around places like schools and daycares. In addition he has to inform the court if he enters into a romantic relationship with a woman so the court can notify her of my brother's record towards women. Look, like I said above I don't condone anything my brother does. His crimes were awful and I don't defend him. I try not be around him if I can help it.\n\nHe was at Thanksgiving dinner because my mom invited him and she and my stepdad were hosting. Afterwards my mom asked me to drive him and one of my other siblings home. My girlfriend found out about my brother because of the sign on his lawn that he's required to have due to his status. She's angry I didn't tell her about my brother. It's not like I defend him and I don't get why his crimes have anything to do with me. We don't want kids and I would never leave her alone with him. I also don't think people should be judged on the things people who happen to share the same DNA do. I had nothing to do with anything my brother did. I don't defend him or even like him much. I don't even have his phone number or anything.\n\nMy girlfriend says I shouldn't want to be around him. I don't like being around him but it wasn't my decision to invite him to Thanksgiving and it wasn't my house so I had no say. We were talking about moving in together soon. My girlfriend says it's on hold because she doesn't know who I am. I don't understand why she is angry. I am not my brother and I do nothing to defend or justify the horrible things he's done.",
 "created_utc": 1700951337,
 "permalink": "/r/AITAH/comments/183vdc9/aitah_for_not_telling_my_girlfriend_that_my/",
 "score": 226,
 "url": "https://www.reddit.com/r/AITAH/comments/183vdc9/aitah_for_not_telling_my_girlfriend_that_my/",
 "comments": [
  {
   "comment_id": "karaoxr",
   "message": "My dude, if you're planning on moving in together, your brother not being allowed near a Chuck E Cheeses should have been mentioned.  You definitely should have told her that she was going to be having Thanksgiving fucking Dinner with a guy who has to have \"Here Resides the Pedophile\" written on a lawn sign!\n\nWhether you condone of his actions or not, keeping the fact that he's a predator while introducing him to her for a family dinner was wrong.  You took her option away from her.  YTA",
   "created_utc": 1700951840,
   "score": 30,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karvyir",
   "message": "What? I knew all about my future BIL and his fuckups and why him and my husband are not close whatsoever within like the first couple months of dating. And BIL not even a pedophile, just a regular ol asshole lol\n\nShe’s not judging you for what he did, she’s judging you for what you did. Which is keep this info from her which takes away her ability to make decisions about her own safety and who she’s around. I would have declined to go to your thanksgiving where your family just overlooks his crimes. Frankly I’d stop dating you because I don’t want a MIL and husband who rug sweep what their family member has done.",
   "created_utc": 1700960163,
   "score": 231,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karukgu",
   "message": "That’s kinda something you should mention… like bro, you SHOULD have told her BEFORE she ever had a chance to meet or be in the same vicinity of your brother.\n\nYou may not condone his actions but you did keep it secret from someone who should be important to you. YTA",
   "created_utc": 1700959586,
   "score": 92,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karwj44",
   "message": "YTA.\n\nYou are correct in thinking you shouldn't be judged by what your brother has done. BUT you absolutely should be judged for hiding it from your girlfriend. If he has to have a fucking sign in his yard and the court has to warn his future girlfriends; every man, woman, and child that is in your life needs to know about him. You just let your girlfriend know her safety doesn't mean shit to you. You had her in a car with a sexual predator. \n\nAnd you did have a choice. Yes, it's your parents house. Yes, they have control over who they invite. BUT you should draw the line at attending any family function where he is around.\n\nEdited for spelling.",
   "created_utc": 1700960407,
   "score": 6,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karme3m",
   "message": "You are not your brother and nobody is judging you based on your actions.\n\nShe, and I, are judging you based on your actions. \n\nYou were okay going to a dinner with what appears to be a child rapist, you were okay driving him around.\n\nYOU refused to give your girlfriend the option to say if she was okay with either of those things.\n\nYou are becoming single because of what YOU did.\n\nYTA.",
   "created_utc": 1700956377,
   "score": 60,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karl1t9",
   "message": "You don’t think he is safe enough to be around her alone yet you didn’t give her the information that he is dangerous and allow her to leave.  Then you put him in the same car with her.  Yeah your whole family including you is a pack of assholes if he is dangerous like you are surmising.\n\nShe is mad at you for not informing her she was in danger, not because he is your brother.  The fact you don’t get that is beyond unreasonable, YTA",
   "created_utc": 1700955843,
   "score": 49,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karisii",
   "message": "YTA You didn’t tell her in advance so she could prepare and feel safe if she was around him, the only reason she found out is because of the signs that he legally has to have out otherwise would you ever have told her? Now she realises that your parents have no issue having a sex offender in the house so how will she feel safe around them at future events?",
   "created_utc": 1700954951,
   "score": 143,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karcjhd",
   "message": "You are defending him by not telling people, by choosing to keep socialising with him, by not drawing a line with people at having him at thanksgiving. You are being complicit with a sex offender being welcomed by family for thanksgiving. You need to read that again and again until you can see how fucking disgraceful you and your family are. *You are all allowing him to continue to come to family events by not saying anything about it. That is defending him.*\n\nI seriously hope this is ragebait because what the fuck",
   "created_utc": 1700952549,
   "score": 73,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas40gb",
   "message": "You let her find out from a LAWN SIGN after she had a holiday meal with him and was stuck in a car with him??? really?\n\nShe had a right to decide to eat in a house with him. I would not have gone.",
   "created_utc": 1700963615,
   "score": 74,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas403s",
   "message": "\"My family keeps poison in a wine bottle on the table, but since I'll never leave my girlfriend alone with the wine bottle and will constantly watch to be sure she doesn't drink from it, it was okay that I didn't tell her it was poisoned.\" \n\nYeah no. You don't get to make decisions about your girlfriend's safety for her. She needs to have all the information because you can't magically predict what will or will not happen. YTA",
   "created_utc": 1700963611,
   "score": 97,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karcarv",
   "message": "YTA. What the fuck bro..",
   "created_utc": 1700952457,
   "score": 168,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karw8ps",
   "message": "YTA. You stole her agency. She had every right BEFORE hand to know he was going to be there so SHE could decide if she wanted to be there.  WTAF is wrong with you that you even have to ASK this question!?!?",
   "created_utc": 1700960284,
   "score": 67,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karwjpg",
   "message": "YTA \n\nYour silence and secrecy is condoning his behaviour. She needs to leave you if you’ll hide something THIS huge from her. You can’t be trusted.",
   "created_utc": 1700960414,
   "score": 36,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karm7il",
   "message": "1. How long were you planning on hiding it? \n\n2. Exactly how were you planning on hiding it? \n\nHe’s registered, there’s a damn sign outside his house, his partners will be informed by the court itself, in what world did you think you would be able to sweep this under the rug?",
   "created_utc": 1700956306,
   "score": 48,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karu3wv",
   "message": "YTA.  She should know this if she was ever going to be in any sort of contact with him.",
   "created_utc": 1700959397,
   "score": 46,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karxd1o",
   "message": "You are most definitely TA. Of course you should’ve told her, she is your girlfriend. She deserves to know that she is going to be around a registered sex offender for Thanksgiving. I mean, come on, she could’ve been in danger and she wasn’t even aware of it. Women have to watch out for themselves all the time because of things like this. And on top of that, if you love her and want to be in her life, then she absolutely deserves to know about something like this. You’re not the sex offender, but someone directly related to you is, which means he’s part of your life and would be part of hers too. Come on dude, she is very rightfully angry",
   "created_utc": 1700960762,
   "score": 28,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karzlm0",
   "message": "YTA\n\nLet's reframe this. Imagine your family has a dog that's had a history of biting people, but they choose to keep it. Would you tell your girlfriend so she could avoid the dog? \n\nSame concept. The courts ruled he's dangerous to children and women, your girlfriend is a potential victim. Not informing her makes it so she isn't aware of the issue and could get hurt. Your discomfort is not more important than your girlfriend's safety. It doesn't matter if you would \"never leave her alone with him\" it should be her choice whether she wants to even exist in the same room and share a meal with a convicted sex offender. Full stop.",
   "created_utc": 1700961722,
   "score": 29,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas4ipr",
   "message": "Apart from all the other reasons everyone has pointed out, YOU ALSO DROVE HIM HOME WITH YOUR GF IN THE CAR. Wtf?!",
   "created_utc": 1700963841,
   "score": 29,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karycuo",
   "message": "What in the actual HELL did I just read. 😳\n\nLook, I believe you when you say you don’t defend your brother, his crimes were terrible, etc. But this is a REALLY BIG THING to keep from someone with whom you’re clearly wanting to keep around for the long haul. I mean, before my then-boyfriend, now-husband met my extended family several years back, I warned him about my grandparents, who were both alcoholics and could get snappy at each other after they’d each had a few. Was I responsible for their choices or behavior? Of course not, they were in their 80s and I was 21. Did I “owe” anyone an explanation for the way they acted around alcohol? Technically no, but I felt it was the right thing to do. I didn’t think he would leave me over it or anything, but giving people a heads up about problematic relatives is just common sense, as far as I’m concerned. (Btw, my husband appreciated the heads up, and he certainly didn’t judge me, even after seeing my grandpa polish off nearly an entire bottle of gin).\n\nAnd I was giving an example of alcoholic grandparents. Not a sex offender sibling. Just how long were you planning on keeping this from your girlfriend? Of freaking course she’s mad at you; not only does it give the impression that you’re perfectly fine with keeping important information from her, but your blasé attitude of, “yeah, he did terrible things, and I was okay with having a holiday dinner with him and driving him home afterwards, but I didn’t do those things, so what’s the big deal” is….off putting. At best. Your brother committed terrible crimes against children, and it also looks like women. No, you are not your brother and you are not responsible for his crimes, but you shouldn’t agree to be around him, ever. I don’t blame your girlfriend at all for never wanting to be around him.",
   "created_utc": 1700961186,
   "score": 14,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karnhwx",
   "message": "YTA \n\nI would seriously break up with someone over this. \n\nIt’s baffling that you did not tell her. I don’t blame your gf, I wouldn’t continue the relationship because I would never feel safe and I’ll forever be disgusted 🤢 \n\nWelcoming a pedophile sex offender to thanksgiving is seriously fucked up . It’s clear that you stand by his actions.",
   "created_utc": 1700956809,
   "score": 47,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karkovi",
   "message": "Yta you put her in a potentially dangerous situation and didn’t warn her. You don’t care about her well being",
   "created_utc": 1700955704,
   "score": 60,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas1o17",
   "message": "YTA. If I were her, I’d run for the hills because you wouldn’t be trusted to have sound enough judgment about folks to keep any potential children safe. You also potentially put your GF at risk because your brother IS that kind of predator. You’ve got your head a little too deep in the sand in the name family ties. 🚩🚩🚩🚩🚩",
   "created_utc": 1700962607,
   "score": 26,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas1xa3",
   "message": "All you needed to say was \"I don't spend time with my brother normally. He will be there at Thanksgiving. He isn't a safe person so my plan is we go but avoid him. I don't want to miss out of Thanksgiving and seeing other people I love. Definitely avoid being alone with him. If something happens and you are uncomfortable, let me know and we can leave right away.\"\n\nThen you discuss it. \n\nActing like it was none of her business and she didn't deserve a heads up from\n You is total YTA.",
   "created_utc": 1700962718,
   "score": 27,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas66vo",
   "message": "Holy shit!!! You are so much TA!! Has to notify the court if he gets into a relationship with woman and you don't want to tell your girlfriend that you are exposing her to a *dangerous person* because he's *your brother*??!!??\n\n**YTA**",
   "created_utc": 1700964599,
   "score": 11,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karx4yg",
   "message": "YTA for forcing your girlfriend to be around a sexual predator unknowingly. It’s your choice to be around him at your parent’s home, but you violated her trust and agency by not disclosing this. And as he’s such a monster police call girlfriends you’re actively exposing her to danger.",
   "created_utc": 1700960666,
   "score": 29,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katfjnp",
   "message": "Do you have to mention what your brother did on your first date? No.   \nDo you have to inform your girlfriend of what your brother did/ why he is dangerous before she MEETS HIM? Yes. Absolutely yes. This is not about her judging you for what your brother did, this is about warning her and giving her a choice of wanting to be in the same room or not. YTAH.",
   "created_utc": 1700991793,
   "score": 10,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karw27y",
   "message": "Literally how much do you want to make her feel unsafe, uncomfortable, and resent you? \n\nYou literally put her in an unsafe environment by not informing her that someone with female related hating tendencies resides. Gosh is she gonna be in his hit list?",
   "created_utc": 1700960207,
   "score": 20,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karwlz3",
   "message": "Um….. yes yta… obviously????!",
   "created_utc": 1700960441,
   "score": 18,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karyvka",
   "message": "YTA. You kept from her the fact that she was in danger and the fact that you and your family still interact with him displays way too much acceptance. Even just giving him a lift, and including attending any event he is present at. Your mother and stepfather are also foul people for keeping him in their lives.",
   "created_utc": 1700961411,
   "score": 18,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas3ob4",
   "message": "This is a woman’s collective headspace just walking to her car after work. “Keys gripped in fist for using as a weapon-check. Look up and around like a fucking owl all the way to the car-check. I think I see a man or men in the shadows…make evil and scary faces like you are insane to keep from being a target-check. Enter car like your ass is on fire, lock all the doors and practically peel out-check.”\nThat is why she’s upset. Anywhere with family, or future family, must be her safe space. YTA by not respecting her enough to have her sixth sense working. Men do not have to do the crazy “check list” every fucking day…just trying to get to the fucking car!  YTA, and that is why she’s doing a deep dive rethink on you.",
   "created_utc": 1700963472,
   "score": 19,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karste1",
   "message": "Yes YTA. How dare you keep that choice from her. I would want that information as another man and not in a relationship. Why would I want to associate with a piece of shit.",
   "created_utc": 1700958896,
   "score": 16,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karxup7",
   "message": "YTA. Communication is important. You took away her informed decision about wanting to be near him ever. Period",
   "created_utc": 1700960970,
   "score": 17,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karyd0x",
   "message": "YTA. How did you think this was going to go over? She deserved to have that information so she could decide if she would want to be in his presence or not.",
   "created_utc": 1700961188,
   "score": 17,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karzt0g",
   "message": "YTA you are protecting your brother by not telling people\n\nHope she breaks up with you and your crappy attitude",
   "created_utc": 1700961810,
   "score": 17,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas1a4v",
   "message": "YTA. You lied by omission which also means you're passively condoning his actions. If I was her, that would be a dealbreaker. What else are you keeping from her?",
   "created_utc": 1700962445,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasazz1",
   "message": "I think plenty have said that YTA and should have told her. One reason you needed to tell her before she met him is that she would have been informed. This is important because even if you never intended for her to be alone with him that situation could have happened. She could have run into him in public and would not have known he could not be trusted. He could have easily gotten her alone at that point. She needed to know about your brother the minute you started introducing her to your family. You denied her the ability to make an informed decision about interacting with someone that is dangerous for her.",
   "created_utc": 1700966790,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasb299",
   "message": "YTA \n\nYeah, you are so wrong, that is something that needs to be told beforehand. \n\nShe’s not judging you for your relationship, she’s judging you for hiding a very serious thing. Dude. Come on…he’s a predator.",
   "created_utc": 1700966819,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karziu6",
   "message": "What? OF COURSE YTA!!! Why wouldn’t you ever tell someone, especially someone you plan to marry, that t your brothers a pedo? If he was coming, you should t be around him! The fact they’re inviting him to thanksgiving says a lot!!! You should’ve told her when y’all started dating!!",
   "created_utc": 1700961689,
   "score": 15,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karxkno",
   "message": "YT MASSIVE A.",
   "created_utc": 1700960851,
   "score": 13,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas4jan",
   "message": "YTA. You should absolutely have warned her. What if he had got her alone because she wasn’t being cautious and had gone somewhere with him or where he could follow and you didn’t realize and she didn’t know to be on guard. Say she went to use a secondary bathroom upstairs or downstairs because the main one was full. Or went outside to get something from the car that she forgot or put something there for safekeeping. \n\nYou shouldn’t be judged by your brothers actions…but you should ensure that, since you are knowingly exposing her to him, that she knows that she should be on guard or can choose not to attend events where your brother will be in attendance",
   "created_utc": 1700963848,
   "score": 14,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat1hg9",
   "message": "YTA he has to have a sign in his front yard and has to notify the court if he is in a relationship with a woman so the court can let her know what he’s done. Good lord the court cares more about your girlfriend than you do. She’s not judging you for his actions she’s mad that you didn’t give her the opportunity to make a decision for herself. You could have put her in danger with information she may have given in conversation.",
   "created_utc": 1700980849,
   "score": 13,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas16xs",
   "message": "YTA- Accept it.",
   "created_utc": 1700962406,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat2f89",
   "message": "Ok, so we, too, have a brother who is a sex offender,  hard core, kids, and all. He's done it his whole life. You should have definitely told her about that beforehand. I would not have gone if I were her. Shit if I were you, I wouldn't have gone. Eff all that. Mom, you want him there cool, but I'm not going to be a part of it. He'd catch hands. I'm not nice to sexual offenders. Of course, this is my personal feelings on it. I don't expect you to do the same, but some people wouldn't even go just because he would be there.\n\nIm sure you would look out for her with him, but Your GF should have had the chance to make that same choice for herself. Sorry, my dude. You fucked up.",
   "created_utc": 1700981514,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katf5z1",
   "message": "YTA. She should definitely head for the hills! You should have been real upfront about this tidbit of information right away. Then you spend time with him? You gave him a ride( because your mommy told you too)? Was your girlfriend riding in the same vehicle when this ride happened? Dude, you suck!",
   "created_utc": 1700991479,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katg20e",
   "message": "Yes, YTA. The courts have decided your brother is extremely unsafe to be around women and children.  This isn’t about it being your fault, or your condoning your brother’s actions. \n\nIt’s about your hiding from your girlfriend the fact that it is unsafe for her to be around him. You cannot guarantee that she would never be alone with him: what if you got severe food poisoning or had a heart attack and had to be rushed to the hospital? What if she runs into him some time when you’re not around, like at the gas station or grocery store, and he asks her for a ride or to come help him with picking out a surprise for your birthday? What if she unwittingly mentioned where she lives, where any of her siblings with kids live, etc?\n\nWhat you did was extremely irresponsible and EXTREMELY unsafe for her. \n\nAnd lots of couple say they don’t want to have children, and then later end up having children. What if your birth control fails and she changes her mind? That happens!\n\nThe fact that the court insists on personally informing any woman he might date about him says your brother is an extreme PREDATOR, and is a  danger to any woman or child. Again, this doesn’t make it your fault, and doesn’t imply you condone what he did. \n\nBut you MUST tell anyone you date ALL about this, including the judicial warnings, even if they aren’t going to meet him at a family event, because he could encounter them without you and you would then be partly responsible for what he did to them because you haven’t warned them that they should NOT agree to go anywhere with him. For example, consider what could happen if your brother finds out you have a new girlfriend (from your social media or your parents), and decides to go over to your place to “meet” her some time when he knows you won’t be there. \n\nI’m sorry you are burdened with this situation, but you need to be responsible and tell any future girlfriend pretty early on about precisely how dangerous the courts have determined your brother is so that they don’t end up one of his victims.\n\nAnd you should apologize profusely to your girlfriend.",
   "created_utc": 1700992212,
   "score": 7,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas4390",
   "message": "The intention to not disclose this seems like deception.  Not cool to put someone in that position - transparency in relationships is vital.",
   "created_utc": 1700963651,
   "score": 12,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas6r15",
   "message": "You don’t understand why she’s angry?  Given the statistics, there is a decent chance that your girlfriend is a SA survivor, and an even greater chance that someone close to her has been.  You just denied her the opportunity to decide for herself whether she wants to be in the company of an abuser. And she also just learned that apparently both you and your family are ok with your brother being around at family events, and presumably that is not going to change. And to top it all off you are being totally dismissive and invalidating of her feelings.  YTA.",
   "created_utc": 1700964851,
   "score": 13,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas6j5f",
   "message": "You didn’t protect your girlfriend, that’s the issue. \n\nHe has to let the government know when he enters into a relationship so they can be warned about him. But you didn’t think your girlfriend was entitled to that informatjon too? You didn’t think of her safety and protection at all. \n\nI’d never speak to you again. Pretty sure your girlfriend isn’t going to either and I don’t blame her.",
   "created_utc": 1700964755,
   "score": 14,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas6pey",
   "message": "The fact that you even need to ask AITAH in this situation is a HUGE red flag 🚩",
   "created_utc": 1700964832,
   "score": 11,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas1amy",
   "message": "YTA, \nShe has every right to know for her own safety. Holy moly. Idk how you can think it’s okay to not have told her.",
   "created_utc": 1700962451,
   "score": 6,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas1v97",
   "message": "Why would you talk to a chomo??? \n\nDont give a fuck if hes your brother.\n\nFuck that goof!! And all his budds.",
   "created_utc": 1700962694,
   "score": 6,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas93a3",
   "message": "You are the biggest Dumbass and a$$hole, so def YTA.\n\nI don’t have to deal with it as through out my life my parents and family have kept him from me (he was also in jail) but one of my uncles is a predator and has to have the sign as well. He does live with my aunt(he is her son) which saddens me cause she focuses on him more than me now (I am ok with this now) but because of his past I don’t speak with my aunt as she thinks he did nothing wrong even with the evidence in the court case. But even I know that if I was in contact or near them I would definitely notify my partner (and I actually have so that he is aware of it in case). In my case me and my parent aren’t in danger of him but I still has the sense of telling my partner about him and how if anything from him occurs to ignore and report. You put your gf in danger and you willingly choose to be around him yet “I don’t condone what he did”. yeah right.",
   "created_utc": 1700965928,
   "score": 6,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katbsmu",
   "message": "\u0026gt;I don't like being around him but it wasn't my decision to invite him to Thanksgiving and it wasn't my house so I had no say.\n\nHorseshit. You have a say in whether or not you spend time with him. It is as simple as \"I won't be coming to Thanksgiving dinner since you've invited a scumbag kiddie rapist.\" And your girlfriend had every right to refuse to spend a holiday with a kiddie rapist. \n\nI had a BFF and we were quite close. She has a *lot* of siblings. I was aware that her past involved one of her many brothers raping her when she was a child and him spending time in juvenile detention. I also knew that she had made a choice to sweep it under the rug. What I didn't know when she invited me in a professional capacity to do some work for her brother who was starting a business was that she was inviting me to work with a kiddie rapist. She told me that it was *that* brother after I had worked with him alone. I was literally sick. I have never and will never forgive her for that, it was the end of our friendship. \n\nSimilarly, I suspect this is the end of your relationship. Because you knowingly and intentionally subjected your girlfriend to spending time with a kiddie rapist without her consent. There is no fucking world where that is okay, and it's sick as fuck that you think it was.",
   "created_utc": 1700988720,
   "score": 5,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katc3d2",
   "message": "YTA.  You brought her around someone dangerous to her and didn't even think that she deserved forewarning.",
   "created_utc": 1700988963,
   "score": 6,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karibby",
   "message": "YTA",
   "created_utc": 1700954769,
   "score": 11,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas4qy7",
   "message": "YTA. Yikes dude",
   "created_utc": 1700963941,
   "score": 11,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas822p",
   "message": "If the authorities think it proper to go out of their way to notify complete strangers when he's around so they can keep themselves safe, it's probably good that you give the same courtesy to someone who is going to be in the same room as him. And by telling her ahead of time, you can get ahead of it and make it clear you don't condone his behavior or care for him as a person. The way you played it makes it seem you support him or want to help him hide it. In the future, be fully transparent about it every single time.",
   "created_utc": 1700965447,
   "score": 11,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat11i2",
   "message": "Conversation should have gone like this: (hangs up phone call with mom) “ugh, my disgusting pedophile brother will be at Thanksgiving.” GF: “wut 😦” “my brother is a disgust pedophile and must do (list of things). Do you still want to come”\n\nYTA. She should have been warned ahead of time.",
   "created_utc": 1700980543,
   "score": 5,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katdxtv",
   "message": "You let her be around someone who is potentially extremely dangerous to her, without any warning or anything. Your entire attitude about this is wrong. She isn't judging you for his actions, she's judging you because YOU did not make her aware of a very real danger she would be near.\n\nGrow up and enter the real world, where women have to look over their shoulder every waking minute to avoid evil men like your brother.\n\nYTA for not telling her.",
   "created_utc": 1700990476,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katg2bv",
   "message": "(You're the AH but not necessarily a bad person) THIS IS DEVIDED IN SECTIONS: WHAT YOU SHOULD DO, WHAT YOU GOTTA REALISE, CONCLUSION\n\nHere's what you should do:\n\nYou should apologise for letting her meet your brother without her knowledge of his actions. Apologise for not thinking that it was a big deal - because obviously she's uncomfortable having been around a sex offender without knowing. Most people would be. \nNeither of you are a bad person necessarily but you should apologise to her. You're responsible for not telling her. You can't undo her meeting him and you can't control if she'll forgive you or not, everyone is different.\nTake the responsibility. Just don't get mad at her for having a strong reaction - if she does/did have one.\n\nHere's what you gotta realise:\n\nYou know your brother but you gotta realise other people don't. You know it in theory but you don’t REALLY know it. If someone isn't comfortable being around a sex offender, they won't get happy if they meet one without their knowledge – especially when it could've been prevented. Even if someone meets your brother only for a short period of time, it's still a big deal. You just don't realise it because he's your brother.\n\nIn conclusion:\n\nYou are the AH but not necessarily a bad person depending on where you take it from here. Apologise to your girlfriend and realise not telling people before meeting him IS a big deal.",
   "created_utc": 1700992220,
   "score": 6,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katt83e",
   "message": "YTA.\n\nYou didn't tell her because it would make your life difficult. She would refuse to be around him, obviously. \n\nBut she also wouldn't have went to Thanksgiving either and that wasn't an option for you.\n\nYou endangered her. What if they met in public? She doesn't know and just assumes, oh it's my bfs brother. I can trust him. Only She can't and she didn't know that.\n\nI'm a ER nurse of 12 years. I have seen some shit. Women and children that I've had to help after someone like your brother was finished with them. Your brother and men like him don't just break bodies. They destroy souls.\n\nYou had no right not to tell her and let her make her own informed decision. But that would mean rocking the boat. Btw, men never grow out of their sexual desires... they get more comfortable in them. They lean into them. It's not like your brother will change and not be a threat to her. So yes, you endangered her.",
   "created_utc": 1701002408,
   "score": 5,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "karynqb",
   "message": "Bruh",
   "created_utc": 1700961316,
   "score": 10,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas396u",
   "message": "YTA\n\nYour brother is a violent criminal who the court decided is  unsafe  around BOTH kids and women.  Of course you should have told your GF about that.",
   "created_utc": 1700963294,
   "score": 9,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas594x",
   "message": "This is bad.",
   "created_utc": 1700964167,
   "score": 10,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas5c1y",
   "message": "\u0026gt;and I would never leave her alone with him\n\nBut you didn't think she needed to know that? You brought her in close proximity with someone you would never eave her alone with because he has a history of hurting people, *but you didn't think that was relevant to mention??* \n\nYTA I wouldn't be able to forgive you. You took away her agency. She probably would have made much different choices, like getting into a car with him? If she had been adequately informed. That makes this a lie by omission. A lie by omission that affected her safety and violated her morals.",
   "created_utc": 1700964203,
   "score": 9,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas5wom",
   "message": "YTA\n\nWho the fuck let's a convicted pedo/offender near their gf without so much as a warning? Why arr you even there if he is there?",
   "created_utc": 1700964467,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas6wgf",
   "message": "YTA.  For not telling your girlfriend, for having dinner with this guy and for driving him around.  I find it totally unbelievable that you would attend that dinner with him there.  What is wrong with you?",
   "created_utc": 1700964918,
   "score": 5,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas7gr3",
   "message": "So here is the line of YTA and nta that I think most people have overlooked and haven’t mentioned. \n\nSo it was ok your didn’t tell her as she never met or around him. The he moment you decided to take her into his vicinity and didn’t tell her. You are the asshole. \n\nHaving him in a car with her and still uninformed makes you a major piece of shit. You failed to do your job and informing her of him. \n\nHow it should have gone down at the bare minimum would have been when you learned he would be there that you informed your gf of the situation. Now I believe you intentionally didn’t tell her about him because you knew she would have noped the fuck out. Which means you are a fucking deplorable human being. \n\nYou know women must be warned by court order about him and you didn’t warn girlfriend. \n\nFUCK YTA",
   "created_utc": 1700965176,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kas8vlx",
   "message": "You cannot be these stupid.  You let her in the same company and in the SAME car as him.\n A known violent sexual offender.  Without her knowledge or consent.  You have shown you will not create a No contact boundary (you could have asked if he was going to be there, you could (should) inform you family you want no contact with him.  Your mother has no right to ask you to take him home and you should have said no.  Since hon allow contact with him,  she has to decide if she’s willing to be in a relationship with you.  Which includes house\nFamily.  Which includes your violent sexual offending brother. \nHow dare you not inform her.  \n\nIf you want any woman in your life you have to cut him out of it.  And if you’re family won’t you’ll need to tell your mother you won’t be in his presence and she needs to see you separately.",
   "created_utc": 1700965828,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasjgkm",
   "message": "YTA.  My God.  You can’t imagine a scenario where she might run into him somewhere, not know this, and get in a situation UNKNOWINGLY that puts her in danger?  Frankly, you’re as much of a red flag as he is.",
   "created_utc": 1700970647,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kaslu05",
   "message": "YTA\n\nYou did not give her all the information she needed to make informed decisions. What if she walked off to the bathroom and he followed her? What if she was friendly with him and he got attached to her and started stalking her? Why the fuck don't you think she should know when someone that violent is going to be near her?\n\nYou brought her around him. You put her in danger. She wouldn't be near him if it wasn't for you.",
   "created_utc": 1700971737,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat19es",
   "message": "Sign on his LAWN?????  In what state is THAT?  I do no believe this story.",
   "created_utc": 1700980695,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat2hva",
   "message": "You fucked up, should of told her. You did protect your brother by not warning your gf ahead of time. \n\nYou can’t imagine why she’s angry? Jesus Christ you’re as bright as a rock",
   "created_utc": 1700981567,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat2lm6",
   "message": "This is something you reveal after like a month of dating when talk about meeting family at some point comes up. Why wouldn't she be upset she was forced to be around a pedophile without knowing prior?",
   "created_utc": 1700981643,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat2tll",
   "message": "it wasn’t your decision to invite him but it was you decision to go and be around him and let him around your gf. why would you even want to be around your family when they are obviously ok with him being a predator? your gf deserves to know so she can make an educated decision on who she wants to be around, especially as a woman.",
   "created_utc": 1700981806,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kauwfr3",
   "message": "We are always cautious about tales of sa and worse when it comes to women. Do you not think that this was a traumatic event for OP. We as a society are so caring and understanding of women's trauma and downplaying of mens that even when its written here, a majority of people are speaking to his girlfriends potential trauma than taking a second to actually think about his realized trauma. He went full blown no contact. There is trauma there, yet people are freely saying YTA. If this happened while he lived at home or was in school, you don't think he was shunned or harassed? There's a reason he doesn't speak about his brother. OP, NTA. For those that downplay his trauma, say he should isolate himself from the rest of the family, and then replay his trauma when he has to explain it all right before the holiday to his girlfriend who, by her actions would judge him anyway and probably ask a million questions that upset him. You are all collective assholes.",
   "created_utc": 1701019938,
   "score": 4,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat1py0",
   "message": "The problem is that you didn’t tell her, my dude.",
   "created_utc": 1700981012,
   "score": 8,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasnusc",
   "message": "Yes, 100% YTA.  How can you be oblivious to the fact that most people would be HORRIFIED to pull up to a house with that scarlet letter for any reason, much less after realizing you just shared a table and car ride with the offender.   I would have broken up with you immediately.  I'd feel like if you could hide the fact that your brother is a violent offender, and remove my choice to decide whether to be around him, what else might you be hiding? Plus, I could not love someone who willingly associates with any violent sex offender, family or not.",
   "created_utc": 1700972749,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kaspsg8",
   "message": "\u0026gt; We don't want kids and I would never leave her alone with him. \n\nHave you consider that:\n\n1. Accidents happen and even if she also doesn't want kids she could change her mind and end up having it.\n2. You cannot be everywhere evertytime.\n3. He could not care if he has to go through you.\n4. You OWE your love ones not to put them in danger? At the very least you could inform them and ALLOW them the possibility to decide by themselves?\n5. Maybe hiding sentive information can be negative if you want to appear trust-worthy and honest with your partner.\n\nYTA",
   "created_utc": 1700973761,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kaspz2t",
   "message": "So listen, I'm in a similar boat as you.  My brother is currently in prison for a crime that's likely along the same lines as yours.\n\nIf you ever jump back into the dating pool, this is something you need to tell the person you're dating early on.  You don't have to drop it on the first date, but they need to know this before getting into a relationship with you.  \n\nThe right person won't judge you for having an estranged family member who's a convicted sex offender.  But they will judge you when they find out via lawn sign at a Thanksgiving dinner they are attending.  You kinda blindsided her with this and I don't blame her whatsoever for being upset.  You didn't give her the option to not attend Thanksgiving because you lied by omission  and now you're dodging responsibility.",
   "created_utc": 1700973857,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasq66w",
   "message": "HE IS DANGEROUS TO YOUR GF.  Should’ve told her.  I wouldn’t want to date you anymore either.  Good luck.  YTA.",
   "created_utc": 1700973961,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasv0at",
   "message": "I think it was a genuine mistake and you're not the asshole.\n\nYou didn't know your brother would be there so why would you have warned her?\nAnd yes at that point you should have told her but I don't feel like you were purposely hiding the fact just didn't deem it necessary because you're a guy and maybe haven't been in a situation like that.\n\nWith the said you should still apologize and take the blame.\n\nGood luck with the relationship\nCheers",
   "created_utc": 1700976682,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasw0v3",
   "message": "it's about disclosure, and by extension, consent. \n\nyou put your girlfriend in a shitty position without her consent. forget dinner or any of that other bullshit, the shitty position is: she just got seen in the car dropping off a known pedo\n\nyeah, YTA..what the actual fuck were you thinking?",
   "created_utc": 1700977290,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kasx1uv",
   "message": "Honestly you should have turned around left then explained why as you were both going somewhere else for dinner.",
   "created_utc": 1700977919,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat18a4",
   "message": "You're not in control of your mom inviting a pedophile rapist to Thanksgiving but I don't even know how a sane person could see that and sit down and eat the turkey. That's when you realize who's sitting down and you walk right back out the door and call your mom later asking why she still supports a pedophile rapist. You did have the option to say no to driving him too, now you're complicit in helping a pedophile rapist. Anything else about his character is irrelevant, him being \"family\" ended when he started violently raping children and women. YTA, not for being related to him but for treating him like a relative after he's proven he's a subhuman monster. Your girlfriend should dump you for keeping something so dangerous a secret.",
   "created_utc": 1700980673,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat1mcx",
   "message": "YTA WTF",
   "created_utc": 1700980943,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat71g7",
   "message": "Yta your an idiot seriously this information is important to anyone especially someone who may eventually become part of the family one day . Your brother is predator and pedo , your actions may cost you your gf bare that in mind .",
   "created_utc": 1700984962,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat73he",
   "message": "Why wouldn't you tell her that?",
   "created_utc": 1700985006,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat85vl",
   "message": "YTA I would be horrified if I was dating someone and they didn’t let me know ahead of time that their brother was a registered offender. I’m 100% sure she feels like you put her in a dangerous situation by not mentioning it and then allowing her to be around your brother.  She doesn’t feel safe around him, and I wouldn’t either.",
   "created_utc": 1700985834,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kat9oxg",
   "message": "YTA\n\n\u0026gt;My girlfriend says I shouldn't want to be around him. I don't like being around him but it wasn't my decision to invite him to Thanksgiving and it wasn't my house so I had no say\n\nBut YOU CAN CHOOSE to not go\nYOU CAN CHOOSE to tell your girlfriend. \n\nIf I were her I'd never want to be in the same room with someone like your brother and would feel very hurt if I wasn't prewarned",
   "created_utc": 1700987035,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katbg6s",
   "message": "YTA. She deserved to know so she can choose not to attend thanksgiving if she wants. You showed a lack of respect for her. Also, I wouldn’t go to any event where he is present and that you went speaks to your character.",
   "created_utc": 1700988442,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katbgtc",
   "message": "YTA\n\nMy BIL isn't on a list, but he fucking should be.\n\nMy husband has never hidden anything from me. And we decided to never attend a Christmas or Thanksgiving where he'll be present.",
   "created_utc": 1700988456,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katdkg9",
   "message": "You're talking about moving into together and you didn't tell her this about your family? I get not wanting to be judged by your family and I get that it isn't exactly easy to \"casually\" mention, but you should've said. YTA",
   "created_utc": 1700990173,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katdrpx",
   "message": "My guy. How do I put this. You. Are. An. Idiot.\nThis is so relevant it might be a dealbreak. You bring a woman near a sex offender without warning. That's like bringing a sheep near a wolf. There are things your PARTNER needs to know before entering a place. Like a quick back up about every person that will be there. Try to put yourself into her shoes.",
   "created_utc": 1700990337,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katefuy",
   "message": "Feels like a pretty big thing to forget to tell your girlfriend isn't it?",
   "created_utc": 1700990887,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katep2s",
   "message": "I would be upset if I were her too",
   "created_utc": 1700991096,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katf17f",
   "message": "YTA you should have been honest and upfront with her as soon as you knew they'd meet.",
   "created_utc": 1700991369,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katfl8a",
   "message": "Jesus Christ. This is so messed up. Yes. You absolutely should’ve told her. How jaded are you? You’re way too close to the situation to know how abnormal that is.\n\nAlso, many years ago, I finally lost my shit on my family for the Christmases and thanksgivings they spent with my rapist stepdad. Why the fuck is nobody intervening? y’all are just gonna keep hanging out with a rapist every year? And expecting your partner to just be chill? I’d be surprised if she doesn’t dump your ass and run as fast as she can.\n\nI mean, if you think having a rapist at Thanksgiving is normal, and that you don’t even need to bother telling her, what else do you consider normal?",
   "created_utc": 1700991829,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katfzjp",
   "message": "YTA. YOU might feel safe around him, but others may not. Your girlfriend has every right to refuse to be near a sex offender.",
   "created_utc": 1700992157,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katixvs",
   "message": "She is not accusing you of being like your brother or anything like that. She is shocked that you thought is ok to behold crucial information about your brother.",
   "created_utc": 1700994571,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katmz5b",
   "message": "As soon as you get to the meet the family stage in a relationship you should have told her. I think the problem is you don’t feel threatened by your brother. You don’t like him and that’s understandable but you don’t feel threatened. And I suspect you are confident you would protect your girlfriend from him. What you don’t seemed to have thought of is that she would feel vulnerable and unsafe. She would feel uncomfortable trying to talk to him like there’s nothing wrong. When you engage with someone you create a relationship, she feels betrayed because she didn’t have the full facts so her relationship was built on lies. She must have talked to him. She may have strong beliefs about engaging with people like this and you didn’t give her the choice.\nShe has the right to know about someone she is engaging with. I know it wasn’t your fault and I understand why you felt you had to attend the get together. Otherwise you are punishing your parents for what their son did. Whatever happens parent have a connection to their children which is unbreakable, they don’t have to like them but they will always be trying to put it right. \nTell her you understand now what you did wrong. You had got so used to ignoring him and cutting him out you forgot that she wasn’t party to it. For your part it’s almost like he doesn’t exist. You never thought about talking to her about a non-person but you realise now it will always be something dark in your life that needs explaining. \nIt almost feels like the world is punishing you but by handling it better you can get on with your life without him darkening it.",
   "created_utc": 1700997821,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "katogqa",
   "message": "OP YTA, your brothers actions have nothing to do with you sure, but it’s your job to make sure your girlfriend has all the information so she can keep herself safe. god forbid she didn’t find out and at some point ended up alone with him? what if he tried to manipulate her into meeting him somewhere claiming something like he wants to plan a surprise for you? she would only have the info that he is your brother and would have no reason to find that worrying or take precautions around him. \n\nyour logic is astounding to me that you’re so ashamed of your brothers actions that you would allow the women in your life to be put in situations where they have to interact with him without knowing that he is a dangerous man. you’re just inadvertently supporting him by allowing him to find new targets who are accessible to him and unaware of his status.",
   "created_utc": 1700999009,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kau1da3",
   "message": "She's mad yoi didn't tell her because SHE had to be around him. That's scary for women or people who have been through SA or DA. Do you even know for a fact she's never dealt with either things in her life? 1 in 3 women face some sort of sexual assault in their lives. She should've been made aware to make the choice. \n\nOn top of that, YES it was your choice to be around him. Why are your parents so disgusting that they allow a predator in their home and lives still? You could choose to not be around him. Don't go where he is. Tell\nYour family you will not be places he's included. And certainly dont drive him home. You're making excuses when you have chosen to be around him.",
   "created_utc": 1701007080,
   "score": 3,
   "submission_id": "183vdc9"
  },
  {
   "comment_id": "kau7dpb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183vdc9"
  }
 ]
}