{
 "submission_id": "183v151",
 "title": "AITAH for telling my girlfriend she's wrong about my family after she met them for Thanksgiving?",
 "selftext": "I invited my (29M) girlfriend (27F) to my family's Thanksgiving dinner. My mom, my aunt and my sister-in-law's are all the best cooks so they always take care of dinner and everything. My mom was so excited to meet my girlfriend that she [my mom] pulled my girlfriend in the kitchen to help. Everyone liked my girlfriend and I thought it was a good day but my girlfriend is mad at me now.\n\nShe got mad that all the women did the cooking and cleaning up while the men sat around and did \"nothing\". She asked me why I didn't try to help. My mom or any of my relatives never asked and I don't want to be in the way. It's nothing to do with women or men. The best cooks in the family make the dinner. It just so happens to be women who do it. My girlfriend said she got pulled into cooking too and she didn't want to be rude to my mom so she said yes. It's because my mom was excited to get to know her but my girlfriend said my brother brought his new boyfriend to meet the family and he didn't pulled into helping. According to her my mom waited on him hand and foot but my girlfriend got put to work. She's also mad at me because she kept coming out to see me and she was trying to get me to get her out of the kitchen but I kept \"sending her back\". I had no idea she wanted out and didn't want to help my mom and everyone. \n\nAITAH for telling her she's wrong when she basically made it out that my family treats men and women differently? My mom is a lawyer. My sister-in-law is an biologist. All of the women in my family are educated and have careers. Women are not treated differently or as \"less than\". They just happen to be the best with cooking. My girlfriend won't talk to me or return my messages. She's overreacting right? I can't see why she's mad like she is.",
 "created_utc": 1700950416,
 "permalink": "/r/AITAH/comments/183v151/aitah_for_telling_my_girlfriend_shes_wrong_about/",
 "score": 193,
 "url": "https://www.reddit.com/r/AITAH/comments/183v151/aitah_for_telling_my_girlfriend_shes_wrong_about/",
 "comments": [
  {
   "comment_id": "karocjn",
   "message": "YTA, dude. Male here, and I come from a conservative,  southern military family.  Generally, the ladies in the family did most of the cooking and did an AMAZING job at it. After dinner, uncles, Dad, and the rest of us guys would hit KP and clean up,  put away leftovers.  After we had time for dinner to settle,  we would serve the ladies of the family coffee and dessert.  Being an excellent baker (my chef ex-girlfriend taught me well), I would bring cheesecake,  cake, and pie in the flavors requested. Spread the work around and serve each other.",
   "created_utc": 1700957134,
   "score": 114,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kara5if",
   "message": "If men and women aren’t treated differently why wasn’t brothers new bf also pulled into the kitchen? Why wait on him hand and foot? \n\nYTA",
   "created_utc": 1700951618,
   "score": 130,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karahep",
   "message": "YTA. They're just the best cooks, and your excuses don't stand up because your mother didn't make your brothers boyfriend cook, just her and every time she left the kitchen you sent her back. If she kept coming out and asking you to spend time with her then it's obvious what she wants. You left her not only to cook with the women, but you fed her to the wolves. No new partner EVER  wants to show up then spend all their time cut off from their partner and under interrogation by the rest of the family. That alone makes you a giant asshole. \n\nYour family is sexist, you're sexist, you're intentionally making up a bunch of excuses.\n\nThe best cooks all cook, that's not how life works. Firstly she's a guest, she's never met these people and you left her alone most of the time, but people share tasks.\n\nSorry the women are also the best at cleaning up? What specialiaty is required to carry plates into a kitchen, push what's left on the plate into a bin and put it in the dishwasher? \n\nWomen are 100% treated differently, they are 100% treated as less than, you've just decided to selectively excuse it and pretend it's for other reasons.",
   "created_utc": 1700951756,
   "score": 22,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karbijd",
   "message": "“They just happen to be the best with cooking.” \n\nHow do you know that? Has any man in the family ever bothered to make a meal? I’m guessing not. \n\nI can see why your girlfriend (probably ex at the point) thinks you’re sexist and is icing you out.",
   "created_utc": 1700952159,
   "score": 116,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karcaon",
   "message": "Really? So the womenfolk did all the cleaning up because they're the best cooks?\n\nGet the fuck out of here with that self-serving bullshit.\n\nYTA. Your girlfriend is right.",
   "created_utc": 1700952456,
   "score": 76,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karim9o",
   "message": "YTAH 100% \n\nYour girlfriend was a guest at another person’s house and she was immediately put to work? That’s bad manners on your family, especially when they didn’t even do the same to your brother’s new boyfriend. \n\nThat is sexist. And the fact that you refuse to acknowledge it paints the picture worth a thousand words. \n\nIf I’m invited as a guest, I should be treated as a guest. I hope she dumps you.",
   "created_utc": 1700954886,
   "score": 35,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karcuoa",
   "message": "YTA. I’m assuming the men did all the cleaning up and dishes?",
   "created_utc": 1700952664,
   "score": 97,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karbayj",
   "message": "\u0026gt;My mom is a lawyer. My sister-in-law is an biologist. All of the women in my family are educated and have careers. Women are not treated differently or as \"less than\".\n\nSo despite working they are still the ones who do all the work at home... thats pathetic on all of the men. The very,very least you can do is clean up",
   "created_utc": 1700952080,
   "score": 46,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kard396",
   "message": "The fact that all the women also have full time professional jobs is even more of a reason for the men to pitch in and help. Why do the men get to relax meanwhile the women have to cook and clean a gigantic meal? The fact that she tried multiple times to “escape” the kitchen and you essentially shooed her back in is particularly irritating. I would have been fuming if I were your gf. Your family is old school and sexist, and yes, YTA.",
   "created_utc": 1700952753,
   "score": 203,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karduxj",
   "message": "Are the women in your family the best at cleaning too? YTA. She wasn’t wrong.",
   "created_utc": 1700953046,
   "score": 79,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kardti5",
   "message": "YTA. A really oblivious asshole, just sitting there thinking the women do all the work because that’s how things should be.",
   "created_utc": 1700953033,
   "score": 138,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kar92qz",
   "message": "YTA. Even if the women are the best cooks and love cooking, there's no way you can make the argument that they also happen to be the best cleaners. The women in my family also do the cooking so the men do the dishes. Also the way you phrased this... your mom kept asking your girlfriend to help because she wanted to get to know her, does this mean she didn't want to get to know your brother's new boyfriend?\n\nUnderstandable that you didn't pick up on the fact that your girlfriend wasn't happy with this if it's your normal family dynamic, but you were wrong to say she was incorrect about how she was feeling. Offer to help out next time. I bet your mom and SILs would also appreciate it.",
   "created_utc": 1700951209,
   "score": 208,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karerxv",
   "message": "Yeah, you are the AH for not recognizing the gender roles at play that overwhelmingly place the work onto the women despite their educational and working status outside the home. \n\n“The women cook better.”  Um, why had one man in your family not learned to cook. I can assure you not one woman comes out of the womb with a cooking gene that triggers to action at puberty. Why didn’t one male figure take the initiative to learn something….anything….. and help. I can promise you, it’s an exhausting day. Despite making the happy memories and doing it all with loads of love and smiles. It’s a lot of effing work. \n\nI hope this interaction with your maybe STBX GF will trigger some real hard conversations for the men in your family on the excessive mental/work loads it takes to make the holidays special. The women have full time careers AND all of the work a household needs on their shoulders. \n\nDo better.",
   "created_utc": 1700953398,
   "score": 53,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kas6cd3",
   "message": "The one who does the cooking should not be cleaning after.",
   "created_utc": 1700964669,
   "score": 29,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karelzu",
   "message": "lol give her more reasons to understand that you are useless via tradition. The women in your life are succeeding their careers yet they are still in charge of home care. What do you bring to the table? Like seeing your family dynamic is something that when you’re in a relationship gets adopted to that relationship. Why would I want to take care of a man baby?",
   "created_utc": 1700953333,
   "score": 57,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kas4ck4",
   "message": "YTA she's a guest and she's put to work???????? Because she's a woman, of course. You can deny all you want but y'all are sexist mfs in your family.\n\nI hope she realizes that's going to be her future if she ends up with you and *runs* far, far away.",
   "created_utc": 1700963765,
   "score": 108,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kars01l",
   "message": "\u0026gt;My mom or any of my relatives never asked and I don't want to be in the way.\n\nDid you ever volunteer to help out? YTA",
   "created_utc": 1700958573,
   "score": 128,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karhzrv",
   "message": "YTA\n\nSo I don't care if they are the best cooks. What the fuck stopped you and your father and brothers from getting off your ass and cleaning after they had cooked.\n\nYou say they are not treated differently but you did. You and the men of that family decided that it was up to the women to wait on you. And you use the excuse that *\"noone asked me\"*. Do you not have eyes, did not you see the amount of dishes to clean and floors to sweep.\n\nI'd be embarrassed if I were you and I think your girlfriend is embarrassed by you.",
   "created_utc": 1700954640,
   "score": 152,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karmsfj",
   "message": "Great, exactly as it should be. All the women do all the work AND work fulltime, while the menfolk sit on their asses watching football and bullshitting. Yep, not sexist at all/s\n\nIn case that wasnt clear. YTA and your girlfriend ISNT wrong. She saw EXACTLY what reality is. Shes not answering your calls cause you most likely no longer have a girlfriend.",
   "created_utc": 1700956536,
   "score": 98,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karih1f",
   "message": "YTA. Of course the women are the best cooks because the men have used weaponized incompetence to get out of the work! I would bounce right out of that situation if I was your gf. The fact that you don’t see an issue is telling. You are absolutely the AH and might be single soon.",
   "created_utc": 1700954827,
   "score": 106,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kasw0vp",
   "message": "LOL!! YTA YTAH YTA\n\nBIG TIME.\n\nYou’re also incredibly sexist as is your entire family. Wake up.\n\n1) Women aren’t magically better at cooking than men. Like anything, your cooking improves with practice and effort. Look at how many top chefs are men. You and the men of your family are bad cooks because you’ve made no effort. You’re lazy. And your mother and the women of your family have enabled and pandered to that laziness. Doing you no favours BTW because a lot of women won’t put up with that and will dump you for it. You should contribute a dish of some kind. Practice it all year if you need to. Every adult human should be able to cook multiple meals well. \n\n2) The general rule of thumb is that if one person or group cooks, the other cleans. If that doesn’t happen, one group is simply serving the other who is doing nothing. And that group doing nothing are lazy and taking advantage. It’s very poor form and it’s not a good look.\n\n3) The fact that the division of labour on Thanksgiving (and I’m guessing other special occasions) falls along gender lines is not an accident. Women aren’t magically better at cooking and cleaning. We don’t like it better because of hormones or genes. This is what we call systemic sexism. The women in your family have been socialised to believe that they should do these things. And the men in your family have been socialised to believe the women should do these things. That is sexism my friend. It could not be clearer. The fact that none of you have ever noticed is appalling and speaks, nay, shouts volumes. It’s never too late to change. \n\n4) Your mother pulling your girlfriend into servitude to the menfolk when she was there as a guest was not a kind thing to do. It’s not how you should treat guests. It was your mother’s internalised misogyny and socialised sexism. And you, as her boyfriend, had a responsibility to stand up for her and set clear boundaries with your mum. But you failed at that. Utterly and completely. \n\n5) The fact that your girlfriend kept coming out to you while you lazed around with your other lazy male relatives and you kept *sending her back to the kitchen* is mind-boggling. You reverted into a lazy misogynist and just expected your girlfriend to fall into line and serve you. Despicable. I don’t know how you can say with a straight face that you’re not sexist. She clearly didn’t want to be in there. But that’s where you felt she *belonged*. Because of your biases. And because she’s polite and didn’t want to make a scene (another thing women are socialised to do), she acquiesced. \n\n6) If it wasn’t already crystal clear that this is about sexism in your family, your brother’s boyfriend was not asked to cook or clean and was, in fact, waited on hand and foot by your mother. How can you still not get it? What other reason could there possibly be? WAKE UP!!\n\n7) If you don’t notice your partner’s distress, that’s on you. You’re not a good partner. You’re not aware of her signals and moods. You’re not checking in with her to see if she’s okay. When you take a partner to a family event for the first time you should constantly be checking in with them to make sure they’re okay. \n\n8) Listing the professions of your mother and SIL doesn’t mean there’s no sexism. In fact, it makes the blindingly obvious sexism even more egregious because these accomplished working women are still expected to serve you menfolk even when they’re breadwinners too. It would still be lazy of the men to contribute nothing if these women were all homemakers; but the fact that they’re working women and STILL did ALL of the domestic labour for Thanksgiving shows just how far your family has to go. Studies actually show that in equal breadwinner households, women still do more unpaid household labour than men and in households where mothers out-earn their husbands, they do even *more* unpaid labour. Mostly because of men’s fragile egos, apparently. \n\n9) When your girlfriend pointed all of this out, instead of taking what she said on board, thinking about it, apologising and committing to mend your lazy, sexist ways; you doubled down. You defended it all. You attempted to gaslight her. Ugh. \n\nMate, you need to do some serious work on yourself before you get in another relationship. This one sounds over and good for your ex-girlfriend because you are *not* a keeper. \n\nAll is not lost though. You *can* improve. Here are some helpful hints:\n\n1) Educate yourself about unpaid labour - including household managment, emotional labour and mental labour - and the unequal distribution of unpaid labour along gendered lines. \n\n2) Educate yourself about systemic sexism, unconscious biases and internalised misogyny. \n\n3) Become an ally to women. Learn to advocate for us. Especially when it comes to your partner. \n\n4) Always be looking out for unequal distributions of labour and be the first to jump up and contribute. Call out other men for not contributing. \n\n5) Learn to cook and cook well. Contribute to special meals. Make an effort. \n\n6) Always clean if someone has cooked for you.\n\n7) When introducing a new partner to your family, set clear boundaries with your family first. And then be watchful of your partner. Make sure they’re happy and comfortable. Check in with them regularly. \n\n8) If you ever move in with someone, it’d be a good idea to try the Fair Play system. You can get the book and cards on Amazon. It will help ensure a more equal distribution of unpaid labour. \n\n9) When your partner criticises you, don’t immediately get defensive and double down. LISTEN to them. Try to understand what they’re saying. Empathise. Put yourself in their shoes. Ask questions. Apologise without excuses. Work on being better. One of the most unattractive qualities out there is the inability to admit that you’re wrong and just apologise. \n\nGood luck mate.",
   "created_utc": 1700977290,
   "score": 57,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kas4e02",
   "message": "YTA\n\nYou abandoned your girlfriend with a bunch of people she didn’t know, and when she came out to try to get some support you sent her back in. \n\nWhy on earth would you let your mom grill her without being there?",
   "created_utc": 1700963783,
   "score": 36,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kar9uc3",
   "message": "YTA-why didn’t the men clean? Are women better at cleaning too?",
   "created_utc": 1700951496,
   "score": 183,
   "submission_id": "183v151"
  },
  {
   "comment_id": "karg2wv",
   "message": "Ya’all men are lazy AH! If the “women”\nare good cooks, the men should be cleaning up!!! Simple. OR. How about EVERYONE HELPS-NO MATTER WHAT GENDER!!!!🙄",
   "created_utc": 1700953896,
   "score": 104,
   "submission_id": "183v151"
  },
  {
   "comment_id": "kar9dkl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183v151"
  },
  {
   "comment_id": "katzlgf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183v151"
  }
 ]
}