{
 "submission_id": "183vdc9",
 "title": "AITAH for not telling my girlfriend that my brother is a registered sex offender??",
 "selftext": "**I DO NOT CONDONE ANYTHING MY BROTHER DID. I DON'T DEFEND HIM OR SAY HE IS INNOCENT.** One of my brothers is a registered sex offender. He can't be around anyone under 18 ever again, and live or otherwise be around places like schools and daycares. In addition he has to inform the court if he enters into a romantic relationship with a woman so the court can notify her of my brother's record towards women. Look, like I said above I don't condone anything my brother does. His crimes were awful and I don't defend him. I try not be around him if I can help it.\n\nHe was at Thanksgiving dinner because my mom invited him and she and my stepdad were hosting. Afterwards my mom asked me to drive him and one of my other siblings home. My girlfriend found out about my brother because of the sign on his lawn that he's required to have due to his status. She's angry I didn't tell her about my brother. It's not like I defend him and I don't get why his crimes have anything to do with me. We don't want kids and I would never leave her alone with him. I also don't think people should be judged on the things people who happen to share the same DNA do. I had nothing to do with anything my brother did. I don't defend him or even like him much. I don't even have his phone number or anything.\n\nMy girlfriend says I shouldn't want to be around him. I don't like being around him but it wasn't my decision to invite him to Thanksgiving and it wasn't my house so I had no say. We were talking about moving in together soon. My girlfriend says it's on hold because she doesn't know who I am. I don't understand why she is angry. I am not my brother and I do nothing to defend or justify the horrible things he's done.",
 "created_utc": 1700951337,
 "permalink": "/r/AITAH/comments/183vdc9/aitah_for_not_telling_my_girlfriend_that_my/",
 "score": 222,
 "url": "https://www.reddit.com/r/AITAH/comments/183vdc9/aitah_for_not_telling_my_girlfriend_that_my/",
 "comments": []
}