{
 "submission_id": "183y2up",
 "title": "Husband being asked to leave the family locker room",
 "selftext": "My husband and I are having a debate right now. He took our daughter to a birthday pool party. It was at a YMCA. Our daughter was the last one out of the pool. My husband took her into the family locker room and a mother looked at my husband and said your daughter can be in here but you can't and have to leave now. This woman was the only other person in there with her daughter and a baby. Only the children were changing, adults weren't in the pool.\n\nMy husband said he brought our daughter back out and waited for the woman to leave then brought our daughter in to dress her. He didn't feel comfortable bringing her into the mens locker room and he said you can't pay him to enter a woman locker room. \n\nI was upset with him because I never want our daughter to feel uncomfortable being in any situation with her father. If this woman didn't want to be around men, why didn't she go into the woman's locker room?\nI told him, I wish he stuck up for himself and told her family room is all inclusive, if she wanted privacy, go into the womans or one of the private bathrooms.  \nMy husbands argument, as a man,  no matter what he would have said in a bathroom situation he would have been in the wrong and did not want an argument. He didn't want  the woman to get too aggressive in front of our daughter and make it more uncomfortable. He also said that her and her child were a part of the birthday party as well. And that after changing they were all going to the same party room and he would have been the only guy in a room full of woman. He says that he felt like he would have walked into a lions den after having a restroom argument. \n\nMy husband works very hard to provide for us. I am the one that goes to the school functions  birthday parties, ect. I wasn't feeling well today and asked him to go and now feel so bad about this, being his 1st kid birthday party experience. I told him our private school is filled with entitled women and need to be reminded, politely, they don't own every room because that's exactly how 90% of them act.\nI guess I just wish I was there to speak up for my husband because I would have told that woman off real quick. My other issue is, what if he was a single father, or there wasn't a female in this family dynamic. What was he to do?\nFamily means for all, no?. ...AITH?",
 "created_utc": 1700959012,
 "permalink": "/r/AITAH/comments/183y2up/husband_being_asked_to_leave_the_family_locker/",
 "score": 80,
 "url": "https://www.reddit.com/r/AITAH/comments/183y2up/husband_being_asked_to_leave_the_family_locker/",
 "comments": []
}