{
 "submission_id": "18405fv",
 "title": "AITA for calling the cops instead of an ambulance for the guy who tried to steal my motorcycle?",
 "selftext": "Posted here because it was removed from Aamitheasshole for some reason. \n\nSome guy tried to steal my motorcycle last night. He dropped it on himself and was injured enough that he could not get out from under it.\n\nMy dogs were going nuts so I went to the front window to see what was up. I found him pinned under my bike. He was in a fair bit of pain. He asked me to help get the bike off of him but I didn't want to get near him.\n\nI called the cops on the non emergency line and told them what happened. Cops showed up twenty minutes later. They called for an ambulance.\n\nMy mom said that I have no compassion and that he could have been seriously hurt. She has always hated my motorcycle. I told her that I had no compassion for thieves. We are now fighting and it is making thanksgiving weekend awesome. /s",
 "created_utc": 1700965228,
 "permalink": "/r/AITAH/comments/18405fv/aita_for_calling_the_cops_instead_of_an_ambulance/",
 "score": 77,
 "url": "https://www.reddit.com/r/AITAH/comments/18405fv/aita_for_calling_the_cops_instead_of_an_ambulance/",
 "comments": [
  {
   "comment_id": "kascq3v",
   "message": "NTA.. but I’d check with an attorney just to cover yourself. He may spin the block on you and try to sue you. Delusional, I know…but it happened to my husband before we were married. Cost him $6k out of pocket and his homeowner’s insurance $30k.",
   "created_utc": 1700967566,
   "score": 194,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kas8e6b",
   "message": "NTA - Call 911 and let them decide who to send out.  BTW, a motorcycle falling over is not going to kill anyone, let the guy feel uncomfortable for a few minutes knowing the cops are coming to arrest him.",
   "created_utc": 1700965601,
   "score": 44,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasikes",
   "message": "NTA\n\ni was a 911 dispatcher for several years you did the right thing. if you called for an ambulance and the EMS guys show up he can spin the story to whatever he wants and it wont be until several months later you could have a case on your hands. OR they ask the RP (you) what happened and you explain he was trying to steal the bike..ok he can have weapons or be a nutjob, the police usually clear the scene and declare it safe for EMS to show up.\n\ni actually had one instance where a bar fight broke out and someone asked for an ambulance and only told me that a guy fell and hit his head. policy says to only send EMS for falls.\n\nEMS show up and a bunch of drunks try to fight them because the dude knocked out allegedly groped a lady so they kicked his ass. my god was EMS mad at me over that.\n\nalso you have 0 obligation to help anyone thats what our taxes are for, you could fuck around and get permanment damage when you lift the bike off of him and he decides to sucker punch you or some dumb shit",
   "created_utc": 1700970231,
   "score": 116,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katvapz",
   "message": "Paramedic here. Other than calling the non-emergent line instead of 911, you absolutely did the right thing. I would've been livid with you if you'd called for EMS and somehow failed to mention that my patient was a criminal in the middle of a crime. We always, ALWAYS, have law enforcement go to scenes like this first and clear them. Tell your mom that's how emergency services work anyway and cops would've shown up first, regardless of whether you requested EMS. Also it's very likely that 911 had an ambulance standing by close to your house waiting for the cops to request them. Your mom can go fly a kite.",
   "created_utc": 1701003718,
   "score": 28,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kas7w0f",
   "message": "NTA. He was in no mortal danger. This is peak karmic justice.",
   "created_utc": 1700965368,
   "score": 102,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasndyo",
   "message": "\u0026gt;My mom said that I have no compassion and that he could have been seriously hurt.\n\nI have no compassion for people suffering the consequences of their own poor decisions.    \n\nNTA",
   "created_utc": 1700972517,
   "score": 72,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat0bl6",
   "message": "NTA when it’s a criminal situation you call police first. Who’s to say if this guy has a gun or not? It could have put you or EMS in danger if you’d acted differently",
   "created_utc": 1700980043,
   "score": 29,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat681k",
   "message": "NTA - When a suspected criminal or otherwise unstable person needs medical care, the paramedics won't show up until after the police do.  For their own safety.",
   "created_utc": 1700984334,
   "score": 19,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasonrj",
   "message": "NTA - You let the cops handle it. Excellent. Who knows what would have happened if you started lifting the bike or called an Ambulance first. I’d talk big shit on him while the cops got there though. “Ambulances are for accidents. You tried to steal my bike.” 😆",
   "created_utc": 1700973171,
   "score": 37,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasr2as",
   "message": "NTA. You called 911 and t9ld them what happened. They decide who to dispatch, not the caller. They made the call to send police first. If you had just helped haul it off him, you could have been assaulted or liable for his injuries. You did exactly right.",
   "created_utc": 1700974430,
   "score": 21,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat4iks",
   "message": "Hey bro, respectfully, your mom is a dumbass. I'm definitely not going to help someone who tried to rob me. Miss me with that.\n\nNTA\n\nEdit to add: How long were you on hold for the non emergent line? I've tried calling it before here in my city and I was on hold for about 30 minutes before I gave up.",
   "created_utc": 1700983041,
   "score": 15,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasos31",
   "message": "NTA, that was the dude who injured himself trying to steal your bike",
   "created_utc": 1700973233,
   "score": 13,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat4o7x",
   "message": "NTA fuck that guy, he tried to steal your shit. I honestly would have waited a few hours before calling anyone just to prolong the pain.",
   "created_utc": 1700983159,
   "score": 9,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat0hel",
   "message": "Fuck him.  He found out. I doubt be will learn his lesson.",
   "created_utc": 1700980158,
   "score": 12,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat5zxn",
   "message": "NTA, a Good Samaritan even for not letting your dogs at him.",
   "created_utc": 1700984162,
   "score": 11,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat2xn8",
   "message": "NTA. You called for police. The police assessed the situation and called for an ambulance.",
   "created_utc": 1700981889,
   "score": 8,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat6u9h",
   "message": "NTA. What if he hurt the ambulance people? Having the cops first was safer.",
   "created_utc": 1700984805,
   "score": 8,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat75hr",
   "message": "Ask her how she’d feel if he’d gotten in the house instead, then fallen and broke his leg coming upstairs to her room with a baseball bat.",
   "created_utc": 1700985049,
   "score": 7,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katfc1q",
   "message": "NTA. I'd honestly be scared to interact with someone in that situation as they might be armed. It'd be different if the injuries were serious but they were conscious, breathing, and interacting. I'd have used the emergency number though, to get the police there quickly.",
   "created_utc": 1700991619,
   "score": 5,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat4y2p",
   "message": "Fuck him as he got instant karma. You were cautious for your safety and called the cops as all smartly should. It's their job so let them do it. If you had no compassion, you'd have waited a while to call 🤣 I'd have been tempted to wait but then would be worried he'd slime away. \n\nI think your mom is a typical mom with too much compassion for those who don't deserve it. My mom is the same and I have to constantly give her a reality check about who truly deserves her compassion 😂",
   "created_utc": 1700983362,
   "score": 11,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat61a3",
   "message": "Ask your mother if she is aware of the concept of \"Karma\".",
   "created_utc": 1700984190,
   "score": 7,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasb3m8",
   "message": "Nta and you should have put your weight on him and the bike",
   "created_utc": 1700966836,
   "score": 15,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kathwh5",
   "message": "I'd ask your Mom how you were supposed to know he didn't have a weapon on him that he just couldn't reach while pinned to the ground.\n\n  \nNTA",
   "created_utc": 1700993728,
   "score": 5,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katzjaa",
   "message": "NTA but it’s weird that you called a non emergency number. Call 911, tell them what happened, and let them decide who to send.",
   "created_utc": 1701006120,
   "score": 3,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau3b0v",
   "message": "NTA, this was a criminal caught in the act on your property. This is what cops are for. Let them sort it out.\n\nThe mods of AITA have weird hangups and block or remove on a whim. I muted it last year, this sub is much better.",
   "created_utc": 1701008046,
   "score": 3,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaubbif",
   "message": "Should’ve sat on the motorcycle while waiting",
   "created_utc": 1701011652,
   "score": 3,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaud5t6",
   "message": "Good call.   \nIf the cops call the ambulance, they pay.   \nIf you would have called the ambulance, you would have been responsible.   \nHome boy found out that in some cases, stupid DOES hurt.",
   "created_utc": 1701012430,
   "score": 3,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat5gpx",
   "message": "My grandfather straight up told me that if someone broke into my house and tried to steal my stuff, to shoot and kill, because better a dead plaintive, then an injured and sympathetic one. Grandpa also says that if they try to get back out of the house to drag them back in and let them die before calling the cops, lol. I am 99% sure that my grandfather and his father were part of the Italian mob. NTA",
   "created_utc": 1700983754,
   "score": 10,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katf1fe",
   "message": "Why would you have compassion for somebody who tried to steal your motorcycle and was stupid enough to drop it on himself.  Would your mom have compassion for somebody who beat her up, robbed her and then fell down the stairs and got injured?  And as someone else mentioned this guy could’ve been armed, calling the police made the most sense.  Plus depending on the size of the bike it might be impossible for one person to pick it up safely.  You could’ve been risking injury as well as exposure to a potentially armed criminal.\n\nNot the asshole. \n\nIt’s not a lack of compassion rather it is an abundance of common sense and self preservation instincts.",
   "created_utc": 1700991374,
   "score": 6,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat5s3q",
   "message": "NTA, that’s just instant karma, dude deserved it. I’d have left him pinned too lol",
   "created_utc": 1700983993,
   "score": 5,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katji8a",
   "message": "If it makes you feel any better, I'd have left his ass for the feral dogs.  You can hose off whatever's left after they maul him to death in the morning.",
   "created_utc": 1700995027,
   "score": 6,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katv20p",
   "message": "Make sure the moron didnt scratch your paint with his stupid antics.  If he did take him to small claims court for cost of your paint being fixed.",
   "created_utc": 1701003570,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katxoaj",
   "message": "Given the circumstances, if you had called the paramedics they would not have done anything until the police turned up anyway, so that would have been a longer delay in lifting the bike. Paramedics have to take their own safety into concideration.",
   "created_utc": 1701005110,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau0n1t",
   "message": "NTA.\nIt's not your concern if a thief gets injured trying to steal from you.",
   "created_utc": 1701006704,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau1j75",
   "message": "Nta. \"Mom, I couldve been seriously hurt. That is why I did the right thing and called the police to come help.\"",
   "created_utc": 1701007164,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau1lxu",
   "message": "NTA. Calling the police was the right thing to do. I don’t know what your mom’s problem is.",
   "created_utc": 1701007204,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau41m6",
   "message": "NTA. He could have had a weapon and used it after you helped him.",
   "created_utc": 1701008406,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau9fmd",
   "message": "NTA\n\nI’ve read many times about potentially hurting someone if you move them after an accident. Seems prudent to let a medical professional do it. And who better to summon said professional than a LEO?",
   "created_utc": 1701010833,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaua2fv",
   "message": "I would've left him. You have no idea if he has a weapon/ knife/ gun. I'd let the cops deal with him. If you helped pick up the bike and It hit him again he could sue you. I would claim you're in fear of your safety. Something the can't prove is wrong. What they do know is tried to take your bike. And apparently he can't ride.",
   "created_utc": 1701011111,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaucuhr",
   "message": "NTA, and thank you! If the injuries resulted in longer term damage due to the wait, he will be less effective as a thief in the future. You’ve done your part in making society safer.",
   "created_utc": 1701012298,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaur9df",
   "message": "You called emergency servcies. You did your part. \n\nTo be honest, if you had told them that someone stealing your bike and got pinned and needed an ambulance, they would have waited for police to show up first anyway. It was an active crime and paramedics tend to not go in to those. \n\nNTA",
   "created_utc": 1701017975,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kauwm00",
   "message": "NTA- First of all, the guy is a thief trying to steal from you. And second, you don’t know if he could be armed or not. It could have been a ploy and you would have risked more than just your motorcycle trying to be a Good Samaritan. Your mother is good hearted but naive. She would 100% be that poor, innocent, little old lady that gets scammed in a parking lot for trying to “help someone in need.”",
   "created_utc": 1701020004,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat7dnx",
   "message": "NTA. Fuck him.",
   "created_utc": 1700985223,
   "score": 4,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat8jtm",
   "message": "NTA - I agree with others, call 911 and let them decide who they want to send. I wouldn't touch it, the guy might be dangerous if I let him out, or while I'm doing it. I'd stick around, out of reach, to make sure he didn't get up and steal the bike. If the cops showed up, I'd offer them my help to get the bike up, but only if they agreed to watch the guy so he couldn't hurt me.",
   "created_utc": 1700986129,
   "score": 4,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katsxka",
   "message": "He tried to steal your shit and epically failed. You owe him nothing. It's his fault for being a stupid asshole.",
   "created_utc": 1701002217,
   "score": 4,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau1z4v",
   "message": "YTA … why didn’t you livestream it so we could all have a good laugh too hahahah",
   "created_utc": 1701007389,
   "score": 4,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasw18t",
   "message": "NTA idk what he would have done if you had helped. Not to mention its his fault in the first place. F him.",
   "created_utc": 1700977296,
   "score": 4,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katj14d",
   "message": "NTA - No shit OP doesn't have compassion, \"he could have been seriously hurt\", that douchebag DESERVED to be seriously hurt. NEWSFLASH! Your possessions, are worth more, then the lives of the people who tried to steal them. That's just how it is, people need to get over it. \n\nMore importantly, calling the police was an important step from a liability standpoint. OP needs to cover his own ass for when this douche tries to sue him later.",
   "created_utc": 1700994646,
   "score": 5,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasznvp",
   "message": "r/instantkarma",
   "created_utc": 1700979600,
   "score": 3,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat8qxl",
   "message": "Hopefully, you delivered a few well placed kicks to the head first.",
   "created_utc": 1700986287,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kascgtp",
   "message": "NTA.  So NTA.  The thief could have had a weapon or been super high on drugs and hurt you and further robbed you.  \n\nYour mom is being very naive. \n\nYTA - for fighting with your Mom, you don’t have to give in, you just shouldn’t fight.  \n\nPerhaps consider nicely and kindly telling her that you aren’t one bit sorry and that you realize she feels differently and that you will just need to agree to disagree and that you aren’t going to talk about it any further.   \n\nIf she brings it up still, tell her you aren’t going to talk about it any further and leave the room, go take a walk, a drive, watch a movie, etc… if she persists just do as you said - leave the room, etc… , rinse and repeat until she gets that you are a man of your word. \n\nYou are just nicely teaching her your boundary and enforcing it - nicely.  And you are treating her with respect by refusing to argue with her.  You are treating yourself with respect by removing yourself from a bad situation and not backing down just to make someone else happy, when doing so would make you unhappy.",
   "created_utc": 1700967450,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat7fzg",
   "message": "NTA. Calling 911 covers both. You tell them what’s going on and they’ll dispatch both police and medics if needed.",
   "created_utc": 1700985274,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katd9on",
   "message": "NTA. He was trying to steal your motorcycle. If he was armed and willing to hurt or kill you for it, an EMT is just going to get hurt as well. Police officers are trained in first aid so if the bike falling on him was life threatening, they can help him while an ambulance arrives. Hes a criminal first and foremost, and injured secondly. Cops\u0026gt;emt's",
   "created_utc": 1700989924,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katmweh",
   "message": "Wtf 😂 being compassionate about what exactly? Nta",
   "created_utc": 1700997760,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kato0ov",
   "message": "NTA unless it's a life threatening injury, best to let cops call the ambulance. If you think the thief is bleeding out call the police and say an ambulance might also be necessary.",
   "created_utc": 1700998654,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katrh9n",
   "message": "NTA and you (usually) don’t have a duty to save someone unless they are dependent on you like a child, the elderly, etc. He got himself in that situation.",
   "created_utc": 1701001230,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katsim2",
   "message": "NTA. Nope, that should keep him from stealing motorcycles for a while.  FAFO",
   "created_utc": 1701001941,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katsnqh",
   "message": "NTA he’s lucky other unfortunate events did not happen. 🤬",
   "created_utc": 1701002036,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau2f89",
   "message": "You're under no legal obligation to assist or call others to help anyone. Even if you saw an icicle fall from your neighbor's roof and impale him, getting in your car and going about your business is not against the law. Morally you would suck.\n\nYou saw someone in the act of committing a crime get hurt and trapped. What might he do when you free him? Calling police is prudent in that situation. It would have been wrong to expose unarmed EMTs to the criminal before police deemed the situation safe. NTA",
   "created_utc": 1701007610,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaua5hc",
   "message": "I wouldn't have helped him out either. I would however would have dialed 911 instead if the non emergency number. My conscience wouldn't have let me do otherwise.",
   "created_utc": 1701011148,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat3uiu",
   "message": "NTA..\n\nHe may spin the block on you and try to sue you. Delusional, I know…but it happened to my husband before we were married.",
   "created_utc": 1700982548,
   "score": 2,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katkbhe",
   "message": "Your moms fucking stupid",
   "created_utc": 1700995683,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katgyof",
   "message": "NTA, always police first, they will assess if he needs and ambulance or not, after they have arrested him.",
   "created_utc": 1700992959,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katko4j",
   "message": "NTA but to cover yourself I would have called both....and hopefully you have video and pictures for your evidence",
   "created_utc": 1700995966,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katjtnj",
   "message": "Nta. I'd have done the same.",
   "created_utc": 1700995281,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katmsee",
   "message": "Your mom is TA. I would have pulled out a chair, recorded with my phone and gave him a taste of my rambling ADHD while we waited for the cops.",
   "created_utc": 1700997671,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katnzr6",
   "message": "NTA. Fuck that, you should've pissed on him before calling the cops.",
   "created_utc": 1700998633,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau1n4s",
   "message": "Depending on your state they may look at the injury and the crime as 2 different things. I live in NJ and my neighbors house was broken into, well attempted broken into the guy fell off the roof trying to get into a second story window that was open a crack. Her broke is leg and hip and sewed them.",
   "created_utc": 1701007220,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katrza7",
   "message": "You should have called the emergency number \u0026amp; asked for both cops \u0026amp; emt's",
   "created_utc": 1701001574,
   "score": 0,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katdrdl",
   "message": "I'm not sure how it is where you live, but in my country you could get sued failure to provide assistance in an emergency situation. And doing it out of spite could constitute causing bodily harm. \n\nDepending on how bad he was injured I would even consider you possibly being the asshole. But I assume it wasn't too bad so NTA.",
   "created_utc": 1700990329,
   "score": 255,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katjore",
   "message": "YTA. Could have called an ambulance at the same time when you called the emergency line surely.",
   "created_utc": 1700995172,
   "score": 252,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat35a4",
   "message": "ESH. You should’ve called 911. The guy got what he deserved, but you intentionally called the non emergency line (when this would be an emergency wether it was theft or injury) \n\nI don’t believe that you didn’t do that specifically to make him suffer for longer.",
   "created_utc": 1700982043,
   "score": 244,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau5eh2",
   "message": "Maybe step on the bike to get a better sense of where it hurts, so you have good info to relay to first responders.",
   "created_utc": 1701009034,
   "score": 0,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaucp2i",
   "message": "YTA. They were in the process of attempting to steal your motorcycle (albeit failing at it) and possibly injured and you called the non-emergency line? An active crime definitely justifies calling 911.",
   "created_utc": 1701012234,
   "score": 0,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaufvuy",
   "message": "ESH. The thief for obvious reasons, you for the reason your mum gave. Nothing stopped you from calling an ambulance at the same time as the cops.",
   "created_utc": 1701013545,
   "score": 0,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaup9nb",
   "message": "YTA for calling the non-emergency line. You don’t know how seriously they were hurt. That’s an emergency. Aside from that, assuming you told them the full story (told them that the motorcycle fell on him and he’s trapped under it and in pain) then you’re not responsible for who they sent. Although given that only the cops showed up, I suspect you didn’t tell the full story either.",
   "created_utc": 1701017218,
   "score": 0,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kasrupb",
   "message": "I will be downvoted but this is honestly so disturbing. I would not want to be around someone like you.\n\nYTA. Call 911 and say someone trying to steal your motorcycle is injured and you need an ambulance along with the police.\n\nBut I guess you got some kind of sick satisfaction watching another person in pain, pleading for help because they wronged you? Did it cross your mind at all they may have internal injuries that require immediate attention? And would you have been even more pleased with yourself if they did? \n\nDoes not having compassion for thieves only apply in the act itself? Does it only matter when they are things that belong to you? Would you not find this revolting if the thief was someone you loved who made a bad choice? Should we do background checks before calling 911? Should ambulances respond to criminals last?\n\nAnd truthfully I can’t get over how proud you seem to be about your selective compassion. Most decent people challenge themselves to find compassion in instances it’s difficult and you are committed to the exact opposite. And placing “things” over your sense of humanity no less. And after having the time to reflect on the night, you still feel this way.\n\nI hate to break it to you but it’s not your job to dispense “justice”. I don’t blame your mother for being so ashamed, this is disgraceful. I wouldn’t want anything to do with you.",
   "created_utc": 1700974866,
   "score": 230,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kat547n",
   "message": "You should of called 911 for cops and ambulance not the non-emergency number",
   "created_utc": 1700983490,
   "score": 245,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katj7zc",
   "message": "NTA, too bad he didn’t die",
   "created_utc": 1700994801,
   "score": 254,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katvors",
   "message": "ESH. He sucks for stealing a motorcycle, or trying to. And you suck for calling the cops and not an ambulance. If you'd called 911 they probably would have sent both.",
   "created_utc": 1701003958,
   "score": 254,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katanay",
   "message": "Your mom is right (you admit it). So why are you posting on here asking?",
   "created_utc": 1700987793,
   "score": 243,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katfqs9",
   "message": "**YTA for not calling 911**, someone pinned under a bike like that needs to be checked out - you should have called 911 and asked for police and ambulance, let them know someone was trying to steal your motorcycle and it fell over and pinned them under it so need police and ambo\n\nI would not have tried to move bike as you could have injured him more, but not calling for help on 911  YES  YATAH",
   "created_utc": 1700991956,
   "score": 244,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katujlv",
   "message": "NTA I'd have probably never called and instead let out the dogs out then put on some noise canceling headphones. People who steal from other people deserve to die in agony, they do not deserve love, empathy, or compassion.",
   "created_utc": 1701003251,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katusxm",
   "message": "In my country (not a place that does Thanksgiving, so not yours) you have no duty of care to people who have accidents near you.  Calling the police was MORE than you were required to do.",
   "created_utc": 1701003413,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katwb3q",
   "message": "Your mother is an asshole",
   "created_utc": 1701004326,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katwj7q",
   "message": "NTA, but why non emergency and not 911?  If I find someone in my property that's a 911 call.",
   "created_utc": 1701004458,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katwwmt",
   "message": "NTA. When he decided to try and steal he deserves what he gets. There is no duty to help in many states. You called the cops, they called an ambulance.",
   "created_utc": 1701004676,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katx7ns",
   "message": "Who cares if he was hurt. He’s just a thief.",
   "created_utc": 1701004853,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katycnt",
   "message": "Is your mom running for mayor of San Francisco?",
   "created_utc": 1701005484,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katzb38",
   "message": "NTA. Play stupid games win stupid prizes, and letting the cops handle it was the right move. Your mom just wants any excuse to hate on your bike.",
   "created_utc": 1701005997,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katzlq5",
   "message": "NTA, but watch out for a lawsuit for getting hurt on your property.",
   "created_utc": 1701006157,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "katzoe8",
   "message": "I would have taken my time, maybe had a sandwich and watched a tv show first.",
   "created_utc": 1701006198,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau02tj",
   "message": "Nta \n\nI hope your motorcycle is ok. If its damaged, you should pursue the thief for repair money",
   "created_utc": 1701006411,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau0k7h",
   "message": "You didn't know if he had a weapon and there's no way you could've know if moving the motorcycle would've caused more injuries you'd risk being liable for.\n\nShe can debate the right thing to do all day, but you definitely did the correct thing!\n\nNTA",
   "created_utc": 1701006663,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau3ul1",
   "message": "Absolutely call the police first. NTA.\n\nI'm just really surprised the dept didn't ask, is anyone injured.\n\nBut I wouldn't have helped either, you have him pinned, let the cops and ambulance extricate him safely without any risk of him hurting others.",
   "created_utc": 1701008311,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau4ac9",
   "message": "NTA",
   "created_utc": 1701008521,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau4gk5",
   "message": "obvious NTA.",
   "created_utc": 1701008600,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau4kph",
   "message": "Lmao he made his decision. Fuck that guy. If your dogs didn't hear him the dude would have been there all night potentially. So you still helped him in a way. Personally I'd make fun of him and talk shit. Maybe sue him for damages to the bike. I hate that hippy compassion shit. He could have had a knife and stabbed you. So fuck him, let him sleep in the bed he made.",
   "created_utc": 1701008655,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kau6ccu",
   "message": "he fucked around \u0026amp; found out.",
   "created_utc": 1701009460,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaukj0j",
   "message": "Score one for instant karma! Dude shouldn't have tried to steal your bike and I don't have sympathy for him. NTA.",
   "created_utc": 1701015388,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kauks0j",
   "message": "Had my motorcycle stolen in 1988. A GSXR-750. If I came out and seen the guy pinned under it I definitely would not helped him get up. Maybe even step on my bike a little. Fuck thieves.",
   "created_utc": 1701015489,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaula68",
   "message": "Hahaha NTA but FYI the official line is \"I saw him stealing my bike and called the cops. I didn't know he was pinned under it. If I'd known I would have called an ambulance for this poor poor soul.\"",
   "created_utc": 1701015689,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kaumdoa",
   "message": "Your mom is a weirdo",
   "created_utc": 1701016116,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kauo8ea",
   "message": "Not very helpful now, but getting an attorney is already mentioned below.\n\nI would assume during the conversation with the cops, the fact that he was trapped under your bike would have come up? And then automatically move on to \"is he hurt?\" and the police automatically sending an ambulance with them.\n\nQuick edit: As you, i got no compassion for thieves.",
   "created_utc": 1701016820,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kauu9pc",
   "message": "I would've called the emergency line and they could've sent both at the same time...",
   "created_utc": 1701019119,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kauzccn",
   "message": "NTA - My only concern would have been leaving my bike on its' side for that long.",
   "created_utc": 1701021026,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kav13l5",
   "message": "NTA, fafo. Should have tea bagged him and took photos for the world to see",
   "created_utc": 1701021684,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kav2b57",
   "message": "He wasn’t in any mortal danger as he laid there and thought about his life choices.",
   "created_utc": 1701022127,
   "score": 1,
   "submission_id": "18405fv"
  },
  {
   "comment_id": "kav2fnv",
   "message": "My main concern is for the bike.  Every time I dumped my scooter I flooded my air box or brake fluid leaked. Hope yours was okay!  \n\nMaybe a little AH because in my area it is possible to contact the cops and paramedics in one call. Otherwise, I get it.",
   "created_utc": 1701022173,
   "score": 1,
   "submission_id": "18405fv"
  }
 ]
}