{
 "submission_id": "1842m1c",
 "title": "AITAH for treating my in-laws different than my mom",
 "selftext": "Edit. Regarding the nurse. I already contacted the hospital and they said it wasn't a HIPAA violation and was also hearsay. Their words \"hearing something through the grapevine about a non-patient is of no consequence\".  \n\nInfo: I'm an only child. My father passed away in 2018.  Husband has much bigger family than me. \n\nMy husband (30M) and I (29F) just had our first child (girl) at the beginning of October.  I told my in-laws that I didn't want family gathered at the hospital while I'm giving birth. They respected my wishes and stayed home. My husband was hurt by my decision though when he found out my mother would be with me during labor.  \n\nMy in-laws found out about my mom being there since one of the nurses goes to their church and told them about it. Now the whole thing is awkward even though they haven't mentioned it to me. I still haven't invited them to come see our baby girl and told my husband I'm still not ready for visitors aside from my mom. He doesn't understand that my mom is different and has provided a lot of help since the birth.  \n\nMy husband keeps asking what his parents did to me to make me treat them this way. They haven't done anything but it's still my boundaries that they need to observe.  My husband went and spent Thanksgiving with his family. When he came home he told me that if I didn't start respecting his wishes as the father then he would have to take other measures for his family to see his child. Two of his good friends are accomplished attorneys and now I'm scared he has talked to them about the situation. \n\nI really feel that I should get as much time with my daughter as I want before introducing her to everyone else.  I don't think it's fair that he is taking such a hard line on it.",
 "created_utc": 1700973233,
 "permalink": "/r/AITAH/comments/1842m1c/aitah_for_treating_my_inlaws_different_than_my_mom/",
 "score": 109,
 "url": "https://www.reddit.com/r/AITAH/comments/1842m1c/aitah_for_treating_my_inlaws_different_than_my_mom/",
 "comments": []
}