{
 "submission_id": "1843v8t",
 "title": "AITAH for cutting my trans sibling out of my life",
 "selftext": "About 6 months ago my 30 year old sibling came out as trans and officially changed their name to something a bit more feminine. From the start I have been as supportive as I know how. I would make sure to do small gestures such as sending them gifts with the transgender flag and their new name on it to show I support and accept who they are. We have had several lengthy phone calls discussing where they are at mentally, frustrations and feelings overall after making friends and family aware of this change. A very common frustration comes from being misgendered or deadnamed which I completely understand can be exhausting to correct constantly. There has been a clear effort from family but it has turned to a single mistake leading to complete outbursts of anger.\n\nFast forward to thanksgiving, we traveled from out of state and quickly have seen how much of a stress they have been on family that see them every day. There was an incident where my grandpa, who is diagnosed with dementia, fell during thanksgiving and hit his head. This cut thanksgiving dinner short as we had to bring him to the ER. Previously before this incident, my grandpa deadnamed my sibling so they went into their room for the remainder of the night until other family was gone. I’m not even sure if they were aware of his fall but they are very aware of him having dementia.\n\nLater in the night we spoke again and they said how frustrating it is to be deadnamed. I cut them off and said they don’t have a right to be mad at somebody with dementia. They were now shouting at me saying they need to be able to complain about frustrations without being lectured. After coming to the conclusion that we won’t see eye to eye on this they stormed off.\n\nI personally can’t take the stress of being made to be the bad guy when I have tried to be nothing but supportive. It is frustrating to me that their identity is the only topic of conversation and everybody has to tiptoe around them to avoid an argument since they are always looking for areas that will anger them. Any conversation can go from 0 to 100 and I don’t feel confident it is going to change. We have circled for hours and hours of discussion and they also have continued to not seek any therapy to discuss this huge new life change with anybody but close friends and family. For my own mental health, I cannot be on speaking terms until they get further help and improve on their anger issues. So does this make me the asshole?",
 "created_utc": 1700977751,
 "permalink": "/r/AITAH/comments/1843v8t/aitah_for_cutting_my_trans_sibling_out_of_my_life/",
 "score": 181,
 "url": "https://www.reddit.com/r/AITAH/comments/1843v8t/aitah_for_cutting_my_trans_sibling_out_of_my_life/",
 "comments": [
  {
   "comment_id": "kat7pc0",
   "message": "NTA. I am a Trans person who cares for elderly. I mainly care for dementia and alzheimer's. These people who have memory and behavioral issues do not care if you're a trans person, they more then likely do not understand. New information goes in one ear and out the other, and your siblings is not being understanding to  the disease. While I agree it's annoying to be deadnamed and it can make you uncomfortable, your family member with dementia is definitely not going to remember someone telling him that they are referred to by a different name now. Compassion works in many ways, and your siblings seems to be lacking.",
   "created_utc": 1700985478,
   "score": 30,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasy2w7",
   "message": "NTA. Dementia steals a person’s mind. Everyone’s expectations of how they want your grandfather to speak and act needs to go right out the window—your sibling included. If they can’t be an adult and recognize that this is a time when their feelings need to take a backseat to an irreversible reality, perhaps they need some separate time.",
   "created_utc": 1700978562,
   "score": 248,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat8lh6",
   "message": "NTA\n\nIt is _exhausting_ to have someone treat you like a therapist, and every conversation revolves around them. I mean, do they even listen to your issues? This goes beyond them getting pissed that grandpa deadnamed them. They want empathy from everyone and can’t even empathize with another human being.\n\nYou go on and give yourself some space. Have a rest. And hold your ground about them getting a therapist. They’ll need to get one before getting surgeries.",
   "created_utc": 1700986166,
   "score": 74,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasyg16",
   "message": "NTA - this is main character syndrome, they’re going through a major change, however, it sounds like they’re blinkered to the fact other things around then are more of a priority than them. \n\nI’d suggest telling them you are stepping away for a while for your own mental bandwidth to deal with other things in your life. It’s a pause, not a cut. \n\nPerhaps your sibling will have time to reflect on their own attitude around others.",
   "created_utc": 1700978796,
   "score": 230,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasxdnp",
   "message": "NTA - not your circus, not your monkeys.",
   "created_utc": 1700978121,
   "score": 158,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katdtn9",
   "message": "NTA\nI am a trans person and I live with my grandparents BECAUSE my grandpa has dementia and I don't want him driving anywhere. He messes up my Pronouns all the time but he can't help it. Sure I can remind him every day but that doesn't change the fact he knew who I was, not who I now am. \nDementia is something that makes you know a person for who they were before you had dementia, now they don't know who you really are, but they know the memories they had with you. \nYour grandfather doesn't mean to misgender and dead name, he is simply using the words he knows were used for your sibling before he was diagnosed. There is no obvious malicious intent behind the dead naming and misgendering that  can see from this point of view. NTA\n\nDementia is something that no amount of changes done can help them live in the present. To put it bluntly, dementia patients live in the past. They know what they can remember and associate people with memories from years and years ago. Changing appearance, name, and pronouns will not (unfortunately) help your grandfather use the right pronouns and name because he can't help what time he lives in. \nImagine you woke up one day and everything seemed the same but one (or a few) people look and sound a little different. You remember what they were like a \"week\" ago so you assume nothing has fundamentally changed, sure you may be confused but that's still the same person, right? So surely I can refer to them as how I know them. \nThis is how dementia patients think. Sometimes they don't put together the pieces some trans people try so hard to put out for them. It's just something you have to deal with when living with someone with dementia. \n\nLong story short, NTA. Your sibling could use a bit of dementia research, maybe show them my comment. This perspective has been how I forgive my grandfather every day for what he just can't help but do.",
   "created_utc": 1700990381,
   "score": 44,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katb5f9",
   "message": "My great grandma in the last moments thought she was on a train and that we (mom, dad, grandma) were passengers or the conductor... I think you are lucky your grandpa could even recognize who you were.",
   "created_utc": 1700988203,
   "score": 83,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat6iru",
   "message": "NTA. They’re just trying to be the victim. Someone with dementia can’t be blamed. They just want drama and to be the cent of attention. Cut them out for good",
   "created_utc": 1700984561,
   "score": 109,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katayq0",
   "message": "NTA even without dementia there is an assimilation process to adapt to a big change from any human being.  Lack of patience and understanding does not help anyone",
   "created_utc": 1700988051,
   "score": 115,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat52tu",
   "message": "NTA. You siblings is the a hole in this case (yes, marginalized people can be aholes). They are going through a lot, but they are not the only one going through a lot. Expecting a dementia patient to understand and fully comprehend how to handle someone’s transition is an unrealistic expectation. Heck expecting anyone from that generation to know how to handle the situation out of the gate with no mistakes is unrealistic. It hard enough for those who grew up in a time that there was a T in LGBTQ realm of sexual identity to never make a misstep while trying to\nbe supportive. \n\nYes, being deadnamed is frustrating and hurtful, but unless it done with malice, your siblings reaction is not acceptable in any form or fashion. People are creatures of habit, they had been calling your siblings by their original name for 30 years, people are going to slip, even the most supporting allies. It happens when people get married, have a tittle change, start using their full name instead of a childhood nickname, and it going to happen here at some frequency until people get used to the change. \n\nIf your sibling acts this way with mistakes made with no malice they are going to lose a big chunk of the support system they had. A support system they should be grateful for, as a lot of transgender people receive little support.",
   "created_utc": 1700983462,
   "score": 74,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasyj3i",
   "message": "There’s a line between being supportive and caving to bullshit.  It looks like you know where that line is and your sibling doesn’t",
   "created_utc": 1700978852,
   "score": 152,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katb429",
   "message": "\u0026gt; I personally can’t take the stress of being made to be the bad guy when I have tried to be nothing but supportive. It is frustrating to me that their identity is the only topic of conversation and everybody has to tiptoe around them to avoid an argument since they are always looking for areas that will anger them. \n\nThis effectively sums up my nonbinary sibling who I have gone no contact with for reasons other than their gender identity. Constantly aggression, confrontation, obsession with their gender identity and delusion sense of entitlement has been key to my decision. They said I was a horrible, unsupportive sibling for saying I couldn’t just “give” them my house deposit so that they could get gender-affirming surgery. I said I had been considering talking to my husband about lending them some money for it, which would be coming from our house deposit, but because of the sense of entitlement they had about it (they called it “extra money” that we “wouldn’t really need”) it was a flat **fuck no** from me, and seeya round to boot. Don’t know who that person is, but they’re not my sibling. \n\nThere seems to be a deep, almost narcissistic obsession with correcting other people for accidentally misgendering (even when they self-correct) and explaining again and again about trans or non-binary identity. It’s honestly disturbing and is polarised in its attitude towards retraining your brain to get used to the new pronouns and names. It gives well-meaning people who care about that person absolutely no slack and just ends up disengaging them from that relationship.\n\nIn short, I empathise wholeheartedly. People can be trans and also be a narcissistic asshole.",
   "created_utc": 1700988171,
   "score": 98,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kataqsa",
   "message": "as an agender person, your sib needs to do more work on theirself and their impact on their loved ones. yea, being trans can strain your relationship with people who have known you your whole life. but when you have people doing the work to include and honor you, you have to acknowledge that. and when relatives are dealing with a disease that makes them fail to recognize their own children, you have to let shit go.\n\nedited to add: if you decide that despite the efforts you've made, your sibling will only see the worst, that's not you being un-supportive, it's you protecting your energy.",
   "created_utc": 1700987869,
   "score": 33,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katfet9",
   "message": "NTA - we routinely tell people to cut toxic individuals out of their lives. Someone being trans does not in any way alter that logic or reasoning. If the person themselves is a problem, just cut them out....because that's what you DO with cancer.\n\nYou could always rethink your decision if they change who they are as a person. They should be expected to show just ABIT of the sympathy and understanding they are demanding other people have of THEM. Given how people used to behave 80 years ago, the fact that granddad is being accepting at all, despite having DEMENTIA, is already a huge effort on his part. Of course granddad forgot this persons new name, he can't remember it, he may very well not remember entire HUGE portions of his lifespan anymore. That part of his memory is GONE! What would this person rather have granddad say instead? \"Hey You?\" Just, replace your entire name with a pronoun?\n\nActually wait, they MIGHT prefer that entirely actually.",
   "created_utc": 1700991680,
   "score": 21,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat60yj",
   "message": "NTA - You 100% support your siblings choice and journey but you can’t stand to listen to the soundtrack they’re playing on the way.",
   "created_utc": 1700984183,
   "score": 24,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat9gw2",
   "message": "Nobody likes being deadnamed or misgendered, but most of us make exceptions under certain circumstances. Like for grandpa, who will eat paint if you don't watch him closely enough.",
   "created_utc": 1700986858,
   "score": 25,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katdaqt",
   "message": "Depression or angst can make people extremely self-centered. But while that may be understandable, it's also hard for others to deal with.\n\nYour sibling is so full of their own angst that they don't have space for compassion or consideration for others. But that is a requirement for successful relationships. You are not a mental health practitioner, and it's unjust of them to treat you like their therapist.\n\nAccidental deadnaming is obviously going to happen, even by the most well-intentioned. Not giving your loved ones grace to make mistakes if they're sincerely trying, is very bad and irrational behavior; and it's by no means universal among trans people. \n\nThe saddest part of that is the trans person who does this creates more distance between them and those who love them. As they did with you.\n\nNTA. I hope your sibling grows into their transition more gracefully with time.",
   "created_utc": 1700989949,
   "score": 7,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasxh40",
   "message": "Taking a break for your mental health is valid, but expressing concerns with empathy can maintain open communication for the future. It's about finding a balance between supporting your sibling and preserving your own well-being.",
   "created_utc": 1700978182,
   "score": 100,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katygd7",
   "message": "NTA. It’s exhausting. They are the most important person in their life. They are not the most important person in everyone else’s life. Their new identity isn’t what everyone else thinks about all day long. \n\nI have found that the newly out trans people in my social circle are selfish and do not understand that the rest of us are doing our best to be accepting, but we also have lives and responsibilities and their new identity isn’t what I care about every second of every day. \n\nDementia patients aren’t going to grasp what’s happening. And your sibling expecting that is not acceptable. My grandparent with dementia thinks it’s 1987. And they just moved to the farm they’ve owned since 1960.",
   "created_utc": 1701005540,
   "score": 6,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat5oas",
   "message": "Lots of people are so focused on themselves and their feelings that they can't take into account other people's experiences. \n\nLike being trans, you can't help having dementia. You can't even look after yourself, people should be able to take in another's faculties and make a logical choice about how they feel.\n\nHonestly, some of my friends who came out as trans have become a lot more self-centered and all consumed with their identity and how people respect it. This has caused friction, however we got to remember they lived most of their life in a lie and they finally feel.like they can prioritize themselves.\n\nNTA",
   "created_utc": 1700983914,
   "score": 20,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katt5ik",
   "message": "NTA I'm trans and most of my family still calls me by my birth-name and I don't really care, do you know why? Because I'm not an asshole and I understand that they knew me by that name for 16 years and it's hard for them to change the habit. They assured me that they are supportive so I assured them that they don't have to feel bad for dead-naming me. I don't care what you call me, I care if you accept me as the person I am.",
   "created_utc": 1701002362,
   "score": 22,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasxlnc",
   "message": "NTA. They are looking to fight.",
   "created_utc": 1700978260,
   "score": 31,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katwhmp",
   "message": "NTA but hear me out, although your sibling is being unreasonable they're also going through a highly emotional time. It's okay to take a step back and limit contact for a while if that's what you'd need to do, but I'd go low contact first instead of no contact, and attempt to set healthier boundaries with them. Remind them expecting to be able to vent to you isn't the same as expecting you to provide free therapy. They may act a little crazy for a while because coming out alone is scary and very overwhelming, let alone transitioning publicly. They deserve some grace for acting like an obnoxious self-absorbed drama queen during this time, however a grace period doesn't mean they can get away with anything and they certainly need to grasp that your grandpa will never make a recover and is literally going to continue to mentally decline until death.\n\nIt's an overwhelming and difficult time for everyone in your family, your sibling is going to have to find better coping mechanisms and you may need to suggest a diary or something if they're not willing to go to therapy. Only you know if it's worth fully going no contact but this behaviour is likely temporary as a result of feeling very overwhelmed, unless they were self-absorbed and combative beforehand.",
   "created_utc": 1701004432,
   "score": 5,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau1zq6",
   "message": "I’m exhausted by them just reading this.  It’s all so selfish.  Absolutely NTA",
   "created_utc": 1701007397,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau3bqp",
   "message": "NTA. Your sibling has a big issue but it’s not about being Trans. They are simply using that as ammo and cover. They disrespected you by not allowing you to have an opinion that differed  from theirs or to really listen to and hear you. You were unable to influence or alleviate their suffering and anger. At that point there is no longer any point or value in interacting.",
   "created_utc": 1701008055,
   "score": 5,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauqv0e",
   "message": "NTA - toxicity is toxicity, no matter sex or identity. If they're using their journey as an excuse to take their frustration out on other's, there no better than any other toxic person using a hard time in life as their excuse.",
   "created_utc": 1701017822,
   "score": 6,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat5jd4",
   "message": "NTA. What if your grandpa, with dementia, called any other family member a dirty, nasty, awful ______ (fill in the blank with whatever you find most offensive)?\n\nIt's possible to have a transgender family member who also happens to be a selfish asshole, and them being a selfish asshole can be unrelated to them with being trans.",
   "created_utc": 1700983808,
   "score": 20,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kath5g8",
   "message": "I work in a Centre with Dementia clients. I have known these people for years and I still get questions like \"who are you?\" \" what are you?\" And my favourite (whispered) \" are you real?\" \n\nWhat your sibling is doing is ridiculous. This seems like a major attention grab. I understand it's frustrating being misgendered and deadnamed, but your Grandfather has a disease that affects memory and cognitive thinking. At this point they just want to be seen as \"oppressed\".",
   "created_utc": 1700993111,
   "score": 14,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katblvf",
   "message": "Nta.\n\nSadly, in my experience you often find that people who are trying to conceive, having sexuality or gender issues, or following  religious paths, often become so self absorbed in this, that they cannot see anything beyond this one facet that becomes their entire identity and focus in life.\n\nThis sounds true for your sibling.\n\nAnd the sibling is now so self-absorbed they cannot see anything beyond themselves, even the impact of dementia.\n\nI don't think that I'd cut your sibling out of your life, per se, I may just swerve some of the occasions they'll be present until they calm down as 6 months in, they're in the throes of this gender issue being all encompassing. Give them time to hope things will calm down.",
   "created_utc": 1700988569,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katcu6c",
   "message": "NTA if it was someone else or he didn’t have dementia then I can understand. But ducksake, he won’t even remember the conversation at all. Like the fact he even remembered the deadname. \n\nI remember visiting my great grandmother and I visited her when I was 14 to see and check up on her. Was staying at a friends house who lived close. She let me in and we stayed for a bit. After the visit she rang my grandmother to tell her how a lovely young lady came to visit. She forgot who I was. Man if I was deadnamed that time I would be happy as she would have remembered who I was.",
   "created_utc": 1700989572,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katnxd8",
   "message": "NTA. Even without dementia, expecting a grandpa to remember to keep using a new identity with their *30 year old* grandchild is a bit much. Hell, I slip up all the time calling my co-workers by each other's names. It's not out of hate. It's because I'm forgetful as fuck.\n\nIt sounds like your sibling is starved for attention and just wants to make everything about themself. Selfish, entitled, and completely lacking compassion. Nothing you do will be right unless it conforms to whatever they want. Cut away, and wash your hands of it until they can learn that respecting people goes both ways.",
   "created_utc": 1700998581,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau36in",
   "message": "Yeah as a nonbinary person, I’m gonna say NTA. I get how hard it is to be deadnamed + misgendered, sometimes you have to pick your battles. The battle you should be okay losing is this one. As unfortunate as it is, your grandpa isn’t gonna remember her name + she needs to come to terms with it. I’m not saying you need to be the one to reach out but maybe soon she’ll see she needed to relax on this one here.",
   "created_utc": 1701007984,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauc2wm",
   "message": "Your sibling wants compassion \u0026amp; understanding but refuses to give compassion \u0026amp; understanding .. NTA",
   "created_utc": 1701011977,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaud0f1",
   "message": "NTA - When grandpa get to the part where they don’t even remember their face I hope they will sing a different tune. \n\n\nYou aren’t cutting them out for being trans. You are cutting them out because they are an asshole.\n\nGender identity doesn’t stop people from having empathy. Your sibling just doesn’t have it.",
   "created_utc": 1701012368,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaujovf",
   "message": "They are 30 years old, had only transitioned 6 months prior, had been dead named by a person with dementia and they went to a room for the rest of the night? Then they exploded after when you talked to them? There's more gong on here beyond the dead name issue. There's an abundance of childish actions coupled with a good sprinkling of anger. You are NTA.",
   "created_utc": 1701015061,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauoicc",
   "message": "NTA. Your sibling needs a therapist to help them navigate these changes and it 100% cannot be you. Frustration and annoyance are understandable, but they need to realize that while their identity is their whole world it is not everyone else’s, and that even people who are trying their best make mistakes. A therapist can help them with all of that. Also, grandpa is obviously NTA here either and sibling is choosing to be unreasonable over it.",
   "created_utc": 1701016925,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauoy62",
   "message": "NTA - I'm also trans, and when my mom was in the hospital recovering from sepsis, she accidentally used my birth name because she was all hopped up on painkillers. I just gave a good natured shake of my head and left it be, because it obviously wasn't meant as a slight, she was just super out of it. \n\nMtF transpeople also have the added struggle that passing isn't going to be fast or easy. I know I'm lucky that I'm FtM because testosterone takes the wheel and creates huge changes in just a couple years. I'm completely stealth at work, but my sister can't be, because it's more obvious that she's AMAB. I feel for her, because I know she struggles, but she also doesn't make it the problem of everyone around her. \n\nYour sister is going to have a very lonely life if she keeps up this persecution complex.",
   "created_utc": 1701017096,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaupul3",
   "message": "NTA. Your Granpa can not even comprehend what \"Trans\" even is. much less that a family member is changing themselves. They need to seek therapy if they are getting angry about Grandpa \"deadnaming\" them. There will come a time when Grandpa will not even know who they are and that they ever existed. \n\nWhen my daughter was 5, my Great grandmother began calling her \"Elizabeth\". Why? her daughter Elizabeth died of Polio when she was 6 and Grandma had lost most of her memories after 1935. \n\nMy daughter, as a child, understood that Grandma's mind was turning to mush and that Grandma really didn't understand that she was her Great-great granddaughter and that her name was not Elizabeth.   She went along with it and actually developed a close bond with Grandma playing the role of Elizabeth. \n\nAnd sadly, at the end of Grandma's life; my daughter was the only one who could talk to Grandma as Grandma had forgotten English and could only seem to understand her native language.  Grandma never spoke her native language once she learned English as a child, and only taught it to \"Elizabeth\".",
   "created_utc": 1701017439,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaut2yk",
   "message": "NTA. Dementia is a cruel illness. People genuinely don't remember newer information, for some reason the most recent information goes away first. It is SO frustrating and frightening for the people suffering from it, they see they've made a mistake and are powerless to remember the new thing. My grandmother with dementia forgot I ever existed. She also forgot her husband of 60 years, her kids - everyone. I'd have given a lot for her to remember me at all, even with the wrong name. \n\nBeing trans doesn't mean the person can't have empathy and compassion.",
   "created_utc": 1701018663,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kautufk",
   "message": "Nah they can fuck right off with that attitude lol. Poor guys suffering with dementia and this loser has the audacity to try and make it about them.",
   "created_utc": 1701018955,
   "score": 4,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katepi3",
   "message": "NTA \n\nI am 100% a supporter of trans rights and there are countless examples of people being disrespected, deadnamed, bullied, threatened, even killed for their gender identity. \n\nHowever, those people also need to respect the fact that not everybody is going to be able to keep up with this huge change in identity and presentation, and elderly people with cognitive impairment are absolutely one group that really can’t be expected to understand or get it right 100% of the time. \n\nNot to mention there was a fall which very well could have been a medical emergency for grandpa. A bump on the head can be catastrophic for elderly people and for your sibling to make this whole ordeal all about them and their displeasure with which name grandpa used? That right there is the asshole behaviour. \n\nIt can’t be easy being a trans person, but it’s not that hard to be a kind person. Especially toward your elderly grandpa. Especially during the holidays.",
   "created_utc": 1700991106,
   "score": 13,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat8lu5",
   "message": "Sometimes my mother, who does not have dementia, calls me on my siblings’ name. Both my brother’s and my sister’s name happen occasionally. And I dont give a fuck. Caling someone on the name she used to have her whole life until now is a very easy mistake to do, though I would not call it a mistake. And then grandpa even has dementia.\n\n\nYour sibling is a major douchebag, or mentally ill.",
   "created_utc": 1700986175,
   "score": 22,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kasy98s",
   "message": "I've been banned from a sub on reddit for saying a woman who'd been sexually assaulted should not be judged for having an issue with penis havers, even if said penis haver claimed to be female. \n\nTrans rights do not transcend other rights. Having dementia is not a reason to put your own feelings first..\n\nTrans women ARE women, but dementia patents ARE dementia patients. \n\nThere is no ill intent in dead naming. Trying to make it such to be the victim is appalling. At the point you play victim in these situations, you use up any support I have for you.\n\nI'd cut them off here, too. Finally and forever. If they cannot have and show empathy towards someone with dementia (or as I said, someone who's been a victim of a penis haver), then I cannot support them. Life does not revolve around their choices.\n\nBye felicia.",
   "created_utc": 1700978676,
   "score": 78,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat7cua",
   "message": "NTA. They need good therapy and help.",
   "created_utc": 1700985205,
   "score": 8,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katdr66",
   "message": "My sister was exactly like this when she was first transitioning. She called a lot of people unsupportive over some incredibly unreasonable things. Hell, she still to this day says my other sister is anti-trans, but other sister spent two years of college writing papers about the importance trans rights.\n\nOne of the things that helped my sister a lot was sitting down and explaining to her that we understand that the world is persecuting her, but we aren’t.",
   "created_utc": 1700990324,
   "score": 6,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau35ot",
   "message": "NTA. Gay here. Anyone, literally anyone, who is consumed with their identity and has nothing else to talk about ( and is constantly looking for a fight) needs therapy. That applies to trans, Christians, gay, boomers, etc. relationships are a two way street, not a one way ride on your psycho highway. Also, a note to my trans and gay folks: it took us decades to discover and accept who we are. It’s cruel and stupid to demand that those around us make an immediate evolution and never ever make mistakes. Utter rubbish. Give people the grace you needed on your journey.",
   "created_utc": 1701007973,
   "score": 7,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau5ndv",
   "message": "\n\nUnfortunately, I know a lot of trans people who went through the \"main character syndrome\" phase. Luckily they usually cool off after a year or so. How long has your sibling been out as trans? Give it some time. I can think of so many trans people who went through this \"being a complete fucking asshole to anyone who isn't the perfect ally because REAL trans people have STANDARDS\" phase.\n\nFor some of us it is the opposite, we retreat into ourselves when we are misgendered during that delicate initial period of transition (negative self talk, despairing, even self harm). But for some people they decide to become the woke police about it. It can really put a strain on families. I am sorry this is happening to you and I hope your sibling will chill out soon enough. So, NTA, but I would advise waiting a good year or so before cutting this person completely out of your life.\n\nTrust me, I don't know anyone who was been on HRT 5+ years (even 3+) who still blows a gasket when they are misgendered accidentally. Otherwise, that person would probably have serious anger issues in other aspects of life, too.",
   "created_utc": 1701009150,
   "score": 7,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katf9au",
   "message": "I am 30 and constantly forget people names, if someone in my family changed their name for any reason I would constantly  \"deadname\" accidently. They do not get to change their name and then get upset when people forget or say the wrong name, they should accept they have 2 names for a while and put up with having to correct people for a long while. NTA I would have made them feel worse about what they are doing. (PS I still occasionally get called my nickname sometimes from over 10 years ago which I have tried to stop, so no sympathy from me lol)",
   "created_utc": 1700991555,
   "score": 10,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kats7bh",
   "message": "NTA. Without some grace for others, your sibling will have a future that will be full of slights, on purpose and accidental. My son’s ex-wife came out as gender queer with they/them pronouns. I am pretty good at speaking, but every time my son uses the pronouns I wonder who they were with. 🤦‍♀️\n\nNo malice on my part. I am 55 and this wasn’t a thing for a lot of my life. I have no intention of being rude or hurtful to anyone, but my brain kinda defaults to traditional definitions.",
   "created_utc": 1701001729,
   "score": 8,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat868u",
   "message": "Nta. They just sound like someone who loves to yell and complain",
   "created_utc": 1700985842,
   "score": 14,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katdez5",
   "message": "I sometimes call my daughter by my son's name and vice versa. Damn, yesterday, I even called my son by my dog's name and we laughed it off.. what's so wrong in being dead named by mistake?",
   "created_utc": 1700990047,
   "score": 10,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat72gm",
   "message": "It's not you responsibility to carry all of your siblings burdens. You are very supportive and were right to be honest and assertive regarding someone with dementia,  there needs to be some understanding and leeway there. I think your sibling really needs some therapy to get the some emotional balance and a realistic perspective and to have some coping mechanisms in place. It's OK for you to take a step back if you need to.",
   "created_utc": 1700984984,
   "score": 7,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kat9p39",
   "message": "NTA My grandmother had dementia before she died and I worked in healthcare facilities and quite a few of the patients had dementia. It's frightening what it does. You're sublime needs to get over being dead named by someone with dementia. Let alone after the trip to the ER. There are more important things like the health of your grandfather.",
   "created_utc": 1700987039,
   "score": 6,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katcr7s",
   "message": "NTA They genuinely sound like they have really low self esteem due to knowing that a lot of people don't agree with their situation. When the slightest thing brings light to that even from people who care they immediately and emotionally react. This is the perfect example of it that they are annoyed that a person with dementia said it. Maybe don't cut them off but avoid them for a while while you both have time to think. I don't see them getting better if they can't even understand your side and are calling it a lecture.",
   "created_utc": 1700989505,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kate8jt",
   "message": "NTA, your sibling should be understanding of dementia. Going from 0 to 100 in that case doesn't make any sense, because it's not a deliberate insult. Your stunning isn't the only person who has mental health problems and needs. Empathy should be a two way street. \n\nI just saw a video on insta of these two old people with dementia who forgot they were divorced. You can't expect someone with dementia to remember things, even when they're important.",
   "created_utc": 1700990719,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kate93p",
   "message": "NTA Your sibling needs to understand that not everything is about them and your grandfather deserves to be treated with kindness too.",
   "created_utc": 1700990733,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katfknn",
   "message": "NTA you are being supportive, but the anger and outbursts are not your responsibility.  They clearly need professional help as this is beyond what can reasonably be expected. I understand deadnaming is painful, but expecting someone with dementia to remember is not appropriate or acceptable.",
   "created_utc": 1700991816,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kathn7w",
   "message": "NTA\nTrans people are pretty much the same as everyone else. 90% are sound and just want to live their life quietly in the same manner as 90% of the cis population. Which means the same rules for whether or not they are assholes apply.\n\n10% of any population are assholes and sadly your sibling falls into this category. Trans changes an identity not a personality so they were most likely always a selfish asshole to begin with.",
   "created_utc": 1700993515,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katkd8e",
   "message": "This seems to me to be less about a family's response to the transition of a family member, more about the trans person themselves struggling with how to go forwards. You don't say whether your sibling is transitioning medically as well as asserting their gender identity. I'm not sure how it is where you are but in Europe this would automatically go hand in hand with an initial in depth counselling program to help the person find their way in their new world. Medical processes would follow this. If your sibling is not choosing to medically transition then that counselling is just as important, if not more so. \n\nOf course you are not an arse for separating yourself from your sibling. If they aren't taking steps to support and help themselves, they are being unreasonable in asking the rest of the family to do so. If you can however, and still feel you would like to, you could speak to them about this. Perhaps they feel that the purpose of gender counselling is to try to persuade them that they are wrong about themselves. If this is their concern, maybe help them find a counsellor they can trust who will help them with what is clearly a struggle for them, and is becoming a struggle for people who love them.",
   "created_utc": 1700995722,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katl6y1",
   "message": "NTA. Dementia and Alzheimer’s can take full control of someone, they often don’t know what they’re saying or doing. They can’t really take in any new information. Your Grandpa has no control over this. Your sibling needs to be more empathetic and understanding. Yes it’s frustrating for them to be deadnamed but he has no control over this.",
   "created_utc": 1700996391,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katodee",
   "message": "Before my Nana passed I(her oldest grandchild) got to see her one last time for a family Christmas.  I was warned that she more than likely wouldn't remember who I was because she had forgotten so much including grandchildren,sons, and daughters in law.   Low and behold when I opened that door she said my name and everyone was in shock.  \n\nNTA. If your sibling has NOT received any of the therapy  technically they can say they are trans but I bet they haven't even started their estrogen shots.  Hopefully they seek the therapy they need for their transition otherwise they will forever be trans by name only.  Js",
   "created_utc": 1700998936,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katqsun",
   "message": "NTA, while I sympathize with the struggle of being transgender. You need to realize when you're leaning on people too much or forming unhealthy habits.  \n\nIf they aren't seeing a therapist/counselor, they desperately should ASAP. The kind of stress and coping strategies aren't meshing well, and you're pointing out very reasonable things. They're expecting someone with dementia, whose brain is destroying itself, to perfectly remember something people of sound mind can fumble or struggle with.  \n\nIt's also one thing to have to remind the same person over and over vs. blowing up on a person for making a mistake one time because other people have been pissing them off.\n\nRegardless of how valid someone's stress is, they aren't entitled to treat other people like emotional punching bags to feel better.",
   "created_utc": 1701000754,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katxa9z",
   "message": "NTA but you're pretty much required to have therapy when you're trans and wants to transition anyway.",
   "created_utc": 1701004894,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katz2zj",
   "message": "NTA. Your sibling is extremely selfish.",
   "created_utc": 1701005877,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katzjuh",
   "message": "NTA. Your sibling is just a self-centered egotistical douchebag. Being Trans has nothing to do with it. Good for you for taking a stand, not just for yourself but for your family. Keep it up.",
   "created_utc": 1701006129,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katzkwz",
   "message": "NTA NTA NTA NTA!!!  AT!ALL!\n\nThe vast majority of people, including me, fully understand how exhausting and insufferable these situations can be.\n\nThis is the trans equivalent of a religious zealot...it's all about them, their beliefs, and their feelings.\n\nAnyone who wants understanding and support needs to also offer the same support to others who are either genuinely trying or who truly need help understanding their plight.  This \"the world revolves around me\", \"it's all about me\", and the \"hey, look at me, I'm special\" attitude will only breed resentment and non-compliance, and this isn't just about trans issues.",
   "created_utc": 1701006145,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau055b",
   "message": "My son (trans) says its ok to describe something about \"her\" before he transitioned because it was easier timewise to use before and after. Also its easier for me sometimes as i really am getting forgetful. Not dementia, just age!",
   "created_utc": 1701006445,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau39qx",
   "message": "NTA.\n\ni fully understand that being deadnamed is annoying and hurtful, even if it's accidental. however, as long as people are genuinely trying to adjust and simply slip up, it absolutely doesn't warrant a damn outburst of anger. especially when someone is suffering from dementia, obviously.\n\nffs, of course they mess up. but obviously not because they want to be rude or mean. hell, my grandma used to constantly call me by my then *60 year old uncle's* name, when i was a 10yo girl. happens. it's whatever.",
   "created_utc": 1701008028,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau3x4r",
   "message": "NTA. Your sibling needs therapy to help with what they're going through. It must be very hard to tell your family that for 30 years they've been uncomfortable being the person you all thought they were. I think you've been very supportive but it's not your job to be a therapist. Your family all sounds very supportive and grandpa literally has a brain that is not functioning normally anymore so he really shouldn't be held to the same standards. \n\nI don't think you should cut them out of your life for good, but maybe just distance yourself for awhile and encourage them to see a therapist to help deal with all of this. While it may be difficult for you, put yourself in their shoes and understand that this is new for you but they've been struggling for decades.",
   "created_utc": 1701008346,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau3yke",
   "message": "NTA. My mother has had dementia for years, doesn’t know who my kids and I are and thinks she’s younger than me. That’s the sad nature of the condition and anyone with empathy understands that.",
   "created_utc": 1701008365,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kau47gd",
   "message": "A gentleman with mild dementia used to come into my workplace daily. He would call me a new name every day. “Good morning, Susan!” (Lucy/Terry/Annie/et. al!) He said it with complete confidence that that was my name and always had been. It struck me how delicate our brains really are; one little thing goes awry and oop! that girl you’ve seen daily for years is a new person every morning.\nI’m cis and don’t deal with dysphoria, but I hope your sibling can find a way to manage theirs so that it doesn’t overshadow their ability to empathize with others. If they were in grandpa’s position, wouldn’t they want a bit of grace?",
   "created_utc": 1701008482,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauad3p",
   "message": "They should probably seek out a therapist to deal with anger issues\n\nMistakes are going to happen and your sibling should make an effort to appreciate the people who try their best even if they make a mistake",
   "created_utc": 1701011240,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauadce",
   "message": "Yeah NTA. Yes, I am sure it can be frustrating and hurtful to be deadnamed. However the biggest issue I have with a lot of the trans discourse I see is people, not just trans people, generally have this inability to look past themselves for even a moment and realize they’re also conversing with and sharing the world with other human beings. \n\nI have a great grandma who’s almost 107, she is remarkably healthy and sharp *considering her age*, however- she was told I had gotten married and I’ve had my tattoos for awhile now, and just this past new years she realized both of those things, it was basically new information for her, even though she’s acknowledged it before. \n\nMy point is, your sibling needs to look outside themselves for 5 minutes and realize that not everything is a slight against them, and that your grandparent is literally incapable of retaining new information let alone acting on it.",
   "created_utc": 1701011242,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauakj5",
   "message": "Nta. I’m not trans so obviously I can’t speak for them. But in my experience with the community they appreciate effort. As long as you’re sincerely trying. It’s hard to get used to something different than what you’ve been saying for years. But if you’re trying it’s what matters. And someone with dementia needs to be off the hook. Completely. \nYour sibling has major anger issues and needs therapy to deal with this. From a therapist who has experience with LGBTQ + members.",
   "created_utc": 1701011328,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaub9bn",
   "message": "NTA, your sibling is a AH.",
   "created_utc": 1701011626,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauec5e",
   "message": "NTA.  I’ve read and heard stories of trans folks flipping out over actions that are NOT transphobic.  the over-the-top over-reactions are doing the trans community NO FAVORS.  In addition your examples, the other I repeatedly see is a trans person being rejected romantically/sexually, and their response is that it is allllllways transphobia.  Smh",
   "created_utc": 1701012911,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaujak8",
   "message": "My grandad thought I was his daughter. He thought my dad was his best friend instead of his son. He struggled to remember my dad's name once. He thought a nurse's name was piddles and kept calling her piddles. Dementia is a beast. I know sometimes my family needed more patience when my grandad was in the early stages with no diagnosis.",
   "created_utc": 1701014905,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaul8yu",
   "message": "I'm also a transfemme person. My take here is that you're NTA. \n\nIt's super challenging becoming the person you truly are even with all the support in the world. For some people, these challenges can be such that they become the focus of the person's world. The results can be that there's no space left for compassion with others. I'm guessing that's where your sib is. Sounds like some therapy might be helpful at this point. \n\nI hope you all can work through this. I'm sure they need your love and support as they move through life on this new path.",
   "created_utc": 1701015675,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaulmir",
   "message": "NTA. A feeling of trans identity almost always coincides with other mental health issues. It's not unusual for them to be quite unstable in fact. I have an ex-half-sister, now half-brother who has gone down this road. They are mentally unstable, very tied up in finding reasons that other people are to blame for how they feel about themselves. I'm sorry.",
   "created_utc": 1701015823,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaun4zw",
   "message": "NTA. Trans people have a hard life. But trans or otherwise, there are people out there who find a sick satisfaction in thier own victimization.",
   "created_utc": 1701016409,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kaur2jy",
   "message": "NTA. Apparently understanding is a one way street for some.",
   "created_utc": 1701017903,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauut0f",
   "message": "I agree with your actions and choices. It is unfortunate when you have to cut somebody out of your life because they don’t take care of themselves. It is clear you are supportive of their choices. What is not okay is how toxic this issue has become and how it is affecting your family. I whole heartedly agree with you that your sibling needs to get therapy. The boundaries you are setting are more than reasonable. It sucks when our own stuff gets in our way of having healthy relationships. We have to be accountable for how we affect the people around us.",
   "created_utc": 1701019320,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "kauxqem",
   "message": "My kid is 13 and NB. They have a grandmother with dementia. My kid knows their grandmother can’t retain their chosen name and can’t comprehend their gender. They don’t get mad about it, because they understand grandma can’t choose it. \n\nIf my 13 year old understands, your 30 year old sibling should be able to figure it out.",
   "created_utc": 1701020428,
   "score": 3,
   "submission_id": "1843v8t"
  },
  {
   "comment_id": "katey7a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1843v8t"
  }
 ]
}