{
 "submission_id": "1845myj",
 "title": "AITAH for refusing to bring drinks when helping my friend move out?",
 "selftext": "My friend is moving out of his parents house and asked for my help. I told him that I'd be there to help out. An hour later, he texts me to also bring some seltzers for when were done moving things in... I didn't respond to that text, but I show up to help out and he got frustrated with me for not bringing the drinks.\n\n  \nI'm open to admitting I'm in the wrong in this situation, but is it okay to ask the people that are already helping you move out to go buy things for them??? Shouldn't it be the other way around??? He's my friend, so I wouldn't even accept payment from him, but I thought it was on him to at least provide us with food/snacks and maybe some drinks after as a way of saying \"thank you, for helping me carry all these heavy ass items when you didn't have to and could be doing anything else, instead\"",
 "created_utc": 1700984718,
 "permalink": "/r/AITAH/comments/1845myj/aitah_for_refusing_to_bring_drinks_when_helping/",
 "score": 151,
 "url": "https://www.reddit.com/r/AITAH/comments/1845myj/aitah_for_refusing_to_bring_drinks_when_helping/",
 "comments": [
  {
   "comment_id": "kat6xcd",
   "message": "NTA\n\nYou're assumption is correct. The person asking for help should be the one providing refreshments and food.",
   "created_utc": 1700984873,
   "score": 226,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kat87pz",
   "message": "NTA- It is customary for the person receiving help to provide food and drink. \n\nIf your friend keeps pressing you can share kindly that your contribution towards their move, and in fact their housewarming gift was your help to get them in. Asking for you to bring extra stuff seemed off. Unless you were already going to the store you being their instacart is not your role.",
   "created_utc": 1700985873,
   "score": 42,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kat9100",
   "message": "NTA. If someone is kind enough to help\nyou move you provide food and drinks, that is the least one does. By not even doing the basic your friend is going to find himself sort on volunteers the next time he needs help.",
   "created_utc": 1700986510,
   "score": 12,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kat9uxn",
   "message": "NTA! Whenever I asked a friend to help me move, I'd say there's a case of beer in it for you.",
   "created_utc": 1700987166,
   "score": 9,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katddh6",
   "message": "I generally stopped helping people that I wish to remain friends with move, after a few such ingratitude moments. Better to be busy that weekend than risk finding out they somehow think me doing thier physical labor for free was a somehow them doing me a favor.",
   "created_utc": 1700990012,
   "score": 5,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katfnps",
   "message": "Is your friend actually moving out or being kicked out for mooching? \nYou need better friends",
   "created_utc": 1700991887,
   "score": 6,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katca32",
   "message": "It is reasonable to expect the person moving out to provide refreshments for those helping.",
   "created_utc": 1700989117,
   "score": 3,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katexrw",
   "message": "NTA - what the fuck is wrong with this person? You offered to help provide FREE LABOR for several hours, labor in which you could have potentially been injured (moving furniture isn't easy and can be unsafe) and this motherfucker had the nerve to expect you to pay for him to get drinks too? THIS WASN'T A SOCIAL OUTING! This, was you, offering to help HIM, for FREE!\n\nThe sheer fucking AUDACITY and ENTITLEMENT of some motherfuckers. If i was offering to give someone SEVERAL HOURS of backbreaking labor, FOR FREE, and they had the nerve to demand free shit on top of it, i would stare them in the eyes, slap the shit out of them, go home and their their selfish ungrateful ass could move their OWN shit.\n\nGet better friends. Me and my friends verbally abuse each other all the time for hours on end and we still know better then to spite a hand offered in support.",
   "created_utc": 1700991294,
   "score": 4,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katndyr",
   "message": "Thank god I don't have to help people move anymore. But the person being moved *always* supplied pizza and beer, and plenty of it.",
   "created_utc": 1700998150,
   "score": 4,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katmelh",
   "message": "Yes it's on him. He should be kissing the ground you walk on for helping. Most people decline so remember that for next time. NTA",
   "created_utc": 1700997363,
   "score": 3,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katn5zp",
   "message": "Nta. Wtf. Someone helps you move, you shout drinks and / or food. You borrow a car, you put petrol. This is just standard stuff",
   "created_utc": 1700997972,
   "score": 3,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katpvvu",
   "message": "NTA..so, he asks you for help and then makes out like you owe him? Is he having a stroke?",
   "created_utc": 1701000090,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katq2ek",
   "message": "INFO - was he planning on reimbursing you?",
   "created_utc": 1701000224,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katq7x7",
   "message": "I moved house today and bought dinner for my friends that helped. Fuck your shitty friends sense of entitlement. Get better friends.",
   "created_utc": 1701000335,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katrziq",
   "message": "... What he wanted you to move his stuff and pay for the drinks??? Like friendship is you know priceless... But I feel like this is a one way street relationship from this tiny tiny preview.",
   "created_utc": 1701001579,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kats2ec",
   "message": "NTA. It's a very firmly fixed custom that when you ask friends to help you move, you provide them with food and drinks, not the other way around.",
   "created_utc": 1701001634,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katsjrh",
   "message": "hard NTA. You helped HIM move, drinks and food are on him, not you, busting your ass to do him a favor for free. Whenever my buddies or i move, whoever is recieving help is buying lunch/dinner and drinks. Thats what's expected of someone who is saving a few grand instead of hiring a professional moving service",
   "created_utc": 1701001963,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katuqk0",
   "message": "NTA- It is customary for the person receiving help to provide food and drink.",
   "created_utc": 1701003372,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katv9yy",
   "message": "NTA. If someone is kind enough to help you move you provide food and drinks, that is the least one does.",
   "created_utc": 1701003705,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katvegn",
   "message": "Is your friend actually moving out or being kicked out for mooching? You need better friends",
   "created_utc": 1701003783,
   "score": 2,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katfq3g",
   "message": "I pay for a moving company because I would be too embarrassed to ask for friends to help me move.  I would never dream of asking them for drinks on top of that.",
   "created_utc": 1700991940,
   "score": 4,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katvbkp",
   "message": "ESH. You said since he’s your friend you wouldn’t even accept payment or take their money, but if you’re looking at it that way why not look at it as it’s my friend and they need me to stop and grab something while I’m already out and On my way! There and they’re at home packing. You also mentioned that you thought it was on him to provide as a thank you, but nobody forced you to do it and if you only do things expecting a thank you in return I wouldn’t even call it true friendship. And also have you ever moved? When would you have time or the energy to basically host a get together/party lol. And like Do you have that at work every day? and some will mention “no but you get paid or employee appreciation.” And yes at a paid job you will but again; this is supposed to be a friend with you helping and doing these actions out of the goodness of your heart, not for what you may get in return for doing so. As me n my friends live by “homies help homies, always.” Whether it be helping back a house up without payment, or stopped by the store to grab a 6pack. Idk it just sounds really transactional.",
   "created_utc": 1701003732,
   "score": 0,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katoy3w",
   "message": "Nta",
   "created_utc": 1700999379,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kats5qx",
   "message": "You are helping him, he should provide drinks/snacks as a thank you!\n\nI understand maybe a drink as a housewarming gift or something but that’s later on, they owe you for your help not the other way round.",
   "created_utc": 1701001699,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katva9s",
   "message": "r/AITAH",
   "created_utc": 1701003710,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "katzbk3",
   "message": "NTA \nThe host supplies the drinks and food for the crew after you are done.",
   "created_utc": 1701006004,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau1wp0",
   "message": "In defense of the friend, he may have asked because he had other people helping and wanted to get them something. Asked the op since he hadn't made it yet, and was planning to reimburse him. It is on the host to provide refreshments which was the question.",
   "created_utc": 1701007355,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau223z",
   "message": "NTA. In my past situations, the person being helped supplies or pays for the drinks, beers, pizza, etc.  he should I have offered to pay for the seltzer.  He is not a good friend.  There is always refreshing tap water.",
   "created_utc": 1701007431,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau2lmx",
   "message": "He is the asshole. Moving is expensive to pay for. If your friends are helping you supply drinks and food /pizza after. Thems the rules. If he ran out and asked you to pick more up and he’d pay you back then maybe",
   "created_utc": 1701007696,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau2yg2",
   "message": "NTA. It's a very firmly fixed custom that when you ask friends to help you move,",
   "created_utc": 1701007875,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau2yui",
   "message": "NTA\n\nYou are correct.  If there are to be any refreshments after the move, HE is the one to provide them.",
   "created_utc": 1701007880,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau4mzb",
   "message": "He's a friend right? Sure, etiquette would state that he should buy the drinks but Jesus my guy just buy a few beers and help your friend move. Why the drama? \n\nIf you're upset, communicate... You ignored his text and just turned up all pissed off.\n\nYTA for making this a big deal.",
   "created_utc": 1701008684,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau4nxp",
   "message": "It's surprising he didn't ask you to bring pizza, too.\n\n\"Friend\":  Please come help me move, and oh, bring some drinks and a couple large pizzas.\"",
   "created_utc": 1701008696,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau5mz3",
   "message": "With an attitude like that, he’ll be back in his parents basement in 3 months. 😂",
   "created_utc": 1701009145,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau6wcb",
   "message": " I would be too embarrassed to ask for friends to help me move.",
   "created_utc": 1701009714,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kau8c27",
   "message": "NTA. I had a rush last minute move (bad break up) and I bought each of my two guy friends a bottle to take home to make up for any awkwardness and to demonstrate I didn't except them to do anything except help me get my shit on a truck to get out.",
   "created_utc": 1701010355,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauaqij",
   "message": "Nta generally the person moving is the one who rewards the one helping with drinks",
   "created_utc": 1701011399,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kaubx1q",
   "message": "Doesnt sound like much of a friend to me",
   "created_utc": 1701011908,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauc43e",
   "message": "NTA, he should be buying the drinks, he's the one asking for help.",
   "created_utc": 1701011991,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauc6wd",
   "message": "You’re there to help him move, not be his bartender. HE should be the one providing drinks.",
   "created_utc": 1701012024,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauephe",
   "message": "NTA. Unless this friend had a great excuse for not being able to go to the store themselves and offered to pay you back. You’re not obligated to help more than you already are by showing up.",
   "created_utc": 1701013062,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauhuvq",
   "message": "NTA I just moved recently an my buddy refused to take payment so I bought her some weed (Washington resident) an told her I didn't have a card just cash at the uhaul. So I gave her all the money an she used her card. In witch the 100 dollar damage deposit will be sent to her card an I offered food also. your buddy sounds like he needed help an thought he could use you in the process",
   "created_utc": 1701014340,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kaujnev",
   "message": "I get my friends pizza and expensive booze as thanks for helping me move. Like…WHAT?",
   "created_utc": 1701015045,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kaunoqg",
   "message": "Moving sucks, it’s always the person you’re helping responsiblity to provide snacks and drinks. Your friend is an asshole.",
   "created_utc": 1701016613,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kaurrl5",
   "message": "I just would not have shown up....\n\nYeah, you don't as the guy doing you a favor to do more another favor for you like buy some drinks.\n\nNTA",
   "created_utc": 1701018166,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kaut4zw",
   "message": "I'm not concerned a man drinks seltzer",
   "created_utc": 1701018686,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauuznu",
   "message": "I wont vote. But listen.\n\nYou do have it right that the person moving should provide some food and drinks. At least some water/juice during the move. And traditionally some take out and beers once youre all done.\n\nBut as a guy who has moved like 20times in 30y, and done about 3x that many moves for friends and family: every once in a while you forget to stock up on water the day before. So, you ask one good friend to pick it up on the way in.\n\nSometimes it's not even water. Sometimes they need more tape or something. And as that person who has not already arrived: you get the call. Because other wise someone would have to stop working on the move, go to the store...\n\nSo again, no judgement. Just, y'kno, you offered to help out for the day. Most of that will be hauling boxes, but it is really so bad if some of that help is you stopping at the store?",
   "created_utc": 1701019390,
   "score": 1,
   "submission_id": "1845myj"
  },
  {
   "comment_id": "kauzra6",
   "message": "NTA. You're a good friend for helping, few will do that these days. Your friend sounds like an entitled leech. Get rid of him if you see this becoming a pattern",
   "created_utc": 1701021181,
   "score": 1,
   "submission_id": "1845myj"
  }
 ]
}