{
 "submission_id": "1846evx",
 "title": "Am I the AH for picking up my sister-in-law?",
 "selftext": "My wife (40f), has told me (40m) Im “being weird” for picking up her sister (43f) at the airport, about an hour away, late at night. \n\nReally long story short, I was speaking with my MIL (78f) the other week, and she said she was having a hard time driving at night because her eyes were hurting, but had to pick up my sister-in-law and her kids late at night as they were coming back from visiting extended family back east…\n\nPertinent info… A couple of years ago the SIL’s husband died. Before he did, I promised him I would always watch out for them… so I didn’t really think “late night airport pick up” was so crazy.\n\nSo, I offered to pick her up.\n\nNow my wife thinks I’m “being weird” and has insinuated that Im trying to sleep with my SIL.\n\nAITAH here?",
 "created_utc": 1700988067,
 "permalink": "/r/AITAH/comments/1846evx/am_i_the_ah_for_picking_up_my_sisterinlaw/",
 "score": 168,
 "url": "https://www.reddit.com/r/AITAH/comments/1846evx/am_i_the_ah_for_picking_up_my_sisterinlaw/",
 "comments": [
  {
   "comment_id": "katd7kd",
   "message": "NTA at all, i'd do the same, even without the promise you made.\n\nYou and your wife need to talk though. Something is bothering her.",
   "created_utc": 1700989875,
   "score": 54,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kati0ve",
   "message": "Short answer, \"if you don't like it, next time please volunteer to drive an hour to the airport in the wee hours of the morning so your mum does not have to worry and stress herself out about her night blindness.\"\n\nNTA",
   "created_utc": 1700993829,
   "score": 101,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katbc5l",
   "message": "ignore the banana pfp troll, tell your wife straight up you have no interest in her sister and you were trying to do something for her mother and her sister",
   "created_utc": 1700988353,
   "score": 38,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katbr7i",
   "message": "NTA- your wife is insecure, I’m assuming you told her beforehand correct?",
   "created_utc": 1700988688,
   "score": 9,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katbosp",
   "message": "This seems like there is more there. Has your wife said she was jealous of her sister before? Is there some weird sibling rivalry? Have you made inappropriate comments about her sister?",
   "created_utc": 1700988633,
   "score": 18,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katls3h",
   "message": "I’d tell the wife fine, I won’t go help but you can.",
   "created_utc": 1700996857,
   "score": 5,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katibet",
   "message": "Projection maybe? Is she doing anything out of the ordinary?",
   "created_utc": 1700994066,
   "score": 10,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katuy7g",
   "message": "Wow. Is she insecure much?\n\nIf she’s so suspicious, she could’ve gone with you. I don’t see anything weird about picking up your SIL, especially a widowed one, and to save your MIL the trouble. That is, assuming you didn’t do it on the DL and didn’t tell your wife about it or something.",
   "created_utc": 1701003504,
   "score": 4,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau35cz",
   "message": "NTA but I am not sure why your wife didn’t offer instead of her mom being put in harms way. I guess she’s the asshole",
   "created_utc": 1701007968,
   "score": 3,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaua7m1",
   "message": "Your wife probably has some resentment or jealousy toward her sister, most siblings do, so since her sister is available she's pushing her insecurities onto you, making you look like you're trying to sleep with the sister. \n\nTell your wife simply, you were honoring your promise to her sisters husband,  being selfless and respectful to MIL and sister.  If she thinks there is something else going on she better say it now and never speak of it again. Or it will compound and become resentment and then you'll go be with the sister.",
   "created_utc": 1701011173,
   "score": 3,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaus7uz",
   "message": "I'm sorry, this story is like 2+2=5, it just doesn't add up. \n\nIf your wife thinks it \"weird\" that you would go pick up your S-I-L and her kids at the airport or worse, thinks you want to play \"hide the weenie\" with her, you two need to have a very serious talk.",
   "created_utc": 1701018336,
   "score": 3,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katc7ie",
   "message": "... this is very typical behavior. There's either more to the story or your wife's off her rocker.",
   "created_utc": 1700989058,
   "score": 4,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katv91o",
   "message": "It's HER sister.",
   "created_utc": 1701003689,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau4lzw",
   "message": "NTA, this is so normal. Good for you for taking care of family like you promised.",
   "created_utc": 1701008672,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaufpup",
   "message": "Tell your wife its weird she didn't pick up her sister and nieces/nephews from the airport.",
   "created_utc": 1701013477,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauv9pz",
   "message": "Many SO are insecure.\nYou do not even need a previous incident to raise suspicion.\n\nKeep talking to your wife.\nReassuring fidelity is a lifetime achievement award.",
   "created_utc": 1701019496,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauw5kz",
   "message": "I’d do that even without the promise to her late husband. Your wife has issues.",
   "created_utc": 1701019833,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauztbb",
   "message": "Gat dam no you're NTAH but your wife needs therapy STAT! She's got serious issues if she thinks you picking up HER sister and nieces/nephews equals trying to score a romp in the hay with a fucking widow. Something is not connecting upstairs with that one bro.",
   "created_utc": 1701021203,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kav09vc",
   "message": "Sounds like you're being a good guy. It really sucks when you get punished for a good deed, but women get really weird about perceived competition.",
   "created_utc": 1701021375,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kav1b64",
   "message": "Your wife's being weird. My brother flew from another state to help my husband with things, my dad's driven an hour to mow My lawn when I had surgery, my bil has offered to come help with kids when my husband was sick for awhile or gone at work etc \n\nMy family helps each other",
   "created_utc": 1701021762,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katij9c",
   "message": "Wife is cheating, sorry.",
   "created_utc": 1700994238,
   "score": 4,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katpllp",
   "message": "Your wife has trust issues.  Unless there is more to the story, you are just being a stand-up guy, looking out for a widowed mom.",
   "created_utc": 1700999875,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau2n7t",
   "message": "Wife is ridiculous.  I can't believe how much I appreciate my husband for doing the difficult hard things for my sister.  Is there more to this?",
   "created_utc": 1701007719,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau3rrt",
   "message": "Your wife is weird.  Tell her that.",
   "created_utc": 1701008272,
   "score": 2,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kate99j",
   "message": "NTA. But maybe your wife knows things about her sister, maybe she was a bit wild when she was young? Unless you have a history of cheating, then this seems odd. Communicate, and don't spend too much time helping SiL, or do it as a couple. OK, don't take your LOs to the airport at midnight, but if SiL needs help with something at her house, go together. Good luck OP, you're trying to be the good guy, and I hope it all goes well for you both.",
   "created_utc": 1700990736,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katevr2",
   "message": "NTA. Tell your wife she's welcome to join you.  For a threesome. Then say you were just kidding about the threesome while she calls a divorce lawyer. Hmmm.. maybe just stop talking after telling her she's welcome to join you and leave out the threesome joke.",
   "created_utc": 1700991249,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau8ecw",
   "message": "Weird that you refer to \"SIL's husband.\"  Wouldn't the husband in question be either your or your wife's brother?",
   "created_utc": 1701010384,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau2j2g",
   "message": "NTA\n\nYou have a wife problem.  Tell your wife to seek professional help for obvious craziness or you will leave her.\n\nNote:  Your wife is probably cheating on you and is setting the stage to cry and whimper in front of the divorce court judge.",
   "created_utc": 1701007661,
   "score": 0,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kater7n",
   "message": "NTA",
   "created_utc": 1700991145,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katgrne",
   "message": "NTA but your wife is very insecure because her sister has lost her husband. Now she thinks means you are next in line...could be reflection...I would check on her social media....phone use etc.  Find out to to recover messages. My spouse was always jealous type and then years later I found out the hard way it was clearly reflection. Does the sister have tendency to \"steal her men\"? Or did she do that to her in past and is worried the favor is returned....",
   "created_utc": 1700992801,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kathtgq",
   "message": "NTA - you were doing a favor for your SIL \u0026amp; MIL and keeping a promise to her deceased husband to watch out for her and their kids\n\nDon't understand why that is an issue for your wife, has she always been jealous of her sister - that's weird   You need to have a chat with her and find out why that bothers her as you should be able to help her sister out like that",
   "created_utc": 1700993658,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katpujm",
   "message": "How is it weird to help family ? \nWould she rather her mother pick up her sister and her children and have a crash cause she's seeing poorly? \nWould she rather do the late night drive ? \n\nYour not weird and your not the asshole maybe ask your wife if there is an issue that doesn't involve it make it known you aren't trying to sleep with her sister but simply making it safer for them and less stressful for her mother maybe say I look at your sister like I would look at a blood sister and nothing else",
   "created_utc": 1701000061,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katpx8g",
   "message": "The rivalry may be less about “men” and more about attention or feeling as if SIL is more important than wife. This may also lead to the why do YOU have to do this for her.",
   "created_utc": 1701000118,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katq1fn",
   "message": "I would proceed to sleep with your sister in law, assuming she's hot.",
   "created_utc": 1701000205,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katq7ap",
   "message": "r/AITAH",
   "created_utc": 1701000323,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katqd9i",
   "message": "NTA. I think of my SILs as my own sisters. They are family. You help out family. Your wife has some weird hang up. You need to talk it through.",
   "created_utc": 1701000443,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katqpi6",
   "message": "Your wife is being weird.  I guess she doesn’t know a good and decent man when she marries him.\n\nYou two need to talk.\n\nNTA",
   "created_utc": 1701000687,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katqxmw",
   "message": " For a threesome. Then say you were just kidding about the threesome while she calls a divorce lawyer. Hmmm..",
   "created_utc": 1701000849,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katrdkr",
   "message": "Nta. I’d be grateful if I was the wife. She a bit insecure maybe? It’s a strange reaction is all",
   "created_utc": 1701001160,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katrlxo",
   "message": "NTA but it’s weird you added the bit about a deathbed promise. It wouldn’t matter if her husband hated you before he died.",
   "created_utc": 1701001317,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kats227",
   "message": "You’re wife is the AH tbh. You sound like a great guy",
   "created_utc": 1701001628,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katsi2s",
   "message": "Has your wife always felt so insecure?",
   "created_utc": 1701001932,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katt953",
   "message": "NTA but why not tell your wife beforehand? Maybe she would have wanted to tag along?",
   "created_utc": 1701002427,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katti38",
   "message": "NTA\n\nYou're wife is being dillusional and acting insecure.  Unless you have a history of unsavory actions and predispositions, you did well by your wife's family, OP!  What was her hope?  That they'd be stranded?!  Not a good look for your wife.",
   "created_utc": 1701002591,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kattx41",
   "message": "NTA, that just seems nice. I've got 4 SILs and 3 of them have kids. If any of them needed a ride, I'd pick them up, esp if it was going to be an issue for my MIL to drove and get them. And I don't want to sleep with any of my SILs. Sounds like your wife is insecure or actually thinks maybe your SIL would try to sleep with you since she is a widow.",
   "created_utc": 1701002859,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katu6c6",
   "message": "Make her do it or ride with you. If she really believes this she’ll be glad to come along . If not she’s just being an AH",
   "created_utc": 1701003022,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katuddt",
   "message": "NTA your wife has issues. Pick her up from the airport. Tell your wife if she really believes what she said you and her need some marriage counseling.",
   "created_utc": 1701003142,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katusir",
   "message": " If she really believes this she’ll be glad to come along .",
   "created_utc": 1701003406,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katvhnc",
   "message": "Holy mackerel..that is weird\nYour SIL and her kids are by marriage, family..\nI think your wife needs to speak to a professional about her irrational fears.\nAsk your wife if it would be more reasonable to leave her sister and her kids to fend for themselves.\nNTA.",
   "created_utc": 1701003838,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katvstz",
   "message": "No, your wife is.\n\nJesus what’s wrong with her?! You’re being a good husband, SIL, BIL. But her attitude maybe the end of your marriage man, Wtaf is that?",
   "created_utc": 1701004025,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katvxov",
   "message": "NTA  Your wife on the other hand.....",
   "created_utc": 1701004105,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katwpfh",
   "message": "NTA. This is what you are supposed to do.",
   "created_utc": 1701004560,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katwv6p",
   "message": "NTA.\n\nYour wife is being weird.",
   "created_utc": 1701004653,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katww36",
   "message": " NTA, don’t let your wife be upset. She make take some talking too, and that’s understandable.\n\nMy dad dated my aunt before my mother. Every time my mother tells a story about my dad showing up with my aunt, my wife and I side-eye each other. So, your wife is NTA either. \n\nI get you. But to keep the wife in a happy place, just pay for the Uber.",
   "created_utc": 1701004668,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katxjmk",
   "message": "NTA.  Your wife is being weird.  Maybe, if concerned, she could have gone.",
   "created_utc": 1701005038,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katxmau",
   "message": "Your wife is sleeping with someone else or projecting her desire to do on to you.",
   "created_utc": 1701005080,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katxnd5",
   "message": "NTA your wife’s an idiot. Everybody knows that seniors have a difficult time with night vision driving after a certain age it’s a clinical fact. Nobody 78 years old should be bopping around at midnight for two hours in a car. But no doubt she’s an idiot in other ways too, correct?",
   "created_utc": 1701005096,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katym2x",
   "message": "Why doesn’t your wife pick up her sister?",
   "created_utc": 1701005627,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katysc9",
   "message": "Your wife is one or more of these things: \n\n(A) cheater\n(B) shit stirrer\n(C) delusional",
   "created_utc": 1701005721,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katzexu",
   "message": "Nta. Is the SIL hot? Who's hotter, her or your wife?",
   "created_utc": 1701006055,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katzgsb",
   "message": "Damn, your wife is a hateful person",
   "created_utc": 1701006083,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katzl9b",
   "message": "[deleted]",
   "created_utc": 1701006150,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "katzvuv",
   "message": "NTA, you're being a good dude. I offer to drive or pick up my friends (literally not family) every time they fly around here even though I know they already have family that will do it and the airport is a 2hr drive one way. Your wife, expecting them to figure out something or make your elderly MIL drive, is being an asshole.",
   "created_utc": 1701006310,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau062b",
   "message": "No.  Wives are always weird if they aren't around when other women are present. Tell her to back off deal with her own insecurities.  You haven't done anything for her to be suspicious.",
   "created_utc": 1701006459,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau0dhc",
   "message": "Sisters can become competitive; especially the younger sister feeling jealous of the older sister. \n\nOP, you are a prince to your family, your MIL \u0026amp; your SIL. Maybe put in a little more effort to make your wife feel like a princess. (Hope this is all that is needed.)",
   "created_utc": 1701006567,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau0vc8",
   "message": "Your wife is being weird. Honestly my sister would offer to pick me up but if she couldn’t she would send my BIL on a heartbeat. Wouldn’t think anything of it because it’s literally my brother and gross to think otherwise (especially if nothing suspicious has taken place prior)",
   "created_utc": 1701006821,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau11ij",
   "message": "Is she projecting, lmao? It seems like a nice thing to do for her sister and for the 78! mother at that, driving js hard at night for young people as well, I can't imagine a 78 old feeling safe driving for 1+ hours at night is really safe",
   "created_utc": 1701006910,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau1kqb",
   "message": "Could have saved yourself a lot of grief by offering that you both could pick the sister up together.  As it stands, without hearing her side, may be you are, may be you're not - depends on the history of your relationship(s).",
   "created_utc": 1701007187,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau1tfl",
   "message": "If the sister is better looking you know shes jealous OP.",
   "created_utc": 1701007309,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau1wr3",
   "message": "NTA, your wife however…",
   "created_utc": 1701007356,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau3qxl",
   "message": "NTA...",
   "created_utc": 1701008261,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau511t",
   "message": "If I couldn't I would totally expect my husband to instead of my mom, if there wasn't someone closer of course. Is there more to the story? Are you ALWAYS going out of your way for sil? Or is this just a once in awhile thing?",
   "created_utc": 1701008863,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau5b26",
   "message": "NTA - your wife is being weird.\n\nDespite the fact I am willing and capable to collect various family members from airports, events and hospitals late on, my family automatically ask my partner. He says, he's part of the family now so he's happy to help ou—",
   "created_utc": 1701008991,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau5ez0",
   "message": "Nta. Your wife has jealousy issues with her sister. It probably goes all the way back to their childhood.",
   "created_utc": 1701009041,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau5r88",
   "message": "NTA. My bil would do it for me.. your wife is being weird",
   "created_utc": 1701009198,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau5tsj",
   "message": "NTA",
   "created_utc": 1701009230,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau6e13",
   "message": "Your wife need some therapy if she think that! She has some insecurities to work in. No your not the a hole. Mil can’t do it.",
   "created_utc": 1701009482,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau6qcu",
   "message": "Does wife know her mom is unable to drive at night? Something is wrong if this kind favor for a woman with kids late at night, picking up actual in-laws, is so suspicious or such a bother.",
   "created_utc": 1701009639,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau6wfb",
   "message": "Your wife needs therapy for her insecurities.",
   "created_utc": 1701009715,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau7fl1",
   "message": "NTA\n\nMy spouse has picked up family and friends for me. \n\nIt’s no big deal. \n\nWhy does your wife feel this way?  Have you given her reasons to be jealous or is she insecure?",
   "created_utc": 1701009956,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau8aeu",
   "message": "NTA\nThis is crazy. Sounds like you are doing this favor for your MIL more so than your SIL.",
   "created_utc": 1701010335,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kau8k0d",
   "message": "Nah wtf is wrong with your wife? Unless you cheat on her a bunch it makes zero sense why she's upset. Most normal women would be happy you're doing something for her family",
   "created_utc": 1701010452,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauac6o",
   "message": "On the next visit have her come with you, or have her make the airport run.",
   "created_utc": 1701011229,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaubum2",
   "message": "NTA.  You sound like a great brother-in-law that kept a promise to look after the family.  You sound like a great son-in-law who is concerned about his mother-in-law and her ability to drive at night. Most wives would be shouting from the rooftops what a great husband they have. Something is up - either she is projecting or your missing information",
   "created_utc": 1701011879,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaubv2e",
   "message": "If the wife thinks this is weird or suspicious, she could eliminate any doubts or negativity simply by joining her husband when he goes to meet them at the airport.  If they have children and it is an issue for both of them to be  away, they could just swap places and she could go pick up her sister and her family.  These would be the first thing most people would think of if they had the same doubts and concerns that his wife has.  It seems like a story that was generated with only part of the facts and details being provided.",
   "created_utc": 1701011884,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaubxut",
   "message": "NTA. My brother passed and I'm always trying or taking to my SILV and nephews. No issues from my wife.",
   "created_utc": 1701011917,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauc59n",
   "message": "NTA\nShe’s your sister by marriage? Right? Family? If your wife is weirded out about it she can do it? Or does everyone fit in the car? Have her come along if she thinks you need a chaperone?",
   "created_utc": 1701012005,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaucxi1",
   "message": "NTA. The only one being weird here is your wife. Is your wife jealous of her sister for some reason. She may want to get counseling so she can put the past behind her already. Plus, there's the lack of trust, her ignoring the particulars of this particular situation, and the false accusations. She's got a lot going on here,  Hoss.",
   "created_utc": 1701012334,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauelq6",
   "message": "Your wife seems to have a jealousy issue. It is completely normal for family to help family.",
   "created_utc": 1701013020,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauf63s",
   "message": "No, you're helping out another family member. \n\nYour wife would want to cop on and grow up.",
   "created_utc": 1701013251,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaug1o5",
   "message": "NTA, it’s not weird at all on it’s own, but…is there more to this?  Some backstory you aren’t sharing?",
   "created_utc": 1701013611,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaug2ff",
   "message": "NTA.  Your wife really needs to get a grip.",
   "created_utc": 1701013619,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaugap3",
   "message": "Question: have you done anything in the past to warrant this response?",
   "created_utc": 1701013713,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauggvu",
   "message": "How much and how often have you been “watching out for them”.  Maybe this is just the last straw for your wife.",
   "created_utc": 1701013783,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauhnsy",
   "message": "That’s weird but clearly there is some weird stuff going on between the sisters.  I feel like we don’t have the full story/background here.",
   "created_utc": 1701014262,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauj0sr",
   "message": "You’d think your wife would WANT you to pick her sister up so she’d be safe. She’s the one being weird not you. NTA",
   "created_utc": 1701014801,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauj8nm",
   "message": "Wow. You are NTA, but your wife sure is. Why is she so jealous of her sister? Did you \u0026amp; the sister have a relationship prior to you marrying your wife? Did you ever date the sister? Do you wish you were with the sister instead of your wife, or have you ever made a joke insinuating that?\n\nI’m going to guess the answer is no to all those questions. What you did was kind. You helped your MIL; you helped your SIL; and in addition, you kept a promise to your BIL. I cannot see how the time of day is relevant. Why is it weird late at night, but it would be okay if their flight came in at 2:00 in the afternoon? \n\nSounds like your wife has severe jealousy issues. I feel certain this isn’t the first time. She is going to destroy her relationship with her sister, and possibly with you if she keeps this up. She needs to get a grip.",
   "created_utc": 1701014885,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaujdgc",
   "message": "Wife needs to see a therapist.",
   "created_utc": 1701014936,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaujr80",
   "message": "Eh what? \nNTA..? You're helping a family member to get home from the airport..?",
   "created_utc": 1701015086,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaulqzy",
   "message": "Tell your wife she can pick them up herself.",
   "created_utc": 1701015872,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaunjad",
   "message": "Your wife is selfish and narcissistic! Instead of being thankful and grateful for your kindness towards her  family, she’s making a scene out of this. She needs counseling or things are gonna keep getting ugly.",
   "created_utc": 1701016555,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaunu9p",
   "message": "So rather than hating your sister in law, you offered to do her (and your mother in law) a favor and that somehow makes you an asshole. Man some people can’t win for losing.",
   "created_utc": 1701016671,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kauoah7",
   "message": "No your wife is. What is her relationship like with her sister?? Maybe she has a reason to be insecure or not.",
   "created_utc": 1701016842,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaup2er",
   "message": "Maybe OPs wife is concerned that her H will become the surrogate H to her sister. He needs to talk to his wife. He also needs to be careful about how he helps the SIL. She is an adult. It is one thing to help out in this case, but another if the SIL becomes dependent to the point that he does everything for the SIL and not for his own wife.",
   "created_utc": 1701017141,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaupfmo",
   "message": "Yea at this point, after what the sister has been through, this sounds a lot like projection. Your wife spending more time than usual out with \"friends\" lately?",
   "created_utc": 1701017281,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaupthy",
   "message": "NTA, and she could have gone with you to pick her up.",
   "created_utc": 1701017428,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaurlm5",
   "message": "Nta if this was my sister’s bf picking me up at the airport  im would do the same for his sibling cause that what family do for each other but I’m don’t know how to drive",
   "created_utc": 1701018103,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kaurwyy",
   "message": "NTA OP I had some people make comments along the same line when I was dating my now husband of 20 yrs who would pick me up or give me rides to work etc. even now some of my BILs wives won’t let them pick me up for work or take me even in an emergency because it makes them uncomfortable etc. some people are just super insecure.",
   "created_utc": 1701018222,
   "score": 1,
   "submission_id": "1846evx"
  },
  {
   "comment_id": "kausnjl",
   "message": "I am always grateful and proud when my husband does things for anyone in my family. She should be thanking you for the ride, and for saving her mom from driving at night.",
   "created_utc": 1701018500,
   "score": 1,
   "submission_id": "1846evx"
  }
 ]
}