{
 "submission_id": "1849upy",
 "title": "My husband locked me out of the house for an hour at midnight because I went out with my best friend",
 "selftext": "Yesterday I(38F) was preparing dinner. My husband (34M) was stepping out to run an errand and I asked him to pick up an avocado to add to our dinner. He said ok and left. He got back, dinner was almost ready and I asked for the avocado. His response was \" Where would I have got it from?\" I was taken aback by his question and responded \" I don't know\". He followed up by saying that avocados are out of season in our country and every knows this. I said \"Oh ok\" and nothing else. (For some context in our country most fruits and veggies are only available when they are \"in season\" and are mostly purchased from roadside stalls or markets instead of the supermarket. So my expectation of him was as he was out he would definitely come across a couple of these stalls in our neighborhood and could pick up the avocado from them)\n\nFast forward a few minutes later, I'm putting our kids' plates together and he comes back into the kitchen saying he's going out to look for the avocado. I insist that it's not necessary and the food is ready anyway. The avocado wasn't an integral part of the meal just a nice add on. He persisted that he was leaving and took off. I waited about an hour, getting increasingly irate with the whole scenario. I literally just asked him to pick up an avocado while he was already heading out and I thought his behavior was uncalled for. \n\nEarlier on in the day, my best friend(38M) had messaged to ask if I was up to get a drink later that night. His work has him traveling constantly and so far this year I've only seen him once. He would be leaving again in a few days and wouldn't be back in the country till next year. I decided to follow up with my friend and arrange to get out of the house for a few hours and clear my head as I was quite frustrated with how my husband had behaved. \n\nHusband came back home almost 2 hours after he left with no avocado and said nothing to me about it. I asked if he was going to eat dinner, he said yes and I told him his food was in the microwave. At this point it's about 7pm. I then went to get ready to head out. He comes into the bedroom just a few minutes later (did not eat his food) and proceeds to lay on the bed and starts listening to a podcast. I shower and start to dress up and then ask him what that whole situation was about with the avocado. He then makes a big deal about how EVERYONE is aware that avocados are not in season, except me of course as I come from more privileged circumstances(per him). Then doubles down that he spent the 2 hour period looking for avocado. The whole conversation was very condescending imo and he trivialized the situation as though there was absolutely no issue with him leaving home for 2 hours when dinner was already prepared and then not eating same food for no apparent reason. \n\nSo as we are speaking he notices that I am getting dressed and asks what that's about. I let him know I'm heading out and this opens a huge can of worms. I'm being disrespectful by not giving him appropriate notice etc and this is not the \"behavior\" of a wife. Basically proceeds to call me a bad wife and I'm not \"submissive\". We go back and forth for about an hour and the conversation goes nowhere and he relents. I did feel as though he was intentionally arguing with me to either stop me from leaving or make me really late. By the time I'm about to leave it's about 9pm. I tell him I'm leaving and he dismisses me. I left with an Uber which he was aware of. \n\nI meet up with my buddy (who is also married and has become friends with my husband since we got together) we have a decent time and by 12am I tell him I need to get back and he offers to drop me off at home. I call my live in nanny and tell her I'm on the way home so she can unlock the door when I get there. She lets me know that husband stepped out after I left and has locked up the front door and the main gate to access the house. I start to call him and he doesn't answer. I call about 10 times back to back no response. On the 11th try the phone goes straight to a busy signal and stays that way for the next 10 or so minutes. I try reaching him on a messaging app we use and that's also coming up unavailable. Literally about 10 minutes before my buddy and I reach the house he calls back, I let him know I'm trying to get in, he asks how long before I'm there I say 10 minutes. My friend and I sat in his car outside the house for almost an hour before husband arrives. \n\nFriend gets out of the car they exchange small talk and he leaves. Husband and I enter the house and neither of us say a word to the other and go to bed. This morning he approaches me to basically get an apology out of me for \"my behavior\". According to him, I tried to use the issue with the avocado as a smoke screen to go out and do what I please. Mind you, my buddy and I always make a point to catch up when he's in town (2 to 3 times a year) and it's not something secretive or shady that I do behind his back. He said he has no way of knowing what or who I was with before I met up with my friend. Nevermind that as far as he knew I was using an Uber to get home and would have had to be out on the street for almost an hour at 1am. That's not his issue apparently because I never communicated with him the time I'd be home. He said he can't let what \"I've done\" go and I responded I also cannot let the fact that he had me locked out of the house for an hour at midnight go. \n\nWe have been together for 8 years and married for 5. We have 3 kids (7,6 and 3).\n\nAITA for meeting up with my childhood best friend for 3 hours without giving my husband prior notice?",
 "created_utc": 1701002379,
 "permalink": "/r/AITAH/comments/1849upy/my_husband_locked_me_out_of_the_house_for_an_hour/",
 "score": 4,
 "url": "https://www.reddit.com/r/AITAH/comments/1849upy/my_husband_locked_me_out_of_the_house_for_an_hour/",
 "comments": []
}