{
 "submission_id": "1849upy",
 "title": "My husband locked me out of the house for an hour at midnight because I went out with my best friend",
 "selftext": "Yesterday I(38F) was preparing dinner. My husband (34M) was stepping out to run an errand and I asked him to pick up an avocado to add to our dinner. He said ok and left. He got back, dinner was almost ready and I asked for the avocado. His response was \" Where would I have got it from?\" I was taken aback by his question and responded \" I don't know\". He followed up by saying that avocados are out of season in our country and every knows this. I said \"Oh ok\" and nothing else. (For some context in our country most fruits and veggies are only available when they are \"in season\" and are mostly purchased from roadside stalls or markets instead of the supermarket. So my expectation of him was as he was out he would definitely come across a couple of these stalls in our neighborhood and could pick up the avocado from them)\n\nFast forward a few minutes later, I'm putting our kids' plates together and he comes back into the kitchen saying he's going out to look for the avocado. I insist that it's not necessary and the food is ready anyway. The avocado wasn't an integral part of the meal just a nice add on. He persisted that he was leaving and took off. I waited about an hour, getting increasingly irate with the whole scenario. I literally just asked him to pick up an avocado while he was already heading out and I thought his behavior was uncalled for. \n\nEarlier on in the day, my best friend(38M) had messaged to ask if I was up to get a drink later that night. His work has him traveling constantly and so far this year I've only seen him once. He would be leaving again in a few days and wouldn't be back in the country till next year. I decided to follow up with my friend and arrange to get out of the house for a few hours and clear my head as I was quite frustrated with how my husband had behaved. \n\nHusband came back home almost 2 hours after he left with no avocado and said nothing to me about it. I asked if he was going to eat dinner, he said yes and I told him his food was in the microwave. At this point it's about 7pm. I then went to get ready to head out. He comes into the bedroom just a few minutes later (did not eat his food) and proceeds to lay on the bed and starts listening to a podcast. I shower and start to dress up and then ask him what that whole situation was about with the avocado. He then makes a big deal about how EVERYONE is aware that avocados are not in season, except me of course as I come from more privileged circumstances(per him). Then doubles down that he spent the 2 hour period looking for avocado. The whole conversation was very condescending imo and he trivialized the situation as though there was absolutely no issue with him leaving home for 2 hours when dinner was already prepared and then not eating same food for no apparent reason. \n\nSo as we are speaking he notices that I am getting dressed and asks what that's about. I let him know I'm heading out and this opens a huge can of worms. I'm being disrespectful by not giving him appropriate notice etc and this is not the \"behavior\" of a wife. Basically proceeds to call me a bad wife and I'm not \"submissive\". We go back and forth for about an hour and the conversation goes nowhere and he relents. I did feel as though he was intentionally arguing with me to either stop me from leaving or make me really late. By the time I'm about to leave it's about 9pm. I tell him I'm leaving and he dismisses me. I left with an Uber which he was aware of. \n\nI meet up with my buddy (who is also married and has become friends with my husband since we got together) we have a decent time and by 12am I tell him I need to get back and he offers to drop me off at home. I call my live in nanny and tell her I'm on the way home so she can unlock the door when I get there. She lets me know that husband stepped out after I left and has locked up the front door and the main gate to access the house. I start to call him and he doesn't answer. I call about 10 times back to back no response. On the 11th try the phone goes straight to a busy signal and stays that way for the next 10 or so minutes. I try reaching him on a messaging app we use and that's also coming up unavailable. Literally about 10 minutes before my buddy and I reach the house he calls back, I let him know I'm trying to get in, he asks how long before I'm there I say 10 minutes. My friend and I sat in his car outside the house for almost an hour before husband arrives. \n\nFriend gets out of the car they exchange small talk and he leaves. Husband and I enter the house and neither of us say a word to the other and go to bed. This morning he approaches me to basically get an apology out of me for \"my behavior\". According to him, I tried to use the issue with the avocado as a smoke screen to go out and do what I please. Mind you, my buddy and I always make a point to catch up when he's in town (2 to 3 times a year) and it's not something secretive or shady that I do behind his back. He said he has no way of knowing what or who I was with before I met up with my friend. Nevermind that as far as he knew I was using an Uber to get home and would have had to be out on the street for almost an hour at 1am. That's not his issue apparently because I never communicated with him the time I'd be home. He said he can't let what \"I've done\" go and I responded I also cannot let the fact that he had me locked out of the house for an hour at midnight go. \n\nWe have been together for 8 years and married for 5. We have 3 kids (7,6 and 3).\n\nAITA for meeting up with my childhood best friend for 3 hours without giving my husband prior notice?",
 "created_utc": 1701002379,
 "permalink": "/r/AITAH/comments/1849upy/my_husband_locked_me_out_of_the_house_for_an_hour/",
 "score": 18,
 "url": "https://www.reddit.com/r/AITAH/comments/1849upy/my_husband_locked_me_out_of_the_house_for_an_hour/",
 "comments": [
  {
   "comment_id": "katvfy8",
   "message": "What’s really weird is the fact that OP isn’t even concerned with the fact that her husband keeps disappearing",
   "created_utc": 1701003808,
   "score": 73,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katyk9d",
   "message": "Beyond anything else, I am confused as to why you don’t have a key to the front door and the main gate to your own house? Why did you need him to let you in? Why couldn’t the nanny open either of them? This makes no sense.",
   "created_utc": 1701005600,
   "score": 70,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katv834",
   "message": "Oh my god. I'm exhausted just from reading this. DIVORCE.",
   "created_utc": 1701003673,
   "score": 37,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katx8i7",
   "message": "I really can't get behind the logistics of him leaving the house and locking everything up, so you can't get back in.\nDo you not have the keys to your own home?",
   "created_utc": 1701004866,
   "score": 238,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katvf8x",
   "message": "He spent two hours looking for an avocado in his mistresses house more likely. Then went back there after you went out.",
   "created_utc": 1701003796,
   "score": 29,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katuto3",
   "message": "Take ur kids and run.\n\nAlso, ur hubby cheating.\n\nNTA.",
   "created_utc": 1701003425,
   "score": 36,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katx8sw",
   "message": "There’s so many red flags here that you could perform a Soviet march with them.\n\nRun, do not walk, far away.",
   "created_utc": 1701004871,
   "score": 90,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katw4pp",
   "message": "Jesus Christ - get rid of that abusive man. He is cheating and treating you like shit at the same. \n\nHe’ll use ‘your behaviour’ as an excuse as to why he had to cheat. \n\nGet tf outta there \n\nNTA",
   "created_utc": 1701004221,
   "score": 162,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katzio6",
   "message": "In a healthy non-abusive relationship, a wife doesn't need a smoke screen to do whatever she wants.  Neither partner needs a smoke screen. But, he certainly used your request to get avocados as a smoke screen of his own for whatever it was he chose to do. Also, in a healthy relationship, a wife would have her own set of keys (or electronic fob) for the gate \u0026amp; door. Start there.",
   "created_utc": 1701006111,
   "score": 50,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katywni",
   "message": "He’s either cheating, or on drugs, or both. And for him to lecture you about the avocado and being submissive, he sounds abusive as well.",
   "created_utc": 1701005785,
   "score": 74,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau6ahq",
   "message": "I have read your post. I am not going to say your husband is cheating, despite that being my gut instinct from the moment you said his response was “where would I have got it from.” I can’t explain why that was my reaction, but it was. Since I am choosing not to jump into that because there are a ton of comments that say that already, and they are saying it better than I would. \n\n- he went out to do “errands” and was gone a long time and returned without the item you asked him for. \n- he returned and was rude to you because he didn’t have them, also stating that he *couldn’t* get them because they’re out of season. \n- he comes in a short time later and says he is going to get one because suddenly in the last 30 mins to an hour they are are suddenly in season. \n- he disappears for a couple of hours without telling you where he is. \n- he returns without the avocado and is again rude to you. \n- he doesn’t eat the meal you prepared for him. \n- he didn’t spend 5 minutes talking to you in the entire evening and is mad that he doesn’t know your plans. \n- you get back to find that your kids and nanny are locked in the house, unable to escape if the need arises, and you are locked out. \n- he returns from *a third trip* out, and gets angry that you went out with someone he knows. \n- he wants you to ask him for permission because he’s the man of the house. \n- you work to make sure your family’s needs are being met. \n- he tries to make you feel bad for your parents giving you what they could afford to give you in your childhood. \n- he tries to use your upbringing against you to make you feel guilty that he has it harder than he has. \n- you already told him you’re gone, but then he made promises which he is now breaking again. \n\nThis man has unilaterally decided that anything he wants is the only thing that need doing. He doesn’t need to make you happy, you’re supposed to make him happy. You need to work, you need to care for the house, you need to care for the children, you need to accept that he just disappears *three times in one night*, you need to inform him of your plans (if he says no you need to accept that, if he says yes, you’re probably supposed to be swooning in gratitude), you need to be obedient, you’re not allowed to think or have feelings about anything unless he tells you that you’re allowed to. \n\nYou don’t need him. If he’s gone for 90% of the evening and is willing to lock your kids in the house where they could have been harmed if there was a fire and trap the nanny where if there was a medical emergency she couldn’t even let the ambulance in, they don’t need him either. I’m hard-pressed to find one thing that he did that night which was for the benefit of anyone other than him. If he wants to be “the man of the house” then he better get his butt in gear: he needs to provide (more than headaches), he needs to earn that loyalty and trust, and he needs to care more about the people who live with and rely on him. \n\nMaking you the head of household merely because you have a wick to dip is not how it works at all. The fact he thinks he can be a subpar husband, and subpar father, a subpar earner, and a subpar human and still get the same footing as a man who is an absolute gem is an abomination. He’s a delusional piece of junk. \n\nPlease, take your kids, the maid, the nanny and yourself, and let him keep the keys to his very empty house.",
   "created_utc": 1701009437,
   "score": 76,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katz6fq",
   "message": "Your husband's 1000000% cheating on you and locking you out of the house to 'teach you a lesson\" is abusive. \n\n\nTake your kids and leave, you're not safe.",
   "created_utc": 1701005927,
   "score": 48,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau0uyi",
   "message": "He’s not looking for an avocado. lol He’s out doing something he shouldn’t while married. He’s a bad husband trying to blame you for his misconduct. He’s either cheating on you or doing drugs (or both). \n\nKick him to the curb.",
   "created_utc": 1701006815,
   "score": 13,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katx0po",
   "message": "NTA. I don't like sudden plans, but that doesn't mean I can't adapt and deal with it if sudden plans occur. I would never stop my hubby from going out to hang with a friend that he only sees 3 times a year. \n\nLocking you out from your house on purpose is abusive. He is controlling and this could become dangerous for you. Tread carefully.",
   "created_utc": 1701004743,
   "score": 27,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katxx8j",
   "message": "Omg this is soooo.... Is this normal behavior for him? From what you wrote, it sounds like he starts arguing about trivial things, he provokes you and is controlling. If it's not a big problem that you go out with a friend a few times a year, he knows him and knows that there is nothing between you, then his behavior is disturbing. And also closing the entrance to the house in this way ...\n\nNTA",
   "created_utc": 1701005248,
   "score": 9,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5327",
   "message": "Why do you tolerate this man child? He sounds AWFUL",
   "created_utc": 1701008888,
   "score": 10,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katvf92",
   "message": "Your husband is behaving outrageously. Not just badly but utterly crazy outrageous.\n\nNot only are you NTA you need to get the heck out of that \"relationship\" now. \n\nThat's not something I say often, nor do I use the term red flag but crikey there are so many warning signs here.\n\nThis is not ok.\n\nYou deserve better.",
   "created_utc": 1701003797,
   "score": 31,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katwpfl",
   "message": "Okay but wassup with avocado?",
   "created_utc": 1701004560,
   "score": 9,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5y3t",
   "message": "NTA. I’ve read all the comments here \u0026amp; I don’t know if he’s cheating or not. But anyone who goes looking for avocados twice, over the space of hours, didn’t find one and then gets ultra defensive and confrontational is CLEARLY up to something shady. And locking you out of the house is all about coercive control. He sounds unhinged. Please reevaluate whether you \u0026amp; your children are safe with him.",
   "created_utc": 1701009283,
   "score": 15,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau30s0",
   "message": "Sorry love. He's either cheating or doing drugs. He went out to look for avocados for 2 hours then talks to you like you're stupid because you should know they're not in season? So why did he bother going to look for them? Because either his side piece messaged him or his dealer. Run.",
   "created_utc": 1701007906,
   "score": 7,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau54s4",
   "message": "This guy is cheating, dealing or doing drugs, or gambling your money aware. Completely insane sounding behavior.",
   "created_utc": 1701008910,
   "score": 7,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauaz30",
   "message": "So your husband keeps disappearing, constantly talking down to you, making accusations and assumptions designed to belittle you, playing little manipulation games with you, angrily argues with you that you are not being a good wife nor submissive enough, refuses to communicate with you, and then locks you out of your house late at night. Then he expects you to apologize and account for your actions while refusing to acknowledge his own.\n\nWhy are you with someone who has so many red flags of toxic abusive behavior and whom openly disrespects you like that?",
   "created_utc": 1701011503,
   "score": 7,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau28jd",
   "message": "NTA. \n\nThe problem is not the avocado. \n\nThe problem is that your husband is a controlling asshat. \n\nYou’re in trouble.  This is only going to escalate. Put your important documents in a safe place away from the house that only you know about, ensure you have emergency cash, separate you finances, tell your friends what’s happening.",
   "created_utc": 1701007520,
   "score": 12,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katz5mw",
   "message": "NTA. In a marriage there should be trust and respect bu both sides, you need marriage counseling really badly, your husband is an AH, him disappearing for 2 hours is shady as fuck, and you going out for drinks with a male friend for 3 hours only makes things worse in this situation. But him locking you out is really disgusting and worrying.",
   "created_utc": 1701005916,
   "score": 6,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kattmya",
   "message": "If this marriage is worth saving, maybe try marriage counselling. \n\nIf I were you, I’d also sign up for individual therapy, is this relationship fulfilling you and is it healthy for you and your kids?",
   "created_utc": 1701002679,
   "score": 17,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katzfcu",
   "message": "He's cheating. Every time someone comes on her saying their spouse is acting like as asshole and saying they aren't submissive enough - the spouse is cheating.",
   "created_utc": 1701006061,
   "score": 10,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau1332",
   "message": "He is cheating on you right in front of you.",
   "created_utc": 1701006931,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau7pcx",
   "message": "He's cheating, for sure, and he's abusive. He absolutely was stalling you and manipulating you, then punished you. Reading this filled me with disgust - please don't allow anyone to treat you this way. You're 38 and he's treating you like his naughty 12 year old.",
   "created_utc": 1701010075,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau7zi5",
   "message": "Sounds like some pretty classic projection here.  I wonder how long your husband has been cheating on you.",
   "created_utc": 1701010202,
   "score": 4,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau8ndn",
   "message": "There could have been a fire in your house and your nanny and kids would have been trapped! Unacceptable.",
   "created_utc": 1701010492,
   "score": 6,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaua0pp",
   "message": "If not cheating, could he be gambling?  A strip club?  Gaming?   He’s definitely doing something that he doesn’t want you to know about.  Locking you out of your home would have been it for me - especially after his pattern of disrespect.  Start charting when he’s gone.  See if there’s a pattern.",
   "created_utc": 1701011091,
   "score": 4,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaubcse",
   "message": "Lundy Bancroft time 💜.\n\nOP is only an AH if she stays for his money thus subjecting the kids to grow up in this environment.\n\nThis man is dangerous.",
   "created_utc": 1701011668,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaud83q",
   "message": "Your husband picked a fight that night so he could storm off and leave. He \"left to find an avocado\" because he had an excuse to leave for awhile and blame you. You left before he could storm out and leave and blame you for a second fight he started, so he left anyway and then punished you for spoiling his plan to leave and blame you so he could use that to punish you. He punished you by locking you out, and your kids in. He has no regard to what happens to any of you and is abusive. He's doing something outside of the home. Whether you care what that is or not is your call.",
   "created_utc": 1701012457,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauk82d",
   "message": "Your husband is definitely the AH, not you. But I’m curious, what does someone do for 2 hours when they go out to “find an avocado?” I want to believe he isn’t cheating, but I also don’t think he was driving around looking for an avocado. If he was drinking or getting high, OP could probably tell. Is there gambling (legal or illegal) in the area? Is he going to strip joints and not drinking(?). I just can’t fathom it.",
   "created_utc": 1701015269,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaufolp",
   "message": "Some small picture questions in light of the bigger picture: If avocados aren’t in season then why did you ask for them, why did he go looking for them TWICE, and what does your socioeconomic status have to do with when you can access them?\n\nAnywhooo… My father used to do shit just like this (minus locking us in the house). Turns out he was leaving to do drugs with the piece of trash he was cheating on my mother with. OP, for the sake of your children’s sanity, PLEASE don’t stay with this subhuman species as long as my mother stayed with my father. It’s not worth it.",
   "created_utc": 1701013462,
   "score": 7,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katx25i",
   "message": "NTA. It can only go downhill from here. Get out sooner rather than later.",
   "created_utc": 1701004765,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katxyt7",
   "message": "I think you should seriously consider splitting up with him.",
   "created_utc": 1701005272,
   "score": 4,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau4li1",
   "message": "Girl,  you have more to worry about than getting locked out of the house! Where was your husband for 2 hours? NOT getting that avocado! Then he leaves when you leave? Are you blind?",
   "created_utc": 1701008665,
   "score": 4,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauaavc",
   "message": "I was barely halfway through reading this and everything is screaming he is cheating on you.  He is determined to make you the bad guy so it will look like he didn’t have a choice but to leave you.  And then miraculously, he will “find” the new love of his life.  Check up on your assets to make sure he hasn’t been hiding money and consult a lawyer now",
   "created_utc": 1701011213,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaucii7",
   "message": "Your husband is doing something nefarious. Based on his words, I’m going to guess an affair. And this behavior is both to keep you distracted from questioning him and also his way of justifying it. If he points out your “flaws” he can explain away his behavior as it being your fault.",
   "created_utc": 1701012157,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaucqi0",
   "message": "NTA. Your husband's behavior with all of the stepping out is very shady, and his tantrum was ridiculous. And what's this about not being submissive to him?? None of this shit would fly in my house. I hope you're able to safely take steps to improve your situation.",
   "created_utc": 1701012251,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaud2bo",
   "message": "Nta..but why dont you have keys to your own home?",
   "created_utc": 1701012390,
   "score": 4,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaud3xl",
   "message": "If he’s allowed to leave and do whatever he wants but you can’t, this isn’t a partnership: it’s an ownership. He doesn’t see you as an equal. He admitted it himself. \n\nHonestly this screams “cheater” behavior. There’s no way I could stay in a marriage like that if I were in your shoes. \n\nNTA",
   "created_utc": 1701012409,
   "score": 4,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauevfw",
   "message": "Bs. A 2 hour avocado run when “it’s not in season”. This is bullshit from start to finish",
   "created_utc": 1701013129,
   "score": 5,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "katznr5",
   "message": "NTA, that's a red flag. . .no a CRIMSON red flag why is it that when you went out with your male friend his immediate response is to lock you out of the house, also gone for two hours? Did you try and contact him if you did and got no response then he's cheating on you, also \"submissive\" wife this isn't the era where \"men have control over women\" marriage advice isn't my thing, but take a look back on your relationship and try and see any more red flags, because I count probably three, 1. He locked you out of the house because you went out with your male friend. 2. He was gone for two hours *if OP didn't contact him* and probably cheated, 3. He's gaslighting you into being a \"submissive\" wife",
   "created_utc": 1701006187,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau0ica",
   "message": "Nta go out  get a divorce consult with as many lawyers as\nPossible\nGet proof of residence \nAnd go out again\nCall cops because hea being abusive ah",
   "created_utc": 1701006636,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau1bbz",
   "message": "I was done at the word “submissive.” Hell no.",
   "created_utc": 1701007051,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau1t2b",
   "message": "Sounds like husband is projecting, and he is cheating.. not only that extremely abusive.\n\nMy narcissist ex used to love belittling me and trying to make me small.. but he liked to wait until he had an audience, so everyone knew how stupid I was.. but honey, this is abuse, ask you friend for a place to stay with your kids' pack up and leave... your husband is cheating on you",
   "created_utc": 1701007304,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau4lnj",
   "message": "To the he's definitely cheating people....have we not thought he may be a drug addict? This sounds more like drug addiction behavior to me....but then again, I'm an  ex-drug addict, not a cheater...",
   "created_utc": 1701008667,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau4m83",
   "message": "OP please don’t believe he spent 2 hours looking for an avocado since “they’re not in season” please RUN",
   "created_utc": 1701008675,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau53n7",
   "message": "This is how avocados 🥑 destroy families.  That first bite of guac seems innocent enough, then this",
   "created_utc": 1701008896,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5cu7",
   "message": "The question isn't whether or not your an asshole, it's why are you still with this misogynistic, weapons grade dick sickness. If he's not cheating he's up to something else that's shady as fuck, does he have any redeeming features?",
   "created_utc": 1701009013,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5g18",
   "message": "YTA for still being with this “man.” Take your kids and run, if you can. If you’re in certain Middle Eastern or Asian countries they might actually be “his” kids and you can’t take them without his permission. Do whatever you can do to get away from him.",
   "created_utc": 1701009054,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5mzx",
   "message": "You need to leave this pathetic boy.",
   "created_utc": 1701009145,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5nka",
   "message": "So has your husband spent the entire relationship not respecting you and you’ve just turned a blind eye until now?",
   "created_utc": 1701009152,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau5tne",
   "message": "Your husband is a petty, insecure man who would cut off his nose to spite his face. He puts a lot of effort into making sure you know he’s angry about every little thing and that that is the most important thing happening right then.",
   "created_utc": 1701009228,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau631u",
   "message": "I sense cheating and projecting from him end. That's all\n\nNTA leave now, for the love of God and if you can't. Make a get away plan",
   "created_utc": 1701009345,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau67l3",
   "message": "And why do you not have a key to your own house?? This is a another checkmark on a laundry list of controlling red flags and unhappiness",
   "created_utc": 1701009400,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau67vl",
   "message": "The Iranian yogurt was not the issue, and neither is the avocado. \nNTA",
   "created_utc": 1701009404,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau7emy",
   "message": "OP,\n\nTake a piece of paper, write the following on it:\n\n*Appropriate Notice*\n\n*Fuck you.*\n\n*Your soon to be ex-wife.*\n\n\u0026amp;#x200B;\n\nGive this note to your husband. \n\nReading about how your husband behaves was extremely exhausting. I have no idea how anyone can endure such existence. What a terrible example of a man he is to your kids. Run, OP. RUN.\n\nNTA",
   "created_utc": 1701009943,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau7njp",
   "message": "This isn't about the avocado or the evening out with the friend - it's about control. Insisting he is right (about the avocado but I'll eat my hat if that's the only thing he's done similarly before) and expecting OP to be \"submissive\". \n\nHe's doing something shady, be that cheating or some kind of gambling addiction or whatever, he's vanishing for random hours at a time without explanation. OP goes out with a valid, pre-discussed reason and husband punishes her for it. It's a solid double standard. \n\nRun, divorce, protect those kids",
   "created_utc": 1701010053,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau7tpm",
   "message": "NTA.  There’s so many red flags here…where does one start?   I hope you see it.   \n\nIf I was locked out of my own home, me and the kids would be gone.  If I was told I wasn’t submissive enough, me and the kids would be gone.  \n\nWhere do YOU draw the line?",
   "created_utc": 1701010130,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau86uf",
   "message": "Getting locked out of her house as a “punishment” is exactly how a girl in my hometown was abducted, tortured, and murdered. \n\nGet away from your abusive husband.",
   "created_utc": 1701010291,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau9hqy",
   "message": "NTA Cheating, getting high or gambling, something is wrong. Check your household finances, income etc and make sure you have your documents (children) and separate money secure in case you need to take any action.",
   "created_utc": 1701010858,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kau9ytk",
   "message": "How is it that assholes like this guy can get married but genuine people like myself have a hard time? I’ll never understand this.",
   "created_utc": 1701011067,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaua77x",
   "message": "Idc what country you’re in, don’t stay married to assholes like this. If it’s possible for you, time to divorce this loser.",
   "created_utc": 1701011169,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauacl8",
   "message": "What the fuck are you doing staying with this controlling and abusive scumbag? This is not something I would ever stand for. Awful.",
   "created_utc": 1701011233,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauacsh",
   "message": "Your husband is disrespectful. Probably cheating. Get rid of this guy. He’s mean and vindictive. I feel bad for the kids.",
   "created_utc": 1701011236,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaubo0w",
   "message": "NTA. As soon as I got to the part where he said you're not submissive, I stopped reading. He's the AH. 100%.",
   "created_utc": 1701011801,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaubvad",
   "message": "At best he is a controlling, gaslighting, misogynistic, dismissive partner. At worst he is cheating or doing something he shouldn't be doing (drugs, crime, gambling, etc) and hiding it from you during these long absences.",
   "created_utc": 1701011886,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauc0xd",
   "message": "He’s cheating. What would have me more concerned is the **submissive** comment.  I don’t care what the other men do in your country. We’re not talking about the other men in your country we’re talking about your husband. I don’t know what resources you have individually but unless you want to keep being treated like a second class citizen you need to get the kids and leave.",
   "created_utc": 1701011954,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauc41r",
   "message": "Are you married to a child?",
   "created_utc": 1701011991,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauc5pp",
   "message": "He’s picking fights to cover for his own shady behavior.",
   "created_utc": 1701012010,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaucs90",
   "message": "I don’t understand why someone has to let the OP into her own house. This whole thing sounds absolutely miserable.",
   "created_utc": 1701012272,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauctvp",
   "message": "Who doesn’t have a key to their own abode?",
   "created_utc": 1701012291,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauemge",
   "message": "He’s cheating on you",
   "created_utc": 1701013028,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauey1e",
   "message": "He’s either cheating or into drugs.",
   "created_utc": 1701013158,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaueydr",
   "message": "My x husband would “go to Home depot” a lot for a spell. Won’t admit to cheating but he doesn’t have to. It was obvious.",
   "created_utc": 1701013162,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauf65m",
   "message": "Is it obvious to everyone but the OP that the husband is cheating on her?",
   "created_utc": 1701013252,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauffrh",
   "message": "He's cheating, sis.  And he's projecting on you to distract from what he's actually doing.",
   "created_utc": 1701013361,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaufm2g",
   "message": "There are so many red flags here that you’re just ignoring you’re worried about avocados and whether or not you’re in the wrong for going out with a friend. What you should be wondering is why your husband‘s disappearing for hours at a time. He left the first time told you avocados were not in season, belittled you and made you feel stupid for not knowing that because apparently everyone should, and then went out and supposedly scoured the entire town for avocados that he supposedly knew, and everyone else knew was out of season so he was looking for something he knew was not going to be found. He was giving you an excuse to stay out for hours he probably went and had dinner with someone else or did something else with someone else because when he got home, he wasn’t hungry. He just left his food and started listening to a podcast which makes me think that he probably already ate. Secondly, you go out and come back around midnight and he’s not home again which means he probably went out shortly after you left to go out and was gone for hours again. And you don’t find this weird you’re more worried about his feelings about a freaking avocado? This relationship is foaming apart and you obviously cannot even see it here. He’s probably having an affair or doing some thing that you’re unaware of because he’s disappearing for literally hours at a time and you’re so worried about defending yourself and wondering whether you’re right or wrong that you don’t even see that he’s gaslighting you into ignoring his behavior",
   "created_utc": 1701013433,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaufnu1",
   "message": "NTA. All signs point to your husband cheating though, the vanishing for hours with lame excuses, the projection, the attitude, all of it. \nI’m sorry and you so much deserve better.",
   "created_utc": 1701013453,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaufr1k",
   "message": "NTA.  You're in a very clearly toxic relationship where your husband is either stupidly looking for avocado for two hours during a season that he himself says he won't find any for sale or using that as an excuse to leave the house for more illicit activities(popular ones are cheating and drugs).  He said that, not you.  Then he insisted on \"looking for an avocado\" for two whole hours while dinner gets cold, explicitly ignoring you when you said it was not necessary.  In his mind, he can leave the house unquestioned for the most illogical reason.  But he can forbid you from leaving and ghost you when he wants to punish you for doing so anyway.  It's insane that he feels he's gaslit you enough to think you'll apologize to *him* for deciding on his own to run off on a wild goose chase before you spent some quality time with an old friend.",
   "created_utc": 1701013490,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaui5gk",
   "message": "He 100% is cheating cuz what else could be the reason to go out not once but TWICE to look for avocados and spent hrs looking them and showed back up empty handed",
   "created_utc": 1701014456,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauibpb",
   "message": "He’s using Red Pill tactics on you. He wants you to feel insecure and to just do whatever he wants, without question, like a servant.",
   "created_utc": 1701014524,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaujid3",
   "message": "OPs husband sounds like a typical Arab husband",
   "created_utc": 1701014990,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauk06l",
   "message": "Why do you not have keys to your own home?  If you are out, hubby is out \u0026amp; all the doors are locked, how is the nanny supposed to get out with the kids in an emergency? \n\nYour husband is an arse",
   "created_utc": 1701015184,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauk46y",
   "message": "What I wanna know is, what's the husband doing while he's out \"looking for avocados\". Then freaks out when he shows back up without said avocados?  Like yeah dude real smooth, not suspicious at all",
   "created_utc": 1701015228,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauk66h",
   "message": "NTA, but uh, your hubby is stepping out on the marriage and is projecting that onto you.",
   "created_utc": 1701015249,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaukml8",
   "message": "He’s controlling and insulting.  Dismissive and condescending.  Disappears multiple times a day without any explanation. At the same time insists on your submission.  Yikes.  He’s sketchy AF. Are we out stuck with him? Does he control the finances?",
   "created_utc": 1701015428,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaul1ze",
   "message": "There is a lot more going on here than OP is letting on without a doubt.",
   "created_utc": 1701015600,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kaulidm",
   "message": "Absolutely NTA! Your husband, on the other hand, is. 2 hours looking for nonexistent fruit?? Hmmmmmm. Slips out the door right after you.  Hmmmmmm. Sounds like your husband is up to something, or seeing someone, and he's the one putting up the smoke screen. And the days of submissive women or housewives are long long gone. My husband would have gotten a cast iron frying pan upside his head if he ever said anything remotely like that to me.",
   "created_utc": 1701015778,
   "score": 3,
   "submission_id": "1849upy"
  },
  {
   "comment_id": "kauu8dp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1849upy"
  }
 ]
}