{
 "submission_id": "1849o8i",
 "title": "AITAH for not telling the baby’s father I’m pregnant \u0026amp; will be giving them up for adoption?",
 "selftext": "Hi y’all, I’m sorry for posting here. I genuinely need you guys’ opinion and will accept whatever verdict you give me. \n\nI’m pregnant. I decided I was going to give the baby up for adoption quite soon after finding out, due to many reasons (among them my age and stuff). \n\nMy family knows. The father doesn’t though, and I don’t want to tell him. He wasn’t a kind person when we were dating. (I don’t wanna get into it too much.) We were sort of together and it went bad FAST. I ended up blocking him and cutting off contact, which was a struggle in itself. \n\nI feel like if I tell him, he’ll use it in a way to keep me close. But maybe I’m being too selfish…? I don’t know. I figured if I told everyone that I didn’t know who the father is, I’d be able to do it without his permission. Maybe? But idk. \n\nSorry for this. \n\nAITA for not telling him?\n\nEdit: Thank you to everyone for replying. I’m really grateful, even if I’m the AH. Can I just ask not to send chats? \n\nAlso, I do know I need to stay away from him myself. But I don’t know if he’s like this with others, or maybe he’d be a good father. That’s why I feel conflicted. Just because I brought that out in him, doesn’t mean others will, I guess. He’s not a horrible person. \n\nEdit 2: Thank you everyone who took the time to read \u0026amp; reply to this. It’s a lot of mixed messages and I’m reading them all, but I will take a step back from this post because it’s a lot to process. Sorry again for all the trouble. ",
 "created_utc": 1701001747,
 "permalink": "/r/AITAH/comments/1849o8i/aitah_for_not_telling_the_babys_father_im/",
 "score": 133,
 "url": "https://www.reddit.com/r/AITAH/comments/1849o8i/aitah_for_not_telling_the_babys_father_im/",
 "comments": [
  {
   "comment_id": "kau5brn",
   "message": "You need a lawyer. \n\nFor an adoption, you’re going to be asked who the father is, because a child can’t be given up for adoption without both biological parents signing off. What specifically are they going to ask you in order to try to find the father? (And the adoption agency will want to find him, because not trying his consent is grounds to reverse the adoption and rip the child from their adoptive family.) Are there publication requirements? Will you be asked to name everyone it possibly could be? Will they ask no follow up questions and risk a legal battle over your child later, and if so, who has to pay for that? \n\nYou also need to know whether there are ramifications for you if you lie and say you don’t know: can you get in trouble, and if so, what kind of trouble? And you need to know what happens if he finds out you’re pregnant before the adoption goes through, so you can make plans if he blocks the adoption. \n\nAnd finally, you need to know what happens if he finds out after the adoption, what rights he would have to reverse the adoption, what would happen next if he succeeded and the baby was taken from the adoptive parents and given to him, and whether anything would happen to you for keeping it from him. \n\nYou may also have other options as a victim of physical abuse—and I know you prefer not to call it that, but that’s what it was—that you’re not aware of, that might be better than what you’re planning to do now. \n\nThe answers to these questions vary among jurisdictions, so you really need to talk to a lawyer now to find out all possible outcomes.",
   "created_utc": 1701009000,
   "score": 53,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katt3nu",
   "message": "Depends what you mean by \"went bad\". If it was just a falling out you'd be in the wrong, but I fully support disregarding parental rights in cases of abuse.",
   "created_utc": 1701002328,
   "score": 209,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katyz5u",
   "message": "NTA but in many states you need the father to sign off on adoption paperwork. In some states, the court has to prove that they have diligently searched for the father. If they find him, and it’s discovered you’ve lied, you can be in trouble. The best thing to do is be honest. Tell them that you were in a very toxic relationship and you wish not to be contacted by the father. A social worker will handle almost everything at that point so you won’t have to. Now, I’m some states if you can prove that the relationship was toxic/dangerous, then a judge will rule that you don’t need that father’s signature. \n\nDon’t lie that you don’t know who he is\n\nKeep all evidence of him being unsafe/unstable towards you. \n\nGet in touch with a social worker now\n\nUse a county or state agency. Private ones sometimes don’t do things legally and it can come back to bite you in the ass. Also, a plethora of resources will be available to you with county/state.",
   "created_utc": 1701005822,
   "score": 243,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau7ipq",
   "message": "In many states (I assume all of them) The adoption  can and would have  be overturned later if he finds out.  \n\nThe US Supreme Court has held many times, biological parents who didn’t give up or lose their rights trumps adoptive parents no matter what",
   "created_utc": 1701009993,
   "score": 132,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katuj71",
   "message": "If this is a safety concern, you are never an ah for doing what you feel is right to protect everyone involved.",
   "created_utc": 1701003244,
   "score": 105,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katy9tj",
   "message": "NTA but also incredibly naive and there is a good chance you won't have the option to do this.\n\nPeople can say that the \"sperm donor\" has no right to know, but legally speaking that's not quite true. Both parents have the right to fight for custody if they want it. And to adopt, you need to sever the legal ties of both birth parents. Adoption agencies and adoptive parents absolutely do not want to be brought to court a few months or years after an adoption has taken place because it turns out the birth father was never told and now he wants to fight for his legal rights. This destroys families.\n\nYou 100% need to talk to people in your state/county that know how to navigate this right now and tell you what is legally required to adopt out a child. You cannot just assume you can hand over a newborn at the hospital and never tell the father.",
   "created_utc": 1701005441,
   "score": 84,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kattuwv",
   "message": "If it was abusive, then I think it’s fine not to say anything. Getting yourself safe is important, your survival, is the most important. Keeping the baby is brave \u0026amp; admirable. You are doing what’s right for a new life. The baby deserves a good life. \n\nIt’s a tough situation all around. There are no easy answers, except for your safety and the baby’s safety. \n\nIf there is contact \u0026amp; he is the type to “love bomb” you, consider the pregnancy hormones and don’t get drawn in. Talk to a counselor instead.\n\nEdit: NTA just a very difficult situation",
   "created_utc": 1701002818,
   "score": 139,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau03fx",
   "message": "You need to consult a lawyer. If he doesn’t know about it now and finds out later he can contest the adoption.",
   "created_utc": 1701006421,
   "score": 61,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katt0hw",
   "message": "You are not the A-hole. Your decision to prioritize your well-being and the baby's future is important. Take care of yourself.",
   "created_utc": 1701002269,
   "score": 105,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau4i1e",
   "message": "\u0026gt;Just because I brought that out in him, doesn’t mean others will, I guess. He’s not a horrible person.\n\nThis is not passing the vibe test. I wouldn't let him dogsit for me. Kids bring out EVERYTHING in a person. Your child will be treated how you were by him.",
   "created_utc": 1701008620,
   "score": 78,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau0mrk",
   "message": "Do not tell him directly, do not tell him yourself. Do not let him know you are pregnant.  Consult with an adoption agency or a counselor or an attorney. If you have a confidential counselor,  Find out if where you live has any laws regarding this. If he must be notified, a third party like an attorney can notify him. Keep yourself safe.",
   "created_utc": 1701006700,
   "score": 23,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau81wt",
   "message": "This one is tough you are NTA for wanting to break all contact with your abuser. However in most states you are legally required to notify the father as he does have certain rights. You could lie and say you don’t know, but if it’s ever found out later that you did know, you could be jeopardizing the legality of the adoption and open the door for him to contest it later, which would cause a serious amount of upheaval for your child and their adoptive family. \n\nMy advice would be to talk to a lawyer about your options and the risks involved.",
   "created_utc": 1701010231,
   "score": 13,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau5lft",
   "message": "When I worked with adoptions, we needed the father’s consent to free the child legally for adoption.\nI have no idea of what the laws are now but you may want to look into this.",
   "created_utc": 1701009125,
   "score": 15,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau9tl7",
   "message": "I'm not going to judge you. But you should tell him. I know a family who recently lost custody of an adopt a child. The adoption was vacated because the father found out about the child. And contested the adoption. Your potentially setting another family up for heartbreak and losing a child that they have bonded with. If the father finds out and wants custody.",
   "created_utc": 1701011002,
   "score": 15,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katufxa",
   "message": "I’d hate that he would use it as a manipulative tactic to keep you close. Maybe consult a lawyer before telling him. Get your ducks in a row.\nNTA",
   "created_utc": 1701003187,
   "score": 10,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau1lqn",
   "message": "A conundrum.\nNTA.",
   "created_utc": 1701007201,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauq2s2",
   "message": "“Just because I brought that out in him, doesn’t mean others will”\n\nYou did not cause his behavior. You did not cause him to abuse you. You do not have the power to control his actions. The way he treated you is not your fault. It’s not your fault. It’s not your fault. It’s not your fault. \n\nYou need to talk this over with a therapist. Even if it’s a counselor at a community health center. And you need to stop listening to all the internet “lawyers” here and schedule a consult with an attorney that practices SPECIFICALLY family law. Many will offer a free consultation, so I’d make some phone calls. But until you have some legal advice and speak with a therapist that helps you regain some control over your situation, I’d keep yourself and your baby (born or not) away from him.",
   "created_utc": 1701017525,
   "score": 11,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauqmxi",
   "message": "I’m reading comments on here about the father needing to sign off for adoption but what if you don’t know who the father is? How is the state going to find the father? Do their own blood tests? I’m sure having legal counsel will help navigate the process and your lawyer will have your best interest at heart.\n\nI really feel for you ending a bad relationship and then finding out you’re pregnant. That’s tough. Being pregnant myself I have a question, how will you hide the pregnancy from him? I know you are no contact but what if he hears from mutual friends or sees you? Not to make you paranoid but this is a precarious situation. I’ve heard of people hiding pregnancy and giving children up for adoption by traveling to another country. Not sure how that works or if it’s feasible. \n\nNTA. You are trying to protect the baby from the father. Trust your instincts, they are heightened and spot on when you’re pregnant. You also don’t want to be tied to him and unfortunately that’s what happens when people co-parent.",
   "created_utc": 1701017738,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kautilo",
   "message": "\u0026gt;That’s why I feel conflicted. Just because I brought that out in him, doesn’t mean others will, I guess. He’s not a horrible person.\n\nYou can not be more wrong here. They way a person treats you has nothing to do with who you are, but everything with who that person is.\n\nSo stay away from him and never go back.",
   "created_utc": 1701018831,
   "score": 7,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katyxyv",
   "message": "Abusive: NTA, your protecting your child \n\nNot abusive: YTA, your just bring selfish",
   "created_utc": 1701005805,
   "score": 25,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau1k2i",
   "message": "NTA especially after reading your comments on him being \"physical\" with you. Nobody in a healthy relationship will ever become physically abusive to get their point across. Keep your baby safe and if possible don't tell anyone who the father is. If he finds out you're pregnant somehow, the father is another guy you hooked up with, not him. He lost the right to fatherhood the moment he laid hands on you.\n\nI sincerely hope that your pregnancy goes smoothly, with a safe delivery and discrete adoption process. If I'm correct you can start looking for families now that will adopt them! Make the process easier on yourself and try to stay stress free.",
   "created_utc": 1701007178,
   "score": 9,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau6ivh",
   "message": "Abusers first step is to isolate the victim. They don’t want anyone to be close enough to see what is going on. Emotional abuse and gaslighting are just as bad as physical abuse.",
   "created_utc": 1701009544,
   "score": 8,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav1bn7",
   "message": "NTA You didn’t “bring that out in him”. If he is aggressive/violent/controlling, he will be like that in every relationship. Don’t fool yourself.\n\nI don’t know about the legal ramifications, but in the case of an abusive partner, I would say, don’t tell him. You can write the child’s adoptive parents a letter to explain who the bio father is and what kind of a person, so that the child has a chance to find out about him when they are grown up.",
   "created_utc": 1701021767,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katw6yk",
   "message": "NTA at all. If you know he’s not safe, don’t take any chances. If he’s abusive he’ll either use the baby as a pawn to control you, be abusive to the baby as well, possibly get custody and put you on child support, abandon you and the child or refuse to consent for adoption and force you to parent/ coparent. It’s not worth living a nightmare! If it’s not against your beliefs I say abort, or have the child without his knowledge and either parent alone or go with adoption/ kinship care. \n\nDon’t let anyone convince you to tie yourself to this man for life by informing him. Anyone who cares about your safety and wellness should understand. Also start planning the adoption now with adoption agencies or friends/ relatives who will raise the child so you can carefully select a family and get to know them in advance rather than a random family being chosen for you by safe haven/ foster care etc. Good luck and take care!",
   "created_utc": 1701004259,
   "score": 8,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau10w2",
   "message": "NTA. However, you should talk to an attorney from your area. In some states not listing him on the birth certificate is enough for you to be able to put the baby up for adoption without his consent, in other states, it’s not and they will notify him. Make sure you’re doing what is best for the child. \n\nAnd in your comments you have said that he got physical with you, yelling at you and trying to alienate you from others IS abuse. He may have convinced you that he was doing it for you or because of you or whatever, but he wasn’t. He was controlling you. He was hurting you, physically, emotionally and mentally. \n\nAbuse is not just physically hitting you every day of your time together and leaving you bruised and battered all of the time. That’s just one *type* of abuse. If a man hits you *once* because he wants to “correct” you or whatever, that is abuse. If a man is constantly angry and screaming at you to convince you that you’ve done something wrong, that is abuse. If a man tries to convince you that you should only ever want to be around him and no one else should be allowed into your bubble with him, *that is abuse*. Please look up different types of abuse so you can learn what to look for and keep yourself safe in all future relationships. (NOTE: I made the man the abuser because that is specific to this post; women can be just as abusive as men).",
   "created_utc": 1701006901,
   "score": 6,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katzc8t",
   "message": "I would imagine that an adoption, without consent from the father would not be legal.  You should get a lawyer, inform the father through your lawyer that you're pregnant, and that you want your child to be adopted.  You should give the father the option of taking on the child himself.\n\nHe may not want to know, but at least, for your child's sake, give him the chance to be involved.",
   "created_utc": 1701006015,
   "score": 7,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau1050",
   "message": "In most states, you are at the most legally obligated to put an ad in a local newspaper naming the father. If he doesn't respond, you're all good to go ahead and not tell him. I had to do this for my daughter to be adopted, even though she was a product of an SA. I legally had to give her sperm donor the opportunity to be a parent, even if I wasn't going to be one to her.",
   "created_utc": 1701006890,
   "score": 11,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau687u",
   "message": "0P, what he did to you was abuse. As someone else said, please learn more about abuse to protect yourself in the future. Hon, you are definitely NTA.\n\nYou need to consult an attorney about the legalities of putting the baby up for adoption without informing the father about the baby. He later contest the adoption and fight for custody.",
   "created_utc": 1701009408,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau9hm4",
   "message": "YTA because if he ever finds out he can take those babies from whoever you adopt them out to.  Because he has parental rights whether you like it or not and if he doesn't sign them away the adoption can be invalidated and then the kids get traumatized by being ripped away from their adopted family.",
   "created_utc": 1701010857,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauegdm",
   "message": "Based on further comments you left an abusive situation with the father and you are 100% NTA. Keep yourself safe and healthy thru the pregnancy. Pregnancy and childbirth are incredibly taxing and your mental health and safety are priority #1.",
   "created_utc": 1701012959,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauf70t",
   "message": "From what you described,  it sounds like the only safe option. This guy sounds dangerous to be around and would NEVER make a good father to anyone. \n\nNTA, but make sure you get your ducks in a row.",
   "created_utc": 1701013262,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauqiid",
   "message": "You need to contact a lawyer. To give a child up for adoption, they’ll ask who the father is and if he gives consent. Can’t lie. He might also be given the option to keep the child.\n\nHe’s not a horrible person but you need to stay away from him? If he was abusive, that changes everything. But then— how is he not a horrible person? So clarity is needed on that. If he wants the child and is fit to take the child, be ready to pay child support.",
   "created_utc": 1701017691,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav11zw",
   "message": "NTA. Claim you got pregnant from a one night stand with a stranger whose name you didn't know. Keep everything quiet, don't tell even your friends about who the father is. Don't post any pics of yourself pregnant or let others.",
   "created_utc": 1701021668,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katvysx",
   "message": "NTA. Statistically the physical abuse gets worse when the woman gets pregnant. Take care of yourself.",
   "created_utc": 1701004123,
   "score": 7,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katsts7",
   "message": "NTA. I call BS on the sperm donor having a ‘right’ to know, particularly when there’s abuse. I wish more women would keep quiet and not tell, but some like the drama.",
   "created_utc": 1701002148,
   "score": 21,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katy3mi",
   "message": "I think abuse is the only acceptable reason not to tell the father. You have the right to decide to bring the baby to term or not but once the baby is born the father at the very least has the right to know their child exists. Even if it means they want to raise the child and youd have to pay child support.",
   "created_utc": 1701005347,
   "score": 7,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau2a6x",
   "message": "Your body. Your choice. This could save both of your lives. NTA.",
   "created_utc": 1701007542,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau3j83",
   "message": "You are doing the right thing.",
   "created_utc": 1701008157,
   "score": 6,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau109k",
   "message": "NTA - yes you are in a difficult situation. … I read some of your replies. Him physically hurting you even one time is too many, plus the controlling behavior = abuse. You are doing the right thing to steer clear from him. Stay safe \u0026amp; know this child will be a gift to someone who cannot have children.",
   "created_utc": 1701006892,
   "score": 7,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau878r",
   "message": "Reading your replies... You are NTA. One time is one too many. Coercive control IS abuse. You don't want to live your whole life wondering if he is doing that to a kid and feeling tied to him or obligated. It's your choice whether to put the child up for an adoption but it seems like there's a better chance they will then go to a safer happier home",
   "created_utc": 1701010295,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauackq",
   "message": "\u0026gt;Just because I brought that out in him doesn't mean others will\n\nI was somewhat on the fence here before I got to this line.  On the one hand, yes, a father, in general, does deserve to know that they have a child coming into the world and make their own decisions accordingly.  However, that line is classic abuser victim talk and if he has abused you enough to the point that you HONESTLY think that it was YOUR FAULT that the abuse happened, then this man has NO BUSINESS being responsible for another human life.  NTA and if abortion is not on the table at all for you (not mine or anyone else's place to judge you one way or the other on that topic) and you are not in a place to raise the child yourself, then adoption sounds like the way to go.",
   "created_utc": 1701011233,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau80q7",
   "message": "Yta. By not telling him, you're putting your child at risk if being torn away from their adoptive family and forced to go live with a complete stranger.  If he doesn't give up his rights, he can take the parents to court and get his kid.",
   "created_utc": 1701010216,
   "score": 10,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katy902",
   "message": "NTA\n\nKeeping him completely out of it sounds like a matter of your physical - not to speak of mental and emotional - safety. \n\nYou are doing a very brave and selfless thing. Please take care of yourself first. You deserve it.",
   "created_utc": 1701005427,
   "score": 6,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katxj2s",
   "message": "NTA. You have to prioritize yourself and the baby’s wellbeing.",
   "created_utc": 1701005030,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau59hh",
   "message": "NTA. If he whined about never wanting children, then you should still tell him out of honesty, but if he's flat out abusive, then don't tell him shit.",
   "created_utc": 1701008971,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau69ro",
   "message": "NTA.",
   "created_utc": 1701009428,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau6hxh",
   "message": "NTA. Even the states that require the father to be notified prior to adoption have exceptions in the case of abuse or sa. \n\nPlease look for someone to talk to through this. Get in touch with a DV advocate group. They can help you with resources for counseling and help you find legal assistance. \n\nI'm so sorry that you're going through this and wish you the best.",
   "created_utc": 1701009532,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau6ind",
   "message": "Maybe consult a lawyer before telling him.",
   "created_utc": 1701009541,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau70ot",
   "message": "Hell, no!",
   "created_utc": 1701009769,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau72ma",
   "message": "You didn’t “bring that out of him”. He was always and will always be like that. Personally I think NTA, if you can’t trust him with your own safety you certainly shouldn’t trust him with a child’s. Sending you love and support",
   "created_utc": 1701009793,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau816l",
   "message": "NTA. But you may want to keep it when you get it. I know women that have, and they were young at the time. It will get back to him eventually anyway, and do you have the right to deprive that child of the knowledge of who their father is, their background, their generic and medical history? That’s so important nowadays.\n\nI wouldn’t have that hassle during pregnancy, though. He sounds like a pain, but you don’t need his consent to adopt out the child in most countries as you aren’t married.\n\nThere’s little stigma about it either. But he sounds an AH. Wait till you give birth then decide. Give the adoption authorities all the details that you know, so the kid has some knowledge in case you and your family aren’t around in future.",
   "created_utc": 1701010222,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau9ltr",
   "message": "Is this legal? Don't you need the consent of both parents for an adoption? It might make sense if you didn't know who the father was but you do. And as the father he has his right to the child. If the abuse was never documented, the law might favor him. I don't see how he wouldn't have a case if he ever finds out.",
   "created_utc": 1701010907,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaud5e0",
   "message": "NTA once you clarified there was physical abuse. Even \"a few times\" is unacceptable. We really don't need to get further into where the line between ok and not ok is once physical abuse comes into play. That's definitely in the \"protect yourself\" category, as well as protecting the baby. Not only can he use the baby to tie you to him, even just financially, you have no guarantee the abuse won't extend to the child. Even if you want to downplay for yourself, getting physical a few times would be something most people would consider intolerable for a child\n\nYou have no guarantee the adopted parents won't, but odds are always better than someone you know has a history of it\n\nAs for your description of the abuse in your comment, please consider maybe seeing a therapist to unpack this. You're downplaying and justifying some things you really shouldn't be, and it's hard not to be a little concerned. I think you may need a neutral voice to step back and view the situation so you don't fall back into old habits. Value yourself a little more.",
   "created_utc": 1701012426,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaue879",
   "message": "What is his family like?",
   "created_utc": 1701012867,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaufdqe",
   "message": "Look if you plan to give them up for adoption, you should inform him and get him to sign over his parental rights away. Adoptions years after going through have been reversed by fathers who never were given the option to take sole custody himself. If you are still going to do this without informing him, you must be 100% sure he will never find out about this. It would be awful for the adoptive parents and kids in the future if he did find out.",
   "created_utc": 1701013337,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaufgn2",
   "message": "NTA if he was abusive to you he will be an abusive father, you are saving this child a life of hurt by not telling him. And yes he will use it to control you for the rest of your life. Abusers prove themselves unworthy of parental rights. Good luck.",
   "created_utc": 1701013371,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauqa45",
   "message": "NTA. I understand why you don’t want to raise a kid in that environment or have him bear the child. However, you need to consult a lawyer asap, or contact an adoption agency and the attorney will handle the paternity. All reasonable efforts need to be made to have the father sign off rights. Let the lawyer handle communication with him and they’ll tell you how you can keep yourself safe.",
   "created_utc": 1701017602,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauqpdz",
   "message": "NTA first how old are you and how old is he? You stated he was older. Depending on the age difference could be a predator situation along with the abuse sounds like he was trying to break you which would give him complete control over you and the abuse would have continued and gotten worse. Also, it is NEVER your fault for abuse end of story. Please stay away from him and place the baby up for adoption. \nAlso please get into therapy. You need to work through the relationship and understand how this is not a reflection of who you are just a bad thing that happened and you learn and move on to healthy relationships. You will also need to discuss the adoption and all your feelings with the therapist. Keep your head up. You can and will get through this.",
   "created_utc": 1701017764,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kausz76",
   "message": "NTA. Keep your NC with him. Just know that when you go to arrange the adoption you'll be asked the name and contact info of the father so that they can ask if he agrees to relinquish his parental rights. They will contact him. \nYou DON'T NEED TO HIRE AN ATTORNEY IF you go through an adoption agency. They'll handle it. It's okay to withhold the name of the father until after the birth so that he doesn't find out and bully you during the pregnany. The agencies have experienced this before. \nBest wishes",
   "created_utc": 1701018624,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kautek5",
   "message": "If he isn’t there for you, then there’s no reason to expect you’ll be there for him. You owe him nothing. NTA.",
   "created_utc": 1701018788,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauw2fo",
   "message": "I'm torn. On one hand I firmly believe it's everyone's individual responsibility to know if they have a kid whether that means taking a pregnancy test if you're a woman or taking the initiative to call and ask a woman if she's pregnant if you're a man. So I'm going with not being the AH for OP not going out of her way to inform him while also doing with pregnancy. OTOH once the baby is born the circumstances where OP has unilateral say over the fate of the baby (to have or abort) is gone so trying to unilaterally put the kid up for adoption isn't ok. That'd be like the dad taking the kid from the hospital and dropping him or her off with a nice couple without getting OP's approval.",
   "created_utc": 1701019800,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauxml9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauz80b",
   "message": "If it were me, I wouldn't tell, I don't want any connection to this person again ever. \nAND, what if you change your mind? Alot of women do, then you'll have already told them who it is, and you'll be stuck co-parenting forever.....",
   "created_utc": 1701020981,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav0zei",
   "message": "INFO...\n\nBecause if this post is actually real...it's a BIT overly perfectly ghastly...you're more than a wee bit of an eedjit, both in terms of picking men and in terms of thinking you can get away with this scheme.\n\nBecause he clearly IS a horrible person, and the fact you're saying he's not indicates you still think like a child, despite the fact you're old enough to carry one.\n\nBut this little plan of yours could easily backfire and cause ASTONISHING damage to any number of people. The law is the law, and just because it doesn't cater to your particular needs doesn't mean you can just ignore it. \n\nHe's got rights as well as responsibilities and you can't just sweep all that under the rug. Trying to do that just gives him power over you if he ever finds out. And I strongly suspect that somehow or other you're going to figure out a way to \"accidentally\" do that.\n\nTruth be told, the only way to keep him completely out of the mix is to terminate the pregnancy, which could very well be impossible at this point.\n\nBut yes, you need to consult an attorney, map out a plan, expect him to be as much of an obstruction as possible, and deal with it. Best of luck.",
   "created_utc": 1701021641,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav10gs",
   "message": "Will this be an open adoption? If so, your child could get curious about their bio father and resent you for not telling him. I believe the courts try to consider what’s best for the child and would prefer to place them with at least one willing and eligible bio parent. I’m so sorry for your situation, but you should be honest with your child’s father since you decided to go through with giving birth. Even if he’s an awful ex, you could have a host of problems in the future by concealing this pregnancy from him. I wish you a healthy pregnancy and a good outcome for everyone involved.",
   "created_utc": 1701021652,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav1fbj",
   "message": "YTA because the father might want to adopt",
   "created_utc": 1701021805,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav2wzm",
   "message": "NTA, and it clear why you want to leave this AH in your rearview.  Are you using an adoption agency or were you going to try doing it yourself?  Advice: don't do it yourself... there are many legalities to consider.  Research agencies to find the one that best fits your preferences; they'll know how to accomplish what you want legally.  Do you want an open adoption or do you want the records sealed?  There are lots of things to consider, so stop asking strangers on Reddit and find a good agency.  Good luck.",
   "created_utc": 1701022349,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav366e",
   "message": "I’d like to put aside the ethical issue of whether you should or shouldn’t tell the baby’s father of your pregnancy and your plans and focus on the practical. \n\nFirst of all, there are other people who know about your pregnancy and the later stages of pregnancy are hard to hide. In other words, even if you don’t tell him you’re pregnant, you need to be prepared for him to find out. Someone you both know in common is going to see you very pregnant and then mention to him — probably thinking he already knows.\n\nI don’t know what state you’re in or if you’re even in America but my understanding is that laws vary from place to place as far as paternal rights go.\n\nIt’s your body but it’s his baby, too, so you may not be able to just give the baby away for adoption without his consent.\n\nI agree with other posters who have said you need a lawyer who is an expert in family law. Failing that, if money is an issue, see what free services there are for you in your city or town. You could get legal help without cost to you.",
   "created_utc": 1701022441,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav46ve",
   "message": "Honestly getting an abortion would’ve been easier bc then you wouldn’t have to be dealing with any of this. \n\nYou could also give birth a drop it off at the hospital or fire station later and wouldn’t have to deal with any of the legal stuff \n\nLegally a social worker will need to know who he is. I’m sure if you said you didn’t wanna contact him then they will as long as you make it easy like giving full name, number, and address. Both parents have to sign off on it. You can’t just give a baby up for adoption like that",
   "created_utc": 1701022809,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau137j",
   "message": "Don’t say anything to the sperm donor. Like others said, he was controlling and that is abuse.  If you’re truly going to give the baby up for adoption, you need to find an agency. \n\nIf you found out “too late” then you’re pregnant enough to be having regular prenatal visits. (I hope you are receiving care)\n\nAsk your provider to connect you with a social worker (most hospital systems have social workers).  They may be able to help you find an adoption agency.",
   "created_utc": 1701006933,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katyxn0",
   "message": "I may get hell for this but, there’s no obligation to tell him you’re pregnant. You are NTA. Women are fully responsible for medical care during pregnancy and in most states men have to legally establish parentage upon birth in unwed couples. This is your decision. You don’t have to question at all what’s best. What works for you is the right decision. You are so strong and brave for making it! Seriously. \n\nI’m so tired of this attack the woman nonsense. I’m a statistics person…1 in 6 WOMEN are FIRST abused during pregnancy. If this man is (in your opinion) borderline abusive now. He is likely to up the game when you are most vulnerable. Add to that 1 in 4 homes have absent fathers, the care for this child is on the woman that carries it. You get to give this child a life and you get to have yours without risk to your safety/life.",
   "created_utc": 1701005800,
   "score": 6,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau7klj",
   "message": "\"But I don’t know if he’s like this with others, or maybe he’d be a good father. That’s why I feel conflicted. Just because I brought that out in him, doesn’t mean others will, I guess. He’s not a horrible person.\"  \n\nWhy take that chance?  He showed YOU he's a terrible person, trust yourself.  Women are oversocialized to give creepaziods chance after chance, and they absolutely don't deserve it.",
   "created_utc": 1701010017,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaue7a1",
   "message": "Unfortunately, you’re going to have to get in touch with a social worker and/or lawyer about this. They won’t let you sign away your child without consent of both parents",
   "created_utc": 1701012857,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau5gcy",
   "message": "NTA. Do Not Contact This Abuser. At All. Never. You will never be free from him. \n\nJust carry the child and place them for adoption. No matter what, do not contact this person.",
   "created_utc": 1701009058,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katv9c3",
   "message": "NTA. Your safety and well being come first.  The best decision is the one you feel comfortable and safe with. Do not contact him ever.",
   "created_utc": 1701003694,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "katw0o1",
   "message": "NTA I don't care if it was just a falling out, he is out of the picture and your life. Keep your baby and you safe.",
   "created_utc": 1701004154,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau18z2",
   "message": "NTA. If he is as bad as you say, I would go ahead with your plan for adoption. Say you don't know who the father is and move on otherwise you will need to get his permission for adoption and if you don't want to keep the child then he would end up with full custody most likely, unless he's unfit.",
   "created_utc": 1701007016,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau2o99",
   "message": "You are definitely NTA here. Maybe say you are not sure who the father is, drunk party etc. If asked during the adoption process. I know it doesn't look good on you, but it will avoid a problem. \n\nHe should not know. He doesn't sound fit to be called a human being, so definitely not a father. Keep yourself safe.",
   "created_utc": 1701007733,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau4shh",
   "message": "Um…not sure where you are but I’m pretty sure that you can’t give a child up for adoption without the consent of both parents. So, that would mean you have to lie at delivery that you don’t know who the father is, get your whole family in on it, and risk legal hell one day if he finds out. That being the case, yes, YTA.\n\nAdopted kids deserve to know who their parents are too and that being kept from them often results in worse mental health outcomes. You’re taking a bad situation and making it worse if you follow through on this. And I doubt your family will keep that secret for you forever, especially if they realize it involves perjury.",
   "created_utc": 1701008753,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kau5sy5",
   "message": "Honestly if I were in your situation I would do the same thing.",
   "created_utc": 1701009219,
   "score": 2,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kauf5a7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavh3wd",
   "message": "Comments are cruel in here. \nYour body, your choice.. if this was an abortion. you would not have to disclose anything, and you would be supported in here.  Now that you're doing the opposite and made a decision of adoption. You're not supported, and ppl want you to tell the sketchy Ex.  \nNTA. NTA... I support the decision. \nHope you find a nice couple.  Good luck.",
   "created_utc": 1701027457,
   "score": 10,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavc7c5",
   "message": "Hiya! Birth mother here! \n\nSo, folks are being super effing aggressive on here, tell them to be quiet. Most of them are talking out their ass and have no idea of the legalities. ☺️ \n\nSo, whether you decide to do a private adoption through an attorney, or go through an adoption agency, yes, 10000% they will indeed inquire about the father. Partially for relenquishment of parental rights, and partially for medical history. \n\nNow, you can do a few things: \n1. lie and state that you don't know who it is.\nA. They will indeed ask you to provide names of the men of whom it is possible it is. They will contact these men, talk to them about the plans for adoption, etc. In some cases they will ask for a signature from all, or, given the ease of a paternity test, will insist on one after birth to determine between the people you named. Then ask that person to sign the adoption papers. \n\nB. You say you don't have a full name, just a generic first name \u0026amp; say it was \"just a hook up\". You have a 50/50 chance as to whether they will do a DNA test at birth to try and locate him through a DNA service \u0026amp; other family members. \nSeriously, some of these organizations are super determined to ensure full legality of the adoption, because if they don't, and they place the child without it, if the bio father finds out, they indeed will have legal rights to take that child from their adoptive parents, which would be horrific. \n\n2. Tell the truth to your caseworker (if an adoption agency) or lawyer (if private placement) about why you don't want the bio father informed. Abusive, etc., and they will know exactly how to handle it. They will do their due diligence in \"contacting\" him. Likely an ad in a local newspaper with a first name you provided them with, or attempt to contact through last known address you might be able to provide them with. 99% of the time, this method allows the adoption to legally move forward after enough time \u0026amp; \"acceptable attempts\" to contact. \n\nI became a mentor for other younger women that went through the agency I went through, and I have seen it all. \n\nAlso, know that there are various levels of adoption, closed (100% no contact), semi-open (updates however often is in the contract, pictures, letters, etc, whatever is agreed on, but not 100% access, contact goes through agency or lawyer), and open adoption (you are allowed access to child \u0026amp; family openly). Also know that even in a closed adoption, you 100% have the right to choose your child's adopters. \n\nI would recommend an agency, but make sure of their reputation, and make sure they've been around a good long time. Adaptation for an adoption agency is key. It means they do things ethically \u0026amp; to standards of society. And our society has greatly evolved in the adoption world. \n\nI was married to my son's father, so him signing papers wasn't an issue. \nBut your situation...safeguard the father's name until you know who you are going through to facilitate the adoption. Be honest with them. The level of name disclosure will indeed be up to you. You also have the right to interview agencies and lawyers. Be honest about the situation, and ask what they would do. Perfectly normal and ok to ask. \n\nIf you have any questions, please feel free to contact me. \nAnd, honestly, I know you're choosing this for your life circumstances, but you're also making the absolute best decision for the baby, too. \nMy son's adoption is the one thing in life I am most proud of. The opportunities he's had, the life he's had...I couldn't have given him those things. \nRegardless of the reason, don't let ANYONE talk you out of what is best for him AND you. And if anyone ever says \"I could never give away my baby!\" Just smile and let them say whatever. You know what is best for you \u0026amp; that child. Screw everyone else. \n💜💜💜",
   "created_utc": 1701025697,
   "score": 24,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavcexa",
   "message": "All fifty states have safe haven laws. Google what the rules are in your state. You can have the baby and deliver him or her unharmed legally. You don’t have to disclose to anyone who the father is if you don’t want to. You are this baby’s mother and if you think the father will not be a safe person for you and the baby to be around, you don’t need anyone’s permission to take this step to protect your child. Your only obligation here is to yourself and the baby. Don’t worry about the father, he lost the privilege of being involved when he became abusive to you. Don’t let anyone else tell you that you owe him anything, and you are absolutely not being selfish by putting your baby’s needs first.",
   "created_utc": 1701025771,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaveure",
   "message": "I don’t have a verdict but I will say you need a lawyer, someone you can talk through in case he gets involved but don’t talk to him yourself. I’m fairly certain you need both parents to sign away parental rights before a child is put up for adoption.",
   "created_utc": 1701026647,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavi6jm",
   "message": "Sounds like you know you can’t give a child a good home and life. You think he can’t either. So, yes terminate the pregnancy or give the baby for adoption.",
   "created_utc": 1701027852,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavs4sy",
   "message": "Your NTA.",
   "created_utc": 1701031461,
   "score": 4,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavtbly",
   "message": "Lawyer up and definitely go no contact with your abuser .\nProtect yourself.",
   "created_utc": 1701031896,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaw7zj7",
   "message": "\n\n\n\nYou may not see this but I WANT YOU TO KNOW you are a good mother for asking these questions. \n\nPersonally, though I know there are strong opinions on this, if he wasn't able to be mature enough for you, he isn't ready to be a father. Your children should not suffer because \"he deserves a chance\". He had a chance to be decent to you and he failed.\n\nTaking a step back to choose the very best for your children, is what makes a good mama. Not rather you raise yoursepf or not. \n\n I'm proud of you.",
   "created_utc": 1701037277,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kawebne",
   "message": "“But I don't know if he's like this with others, or maybe he'd be a good father. That's why I feel conflicted. Just because I brought that out in him, doesn't mean others will, I guess”.  Never take responsibility for other peoples abusive actions. You are not at fault there.  Regardless of what happens with the adoption, never blame yourself for what he did to you.",
   "created_utc": 1701039665,
   "score": 5,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav3ya5",
   "message": "Safe haven boxes exist. You are allowed to leave a baby at a fire station. Look into this please!!!!",
   "created_utc": 1701022723,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kav6i5k",
   "message": "Leave the baby at a safe haven drop off. They ask no questions.",
   "created_utc": 1701023642,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavbe0l",
   "message": "If you say you don’t know who the father is, they cannot prove otherwise. “I had a one night stand at a party, I don’t even know his name.” Unless you fuck up your story, there is no chance they find out. \n\nIf you do tell him, you are inviting everything that you got away from back in your life, and he can try and keep the baby. So in my probably unpopular opinion, NTA if you keep it to yourself.",
   "created_utc": 1701025407,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavdy09",
   "message": "ethically i don’t think you need to tell him based on your description of him, legally it depends where you live. NTA from me, if you don’t have to tell him don’t, if he has abusive tendencies it could put you and potentially adoptive family harms way to do so.",
   "created_utc": 1701026321,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavefs9",
   "message": "No, you owe him nothing. Decent people don't force you to block them FAST and the type that do don't deserve to be parents.",
   "created_utc": 1701026498,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaver6r",
   "message": "Get a lawyer.  Laws about this are different in each state.  The moral thing to do is tell him.  He should know that if he doesn't agree to the adoption, then he will be responsible for raising the child.  Of course, he could still hit you up for child support at some point.",
   "created_utc": 1701026613,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavhro4",
   "message": "NTA",
   "created_utc": 1701027700,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavjuah",
   "message": "NTA. Sounds like he’s a shitty human being and shouldn’t be raising a child in the first place.",
   "created_utc": 1701028455,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavjvfg",
   "message": "NTA\n\nThe moment someone abuses you is the moment you're no longer obligated to keep them apprised of anything.",
   "created_utc": 1701028467,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavkahu",
   "message": "Absolutely NTA but find out what the legal process is for the adoption process where you are. It's possible he would have to be notified and that might mean your plans change if so. Now, I'm not saying this is necessarily the best advice or a suggestion but in your position I might want to be careful initially stating you know who the father is. Given this is a physically violent and controlling individual, I'd be very concerned how they'd treat a child. \n\nThere's a lot of comments made where they've assumed where you live and given statements about legal advice based on that - rather than thinking they're correct find out yourself for where you're from. Where I am you can often get a free consultation for legal advice - worth checking if it's an option for you.",
   "created_utc": 1701028620,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavkf5m",
   "message": "Nta. If you can't give the baby up for adoption, there is the safe haven law. Just give the baby to the hospital or the nearest fire station no questions asked.",
   "created_utc": 1701028667,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavq9ta",
   "message": "NTA. That sort of person will never make a good parent. Protect yourself legally, though.",
   "created_utc": 1701030781,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavu3wq",
   "message": "NTA. So sorry you’re going through all of this. Adoption sounds like a great solution. Hope you’re doing okay.",
   "created_utc": 1701032181,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavui11",
   "message": "I think you need to discuss with a counselor and lawyer. \n\nWhat happens if years from now, this man finds out he has a child? With ancestry sites, people have been finding out family secrets.\n\nMy point is that he may not find out now, but he could find out later. \n\nI’m of the opinion that someone should know if they are bringing a child into the world. That doesn’t mean you need to take abuse from him. Not sure where you are, in the US you may be able to get a PFA (protection from abuse order) aka restraining order.\n\nYour safety is most important. Wishing you and the child the best outcome, and sorry you’re going through this.",
   "created_utc": 1701032319,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavumcw",
   "message": "NTA! From other comments I read he sounds like an unsafe person! I suggest you get a lawyer though",
   "created_utc": 1701032363,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavv5u3",
   "message": "Do not tell him you are pregnant. He will use that to control you and manipulate you. You have people on here who have been through that and have ages of wisdom on this issue. Start setting up appts to get the ball rolling on adoption with an experienced adoption agency. Do not tell them the fathers name until you need to. Repeating this for seriousness, do not tell him you are pregnant until you legally required to.",
   "created_utc": 1701032560,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavvec3",
   "message": "You did not bring that out in him! If he behaved badly or violently toward you, it’s on him? Not on you. \n\nWhatever you decide to do, please find legal counsel before you tell him or not. Advice on the www can be useful, but it will never take into account all your circumstances. Some cities and stated provide free legal counsel for a lot of social and age groups. \n\nYou are doing the right thing putting the baby up for adoption, it’s refreshing to see young people that are levelheaded enough to realize when it’s not a good time for them to be parents. \n\nGood luck OP.",
   "created_utc": 1701032647,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavw5if",
   "message": "Get a lawyer.\nAlso, if he's a danger to himself or others, including you, then you need protection. \n\nNote: you don't bring personality traits out in someone, those were already there.",
   "created_utc": 1701032924,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kavwrsu",
   "message": "If he is abusive (physically, mentally, emotionally, sexually or any other way), then you are NOT a a$$.",
   "created_utc": 1701033152,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaw2s0l",
   "message": "NAH. Well…. The father may be for other things and may yet still be….. \n\nYou are not however. But you do need legal advice. He can petition for custody. You can relinquish your rights. \n\nBut you need an attorney to do this RIGHT. \n\nBest of luck to you. You are doing a brave thing.",
   "created_utc": 1701035362,
   "score": 3,
   "submission_id": "1849o8i"
  },
  {
   "comment_id": "kaw70bz",
   "message": "NTA. Stay safe.",
   "created_utc": 1701036913,
   "score": 3,
   "submission_id": "1849o8i"
  }
 ]
}