{
 "submission_id": "184aqux",
 "title": "AITA for screaming at future SIL and telling her to stop whining like a baby?",
 "selftext": "I (34F) was asked to cater Thanksgiving dinner for myself, my 3 children, my oldest child's bf, my fiance (29M), future BIL (24M), \u0026amp; his fiancée (22F). I absolutely agreed to this because not only do I love cooking but, I am good at it because my dad taught me when I was young and he used to work for a well-known cruise line as a chef. I honestly get a joy out of seeing people's reactions to eating a delicious meal. \n\nOn short notice,  I was informed that not only would there be 6 extra people but,  also that future SIL would be cooking. Now, I do not have a problem with people wanting to add their own signature dish or anything like that. The more, the merrier, right? Well, SIL is a terrible cook. I have tried to help her in the past by giving her small tips without hovering or overstepping, but she just doesn't listen. At this point, I just let her do what she pleases. \n\nOnce dinner was finished, we put everything on the table, organized everything in order from meats to sides to gravies to biscuits. Everyone filled up their plates and went ham (no pun intended lol). I started cleaning up the mess from cooking and doing some light cleaning (small spills, etc.) around what was left of the food. As I was walking from the dining room back to the kitchen to throw something away, she is entering the dining room with her fiancé. She looks at the table and says \"no one ate anything I made.\" She grabs her fiancé, storms to the bedroom and starts screaming at the top of her lungs at her fiancé that I somehow sabotaged her and her food so no one would eat it. \n\nFirst of all, I wasn't even in the kitchen when she was cooking because I had timed all of my dishes to be finished at the same time. Second of all, I would never sabotage food knowing that people are going to eat it. Third of all, i was outside entertaining kids \u0026amp; guests so that she would have space to cook because the kitchen is not very big. So, I waited for her to finish her little rant then, she came out and gave me dirty looks then started saying stuff under her breath about me. This is where I went off. I screamed at her that I have done nothing but tried to help her and all she has done was ignore my suggestions. I also yelled at her that she is acting like an immature baby throwing a temper tantrum and maybe nobody ate anything you made because it didn't look appetizing. (My rant was a little longer than that but that was the summary of what I told her).Then I stormed off to go have a peace break.\n\nInfo: I did not tell anyone who made which dish. I just directed people to the food and let them know that plates and silverware were on the table. So, there was no way for anyone to know who made what. (I wanted to give everyone who cooked, a fair chance of taste test.)\n\nSo AITA for telling her to go sit down \u0026amp; stop whining like a baby?",
 "created_utc": 1701005395,
 "permalink": "/r/AITAH/comments/184aqux/aita_for_screaming_at_future_sil_and_telling_her/",
 "score": 172,
 "url": "https://www.reddit.com/r/AITAH/comments/184aqux/aita_for_screaming_at_future_sil_and_telling_her/",
 "comments": []
}