{
 "submission_id": "184aqux",
 "title": "AITA for screaming at future SIL and telling her to stop whining like a baby?",
 "selftext": "I (34F) was asked to cater Thanksgiving dinner for myself, my 3 children, my oldest child's bf, my fiance (29M), future BIL (24M), \u0026amp; his fiancée (22F). I absolutely agreed to this because not only do I love cooking but, I am good at it because my dad taught me when I was young and he used to work for a well-known cruise line as a chef. I honestly get a joy out of seeing people's reactions to eating a delicious meal. \n\nOn short notice,  I was informed that not only would there be 6 extra people but,  also that future SIL would be cooking. Now, I do not have a problem with people wanting to add their own signature dish or anything like that. The more, the merrier, right? Well, SIL is a terrible cook. I have tried to help her in the past by giving her small tips without hovering or overstepping, but she just doesn't listen. At this point, I just let her do what she pleases. \n\nOnce dinner was finished, we put everything on the table, organized everything in order from meats to sides to gravies to biscuits. Everyone filled up their plates and went ham (no pun intended lol). I started cleaning up the mess from cooking and doing some light cleaning (small spills, etc.) around what was left of the food. As I was walking from the dining room back to the kitchen to throw something away, she is entering the dining room with her fiancé. She looks at the table and says \"no one ate anything I made.\" She grabs her fiancé, storms to the bedroom and starts screaming at the top of her lungs at her fiancé that I somehow sabotaged her and her food so no one would eat it. \n\nFirst of all, I wasn't even in the kitchen when she was cooking because I had timed all of my dishes to be finished at the same time. Second of all, I would never sabotage food knowing that people are going to eat it. Third of all, i was outside entertaining kids \u0026amp; guests so that she would have space to cook because the kitchen is not very big. So, I waited for her to finish her little rant then, she came out and gave me dirty looks then started saying stuff under her breath about me. This is where I went off. I screamed at her that I have done nothing but tried to help her and all she has done was ignore my suggestions. I also yelled at her that she is acting like an immature baby throwing a temper tantrum and maybe nobody ate anything you made because it didn't look appetizing. (My rant was a little longer than that but that was the summary of what I told her).Then I stormed off to go have a peace break.\n\nInfo: I did not tell anyone who made which dish. I just directed people to the food and let them know that plates and silverware were on the table. So, there was no way for anyone to know who made what. (I wanted to give everyone who cooked, a fair chance of taste test.)\n\nSo AITA for telling her to go sit down \u0026amp; stop whining like a baby?",
 "created_utc": 1701005395,
 "permalink": "/r/AITAH/comments/184aqux/aita_for_screaming_at_future_sil_and_telling_her/",
 "score": 62,
 "url": "https://www.reddit.com/r/AITAH/comments/184aqux/aita_for_screaming_at_future_sil_and_telling_her/",
 "comments": [
  {
   "comment_id": "kau53ea",
   "message": "When people act like that, I stay tf away from them. Drama queens Need an audience-I don't need their damned drama. NTA, but SIL absolutely is. She's in some kind of competition with you, and you're simply not competing-which pisses her off worse. 🙄",
   "created_utc": 1701008893,
   "score": 171,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kau635v",
   "message": "NTA\n\nI think you summed it up nicely.\n\nBut you have to know that it's probably the first time in her life anyone held her accountable for anything.",
   "created_utc": 1701009346,
   "score": 33,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaua22x",
   "message": "Nta stop doing co dinners. Either you cook or she does but I would let her know she isn’t a good cook and she needs to get better or stop forcing it on everyone",
   "created_utc": 1701011107,
   "score": 12,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "katzp4w",
   "message": "NTA — it sounds like you said it all",
   "created_utc": 1701006209,
   "score": 25,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kau79i7",
   "message": "NTA but you're a grown adult too, there's no need to scream at someone. Next time just quietly bask in the glory of knowing you are better than her and let her have a shitty night.",
   "created_utc": 1701009879,
   "score": 32,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauh27a",
   "message": "NTA ish. You played into her drama by yelling and acting as immature as she did. I would’ve asked her if she had something to say bc she was mumbling. And kept doing so. However I know it can be tough dealing with someone being difficult and ridiculous so tbh you get a pass in my book",
   "created_utc": 1701014019,
   "score": 8,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kau2s6l",
   "message": "NTA",
   "created_utc": 1701007788,
   "score": 7,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kau7usu",
   "message": "NTA not your fault they didn't want the food, she's just being a drama queen",
   "created_utc": 1701010143,
   "score": 5,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaunw90",
   "message": "NTA - try to get your brother to not marry her. Obviously he's sought out some woman who will treat him like crap. She pulled him into a room to yell at him because she can't cook. She seems to think everyone is just obliged to pretend she's good at something. She must be an absolute horrible person",
   "created_utc": 1701016692,
   "score": 3,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauq8tq",
   "message": "NTA. It's not your fault she's a terrible cook and person",
   "created_utc": 1701017588,
   "score": 3,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kau7rhp",
   "message": "ESH\n\nShe is for throwing a tantrum like a child. \n\nYou are for yelling at her like that, not mature from you either ...",
   "created_utc": 1701010102,
   "score": 10,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaudlx9",
   "message": "NTA\n\nShe was screaming at the top of her lungs about you and being nasty. Not your fault no one wanted her food",
   "created_utc": 1701012616,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaugqbt",
   "message": "Nta….but curious what did she make??  I love cooking disasters lol",
   "created_utc": 1701013888,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaul7sy",
   "message": "Her issue not yours!  I grew up the only girl with three older brothers.  They were never mean, but they did tease me.  My best friend told me in second grade, not to react to them and take the fun out of them teasing you and they will stop.  It was hard, but the less I reacted the less they teased me.\n\nI would try that approach with the SIL.  If you stop reacting and try to be right, it may this stop some of this behavior.  Be the grown up in the situation.  That will really make her mad and give you some satisfaction.",
   "created_utc": 1701015662,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaurdd2",
   "message": "NTA But, honestly, I'd stop doing the holiday cooking. If she has such a problem with the food that she throws a screaming fit then she can do it all her damn self. That way no one has any choice but to eat her food and she can deal with both the leftovers and the repercussions.",
   "created_utc": 1701018016,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauz5d0",
   "message": "Sounds like a typical hellish Thanksgiving to me. Next year take the kids and go on vacation.",
   "created_utc": 1701020953,
   "score": 3,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauaw6c",
   "message": "I don't blame you, but you haven't heard the end of this. What did your brother have to say? He must realize she's a bad cook.",
   "created_utc": 1701011467,
   "score": 3,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauohg1",
   "message": "ESH, at least a bit. \n\nShe's the AH for starting the scene, you're the AH for continuing it. \n\nThe best thing a person can do in this kind of situation is remain coldly and rigidly polite, and / or to leave. Your peace break was the smartest thing you did. \n\nI'm sorry you did most of the work and got little of the credit, though. It sounds like you did a wonderful job and she was jealous. \n\nNot your fault, but losing it definitely was your fault.",
   "created_utc": 1701016916,
   "score": 4,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "katziqg",
   "message": "ESH",
   "created_utc": 1701006112,
   "score": 247,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kaup36x",
   "message": "ESH.  You lowered yourself right to her level by screaming at her.  And at least she did her screaming in another room and not in front of everyone.\n\nAll y'all come off looking bad in this little story.",
   "created_utc": 1701017150,
   "score": 255,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauxk9w",
   "message": " He kind of just sits or stands there and takes the abuse while she yells at him.",
   "created_utc": 1701020363,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauxrqe",
   "message": "She is going to struggle if they have kids.",
   "created_utc": 1701020441,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauxu11",
   "message": "Nta....would have been funnier to tell her to learn to cook if she wants people to eat her food rather than give yourself a headache screaming tho.",
   "created_utc": 1701020465,
   "score": 3,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauytau",
   "message": "Obviously he's sought out some woman who will treat him like crap.",
   "created_utc": 1701020828,
   "score": 1,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kauzoiv",
   "message": "Don’t invite her to anymore events.",
   "created_utc": 1701021152,
   "score": 2,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kav2f77",
   "message": "I wouldn’t say you’re an asshole for the substance of what you said but yelling at someone at a holiday gathering is just tasteless and unsophisticated. I’d be embarrassed.",
   "created_utc": 1701022168,
   "score": 0,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kav3kt2",
   "message": "INFO: was all that yelling happening in front of the kids?",
   "created_utc": 1701022589,
   "score": 1,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kav5h6f",
   "message": "NTA - Did BIL eat any of her dishes?",
   "created_utc": 1701023267,
   "score": 1,
   "submission_id": "184aqux"
  },
  {
   "comment_id": "kav5i34",
   "message": "Lololol imagine screaming in someone's face that they're acting like an immature baby because they're screaming. \n\nESH. You're both babies!!",
   "created_utc": 1701023276,
   "score": 1,
   "submission_id": "184aqux"
  }
 ]
}