{
 "submission_id": "184b6pn",
 "title": "AITAH for not signing on blank piece of paper to prove my trust to my husband?",
 "selftext": "My husband and I were arguing about paternity testing after reading lots of reddit stories about it. He said that men should be able to get it without judgement and I said that women should be trusted in a committed relationship.  I told him that if he wants DNA test then we should not have kids.\n\nHe came back to me with a blank page and told me to sign it. I asked him why?? and he told me that he wants it. I told him that I will never sign a blank paper ever. He asked me whether I think that he will use it for bad things or ever harm me. I said no, I dont. Then he told me that I should not worry and sign it and trust him.\n\nThen he said that he will not ask for DNA test because he trust me but I should also show my trust and sign on the blank paper. He said he will not have kids with me unless I do it.\n\nIts stupid, they are not equivalent, no one should sign a blank paper. Thats the first thing we are taught. He just tell me to trust him and sign it, says he needs to know his wife trust him completely before he can have children.\n\nI cant explain my viewpoint properly, he feels he got me. Am I wrong here?????",
 "created_utc": 1701006801,
 "permalink": "/r/AITAH/comments/184b6pn/aitah_for_not_signing_on_blank_piece_of_paper_to/",
 "score": 127,
 "url": "https://www.reddit.com/r/AITAH/comments/184b6pn/aitah_for_not_signing_on_blank_piece_of_paper_to/",
 "comments": [
  {
   "comment_id": "kaugbxy",
   "message": "This relationship sounds like there's absolutely no trust on either side and is already ruined.",
   "created_utc": 1701013728,
   "score": 109,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauhfln",
   "message": "Please don’t have children together. There are obviously issues between you two that need to get worked out.",
   "created_utc": 1701014169,
   "score": 1,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugk2q",
   "message": "The fact that you are arguing over DNA or signing a blank piece of paper is a clear indication that your relationship has trust issues - just the top of the ice berg. Get professional help",
   "created_utc": 1701013818,
   "score": 173,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau4f9n",
   "message": "This guy is not going to change.",
   "created_utc": 1701008584,
   "score": 225,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau1x88",
   "message": "NTA, also, get counseling. The way the discussion spiraled out of control indicates there are issues in your relationship that go beyond the discussion you're having.",
   "created_utc": 1701007363,
   "score": 147,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaucsfm",
   "message": "I think neither of you needs to have children.",
   "created_utc": 1701012274,
   "score": 119,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau9ma5",
   "message": "What happens if you ask him to sign a blank sheet of paper also in return to use as you wish?",
   "created_utc": 1701010912,
   "score": 141,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau9hzt",
   "message": "NTA. That paternity test can be used for only one purpose: to prove or disprove the paternity of that child. \n\nThat blank piece of paper, however, could be used for so many things, i.e., to confess to a crime, to witness or sign a will or other legal document, to allow someone to take full control over finances, etc. \n\nAsk him to do the same and see what happens.",
   "created_utc": 1701010861,
   "score": 126,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaue3c2",
   "message": "You are right to not want to have kids with him, but not for the reasons you think.",
   "created_utc": 1701012812,
   "score": 72,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau40wv",
   "message": "Som basically y’all don’t trust each other",
   "created_utc": 1701008397,
   "score": 84,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau6l6o",
   "message": "[deleted]",
   "created_utc": 1701009574,
   "score": 38,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaud9ey",
   "message": "\u0026gt;no one should sign a blank paper. Thats the first thing we are taught.\n\nSigning a literal blank piece of paper is of no legal consequence. If someone uses your signature to attach to a document without your approval, that's fraud.\n\nWhat we are taught, or at least should be taught, is not to sign any legal document without reading and understanding it. One cannot claim ignorance as to the details of the document as a defense.",
   "created_utc": 1701012473,
   "score": 83,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauaecn",
   "message": "Wow….stop the relationship. Neither of you trust each other",
   "created_utc": 1701011254,
   "score": 28,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauems3",
   "message": "In terms of the number of potential bad things he could do with that, they’re not literally equivalent.\n\nIn terms of an analogy, he’s got a point.  \n\nYou don’t trust him. Not enough to hand over that kind of carte blanche and trust him not to use it against you.  You’re basically saying you think that he might well be the sort of monster that would betray you after all.\n\nYet you expect him to hand over twenty years raising a kid that might not be his.  And you get butthurt that he’s showing you (to prove a point) that he trusts you only as much as you trust him, which is obviously well short of 100%.",
   "created_utc": 1701013032,
   "score": 44,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaudad6",
   "message": "ESH do not reproduce.",
   "created_utc": 1701012484,
   "score": 57,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauvfb8",
   "message": "YTA, while the SPECIFIC circumstances aren't the same, the intent IS the same. You said that a man should trust his partner. Well, whats good for the goose is good for the gander. He showed you the hypocrisy of your position, (The ol' \"I want him to trust me, but I won't trust him in a similar manner,\" shtick, ) and you got called out for said hypocritical viewpoint.",
   "created_utc": 1701019554,
   "score": 16,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauctiw",
   "message": "I mean, if my wife told me to sign a blank piece of paper, done deal. I don't need to know what she needs it for, nor do I care. Of course, we have been married for 22 years and have 3 kids together. I don't think you are an AH, but if you don't trust the man you married.... I mean, c'mon. That isn't really a marriage.",
   "created_utc": 1701012287,
   "score": 59,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulr2y",
   "message": "ESH neither of you trusts the other. He thinks you're cheating and you think he'd use your signature against you. If that's a reoccurring problem, you might want to think about counseling before having a child together",
   "created_utc": 1701015873,
   "score": 10,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauv99l",
   "message": "YTA - he proved his point",
   "created_utc": 1701019491,
   "score": 9,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauuz17",
   "message": "Sounds to me like you’re both stubborn. Personally, if I knew without a doubt the father of a child I was carrying… I’d have no issues doing a dna test. The trust issue isn’t about me- but internal crap on their part. So why wouldn’t I want to make my partner feel secure? As far as signing a blank paper, I get what his intentions are. However I don’t blame you for not signing something random. Sounds like you two are just viewing things differently. I’d say your both the assholes.",
   "created_utc": 1701019383,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauwc5v",
   "message": "Everybody downplaying the tremendous legal and financial responsibility of fatherhood as something that should be entered into lightly in an effort to placate the mother shouldn't be taken seriously.  \n\nDNA tests are common technology at this point.  Not using it the one time in your life you actually need it is wilfully being a Luddite.\n\nIDK if you simply don't care or are gaslighting him about the significance of this technology but either way YTA",
   "created_utc": 1701019902,
   "score": 12,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugoja",
   "message": "If you have trust issues to simply sign a blank piece of paper, why should he trust you about having kids?\n\nYour lack of trust shows that he can't trust you for such a simple task, let alone having a whole damn kid.",
   "created_utc": 1701013867,
   "score": 16,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauefmm",
   "message": "There is nothing this guy can legally do with a blank signed piece of paper. \nHell even at a public church wedding you need to get a witness signature with all the people there that can attest. Sign the paper with a flourish then take a picture of the otherwise blank sheet and post it on your social asking how lovely your autograph is…",
   "created_utc": 1701012950,
   "score": 10,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauelxq",
   "message": "YTA. Nothing wrong with the good ol trust but verify.\n\nI wonder whether he doesn't fully trust you because you don't fully trust him as evidenced by you not wanting to sign the paper.\n\n\"women should be trusted in a committed relationship\" gets handed a piece of paper to sign... Nahhh.\n\nI guess it only works one way.",
   "created_utc": 1701013022,
   "score": 28,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau8ucu",
   "message": "Being asked to be on a birth certificate of child is very different to being asked to sign a blank piece of paper!\n\nIn the case of the birth certificate, the husband knows exactly what he is signing.  Asking someone to sign a blank piece of paper is unreasonable! The husband could use that signature for nefarious purposes, such as signing for a loan, emptying a bank account etc.",
   "created_utc": 1701010576,
   "score": 74,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauw1yv",
   "message": "I think your husband is making a very good point. You are not the AH for not signing the paper, but YTA for 1) being so resistant to a paternity test and 2) not seeing the close equivalency between what you are offering him (\"trust me husband\") and what he is offering you (\"trust me wife\").  \n  \nI wish people were less up-in-arms about men wanting to have the safeguard of a paternity test. It isn't about him not trusting you. It's the fact that there are people in the world to will cheat and lie convincingly. Even if you have given him no reason to doubt your fidelity, that doesn't mean he can have 100% confidence in your fidelity.  But a paternity test can give him that reassurance. Why are you so steadfastly opposed to reassuring your husband?",
   "created_utc": 1701019795,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kav18pg",
   "message": "ESH. Just get the divorce and get therapy.",
   "created_utc": 1701021737,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauvyhn",
   "message": "YTA for not seeing that you're proving his point lmao.",
   "created_utc": 1701019757,
   "score": 13,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaubv20",
   "message": "I get his point. Why don’t you just blindly trust him?",
   "created_utc": 1701011884,
   "score": 34,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugq65",
   "message": "He proved his point. You don’t trust him blindly. “Just trust me” applies both ways. It’s a modern day delusion where women are all trustworthy angels because we all know that ain’t true. How many stories of dudes finding out their kids ain’t their kid 18 years down the line and killing themselves do we have to get before we start just mandating tests. Obviously you don’t care about equality but your fee fees got hurt by logical decision making.",
   "created_utc": 1701013886,
   "score": 38,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaublcd",
   "message": "You both have trust issues but he does have a right to DNA testing. The fact you are refusing it would make any husband feel shitty.",
   "created_utc": 1701011769,
   "score": 30,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauloew",
   "message": "WTF is this blank piece of paper contractual agreement, is this some aort of redditism??\nIm having trouble understanding this\n\nEdit: Fuck all that paperwork",
   "created_utc": 1701015843,
   "score": 6,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulz0q",
   "message": "He did get you. Accepting one but not the other is indeed hypocritical.",
   "created_utc": 1701015957,
   "score": 7,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauus1z",
   "message": "Ehhh.. he has a valid point. I do commend him for trying to come up with an equivalent test.  While most say he failed, I think it's fair. If there's possibility it isn't his child, it is much like the blank paper- going on the many comments I read suggesting that you know what you're getting with signing a BC. If it us his child, yeah that can be a valid point. If it is not his kid, he has no idea what he is signing up for. Bio dad wanting to be involved. Possibly family members from bio dad wanting to be involved. Health issues from bio dad, and /or that side of the family. Sharing the child with that family. Facing the reality of being this child's step dad. The obvious infidelity of the wife. The effects on the marriage. You're committing your entire life. He has every right to be anxious about it. Did the wife cheat ever? Is he scared? Either way, I think it's unfair that men are just expected to sign a lifelong contract bc women say so. It's hard to say without the guys side. He may have suspicions. Would any women sign that type of contract, if the shoe was on the other foot, without the test, if you had doubts? I doubt it. But men are expecting to. \nI'm sure this will be an unpopular opinion, but it's mine. For the record, i am a woman.",
   "created_utc": 1701019310,
   "score": 6,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaun8hg",
   "message": "YTA. I've seen this argument so many times. Women on reddit think that a man requesting a paternity test is an accusation of cheating. It is not. It is an acknowledgment that, even if a man doesn't believe his SO is cheating, sometimes she actually is. That's a fact whether the women of reddit want to accept it or not.\n\nI propose a very simple solution, which I use in real life and always will. Men must signal early on in the relationship that they will get a DNA test for their children, and if the woman doesn't like it, the relationship is over. I'm fine with this. If all humans stop procreating because women refuse to admit that some women *do* cheat, and it makes sense for a man to protect himself against those types of women, so be it.",
   "created_utc": 1701016445,
   "score": 8,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaucdsb",
   "message": "YTA. He has every right to ask for a paternity test and you're refusal to have kids over it is a huge red flag. Unlike you he doesn't get to know 100 percent if he's the father and your refusal to give him that reassurance is a stupid reason to fight and not have kids if you both want them . You're a walking red flag and your refusal to have one should make him want one even more. There's nothing wrong with him getting a paternity test and you're insistence to just trust you is weird and super controlling. You're over reacting way too much . There's so many men who end up paying child support or being responsible for kids that aren't theirs and even if you haven't cheated he has a right to know for sure. This \" you should just trust me \" is a great Segway into a guy being stuck responsible for a Child that isnt Theirs. This is wrong on so many levels.",
   "created_utc": 1701012103,
   "score": 21,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau2p6g",
   "message": "NTA but he’s also proving his point (in a very shitty way though I might add). He’s proving that signing a birth certificate whilst not knowing if they are the father of the child is like signing something without knowing its use. Basically you’ve proven you don’t trust him with your signature but expect him to unconditionally trust you in regards to signing a birth certificate.\n\nNo one can honestly unconditionally trust everyone, in fact the world would be a better place if we could but it’s a fact people lie and do crappy things, everyone needs to cover themselves just as you won’t sign the paper in case he prints something that can be used to harm you financially/mentally/socially etc.",
   "created_utc": 1701007746,
   "score": 71,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugtb6",
   "message": "Wow red flag on  a hill for everyone to see",
   "created_utc": 1701013921,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugml0",
   "message": "If y’all are married, depending on your state laws, a paternity test doesn’t amount for much if the child was born in wedlock.\n\nI think the conversation was about something else. Y’all fight dirty…and have some very serious issues to work out. In my experience, these kinds of issues don’t work out. Any person/couple that I’ve ever seen or heard of that fights like y’all always had a component of abuse. Mental, emotional, social, financial, physical… any combo of them. It might not be apparent now but I’d reflect on that bc that was Not a clean fight.",
   "created_utc": 1701013846,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauptf5",
   "message": "Paternity tests should be mandatory before a man's name is placed on a birth certificate unless he signs a waiver.  Basic legal protection - it's not about trust. It's about basic legal protection.",
   "created_utc": 1701017427,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaurlhq",
   "message": "Please don't have kids together.",
   "created_utc": 1701018102,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauts0r",
   "message": "Y’all are toxic. Please don’t have kids",
   "created_utc": 1701018929,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauuwag",
   "message": "ESH, neither of you trust the other, please never have children together",
   "created_utc": 1701019354,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauwfo6",
   "message": "You both should not be having children together.",
   "created_utc": 1701019938,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauwxsd",
   "message": "And.. let him get paternity tests.  Who cares. Frame it and put it on the nursery wall.",
   "created_utc": 1701020128,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauxbxr",
   "message": "OP - I would never sign a blank piece of paper no matter who asked me, family, whatever.\n\nSimply put, the very act of asking is already highly suspicious.",
   "created_utc": 1701020275,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauznyg",
   "message": "NTA you aren’t compatible. He’s nothing but 🚩🚩🚩🚩🚩🚩🚩🚩🚩",
   "created_utc": 1701021146,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kav0mcl",
   "message": " You both have absolutely no trust for eachother, absolutely trainwreck, whats the point of this",
   "created_utc": 1701021504,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kav0se4",
   "message": "My grandfather did this to my mother when my grandmother died. In the throes of grief, and trusting her father, she signed.  He used it to empty the bank accounts that should have gone to her and her brother. NTA but there is a huge red flag waving in the breeze here.",
   "created_utc": 1701021568,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kav16mm",
   "message": "This relationship sounds exhausting.",
   "created_utc": 1701021715,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kav1dfp",
   "message": "Absolutely not. Noone should be singing blank pieces of paper, it could be used for absolutely anything.",
   "created_utc": 1701021785,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kav34we",
   "message": "Just tell him you can't sign it because it's missing all of the divorce settlement text, but you will once the lawyers have filled that part in and are there to witness it.",
   "created_utc": 1701022428,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaub667",
   "message": "Reddit has me thinking that paternity tests should be mandatory.",
   "created_utc": 1701011588,
   "score": 28,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauceox",
   "message": "Don't like turned tables, huh?",
   "created_utc": 1701012113,
   "score": 15,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaub5tb",
   "message": "Why would you be concerned about getting a DNA test? 🤔 \n\nIt's a matter of practicality not trust, every birth should be accompanied by a mandatory DNA test.",
   "created_utc": 1701011583,
   "score": 19,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaucfz3",
   "message": "Paternity DNA tests should be mandatory",
   "created_utc": 1701012129,
   "score": 28,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaug3ky",
   "message": "Trust goes both ways OP. Aren’t you in a committed relationship? Isn’t his word good enough? You guys need counseling and might not be compatible. Please don’t have kids before you fix your issues.. leaning towards ESH but without more info I’m gonna go YTA.",
   "created_utc": 1701013633,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulcgv",
   "message": "it's fact that many men raise kids that come from their wife's affair and don't know about it. It's an injustice that the biological father isn't financially responsible for the child.",
   "created_utc": 1701015714,
   "score": 6,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulg7e",
   "message": "These are equivalent in a relationship with zero trust. \n\nWhy does he think you’re being unfaithful? Or why does he think you will be?  If it’s a 100% him thing with zero history - you need to run away before you have children and are connected forever.\n\nEdit. Need more info.  But regardless why be with someone that doesn’t trust you?\n\nEdit 2. OP is either trolling, or the husband. “Her” replies make that pretty clear.",
   "created_utc": 1701015755,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulwza",
   "message": "There’s no way two adults did this. Yall both sound like buffoons",
   "created_utc": 1701015936,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauo5mz",
   "message": "Yes YATAH, your husband masterfully checkmated you on this topic and you’re running to the feminist simps on Reddit for validation because you refuse to admit he’s right even.",
   "created_utc": 1701016791,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaurf38",
   "message": "YTA.\n\nYou can always make claims for non-equivalency about anything and everything, but it's you who argued that partners \"should be trusted in a committed relationship\". And then you proceeded to show that your sentence isn't absolute, that you don't trust him with a signature on a blank piece of paper.\n\nIf you can't explain your viewpoint properly, it might be that you are just wrong with your viewpoint.\n\nYou should have either signed the paper or agreed that there's limits to prudent trust even among committed partners.",
   "created_utc": 1701018034,
   "score": 6,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauvp84",
   "message": "Paternity tests should be mandated by government.\n\nHow do you even know the baby is yours miss mom? Hospitals fuck up and give the wrong babies to couples decently often. I mean it's semi rare but it happens multiple times a year. A test needs to be done, whether it's maternity or paternity shortly after you get home from the hospital. And if you are already testing, might as well go with the man's since if its his it has to be hers but if it's hers it might not be his.",
   "created_utc": 1701019659,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugk2i",
   "message": "Yta. If you don't trust him with your signature why should he trust you with the next 18 years of his life. Paternity tests should be required.",
   "created_utc": 1701013818,
   "score": 16,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugawa",
   "message": "Either both Ata or nothing are nta.\n\nYou are both asking for trust. You say it's different but the heart behind it is EXACTLY the same. In your circumstance, the true ahole is the one who 'uses' this trust insurance first because it is the sign that you have distrusted the other first.\n\nIf you don't want to sign the paper due to principle (cuz its the first thing you were taught) then give the consent to a paternity test. You can't eat your cake and have it too. Wanting it is what is skewing you towards being TAH.",
   "created_utc": 1701013715,
   "score": 9,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulkv3",
   "message": "YTA or at least wrong. His response isn't relevant. Every man should be able to ask for a DNA test without judgment. It should be SOP in hospitals in my opinion, take the awkwardness away from couples.",
   "created_utc": 1701015805,
   "score": 10,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauc5iq",
   "message": "YTA\n\nHe absolutely proved his point about trust.",
   "created_utc": 1701012008,
   "score": 14,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugogc",
   "message": "If u can't sign why should he sign. \n\nIt's reddit, so probably time to divorce?",
   "created_utc": 1701013866,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauc9vm",
   "message": "YTA.   \nYou know perfectly well that even closest people can do bad things, hence why you don't trust your husband with a blank paper with your signature, but at the same time you claim that \"**women** should be trusted in a committed relationship\". Typical double standards.",
   "created_utc": 1701012057,
   "score": 20,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau3j7h",
   "message": "He got you.  You don't unconditionally trust him, any more than he unconditionally trusts you.  I would totally sign a blank piece of paper my husband handed me. Because my husband is 100 percent trustworthy.  If I didn't trust him, I wouldn't be married to him.\n\nYou don't trust your husband. He proved it.",
   "created_utc": 1701008156,
   "score": 54,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaukcd8",
   "message": "I feel like everyone here overestimates the number of kids born from cheating and the number of men lied to about it. I wouldn’t sign the paper because I’d know it’s a dumb point they’re trying to get across, not because of trust. If you can’t trust your partner enough for you to believe that the kid they’re having is yours, then don’t have a goddamn kid with them. NTA",
   "created_utc": 1701015315,
   "score": 8,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauguzo",
   "message": "The blank paper is weird.\n\nHowever, that said. I think paternity testing should be mandatory. \n\nAs a man, I get that trust is important in a relationship. However, one of the worst things I'm sure a man could feel is to not be the father when you spent time and money raising a kid forming that bond and then finding out it wasn't yours. That for however many years you operated on a lie.\n\nThis doesn't EVER happen to women. They are always the mother doesnt matter who the father is and have that special bond with their babies. \n\nHow he approached it is unreasonable, but I think that that peace of mind is priceless. Everyone wants to feel that secure in their relationship. People say to just trust, \n\nEveryone preaches about looking out for yourself, making sure your relationships are healthy, leaving if things are toxic etc. This is in that same boat.\n\nFor example, asking for child support should come with immediate paternity testing. For some reason, it's not. I say this as a child of a single mother as well.",
   "created_utc": 1701013940,
   "score": 12,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugzl9",
   "message": "YTA. Honestly don’t understand what the problem is having a paternity test done. If it alleviates his anxiety and concerns, and YOU have nothing to hide, why is it a big deal? Your husband may have made his point in a crude way, but he is 100% right. You expect him to blindly trust YOU but won’t return the favor? Put your pride aside.",
   "created_utc": 1701013990,
   "score": 8,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau8hl0",
   "message": "Shit I have to go ESH or NAH\n\nYour husband proved his point (while being an ass).  You are stating you don't trust him (without any good cause) for something that can be used against you.  It's the same as the birth certificate.  The guy never truly knows (with a test) that the child is his and is putting blind faith (aka the blank piece of paper) that it is and is fully trusting of his wife.  It's essentially the same ask he's doing to you.\n\n\nDon't get me wrong he went about it a bad way but his point is still valid",
   "created_utc": 1701010423,
   "score": 16,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau6ewd",
   "message": "nah\n\ndna testing should be mandatory upon birth, it should in there with the blood /glucose /disease checks they do.\n\nI think you both are too childish to have kids if you both are going to dig your heels in over a non argument.",
   "created_utc": 1701009493,
   "score": 12,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau7q59",
   "message": "Your husband is worried. Yes he is being an AH about it. But I don't see how giving him the option of a DNA test bothers you. If you ever divorce he is going to get it before you get any child support anyways. It's like a prenuptial, yeah asking for it is kind of being an AH and planning for the relationship to fail. In the end it at least makes one of you feel safer, and allows them to move forward without so many worries. Yes you should be trusted. However when that trust is questioned, if you fight back it seems like you are hiding something rather than merely defending yourself. \n\nCheating seems to be very common in the world. I don't see why you wouldn't want him to have piece of mind. It doesn't hurt anything other than your pride. And allowing it will let him know that you have no intention of cheating. Seems like a good trade to me.",
   "created_utc": 1701010085,
   "score": 14,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaueqt1",
   "message": "This relationship isn’t going to work. He does not trust you. If you trusted him before? This sketch behavior should have you thinking about your trust in him. \n\nBut he’ll to the no! No one should be signing a blank piece of paper ever!!! For anything!",
   "created_utc": 1701013077,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauerbn",
   "message": "YTA, let him have the DNA test wtf",
   "created_utc": 1701013083,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaukbei",
   "message": "Ok so when I was buying a house with my ex, we both signed a blank piece of paper, scanned it into my computer so I could use the Adobe \"sign\" feature with our actual signatures. This way, we didn't have to print every document and sign it and then re-scan it in\n\nI never signed a document with his signature without his consent, BUT I could have. There was literally nothing stopping me from using his signature for whatever I wanted, except for me not being that type of person.\n\nThis dude is 100% going to scan your signature and use it to get a paternity test behind your back.",
   "created_utc": 1701015305,
   "score": 5,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaul9ks",
   "message": "I wouldn't sign that, even if my own mother gave it to me.  NTA.",
   "created_utc": 1701015682,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauufa2",
   "message": "YTA. It’s a very reasonable request of a man to have a paternity test. If you’ve done nothing wrong then you’ve got nothing to hide. The numbers tell the story a statistically significant number of births are not to the birth certificate father.",
   "created_utc": 1701019178,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauulsc",
   "message": "This will probably be  buried and it's only kinda relevant anyway.  Part of being in a relationship is reassuring one another. Every relationship I've seen or been a part of has that. For example my current one, we trust each other but also ask each other to double check things just to put our minds at ease. Or check  ourselves. Honey did you roll up the car window, is the stove off, did we check that the door is locked etc. If a DNA test would give him piece of mind I'd get it done for him because I love him and want him to have a peaceful mind. Who knows we might learn that the hospital swapped the baby lol.",
   "created_utc": 1701019246,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauuqwp",
   "message": "You know that thing women do when they first go about with a guy and they ask something along the lines of \"you're not a serial killer are you?\" \"you're not gonna kidnap and kill me are you?\" and you laugh and play it off and try not feel insulted and stereotyped inside and make her feel comfortable because she's just looking out for herself and you understand that it's just something girls have to do? \n\nPaternity tests and all questions regarding it are the male equivalent. Yes I know you're not gonna cheat, but the fact is some women do. Just like no, I'm not a serial killer but facts is facts, some guys are.\n\nObviously getting killed and getting cheated on are different degrees of heinousness, I understand that.",
   "created_utc": 1701019298,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauur77",
   "message": "YTA. Trust is important but there's trust and then there's blind trust. A woman with nothing to hide shouldn't have an issue, just part of the process. There are too many stories of women passing off affair babies as their partner's and this provides a sense of security while reinforcing that his trust is not misplaced. More importantly, he's being upfront about it. Honest even. Once the baby is born, he can just do it behind your back. So be offended and you force people to do things secretly. And trust falls apart.",
   "created_utc": 1701019301,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauw1eo",
   "message": "1. I didn't get a DNA test for either of my kids because I know my wife wasn't cheating and I'm not a paranoid bastard.\n2. However, what's the harm in getting it?  A non-zero number of men end up raising kids that aren't biologically theirs.  The estimate is around 10%.  \n3. So if the husband is otherwise reasonable, why not humor him?",
   "created_utc": 1701019789,
   "score": 4,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau9x26",
   "message": "Mamas baby daddy's maybe...trust but verify. I agree with your husband and I am a woman with five kids.  Men don't have the privilege of knowing 100 percent and if that test gives them peace then let's go. No skin off my back. YTA",
   "created_utc": 1701011045,
   "score": 8,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaua2dr",
   "message": "YTA lol. first of all, paternity test should be the norm. and lol. he totally owned you on this one.",
   "created_utc": 1701011111,
   "score": 9,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaudq6s",
   "message": "*I said that women should be trusted in a committed relationship.* \n\nWhy?\n\nAre you incapable of lying?\n\nThe analogy he's using with your signature is flawed however the concept is reasonable. Women often lie about paternity, that's well known. If you refuse to agree to a paternity test a reasonable person would take that as an admission of infidelity.",
   "created_utc": 1701012663,
   "score": 3,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauo5r0",
   "message": "It's so equivalent. Just trust me is the same thing as no DNA test. \n\nYou're right you never sign blank paper and paternity tests should be used at every birth.\n\nI'm not sure why you would ever be defensive about this. Seems like common sense",
   "created_utc": 1701016793,
   "score": 6,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugnex",
   "message": "\u0026gt; I told him that if he wants DNA test then we should not have kids.\n\nI mean, if you're so sure the kids will be his, why not just get the DNA test? Weird hill for you to die on.",
   "created_utc": 1701013855,
   "score": 10,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau5d7x",
   "message": "Yta. Paternity tests should be completed upon birth. Removes both the insecurity and trust issue with a easy solution. If you still disagree, I'd go all in on you being a cheater and/or not being a compromising person.",
   "created_utc": 1701009018,
   "score": 10,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kau7obw",
   "message": "I’ll preface this by saying that I found out the man I thought was my father for my whole life turned out to not be when I took an ancestry test so I understand where he’s coming from. There’s a ton of us finding out our fathers aren’t are fathers due to the ease of getting dna tests now. With that in mind, he’s a moron. He could swab your kids mouth and test its dna as soon as it’s born and you would never even know, if the test came back with him as the father. He’s dying on a hill he doesn’t need to die on. As far as you, yta. I would sign anything my wife tells me to sign. That’s literally how I live my life. My wife has me sign stuff all the time and I read absolutely none of it unless she specifically tells me to read it. I don’t care what it is. She could put a blank piece of paper in front of me or 400 pages written in Chinese and I would absolutely sign it and hope there was nothing I had to read.",
   "created_utc": 1701010062,
   "score": 12,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauh7i8",
   "message": "ESH. Asking you to sign a blank piece of paper is unreasonable. In my opinion, signing a birth certificate without proof is also unreasonable.",
   "created_utc": 1701014078,
   "score": 14,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaucuqx",
   "message": "In a way you both are and are not.",
   "created_utc": 1701012301,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kauemu6",
   "message": "\u0026gt;He said that men should be able to get it without judgement and I said that women should be trusted in a committed relationship.\n\nThis is why paternity tests at birth should be legally required. Avoids arguments like this.",
   "created_utc": 1701013032,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaugc5g",
   "message": "I think it should just be standard test for babies. Not even asked for. But I wouldn't sign a blank form",
   "created_utc": 1701013730,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaulsw0",
   "message": "He doesn't want nor care about this signed blank piece of paper. He was just trying to prove his point. Which he did. You don't trust him blindly, why should he?",
   "created_utc": 1701015892,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaum9dd",
   "message": "I forgot to judge. NTA of course. I think you should just offer him that you should adopt instead. That way it's beyond any doubt that cheating has happened, and you don't even need a test.",
   "created_utc": 1701016069,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaumb9z",
   "message": "He's making a point to you that you don't like.\n\nIt has some validity. But the correct answer isn't you signing. It's him getting the test results.",
   "created_utc": 1701016090,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaumqyn",
   "message": "I don’t understand some women’s hangups about paternity test. IMO it should be standard at birth. What’s the big deal if you have nothing to hide. \n\nNow, if you don’t want to sign a blank piece of paper, don’t sign it but don’t pretend like the mistrust is one sided. You don’t trust him as much as he doesn’t trust you. Except in the case of the paternity test there’s a kid’s life also potentially affected.",
   "created_utc": 1701016259,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaumsyt",
   "message": "If you ain’t cheating why do you care about a DNA test.",
   "created_utc": 1701016281,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaumwxm",
   "message": "ESH. He got you with the paper thing, but the truth is that you two just don't trust each other and shouldn't be having a kid.",
   "created_utc": 1701016324,
   "score": 2,
   "submission_id": "184b6pn"
  },
  {
   "comment_id": "kaunf47",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "184b6pn"
  }
 ]
}