{
 "submission_id": "184bor3",
 "title": "AITAH for catching my spouse with a dash cam",
 "selftext": "AITA For Catching My Spouse Cheating With the Dash Cam?\n\nMy spouse and I have been together for over a decade and have had our fair share of ups and downs through that period. My spouse (30s f ) has had multiple emotional affairs behind my back, and each time I’ve only found out by snooping. On one hand I get that the ends can’t justify the means. On the other prior to doing that each time I’ve asked the right questions and have gotten lies in response. \n\nMy spouse was supposed to be out at a work function, but was acting strangely. Over communicating through text , memes etc. it just wasn’t feeling right. I was aware of a coworker that she was interested in, we had ventured into trying poly as a result of all of the other events that have happened over the years. We discussed this person in particular and he was on the no fly list. \n\nSuddenly she stops texting and it’s approaching 11 pm, I look at the car app and see it’s parked in a random lot not near where the function was to be at. I then turn on the cameras to the car and see my spouse with the guy I suspected in the car. Let’s say they weren’t talking about work. \n\nI send her a SS and obviously a big fight happens when she gets home. I’m being treated like I’m the asshole, with her going so far as to say she’s disgusted by my gross invasion of her privacy. I’m of the opinion that these two breaches of trust, as not in the same ballpark as one another and I’m being actively being gaslit.\n\n The concept of I can’t be caught if I’m in situations where snooping and provide proof after trying to confront through conversation is asinine. How is this different than seeing your spouse being someone home on your ring and you decide to go home and walk in on them? \n\nI’m not a saint here. I totally own that. I’m having a hard time though shouldering any real feelings that I’m the asshole here. So am I?",
 "created_utc": 1701008325,
 "permalink": "/r/AITAH/comments/184bor3/aitah_for_catching_my_spouse_with_a_dash_cam/",
 "score": 243,
 "url": "https://www.reddit.com/r/AITAH/comments/184bor3/aitah_for_catching_my_spouse_with_a_dash_cam/",
 "comments": []
}