{
 "submission_id": "184djhn",
 "title": "AITAH for not paying for the other couple on a double date?",
 "selftext": "Me and my husband are recently married, and at the wedding I talked to one of my friends and his girlfriend about going out on a double date soon. I texted him later on wishing him a happy Thanksgiving and asked if he would still like to double with me and my husband. We settled on a date then he asked where we should go for dinner. I made a suggestion for a place that was fairly priced, but a little out of the way. But I also said I would be fine going somewhere closer to them. He made a different suggestion to a more expensive restaurant closer to where they lived. It wasn't a big deal to me or my husband so we agreed. \nWhen the waitress came over to ask if the checks were together or separate my friend and his girlfriend were a little quiet. My husband gestured to me and himself and told her we were on one check and my friend was on the other. My friend then looked at his girlfriend and made a face I can't describe. \nAfter we paid our separate checks my friend said how he \"was glad he didn't spend all his money so he could afford coming here\" and \"how it was more expensive than he thought it would be\". His check ended up being more expensive because he was ordering alcoholic drinks and no one else was drinking. \nAITA for not paying for another couple's meal on a double date just because i asked if they would go?",
 "created_utc": 1701013655,
 "permalink": "/r/AITAH/comments/184djhn/aitah_for_not_paying_for_the_other_couple_on_a/",
 "score": 97,
 "url": "https://www.reddit.com/r/AITAH/comments/184djhn/aitah_for_not_paying_for_the_other_couple_on_a/",
 "comments": [
  {
   "comment_id": "kaugrk7",
   "message": "NTA. That is not a normal expectation.",
   "created_utc": 1701013901,
   "score": 108,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauh4f8",
   "message": "NTA. I absolutely never assume someone else will pay for me and my husband. You can always tell him I’m sorry I wasn’t aware you were expecting us to pay for you and your date however, in the future separate checks should be expected, unless otherwise stated",
   "created_utc": 1701014044,
   "score": 102,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaujbhx",
   "message": "nta...hahahahabubububuahahaha Whaatt??!??!? really?\n\nbe \\*wary\\* of invitations from them/with them in the future! that's odd behavior and I would be worried about what last minute social etiquette rule change they would rope you into.\n\nlike, inviting you all out to a movie, but giving you a bill to pay for the new outfits they bought. Or inviting you to their house for dinner, and them getting mad that YOU didn't supply the food to their function.\n\npeople are nutty and really do live in their own little bubbles don't they?!\n\neta: fixed Wary but none of you told me I had spelled behavior wrong too :P",
   "created_utc": 1701014916,
   "score": 14,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauqclq",
   "message": "NTA. He thought you were paying hence why he chose a more expensive place and drank all that alcohol. It backfired on him haha.  It's normal to go out with another couple and split the check.",
   "created_utc": 1701017628,
   "score": 103,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauo8qw",
   "message": "NTA.  Holy entitlement, Batman!\n\nNot only do they suggest a more expensive restaurant that is more convenient for them, but they also have the insane gall (yea, it’s insane…) to assume that you guys will pay for their expensive meal and drinks.\n\nI’ve been on this planet for 40 years, have been on dozens of double dates, and never once was this a thought or assumption from anyone. Ever.\n\nPrepare to not hang out with these people ever again.",
   "created_utc": 1701016824,
   "score": 63,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaulnmc",
   "message": "“I want to take u out to dinner” vs “do u want to go out to dinner” are very different.  Other dude is the AH if he assumed u were gonna pay, no matter the restaurant.",
   "created_utc": 1701015835,
   "score": 147,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaupkd7",
   "message": "Did they think you all were swingers and were going to wine and dine them? LOL",
   "created_utc": 1701017332,
   "score": 40,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauiscn",
   "message": "NTA. There’s no expectation that by asking another couple out to dinner, you’d be paying for their meal (and drinks!). You aren’t dating THEM; that’s not what a double date is and I don’t understand the source of these people’s confusion. \n\nAnd if he thought you were paying from the start, it’s even weirder that he chose an expensive restaurant and that he was ordering alcohol when no one else was drinking. It’s just rude behavior all around. \n\nDid you have any evidence beforehand that this couple, this friend in particular, has bad manners? \n\nIt’s odd for it to come out of nowhere. But that said, I recall an acquaintance once suggesting lunch, then on the day, steering us to a pricier restaurant. When the bill arrived, he simply stared at it without moving, wearing a slightly stupid smile. Irritated me to no end.",
   "created_utc": 1701014711,
   "score": 61,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaujdbh",
   "message": "NTA\n\nhere is a situation where you can apply the principle of symmetry.   Why wouldn't they pay for you?  Why would you pay for them?",
   "created_utc": 1701014935,
   "score": 22,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauvvt3",
   "message": "NTA he suggested the more expensive place, got drinks and then got pissy that he had to pay for what he and his gf ate and drank. Wtf kind of bs is that? I am assuming he googled the place before suggesting it and could see the menu and prices online. If not, lesson learned for that guy. Idiot.",
   "created_utc": 1701019729,
   "score": 16,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauq3y7",
   "message": "NTA. A suggestion for a double date is not an invitation to be taken to dinner.  It is just two couples going out together.\n\nThe other couple now, they just could be the dreaded AHs because, not only did they expect you to pay for their dinner, he was only one with drinks, and they suggested this particular restaurant that was both more expensive and more convenient for them.",
   "created_utc": 1701017537,
   "score": 15,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kausgxe",
   "message": "NTA. PEOPLE LISTEN!!\n\nUnless you are specifically told that someone else is paying for the privilege of being in your presence, expect to pay your own damn bill. IF someone ends up paying for you, it's a blessing, not an obligation. You then invite them to a dinner and pay for them.\n\nThe telling part of this is that the slimeballs picked a more expensive restaurant because they thought they were eating for free!! Karma is indeed a bitch! 👏 👏 👏",
   "created_utc": 1701018430,
   "score": 14,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauorh1",
   "message": "Gosh I’ve been on well over 100 double dates and this was never expected with anyone in any friend group ever. Strange.",
   "created_utc": 1701017024,
   "score": 12,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauq1k5",
   "message": "NTA.  Especially since THEY suggested a different restaurant than the one YOU mentioned first.",
   "created_utc": 1701017512,
   "score": 13,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauno1a",
   "message": "Why does this have to be asked? In no universe is this expected? 😶",
   "created_utc": 1701016605,
   "score": 11,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavap54",
   "message": "\"because I asked if they would go.\" \n\nHe's treating it as you inviting him to lunch, but a double date is, well a date and a different situation all around. Why would you pay for another grown couple that is in charge of their own finances (especially when he picked a more expensive place, and bought a bunch of alcohol), to go on a date together? You're not dating them, and they're not your kids. If you were inviting them to lunch, YOU would pick the restaurant, and likely the menu too. He purposely tried to get a more expensive meal and a bunch of free drinks on your tab. NTA.\n\n\"I'm glad I didn't spend all my money so I could afford coming here, it's more expensive than I thought it would be\" is a manipulative sentence meant to make you feel guilty and offer to pay for them. After growing up with a manipulative parent, it irks me when people pull that crap, and petty me would be tempted to reply:\n\n\"Oh, dang, I'm sorry to hear that. I thought since you picked the restaurant that you were aware of the prices beforehand and were prepared for your bill. I also don't mean to push you into double dating if money is tight, so if you guys want to hold off in the future until your finances have settled a bit, we completely understand. Just let us know.\"\n\nThis makes it clear that in the future, they will be expected to cover their own bills.",
   "created_utc": 1701025152,
   "score": 8,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauw8f5",
   "message": "NTA.\n\nAnd as far as the \"friend\" goes...this is dropworthy behavior.",
   "created_utc": 1701019863,
   "score": 7,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav4jtw",
   "message": "He suggested the restaurant, he knew what he was ordering. He was just planning on being a mooch.  YNTA",
   "created_utc": 1701022939,
   "score": 7,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauledr",
   "message": "NTA. That is not a thing. Splitting 50/50 I’ve seen. I hate it myself. But expecting to get a free meal especially when they picked the pricy place?",
   "created_utc": 1701015735,
   "score": 6,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauuq3y",
   "message": " NTA but you did put an immediate stop to what could have become an ongoing mooching situation. \n\nWe regularly eat out with friends and unless one of us says otherwise we always do separate checks for each couple. \n\nThis friend of yours knew what he was doing when he requested the more expensive restaurant. \n\nIn the future if you want to make it clear before meeting up with other couples just state each couple will pay for themselves.  People who want to spend time with you will happily go anyway though please consider offering a couple restaurant choices of different cost levels as we never really know another’s situation.",
   "created_utc": 1701019289,
   "score": 11,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaukxux",
   "message": "NTA, you clearly asked for a double date and let them decide on location. There is no reason why they should expect you to pay for them.",
   "created_utc": 1701015554,
   "score": 5,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauqiua",
   "message": "NTA not normal to expect in double date to pay the other couples food AND you suggested fairly priced restaurant....they suggested expensive place so they chose this place and expected you to foot bill....nope...",
   "created_utc": 1701017694,
   "score": 6,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kausf1d",
   "message": "NTA\n\nHe thought he was getting a free high end meal. 🤣🤣 that’s not a friend. Be very careful if you choose to go out together in the future.",
   "created_utc": 1701018411,
   "score": 5,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauwg7d",
   "message": "A double date does not imply that you are going to pay for their dinner.  that is not what A double date means. NTA",
   "created_utc": 1701019943,
   "score": 6,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauoq7f",
   "message": "NTA.  The audacity for them to think they don’t have to pay for themselves.",
   "created_utc": 1701017011,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaup1dy",
   "message": "NTA. I would never assume a friend suggesting a double date at a restaurant would be paying for me and my date. Your friend is obviously extremely entitled or they feel they're entitled to your money at least.",
   "created_utc": 1701017131,
   "score": 5,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauupu6",
   "message": "Nta. If you specifically invited them and indicated it was your treat that would be one thing but a double date is 2 couples going out together but each responsible for their own expenses.",
   "created_utc": 1701019287,
   "score": 5,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavda6w",
   "message": "NTA. Eww, the other couple is cringy.",
   "created_utc": 1701026085,
   "score": 4,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavnrpe",
   "message": "NTA these people are very tacky, he obviously only ordered the booze because he thought you were paying but why would he? I have a thing where if it’s someone’s birthday or something I might say I’ll treat you to lunch/dinner whatever but if I just say do you want to go for lunch/dinner then I would expect to get separate checks. I once went for a group meal when I was very young, I didn’t drink and shared a pizza with another girl because I knew I had very limited money, everyone else was drinking ordering multiple courses etc and then we were told the bill would be split evenly between us all, oh hell no! I worked out what I owed and I gave them that, I told them I wasn’t paying three times that amount. I learnt my lesson, I now ask at the start can you do separate bills please, is it easier for you if I do that now? To the waiter, job done everyone knows where they stand.",
   "created_utc": 1701029877,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauv5fe",
   "message": "Always separate checks. NTA",
   "created_utc": 1701019450,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav08oy",
   "message": "NTA it’s clear they chose a more expensive place for you to foot the bill. Consider that the last double date you go on with them",
   "created_utc": 1701021363,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav106o",
   "message": "NTA. It’s not the same thing as asking someone on a date! Nobody said “It’s our treat” to him. That guy is the asshole because he, having the expectation all along that you guys would pay for him and his girlfriend, intentionally changed the venue to an expensive place and then ordered drinks when nobody else was drinking. He was trying to take advantage of you and now he’s pissed he didn’t get away with it.",
   "created_utc": 1701021649,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav3cp9",
   "message": "You didn’t say “we’d like to take you and gf out for dinner”- you asked if they’d like to go on a double date. Not even remotely the same thing.\n\nNTA.",
   "created_utc": 1701022508,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav4ljs",
   "message": "NTA- A double date does not mean you pay for the other couple! That’s not what that means. I don’t know where they even got that expectation! And even if they did, him drinking a bunch of alcoholic drinks, knowing that those were expensive is pretty shitty. Especially when nobody else was drinking, and he knew damn well they were yet apparently expected you to pay for it. You might need better friends.",
   "created_utc": 1701022955,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav4mng",
   "message": "Goodness! How your friend ever got the idea that when couples go to a restaurant together that the person who initiated the outing is obliged to pay utterly eludes me. \n\nYou are not an AH.",
   "created_utc": 1701022966,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav57pd",
   "message": "Your friend is TA or ITA or is the asshole or however it's worded.\n\nHaving that expectation is bad enough, but to comment after the fact is where the asshole marker gets verified. Especially after picking the venue and ordering drinks. Dude assumed he won a free all expenses paid night out. In 2023? No way.",
   "created_utc": 1701023174,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav8kgx",
   "message": "Why is this even a question? You pay for yourself unless somebody says don't worry about it I'm paying for everyone. If you never offered that then he should have came prepared to pay for him and his girlfriend.",
   "created_utc": 1701024379,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav8sut",
   "message": "The other couple suggested the more expensive restaurant, and then complained about how much it was? \n\nDef NTA.",
   "created_utc": 1701024464,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavaf96",
   "message": "Unless someone says “let me treat you to dinner” I fully expect to pick up my own bill. \n\nDid they actually make you out TBTAH or was that guy just being a bit whiney?",
   "created_utc": 1701025051,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavatxx",
   "message": "anyone who assumes you should pay for them sucks. And guilting you for not is also shitty. \n\nNTA",
   "created_utc": 1701025202,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavcx80",
   "message": "NTA \n\nI have never, ever assumed someone who invited me to join them for dinner was paying for me unless they expressly said, \"My treat\". \n\nI also don't know anyone who has ever assumed what your friend did. This seems to be a big complaint in this sub. I will never understand such entitlement.",
   "created_utc": 1701025953,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavd1ef",
   "message": "NTA I’ve never been on a double date with one check unless it was a swingers meeting type of thing… which based on context… this wasn’t that. Y’all weren’t all headed for a hotel afterwards so it’s strange they’d even assume y’all would pay.",
   "created_utc": 1701025996,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavje0y",
   "message": "NTA! You’re not responsible for paying for the other couple because you asked if they wanted to go out with you. I never go out EXPECTING someone else to pay for me. Hell, the first date with my husband, I brought my wallet because I wasn’t even expecting him to pay for me. They could’ve said no. Them going was their choice. Doesn’t make what they spend, your responsibility. \nPlus, they are the ones who decided on a more expensive restaurant and decided for order alcohol. Again, THEIR CHOICE, NOT your responsibility.",
   "created_utc": 1701028291,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavjxcv",
   "message": "I always tell the waiter that its separate checks as we're seated.  Never had a problem.",
   "created_utc": 1701028486,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavkk46",
   "message": "NTA\n\nI was leaning the other way (you proffer the invitation, you pay), but given his suggesting a more expensive place, then ordering and drinking expensive items under the _assumption_ that you were paying makes him the AH.",
   "created_utc": 1701028717,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavpv2t",
   "message": "OP isn't an arsehole. The other couple picked the restaurant and ordered more expensive drinks, which in expensive restaurants can end up more than the food depending on how many you have. The expectation should've been each couple pays their share. You're not taking them on a bloody date for god sake. Find better people to hang out with.",
   "created_utc": 1701030631,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavqbpq",
   "message": "NTA He thought you would pay for him and his date, and so he purposely picked an expensive restaurant and picked expensive drinks wall with the same expectation. He’s not your friend. Friends don’t take advantage of each other and are reasonable. There was no misunderstanding. Whenever one friend plans that the other would cover for them by default, it usually means that they are for themselves and are entitled to your money",
   "created_utc": 1701030801,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavtcqg",
   "message": "So when they assumed you were paying, they suggested a pricier place? NTA, but maybe rethink the dynamics of this friendship. If it was a one-off, cool. But if not?",
   "created_utc": 1701031907,
   "score": 3,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaul7xk",
   "message": "In some circles it’s an expectation that if someone asks you to dinner it’s their treat. \n\nIt’s helpful to be clear. If you are paying when asking make sure to mention. “My treat” or before ordering tell the server separate checks.",
   "created_utc": 1701015664,
   "score": 6,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaujc6z",
   "message": "NTA. They shouldn't have expected it.",
   "created_utc": 1701014923,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaun7us",
   "message": "Nta.  Unless you’re swingers and offered to take them out that’s not a normal expectation.",
   "created_utc": 1701016438,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauqj3m",
   "message": "\nI don’t know if he expected you to pay, it sounds to me like he got sticker shock from the price after ordering booze drinks that he didn’t add up in his head",
   "created_utc": 1701017697,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauqkto",
   "message": "He even suggested the place. What an idiot",
   "created_utc": 1701017714,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauqwqx",
   "message": "Nta...who just expects another couple to pay for their dinner unless it's explicitly stated?",
   "created_utc": 1701017840,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kausmhi",
   "message": "This is a weird expectation.  On a double date, each couple pays for themselves.  In addition, this guy suggested the more expensive restaurant and expected you to pay for him?  Yeah no, NTA.",
   "created_utc": 1701018489,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kausyk7",
   "message": "NTA. Your friends are just cheap.",
   "created_utc": 1701018617,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kautjyr",
   "message": "When you go out with another couple it’s always a split check, unless one couple insist on paying regardless of who asked.",
   "created_utc": 1701018845,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauwfw5",
   "message": "I normally tell the server at the beginning so everyone is aware.",
   "created_utc": 1701019940,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauymuz",
   "message": "In what world would a person not only blame you for not paying for their own meal but have the audacity to think that would be the case and still have multiple expensive alcohol drinks??\n\nWoooow\n\nNTA but the other couple are weiiiiirdos",
   "created_utc": 1701020762,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauzxh3",
   "message": "NTA, so he picked an expensive place he could barely afford, and expected you guys to pay?? The entitlement.",
   "created_utc": 1701021246,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauzzxr",
   "message": "NTA. You never offered to pay, so they shouldn't have expected you to pay.",
   "created_utc": 1701021272,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav155d",
   "message": "I love that they whole heartedly picked a more expensive meal and the more expensive beverage option with the assumption someone else would pay. Man. These aren’t friends.",
   "created_utc": 1701021699,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav20uv",
   "message": "When my friends and I go out to eat, one of us typically picks up the check for everyone. But we rotate that among us, because we often go out together. Also, each of us is very well-off so it's not a burden to anyone. Years ago, when that wasn't the case, we would split one check by the number of couples, without regard to who had what.",
   "created_utc": 1701022022,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav3ppq",
   "message": "NTA. \n\nIn general, inviting people out to activities/meals doesn't mean you will pay for them, period. I know in some cultures there are more strict or adhered to principles of inviting people out means you will pay, but I'm gonna assume you aren't part of those cultures since you didn't think to pay for the other couple. \n\nIf he was worried about money, he should have suggested a cheaper restaurant, and if he expected you to pay, he shouldn't have suggested a different restaurant from the one you offered, as even I know in the cultures where an invitation means you pay, the invitee doesn't make alternate suggestions. \n\nSo you're good, but don't invite this friend out again.",
   "created_utc": 1701022638,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav3wj6",
   "message": "NTA OP\n\nYou asked if they'd like to double date. You didn't ask if they'd like to be your guests.",
   "created_utc": 1701022706,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav4bzt",
   "message": "NTA. It was extremely rude of the other couple to assume you'd pay their bill, especially when they suggested an expensive restaurant. I wonder if the guy friend ordered all those drinks because he didn't expect to actually pay for them. People who order the most expensive thing on the menu or rack up the bill on someone else's dime are literally the worst. I'd be hesitant to hang out with this couple again.",
   "created_utc": 1701022860,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav4rz3",
   "message": "NTA. How bizarre, how bizarre. If I'm reading this correctly... NEVER go out with these people again. You chose a less expensive restaurant, the other couple pushed for a more expensive one. Then it appeared they tried to guilt you into paying. This is absurdly entitled behavior. Cut them off.",
   "created_utc": 1701023019,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav567o",
   "message": "NTA - This is not a friend.  I can't stand people who order the more expensive things when someone else is paying (which he was totally expecting you to do).",
   "created_utc": 1701023160,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav5jr2",
   "message": "To avoid this happening, how does one couple, when asking someone if they want to get together for dinner, make it clear they are not treating?",
   "created_utc": 1701023293,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav5mwa",
   "message": "At least where I’m from, it’s typical to just split the bill according to the number of couples. I think in my entire life I’ve only gotten separate checks twice…. And only because the other people asked before the meal",
   "created_utc": 1701023324,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav87a7",
   "message": "Some friend. NTA.",
   "created_utc": 1701024248,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav8sfd",
   "message": "We went out to dinner with another couple and made sure to get separate checks beforehand, and I’m sure glad we did. We got two beers each  and a couple of the least expensive entrees on the menu and our bill was $60. They seemingly didn’t order much more than we did, but there’s was over $200. All pre-tip.\n\nYou did the right thing. You should always be very upfront with those you are with and the waitstaff. That avoids any confusion in the end.",
   "created_utc": 1701024460,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav999h",
   "message": "My boyfriend’s friend offered to take us out to dinner for my boyfriend’s birthday. When the check came my boyfriend politely said we can split the check, his friend, who is a millionaire, said ok. I couldn’t believe it.",
   "created_utc": 1701024628,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kava21j",
   "message": "NTA, he picked the expensive place being sure you'd pay for it all! HA! Now you know all you need to know about him!",
   "created_utc": 1701024918,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavb1h7",
   "message": "NTA. I suspect that when you said “double date” instead of “get dinner together” he thought that since you invited them on a DATE, that you were going to pay. So he suggested the expensive restaurant and ordered multiple drinks because he assumed he wasn’t paying. If you go out with that couple again, you’ll want to make it clear that it’ll be separate checks.",
   "created_utc": 1701025278,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavcf6z",
   "message": "NTA, he decided on the more expensive venue thinking he would be able to take advantage of the situation by eating and drinking on your dime.  I’d be curious as to why you would have any doubts about it.",
   "created_utc": 1701025774,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavct1d",
   "message": "NTA - the term “double date” made it clear there was no expectation of you paying for them.",
   "created_utc": 1701025912,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavcxoi",
   "message": "Nta. They were expecting you to pay when they changed to a pricier restaurant closer to them",
   "created_utc": 1701025958,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavd3hf",
   "message": "NTA",
   "created_utc": 1701026017,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavddcn",
   "message": "NTA. That's ridiculous",
   "created_utc": 1701026116,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavegia",
   "message": "NTA. Your friend chose an expensive restaurant but acted surprised that it was….expensive? He clearly thought you would pay and took advantage of it. I could see if you told him you were treating them out for dinner but you didn’t. He honestly doesn’t sound like a good person, much less a good friend.",
   "created_utc": 1701026505,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavfphc",
   "message": "NTA\n\nIt sounds like he went overboard ordering things he would not have had he thought he was paying, but that is not on you.",
   "created_utc": 1701026952,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavga50",
   "message": "NTA, probably. Depends on how you invited them.",
   "created_utc": 1701027157,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavgdeg",
   "message": "No, YANTA\nYour friend is a piece of work though. \nSuggest you to use this as one of your first married lessons.\nNext time set the expectation along with the invite. Hey Friend, hubby \u0026amp; I are heading to taco restaurant. Do you want to go Dutch with us?\nFormal, like on an invite, is \"no host\"...",
   "created_utc": 1701027190,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavgffp",
   "message": "NTA\n\nYou’re not courting them and you never offered to pay for them.  They’re idiots.",
   "created_utc": 1701027211,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavgwth",
   "message": "NTA a double date doesn’t mean you’re paying for theirs. They wanted to go to the more expensive one and he ordered drinks because he thought you were footing the bill. Shame on them",
   "created_utc": 1701027385,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavh3ha",
   "message": "I’m so confused as to why they thought you were paying for them.",
   "created_utc": 1701027453,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavhn2p",
   "message": "I've never been on a double date where I expected the other dude to pay for me and my date. What kind of loser does this?",
   "created_utc": 1701027652,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavhqrp",
   "message": "Absolutely NTA there is no reason you would have been expected to pay especially with them drinking and your not. The only thing I could say and this is not required especially with them drinking was just split it down the middle. Again not required but they made the suggestion and there is no reason you are expected to pay.",
   "created_utc": 1701027691,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavhwrr",
   "message": "Looks like you need new friends, that guys a dick.  Tried to pull a fast one on you by playing the quiet game when the check came.",
   "created_utc": 1701027753,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavi6ku",
   "message": "My bf and I have a rule that whoever suggests the date pays, but if we go with other people, we always assume we’re gonna pay for ourselves",
   "created_utc": 1701027853,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavj2jm",
   "message": "If that was the expectation, no one would ever double date. Usually if one couple wants to pay for the other, they will specify by saying “our treat”.",
   "created_utc": 1701028177,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavjfvt",
   "message": "No who said you were responsible for them",
   "created_utc": 1701028310,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavl5rl",
   "message": "I mean, if this is after your wedding I’d more so expect them to pay for you. NTA at all!!",
   "created_utc": 1701028933,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavmk3w",
   "message": "NTA\n\nTotally normal expectation, especially considering they chose a more expensive place to eat.",
   "created_utc": 1701029442,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavmue0",
   "message": "Haha no! NTA. Did your friend think you were asking *him* on a date 🤣\n\nI can’t imagine any of my friends expecting me to pay for them just because I suggested getting together.",
   "created_utc": 1701029543,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavngz7",
   "message": "Dude knew what he was trying to do. Good for you at not falling for it. NTA",
   "created_utc": 1701029768,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavnqm3",
   "message": "NTA. Your 'friend' picked a more expensive place and then expected you to pay. He was seemingly using you to impress his date. The very fact he suggested a more expensive place himself means if any one was going to be picking up the bill for both it's him. If one person suggests or pressures people to go to a more expensive place then that person absolutely can't expect the other people to pay for them. \n\nIt's like hte dreaded tinder/blind date, going to the restaurant and your date asks what the most expensive drink/meal is on the menu, you know what they are doing.",
   "created_utc": 1701029866,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavohnd",
   "message": "You’re definitely not and your friends seem like complete a holes getting drinks because they thought someone else was gonna pay. Double date doesn’t mean you pay for everyone that would just mean that you ask your friends to come out to dinner it’s different when you say it’s a double date that means it’s two dates happening at the same time which means that one couple has one check and the other couple has another check. If you were asking them out to dinner, it would be different, also they’re the ones that wanted to go to the more expensive place again because they were under the impression that someone else was going to pay. They didn’t want to drive and be inconvenienced and they also ordered more expensively than they would have if they thought they were paying it sounds like they’re mooches and they’re upset that they didn’t get a free meal, those friends are gross",
   "created_utc": 1701030134,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavq663",
   "message": "If I invite someone to dinner, I live comfortably enough to pay for the four of us.  It's not a competition and not a way to show dominance.  It is a token of my generosity and a way to show the value of friendship between all of us.  However, this friend was trying to take advantage of you and is now butt hurt that it didn't work.",
   "created_utc": 1701030745,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavr4r0",
   "message": "NTA but you did put an immediate stop to what could have become an ongoing mooching situation.",
   "created_utc": 1701031096,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavrsy1",
   "message": "Your NTA your friend picked a expensive restaurant because he wanted you and your husband to pay.",
   "created_utc": 1701031342,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavsup9",
   "message": "Lmao NTA. Unless part of the invitation was \"why don't we go on a double date and it's our treat,\" why would two grown adults expect another couple (even if they're good friends) to pay? Also the comment about saving money/not knowing how expensive it would be is laughable. Is it no longer normal to take 30 seconds to look at a menu online to make sure it has options you'd like/be willing to try and scope out prices?\n\nUnless this was a much fancier/more expensive place that doesn't have the prices listed, he's being ridiculous. And if it didn't have prices listed, that's the indicator that maybe you should stick to one drink (or maybe water instead) if you're uncertain about your finances.",
   "created_utc": 1701031726,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavx0yh",
   "message": "No. When you double date, each date or single person buys their own meal. They assumed you'd be paying for the fact that you invited them. But they bit off more than they could chew.",
   "created_utc": 1701033246,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavy3um",
   "message": "NTA. Never go out with that couple again.",
   "created_utc": 1701033643,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaw1ecw",
   "message": "Hol’ up. \n\nSo your friend said no to the cheaper place, yes to the more expensive place, then proceeded to be the only person drinking alcohol, which can easily double the price of the bill. And then got disappointed when he discovered you *weren’t* treating him?\n\nI have a good friend I slowed down going to dinner with as a couples thing. He and his wife are financially on a different stratosphere than almost everyone I know. And even me with my beer at dinner couldn’t keep up with what he was spending. \n\nNTA.",
   "created_utc": 1701034855,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaw22d3",
   "message": "Sounds like he was embarrassed by the unexpected price more than expecting you to pay for him.",
   "created_utc": 1701035104,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaw2w8d",
   "message": "NTA\n\n2 couples, 2 checks.",
   "created_utc": 1701035405,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaw5gso",
   "message": "NTA- they suggested going to the fancy restaurant thinking that you would pay when you suggested a less fancy one that was a little out of the way also they were the ones to bring up the idea.",
   "created_utc": 1701036342,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kaw6o5n",
   "message": "NTA. \n\nYou are 2 separate couples. Why would that guy expect you to pay for him and his girl?",
   "created_utc": 1701036785,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kawes7n",
   "message": "He picked a more expensive restaurant and ordered a bunch of drinks  -- and then assumed you'd pick up the tab? wtf",
   "created_utc": 1701039834,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kawfwkg",
   "message": "NTA. Unless clearly stated, the couples are separate. Just asking if they want to go out with you guys doesn’t mean you’re paying for them. Looks like he was expecting a free meal so he made sure to drink a bunch of alcohol.",
   "created_utc": 1701040260,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kawnrq3",
   "message": "NTA HE PICKED THE PLACE. What a fucking scam artist. He picked someplace closer to him and more expensive. If anything, he should have paid for everyone.",
   "created_utc": 1701043349,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kawrf3y",
   "message": "Lol!  NTA, what was your \"friend\" thinking?  A double date is two couples, each paying their own bill.  Just amazing what people try to get away with.",
   "created_utc": 1701044814,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauxgck",
   "message": "I have a friend who makes considerably less than me and \"owes\" me money I never expect to see again. He regularly invites me out to pay me back the original loan. I always suggest places he can afford, and then I pay anyway. He will sometimes hand me cash, but sometimes he is expecting to pay with a card. \nHere is the thing: this friend NEVER expects me to pay. He always intends to pay for himself at the very least. He always orders moderately priced items. Panics every time I pay, hence the handing me cash if he as it. On the few occasions he has got the meal or coffee or whatever, his pause is always the \"Where is my wallet\" because he has ADHD, not \"Oh shit! I can't afford this. \" \n\nI realized recently that I have taken on a maternal role. Not a mother, but somewhere between mother and friend. Anyway, I pay by choice. In all of my other social outings, the check is split, or the payer is predetermined. Something is said like: I want to take you out for your birthday.\nNTA\nAlso, weddings are expensive. No one expects someone who just paid for one to buy them an expensive dinner for no reason other than socializing. I",
   "created_utc": 1701020322,
   "score": 2,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kav1l63",
   "message": "NTA… you aren’t responsible for paying their check they are!",
   "created_utc": 1701021865,
   "score": 1,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kave25j",
   "message": "Well you did ask him out on a date so... /s",
   "created_utc": 1701026362,
   "score": 1,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kausj44",
   "message": "Nta. Imo, the initiator usually pays, but they also pick the local. After they changed venues and the fact that it was to a more expensive place, they are on their own. Also, double dates should only be paid by one party if it's a reoccurring thing where each couple takes a turn getting the tab.",
   "created_utc": 1701018453,
   "score": 1,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kavannh",
   "message": "That's fair.  If you made all the arrangements and placed the orders, then you should at least offer to pay.  They chose the place and ordered what they wanted. Split the bill.",
   "created_utc": 1701025137,
   "score": 1,
   "submission_id": "184djhn"
  },
  {
   "comment_id": "kauy7w2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "184djhn"
  }
 ]
}