{
 "submission_id": "184dvaz",
 "title": "AITAH? My fiancé (36m) is telling me (28f) not to do his laundry anymore because I brought up his messy boxers",
 "selftext": "For more context, he works, im a SAHM. We have two kids (f5,f2) and I make us 'extra' money by making jewelry and selling it.  \n\nYesterday, he was off of work. He started cleaning the fridge out. As he's cleaning it out, he's making comments to me \"look how gross this is\", \"come on man, this has mold\" and other passive-aggressive comments. I told him that the comments are making me feel like shit, and he said good, that's the point. \n\nI understand how frustration with old food in the fridge, how it's his money being spent on the food and that he's asked me for over two years to try better to keep the fridge cleaner. I do try, but things get shoved in the back and I honestly just forget about checking the back of the fridge. I do wipe the fridge regularly.  Alot of the food that gets pushed to the back are dinners that I make and leave for him but he never eats when he comes home from work, he orders out, instead. Or eats snacks. \n\nAnyways, he was getting pissed off and started slamming things, and I decided to take the kids out so that no one had to deal with his negativity. The kids and I had been up since 530 yesterday and having a good morning, I didn't want it ruined. I'm packing the kids up to get into the car and he goes into the room and stays there, now upset that I didn't invite him out with us. \n\nWe've had enough arguments that I figured it was best to give him some space.  He texted me telling me \"fuck you have a great day\"and I told him that I understand the frustration with the food waste and messy fridge, but that he also lives here and can clean the fridge anytime, and that making comments to make me feel like shit isn't appropriate. He replies still swearing at me and disregarding anything that I'm saying,  and I say that I don't point out every disgusting thing that he does in the house because it isn't worth a fight and we both live here. He's still going on and I just come out and say it. Ive been keeping quiet about it for months. I say that I don't like cleaning up his cummy boxers, but I do. Now he's pissed, I imagine he's embarrassed,  but that was the only way to get my point across while he's disregarding me. \n\nFor more context, when our second kid came along, she was a rough newborn (aren't they all?) She would just cry and scream inconsolable from 7-9/10 for the first 6-7 months of her life. For the first month, her father would Stay in her room with me, and it was a mental relief to have that company while dealing with a new baby. She didn't like being held by him, but I appreciated the support. After that first month, he stopped offering his company and would instead say how he couldn't deal with the crying and would go into the bedroom and do his own thing while I dealt with the baby. I would often fall asleep with the baby, too tired to really get up and make it into our bedroom. Our older child was having a hard time adnusting to the new baby as well, and bedtime was a mess with her, too. So over time, we slept in seperate rooms. I sleep in the kids room, he has the bedroom to himself. Halfway through my pregnancy we stopped having sex and he admitted he found my growing belly unattractive. Our sex life never got back on track, even now two years later. So yeah, he tends to jerk off. He doesn't show interest sexually when I initiate it, and over time, I've come to realize that he's lazy sexually, and he was grossed out by watching our daughter come out of me, so he won't go down there anymore either. Pretty dead sex life. \n\nNow he doesn't want me doing his laundry, after my \"hurtful comment\". AITA?",
 "created_utc": 1701014538,
 "permalink": "/r/AITAH/comments/184dvaz/aitah_my_fiancé_36m_is_telling_me_28f_not_to_do/",
 "score": 45,
 "url": "https://www.reddit.com/r/AITAH/comments/184dvaz/aitah_my_fiancé_36m_is_telling_me_28f_not_to_do/",
 "comments": [
  {
   "comment_id": "kaujuvz",
   "message": "NTA- I always find it weird when I'm reading a post and thinking to myself, \"These people are divorced and they don't even know it.\" If your husband has gotten to the point where, \"making you feel like shit is the point,\" he's moved into abusive territory, and it's not going to get better.",
   "created_utc": 1701015127,
   "score": 115,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaupgla",
   "message": "Why is this abusive fuck your fiancée? Obviously NTA, but I really hope that you have some clarity around what a shitty person this dude is.",
   "created_utc": 1701017292,
   "score": 51,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauospj",
   "message": "\"Anyways, he was getting pissed off and started slamming things\"  Yeah, you're one step away from this performatively shitty dude slamming you or a kid.  He does this to keep you all in fear.\n\nMaking your kids and girlfriend scared of you isn't about food waste, it's about control.\n\n\"I sleep in the kids room, he has the bedroom to himself. Halfway through my pregnancy we stopped having sex and he admitted he found my growing belly unattractive.\"  You aren't a partner, you're a house drudge he enjoys torturing.",
   "created_utc": 1701017038,
   "score": 113,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauo0y7",
   "message": "You are not the asshole.\n\nHaving two tiny kids is really hard on a marriage, and it sounds like yours have been high needs.\n\nYou told DH he made you feel like shit, and he said \"Good.\" He's a dick.\n\nHe's also a dick for deciding after a month that getting your fussy infant to sleep was all you.\n\nHe's also a dick for wasting food that you made him, wasting money on take out when you made him food, and then humilating you for not throwing away the food you made.\n\nIt's not his money he's spending, btw. Look up childcare prices if you haven't. \n\nIDK what is going on with the boxers. 'seems avoidable.\n\nThe sex is bad, too? I don't know. This is a really hard time for a lot of couples, but I'd leave. Honestly, you might get more child support than he is contributing now.\n\nand get a counter-depth fridge in your new house. It's a lot easier to not lose food in those.",
   "created_utc": 1701016741,
   "score": 54,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaupjzk",
   "message": "So tired of these types of posts. There should be a new sub r/ismyrelationshipshit and the answer would be yes to every one.",
   "created_utc": 1701017327,
   "score": 54,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaujxdg",
   "message": "\u0026gt;Anyways, he was getting pissed off and started slamming things\n\nSlamming things (even if it's not directed at you) is abusive. It's the next closes thing to hitting you without technically getting himself into trouble.",
   "created_utc": 1701015153,
   "score": 51,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauq5zs",
   "message": "NTA- but why are you still with him? He sounds like an AH",
   "created_utc": 1701017558,
   "score": 14,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaur2fg",
   "message": "go on, what are his GOOD points?",
   "created_utc": 1701017901,
   "score": 11,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauvtth",
   "message": "He's upset about food waste, but he's the one wasting food. \n\nHonestly, y'all are both over this relationship. It's obvious to me, and if it isn't already obvious to your older child, it will be soon. Don't let things continue to deteriorate. You don't want your kids growing up in a house where dad openly tries to make mom feel like shit. \n\nAnd everyone saying his behavior will only continue to escalate are right. If he's not already yelling and and slamming things around when the kids piss him off, he will be soon. And your kids will rightfully be scared.",
   "created_utc": 1701019707,
   "score": 10,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauv51r",
   "message": "Jesus. I hope you don’t really consider this man a suitable husband. Cuz he’s sure not a suitable partner or a man at this point, I can only imagine how much worse it’s going to get when you’re married.",
   "created_utc": 1701019446,
   "score": 9,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaup1ah",
   "message": "NTA. I’m baffled at the ESH comments. While I completely understand that it seems the both of you need to communicate, he could also be doing a much better job of that himself in general. It should not be solely on you. If he’s upset at the lack of sex, he could mention it. If he doesn’t appreciate the moldy food that hasn’t been tossed out yet, he could mention it. Instead it’s clear he’s forming resentment from not speaking up. \n\nHe’s also, resorting to other mean tactics to make you feel just as bad as he does. Cussing at you is unacceptable. Slamming things is unacceptable. Him not helping you with the baby is unacceptable. Him feeling so grossed out by you for birthing his kids is way past unacceptable. He wants sex but refuses to satisfy you in any way? Help you in any way? I wouldn’t have sex with him either OP. \n\nHe’s a grown man, and his behavior is atrocious and he’s throwing temper tantrums. Leave his cummy boxers for him to clean up himself. He doesn’t deserve you anyways. \n\nI hope for your peace OP, you can work through this. However I really feel it’s better if the two of you part ways. You’re already doing most of the work yourself.",
   "created_utc": 1701017130,
   "score": 24,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauvsf3",
   "message": "Wtf is it with women and them staying in toxic af relationships?\n\nHow many red flags do u need? \n\nRUN GIRL. TAKE THE KIDS AND RUN.\n\nNTA, but every day you stay makes you an AH to yourself and the kids.",
   "created_utc": 1701019693,
   "score": 17,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauwg4r",
   "message": "Info: Whats the point of this relationship?",
   "created_utc": 1701019942,
   "score": 5,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kautgev",
   "message": "NTA. Lawyer up.\n\nWeird situation. He is your fiancé, you have two children already, and you're not married? Your children need financial and emotional support from this dick head. But go talk to a lawyer about your rights and prepare to dump his sorry ass and build a new life with your kids.",
   "created_utc": 1701018808,
   "score": 9,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauwh3f",
   "message": "Info: is therapy an option for your husband? Or maybe joint marriage counseling? Because his behavior is fucked up and needs to be addressed if you're wanting to stay with him",
   "created_utc": 1701019952,
   "score": 4,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaulmi8",
   "message": "ESH\n\nNo sex life?  Time to split.\n\nArguing regularly?  Time to split.\n\nAdvice:  Time to split.",
   "created_utc": 1701015823,
   "score": 22,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kautfny",
   "message": "This story had more twists than a fun house ride.\n\nIf your husband is a 36 yo who is snacking and eating take out food for dinner, I’m pretty sure he’s no sculpted Greek statue himself. You’ve had two babies. Your body will change after that. It happens to all women who don’t have personal trainers and dietitians and hours of free time every day to work out.\n\nTo chat about something different, I’d like to rewind your story and ask about the bonding experience with your first baby. Did your first baby also seem to reject him? That’s an incredible blow to a father or grandfather. Feeling like you scare your baby is heart wrenching. It hits us square in our lizard brain telling us we are unworthy and bad. If your first child was fine with him this can feel doubly awful.",
   "created_utc": 1701018800,
   "score": 7,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauivzq",
   "message": "ESH. Just get some counseling or get a divorce. But don’t keep on like this. Life is short. Climate change is real. Plan accordingly.",
   "created_utc": 1701014750,
   "score": 14,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaunxh1",
   "message": "I would consider marriage therapy.   You need a home with low hostility to raise your children lest they grow up with anxiety issues.  Good luck; life isn’t easy.",
   "created_utc": 1701016704,
   "score": 3,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauptua",
   "message": "Seems like bigger issues going on than just boxers. I would let him do his own laundry, it shouldn’t be that big a deal for him to do. Go to marriage counseling for the bigger issues.",
   "created_utc": 1701017431,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaut9nl",
   "message": "Baby, get out of this relationship. He is not mature enough to have an adult relationship.",
   "created_utc": 1701018735,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauzvrz",
   "message": "He is your fiancee??? Leave... fucking RUN as fast as you can",
   "created_utc": 1701021229,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav0wto",
   "message": "NTA- You're only TA if you stay with him. You're very close to him abusing you guys. This is not about the fridge, he's trying to scare you. You didn't do anything wrong op. If it wasn't the fridge, something else would've set him off. He thinks he can control you because he knows you can't afford to live on your own.",
   "created_utc": 1701021614,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav1zpq",
   "message": "This isn’t an AITAH situation. This is a relationship problem.  Disagreements are normal, fighting and sleeping in separate rooms with no sex life is not normal.",
   "created_utc": 1701022011,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav2a3g",
   "message": "So. He’s 36 and holding down a job, because he knows how to act like an adult at his job, but then because he KNOWS HE CAN, he comes home and communicates to you like a spoiled child.  You also make statements about “his money going to waste on food”, do you get money for the job you do at home with the children or does he have you in a financially abusive situation? The communication between the two of you sounds awful, he checked out of parenting your youngest, and I’m really not seeing what you get out of the relationship? NTA for this one particular instance you ask about, but you would be the ah if you continue to let your children witness this type of conflict.  Get some counseling or start working on a coparenting and child support agreement.",
   "created_utc": 1701022116,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav2gny",
   "message": "He needs to grow tf up, but he probably won't. Expand your side hustle and get out.",
   "created_utc": 1701022183,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav3woj",
   "message": "I would venture to guess that his inability to have sex with her is probably related to some form of porn addiction that she doesn’t realize that he has. It’s extremely common.\n\nI also find  it very sad and embarrassing that a grown ass man who chose to have children with this woman would have the audacity to turn around and say that her being pregnant is unattractive, or that he doesn’t wanna go down on her because he watch the baby come out. Grow up.",
   "created_utc": 1701022708,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav42e1",
   "message": "Good, don't do his laundry. Sounds like a win.",
   "created_utc": 1701022765,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav4il1",
   "message": "The relationship is dead. He is bullying you. What are you actually getting out of all this. Please wake up. Start sticking up for yourself regain your dignity otherwise you will be his doormat and victim all your life. NTA",
   "created_utc": 1701022926,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaupgen",
   "message": "Just a PSA for literally anyone reading this, *everyone in the house should be doing their own laundry*. Just full stop.",
   "created_utc": 1701017290,
   "score": 0,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaul2gz",
   "message": "NTA but I think you guys need to communicate a little better. He’s looking for things to nit pick about, and maybe projecting some insecurities. I know you addressed the issue but some times when you think you’re giving someone their “space” it can feel like they’re being abandoned. I understand that you wanted to let him know that you also have tasks you don’t like to do, but the middle of a fight is never the time to start bringing up bottled feelings. And lastly intimacy becomes a lot easier when you guys are getting along. Best of luck to your family.",
   "created_utc": 1701015604,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauw0hf",
   "message": "I want to say NTA but it’s more like ESH if the question is whether you’re an AH for your comment about his boxers.\n\nThis relationship sounds absolutely miserable. Toxic and unenjoyable in every way. LEAVE while he’s still just a fiancée because you absolutely should not marry this person and I’m having trouble understanding why you would want to even for a second.",
   "created_utc": 1701019779,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaup8lc",
   "message": "NTA, he had such a huge overreaction at something as small as mouldy food in the fridge and wanted you to feel bad over it? gross. \nthe fact you even have to clean cum off a grown man’s boxers says enough and i’m sorry that you’ve had to do that :( \nOP i hope things get better for you either on your own or in your relationship",
   "created_utc": 1701017207,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav1eeu",
   "message": "ESH. He's acting like a child, and you're not much better. You can't remember to check the fridge to the point where food is rotting inside? I'm a bit of a slob, and I don't even do this. But even so, for him to insult and curse at you is inexcusable. I've been with my wife 23 years. Guess how many times I've cursed or insulted her? That'd be ZERO. You don't talk to or treat people you love and respect that way. The both of you need serious therapy and to grow up.",
   "created_utc": 1701021796,
   "score": 0,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaus01r",
   "message": "NTA and it seems like kind of a win for you if you no longer have to do his laundry. I’ve been married for decades and my husband does his own. Sometimes I will hang his things up or put them in the dryer if I need the washer and his clothes are in there. Works well for us.",
   "created_utc": 1701018254,
   "score": 0,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav2l8g",
   "message": "YTA. Yes, he’s being a jerk, but like….even with two kids you can clean the fridge once in awhile. And then you leave without saying goodbye. Why not say instead apologize for the fridge and tell him you’ll clean it or something?\nHe’s upset about the fridge. Are you listening? Address the issue there before going on other long tangents about your sex life and his boxers.",
   "created_utc": 1701022229,
   "score": 0,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaujd3u",
   "message": "ESH\n\nHe shouldn't react the way he is. He should invest more into parenting.\n\nYou are not doing your job. To the specific question, you said it to take a shot at him.",
   "created_utc": 1701014933,
   "score": 242,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kaupkl2",
   "message": "You need to talk to your husband and stop wasting time getting predictable advice from single women on the internet.\n\nYou have to fix the dead bedroom problem. \n\nOnce that's resolved, his pent-up anger might just go away. \n\nThe only path forward is to talk to him, not randos on the internet.",
   "created_utc": 1701017334,
   "score": 244,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauyrxg",
   "message": "Only to yourself for staying with this verbally abusive dickhead",
   "created_utc": 1701020814,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauyunl",
   "message": "NTA! Good thing you’re not married! Good luck 🍀",
   "created_utc": 1701020841,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauywz4",
   "message": "NTA but why are you staying in this situation it's bad for you \u0026amp; worse for the children.",
   "created_utc": 1701020865,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauz0qc",
   "message": "This is not my comment, it's my husband's...  \n\n***What kind of a pig jacks his root and doesn't clean his own mess?  Seriously.***\n\nSo, OP, you're NTA.  He is.  But remember this: not only are there other fish in the sea, there are much better fish.",
   "created_utc": 1701020904,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauz16q",
   "message": "If you’re staying together for the kids there are generations of people who did that and their kids wished they gotten a divorce so they wouldn’t have to grow up in that abusive mess. Also why do we want to model a relationship like this to kids? Is this the type of relationship you want them to have when they’re older?!",
   "created_utc": 1701020909,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauz74u",
   "message": "You’re NTA, but you are a fool for still being here and thinking you’re his wife and not just the live-in nanny/cook/maid he doesn’t have to pay. Please, for the good of you and your kids, do NOT marry that man.",
   "created_utc": 1701020972,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauzbwk",
   "message": "INFO: How long have you been together?  Are both kids his?",
   "created_utc": 1701021021,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kauzr26",
   "message": "Whoa NTA in any way, shape, or form! This dude is bordeline abusive in the way he's handled this, and when you walk away from his abuse, rather than realise he's gone too far, he carries it on via text?! And he hasn't slept in the same bed as you for over 2 years and told you he didn't find you attractive whilst you were growing the baby HE put inside you? So, what, you do ALL the housework and ALL the child rearing, and he basically just does whatever he wants?? He doesn't even eat the food you cook but orders take away?? Sweetie, this doesn't even resemble a relationship. You're doing EVERYTHING whilst he gets to do jack all and then has the AUDACITY to complain the freaking fridge hasn't been cleared out? He sounds like a selfish, entitled ass and i honesty don't even know why you're together if you don't even sleep together.  When my kids were babies we often slept apart - because we EACH co-slept with one kf them, him with our oldest and me with our youngest. And yeah our sex life wasn't the greatest when they were really little (25 months between them and neither slept through the night until they were like 4/5), but we still always made time for each other when we could and used pretty much every room/ space we could when the mood struck. And even during a dry spell, he'd never leave cumming boxers for me to clean up, if he jerked off he did it in the bathroom and cleaned himself off. And I was a sahm and he worked full time, and he STILL co-slept with our oldest every night and dealt with any wakings up from her whilst I dealt with our youngest and when they were new borns he slept downstairs with the baby every weekend to try and give me at least one night's sleep a week.",
   "created_utc": 1701021179,
   "score": 2,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav1kt2",
   "message": "I would not marry this man he sounds like a shitty partner and abusive. Is there anything good left in this relationship?",
   "created_utc": 1701021861,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav1y5g",
   "message": "Leave. It'll only get worst.",
   "created_utc": 1701021995,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav2clm",
   "message": "NTA - DO NOT MARRY HIM. If he is treating you like this as his fiancée, it will get definitively worse as his wife. It will be abusive, it sounds pretty abusive now. You’re already doing all the parenting, and he’s not helping except to complain, so it won’t be much different.",
   "created_utc": 1701022141,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav2qyt",
   "message": "NTA. This man is abusive towards you. Exactly what does he add to your life? Sounds like you’re doing it alone already. Before initiating the divorce though, please take careful documentation of all of the finances. I’m so sorry OP, good luck",
   "created_utc": 1701022288,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav3nx2",
   "message": "ESH, I don't believe this relationship is this one sided. Yeah the guy is a dick, so why in the fuck would you have two kids from him out of wedlock? The only victims in this story is those poor kids",
   "created_utc": 1701022620,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav40to",
   "message": "NTA leave this jerk",
   "created_utc": 1701022748,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav44od",
   "message": "He feels bad and he wants you to feel bad. Not a healthy relationship.\n\nHe is lazier sexually because he probably watches too much porn. Tell him to not watch porn for a week or two and it will get better.\n\nNTA",
   "created_utc": 1701022787,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav4qvw",
   "message": "Sounds like your marriage has come to an end. Sex isn't everything. But he clearly doesn't respect you. Yes, you are home every day. But you have two little ones that need CONSTANT eyes. It's hard to put your head in the fridge If he can't even be bothered to watch them.",
   "created_utc": 1701023008,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav5e3y",
   "message": "How do yall end up marrying such blatantly terrible dudes?",
   "created_utc": 1701023236,
   "score": 1,
   "submission_id": "184dvaz"
  },
  {
   "comment_id": "kav5o8a",
   "message": "I used to be married to a guy who slammed things around and was negative all the time. I’d been dating him since my teens, didn’t know any better. Then when I was around your age I’d had enough, packed up my toddler and got the heck out. Now I have a spouse who loves me, treats me well, loves my kid, supports my passions, washes dishes, and is great in bed. I know it doesn’t feel like you can leave, but the truth is, you can. It ain’t easy, but it’s better. Give him an ultimatum and while he’s pretending to get his shit together before inevitably backsliding into douchery, start saving money and making a plan.\n\nNTA, obviously, but you will be if you choose to stay in this situation. You and your kids deserve better. And there is better. This isn’t normal or healthy. The good days don’t make up for this. If you’d ever been in a healthy relationship, you’d realize why everyone is so flummoxed by this post. Normal relationships are not like this, babe. Get out.",
   "created_utc": 1701023338,
   "score": 1,
   "submission_id": "184dvaz"
  }
 ]
}