{
 "submission_id": "184gwr6",
 "title": "For telling my ex that it's not my fault that he's homeless.",
 "selftext": "So I 28f posted on relationship advice before about my now ex 29m. The post and update is in my profile, but basically my ex fiance wanted me to put his family before mine even at the cost of my sisters health. I ended up breaking up with him over it and he was forced to move in with his mum, who then found out that he had been intouch with his abusive dad who was twisting his view on how a relationship should work. \n\nLast I heard was that his mum was kicking him out as she would not have anyone in her house that was in contact with her ex and that he had tried to go live with his dad, but his dad had refused. I was completely NC with him, so his mum was the one that had told me this. \n\nI'll call my ex R and exs mum S to make things easier. \n\nI hadn't heard from R in weeks, but yesterday he showed up at my house. I had the chain on my door so opened it with that still attached, no way would I let him in. He basically told me that he had no where to live. His mum isn't speaking to him and his dad won't put a roof over a grown man's head, his words not mine. He asked if I would take him back or at least let him live with me.\n\nNo way in hell would I get back with him and getting him out the first time only went easy because his mum stepped in to help. He had threatened to take me to court knowing that if he did it could take months to get him out and then said he would only move if I gave him £10,000. I contacted his mum, who was furious about that and she turned up with his brother and forced him out. \n\nI told him that there was zero possibility of him ever living with me again and that we were 100% over. He started shouting at me and calling me all sorts of names, so I threatened to call the police if he didn't leave and shut the door. I have cameras all over my house so I caught everything he did and said on camera and have saved it to a USB just incase. \n\nHe then went crying to all our mutual friends and it managed to get back to his mum. She called me and asked what happened, I told her and she then informed me that she had put her house up for sale and was moving 300 miles away to be nearer her other son. Her and R had a huge argument about this and she finally kicked him out. Since then he's been couch surfing, but with Christmas coming up, his friends aren't really happy with having him on their couches when they have kids and are meant to be enjoying the festive season. He's been kicked out of 3 friends houses in 10 days. \n\nShe told me I was right to refuse him, but I've since had other friends say that they feel sorry for them, and that I can just let him stay in my spare room until he's back on his feet. I then asked them to put him up, but they said they would but don't have room and if they had a spare room like me then they would let him stay. My family and his are on my side, but I'm starting to doubt myself with what a couple of my friends have said. \n\nSo Reddit, AITA?\n\nEDIT; Just a quick edit as I'm going to bed. I've just spoken with the wife of one of R's friends and she's asked to meet me on my lunch break tomorrow. Apparently, R stayed with them for 2 nights before she kicked him out and there's more going on than what I know of. She's going to tell me the full story tomorrow, but told me that I shouldn't let him anywhere near me and that he's staying in a b\u0026amp;b so he does at least have a roof over his head right now. I'll try and update after I've spoken to her.",
 "created_utc": 1701022579,
 "permalink": "/r/AITAH/comments/184gwr6/for_telling_my_ex_that_its_not_my_fault_that_hes/",
 "score": 155,
 "url": "https://www.reddit.com/r/AITAH/comments/184gwr6/for_telling_my_ex_that_its_not_my_fault_that_hes/",
 "comments": []
}