{
 "submission_id": "184i2s4",
 "title": "I kicked my step- granddaughter out of my house.",
 "selftext": "For context: Step- child was evaluated and examined by a psychologist and physician the police department chose. the child showed no sign of abuse. \nThe psychologist said step- child is a danger to others and needs extensive help. She advised we keep her away from our family. \n\n\nwe tried to include her in our family but she's made it damn near impossible \n\n\n\n\nso I, 57 male, have a daughter who is 30, well almost 31. in 2019 my daughter married her now husband who is a bit older than her but not much , he's 39. I begged her not to marry him, not because I don't like him, but because of his terror of a child. \n\nmy daughter has a son with my son- in - law and my son- in- law has a 13 year old daughter from a previous relationship. \nThe 13 year old has made it damn near impossible for my daughter to enjoy her baby. \n\nThis child is incredibly dangerous in my opinion and before the major event that caused me to cut contact with her, it was always something she had going. \n\nlast year, the 13 year old step child told the school that my son, 22, had SA her and it started a shit storm of police interviews and other things. \nIt came out pretty quickly she was lying because my son has a large burn scar that takes up the lower half of his body and the step child couldn't identify it via photos. my son also volunteered for and passed a polygraph test. \nThe psychologist who interviewed both my son and the step child deduced rather quickly that the step child was lying. \nwhen confronted step child admitted she was lying because she was angry my daughter wouldn't get her a laptop. \nwe had a situation thr Christmas before where I bought my daughter a gaming laptop and my step-- granddaughter wanted it but her tantrum didn't work so she decided to try and steal it, didn't work. \n\nI invited my daughter and grandson to Thanksgiving and told my son- in - law he was more than welcome to come but his child was not. he said he understood. \n\n\nso my daughter, my grandson and my son- in - law show up Thanksgiving day. everything was going well until we hear the front door open and in walks step child. apparently her mother had gotten wind we were gathered at my house and decided step child should be included. \nI met step child in the foyer and told her she wasn't welcome in my home and needed to leave. \nshe got smug, saying \" well my moms already left so..\". and tried to push past me. I held my arms out and stopped her, telling her to GET OUT NOW!. \nI forced her back outside and told her she could wait by the mailbox while she called her mom to come get her. \nthis child has never heard no more than a few times. \n\nI told my son- in- law he could do what he wanted as long as it didn't involve bringing her in my home. He went outside and came back in to tell us apparently her mom thought we weren't allowed to gather unless it included step child. \n\nher mom ended up coming back to get her only when I called the police. I had her and her mother trespassed. Her mom pitched a fit but the officers fully understood once I provided proof this brat had lied on my son. \n\nnow everyone on my son in laws side is saying I'm the asshole for being mean to a child but frankly I'd prefer never to see her again",
 "created_utc": 1701025675,
 "permalink": "/r/AITAH/comments/184i2s4/i_kicked_my_step_granddaughter_out_of_my_house/",
 "score": 167,
 "url": "https://www.reddit.com/r/AITAH/comments/184i2s4/i_kicked_my_step_granddaughter_out_of_my_house/",
 "comments": []
}