{
 "submission_id": "184ib7k",
 "title": "AITAH for insisting I’ll get a surgery even if it upsets my family?",
 "selftext": "I’m 20 and have endometriosis. I take progesterone only pills to stop my period as I can’t have estrogen because of history of aura migraines puts me at risk of having a stroke if I were to take estrogen (even if my migraines stopped I still couldn’t have estrogen because the history still creates the risk). Lately even with no period the pain has been coming with severe intensity and I can barely even function or walk some days. \n\nI finally got a scheduled consultation to get a laparoscopy to remove the endometriosis. I’ve been updating my family about this condition. My grandma however does not like the idea of me getting this surgery. She is insisting that it will make me unable to have children and will cause me harm than good (this is all false and I’ve tried explaining that to her but she’s not convinced). She’s even trying to get me to stop taking my medication and get my period back because it’s “not healthy for a woman to not get her period.” I will not be doing this as my periods are literal HELL. I cannot walk. I cannot get out of bed and I will be screaming all day long. Doctors told me for years that this was completely normal. \n\nMy mom insists there must be other options to get the endometriosis out but there is not. Only the laparoscopy. My grandma is continuing to tell me to not get the surgery and to just deal with the pain I experience and go back to “normal.” She’s going as far as saying I can’t have endometriosis because that’s something “pregnant women get” (NOT true). \n\nI don’t care what my family says. I am getting this surgery. They’re insisting it’s a selfish decision because “what if there are complications” and that it wouldn’t be fair to them if I can’t have children even though I recently found out my body most likely won’t be able to handle giving birth anyway. They don’t understand why I’m doing this and why I can’t just suck up “some little period cramps.” \n\nI told them I’m getting this procedure whether they like or not and that it’s none of their business what I do. I directly told them they don’t get to have a say about anything in my life. They’re all turned against me for saying this. Maybe I did go a little too far and I get they just care about me. I just can’t continue living in this much pain. AITAH?\n\nEdit: thank you guys so much for all the advice on how to stand up for myself when my family tries to pry into my business. I really appreciate it. ",
 "created_utc": 1701026301,
 "permalink": "/r/AITAH/comments/184ib7k/aitah_for_insisting_ill_get_a_surgery_even_if_it/",
 "score": 13,
 "url": "https://www.reddit.com/r/AITAH/comments/184ib7k/aitah_for_insisting_ill_get_a_surgery_even_if_it/",
 "comments": []
}