{
 "submission_id": "184kdkj",
 "title": "My husband's friend (21m) has a gf (16f) AITAH for telling them they're no longer welcome at our home?",
 "selftext": "My (24f)  husband (22m) has a friend (21m) who frequently visits our home. We'll call the friend \"Matt\" so Matt has recently starting bringing this girl around. I had not thought to previously ask her age, but nevertheless a topic came up where she told me she was 16. I didn't want to embarrass this girl so I only shot dirty looks at Matt until they left. I had a conversation with my husband about how I wasn't comfortable that his friend is basically grooming this teenager, I also found out they've been lying to her parents saying Matt is 19. This only confirmed that Matt knew exactly what he was doing \u0026amp; knows it's wrong. I told my husband it was his position to tell Matt he needed to stop \"dating\" girl because he was childhood friends with Matt \u0026amp; I had only known Matt a few months. My husband told me he had already spoken to him \u0026amp; that's all he could do. This led into an argument with me telling my husband he basically was condoning it because he continues to let this man bring this kid to our home.\nI told my husband if he doesn't do something about it I will embarrass whoever I have to next time they come over. \n\nSo AITAH for saying my husbands friend isn't allowed over here if he continues \"dating\" this kid?\n\n*********EDIT: Just got off the phone with police \u0026amp; y'all. The age of consent is 16. There is \"nothing\" they can do legally. BUT I'm in the middle of trying to find her parents. I don't have her last name so I've been scrolling through names like hers for awhile. Matt doesn't have her on his FB (I checked twice) hopefully I can find her parents. Husband also informed his \"friend\" he can't come over because we're both in disapproval to this \"relationship\" \n\nThe police also told me the only way they could take any legal action is if he bought her alcohol or nicotine. Which I'm sure he has but I have no proof. They really didn't tell me much more except they were also disgusted. \n\n******EDIT AGAIN\nwow y'all are wild I'm not coming back to this thread, they're not coming back to our home. Yeah it's legal but it makes us uncomfortable. We also don't want a minor we have to be held legally responsible for if things go south on our property. They can do whatever but not here. I couldn't find her parents I looked for maybe 2 hours. But like I've said many times before it's not like they could've done much anyways. That's just coming from a mother to a mother. Some of y'all are weird I definitely as an adult wouldn't be dating someone I couldn't even take to a bar much less a junior in highschool. Anyways thanks for coming to my Ted talk. Goodbye 👋",
 "created_utc": 1701031593,
 "permalink": "/r/AITAH/comments/184kdkj/my_husbands_friend_21m_has_a_gf_16f_aitah_for/",
 "score": 9,
 "url": "https://www.reddit.com/r/AITAH/comments/184kdkj/my_husbands_friend_21m_has_a_gf_16f_aitah_for/",
 "comments": []
}