{
 "submission_id": "184lk8i",
 "title": "WIBTA if I didn't delete the photos of my mum from my wedding day?",
 "selftext": "My mum is vehemently against being in any photo. I think the last willing photo of her is from the 90s when I was a baby.\n\nThe weird bit is that shes a really beautiful woman but she gets so self conscious about being in a photo. There have been huge arguments about this from various family members but she's never swayed.\n\nOur family has zero Christmas, holiday or birthday photos. No pictures from events or parties, because my mum won't be in the same room as a camera on the off chance it snaps her.\n\nFor my wedding, she promised she'd be cool about it. But she did buy a massive (and I mean massive) hat that covered half her face and all of it if she looked down. This was clearly her safety net. \n\nExcept my photographers were onto her, and a few full face photos have made it through into the album. This is probably the only photos I have of my mum in the last 30 years. She looks stunning in all of them. \n\nAnyway, I get the link to the album and warn her she's in some photos. She doesn't want the link and doesn't want me to give the link out to anyone else. I try and show her a few shots where she's in them but you can't really see her face to show her how nice she looks, but it makes things worse. \n\nWithout her knowing, my husband obviously sends the link to his family, I send it to my bridesmaids and just give my family the highlights for my mum. \n\nWell, that wasn't enough, and my brothers just told me that she's been sobbing all day knowing these photos exist and she wants them deleted. She been sat crying all day and has been miserable about this since I told her I'd gotten the photos. \n\nWhat do I do? I don't want her to be sad, but it feels like she's being totally unreasonable and honestly, dramatic.\n\n What can I say to make it better or to make her see reason? Do I just delete every photo that she's in? I cant take them off the link as it's just a hidden page on the photographers website.\n\nTLDR my mum hates any picture where she's in it so wants me to delete a chunk of my wedding photos, I have zero pictures of my mum and want to keep them.\n\nEdit: fixed spelling\n\nEdit 2: I just went to see my brothers exact text, it was:\n\n'Could you please not include a close up of mum in your wedding album? She's really sad and has been crying all day.' \n\nAnyone who knows the photographers website can get to our album - and there is ONE close up of her face out of 1000 photos. \n\nI think temptation has won over and she's gone to check out the pictures herself. \n\nIf I'm right, I have no control over that website and couldn't delete the photo even if I wanted to unless I reached out to the photographers. But that's crazy and if its the case I really really don't want to do that.\n\nEdit 3: okay, so final update. Thank you all for your advice and it did help me understand and have more sympathy of my mums phobia. Special thank you to those who felt the need to call me an awful daughter.\n\nI hate the idea of my wedding album giving her anxiety. So I have emailed the photographers the situation and asked for admin rights to the Web page. I have then gone through every photo and deleted any that included my mum, including the family photos she did agree to be in prior to the wedding (for those of you who seem to think I sprung this on her). \n\nNo one will be able to see them now. Have I kept them secretly for myself? You're damn right I have, and when my mum one day isn't here they will be the only photos I have of her. I'm going to treasure them.",
 "created_utc": 1701034480,
 "permalink": "/r/AITAH/comments/184lk8i/wibta_if_i_didnt_delete_the_photos_of_my_mum_from/",
 "score": 122,
 "url": "https://www.reddit.com/r/AITAH/comments/184lk8i/wibta_if_i_didnt_delete_the_photos_of_my_mum_from/",
 "comments": []
}