{
 "submission_id": "184lk8i",
 "title": "WIBTA if I didn't delete the photos of my mum from my wedding day?",
 "selftext": "My mum is vehemently against being in any photo. I think the last willing photo of her is from the 90s when I was a baby.\n\nThe weird bit is that shes a really beautiful woman but she gets so self conscious about being in a photo. There have been huge arguments about this from various family members but she's never swayed.\n\nOur family has zero Christmas, holiday or birthday photos. No pictures from events or parties, because my mum won't be in the same room as a camera on the off chance it snaps her.\n\nFor my wedding, she promised she'd be cool about it. But she did buy a massive (and I mean massive) hat that covered half her face and all of it if she looked down. This was clearly her safety net. \n\nExcept my photographers were onto her, and a few full face photos have made it through into the album. This is probably the only photos I have of my mum in the last 30 years. She looks stunning in all of them. \n\nAnyway, I get the link to the album and warn her she's in some photos. She doesn't want the link and doesn't want me to give the link out to anyone else. I try and show her a few shots where she's in them but you can't really see her face to show her how nice she looks, but it makes things worse. \n\nWithout her knowing, my husband obviously sends the link to his family, I send it to my bridesmaids and just give my family the highlights for my mum. \n\nWell, that wasn't enough, and my brothers just told me that she's been sobbing all day knowing these photos exist and she wants them deleted. She been sat crying all day and has been miserable about this since I told her I'd gotten the photos. \n\nWhat do I do? I don't want her to be sad, but it feels like she's being totally unreasonable and honestly, dramatic.\n\n What can I say to make it better or to make her see reason? Do I just delete every photo that she's in? I cant take them off the link as it's just a hidden page on the photographers website.\n\nTLDR my mum hates any picture where she's in it so wants me to delete a chunk of my wedding photos, I have zero pictures of my mum and want to keep them.\n\nEdit: fixed spelling\n\nEdit 2: I just went to see my brothers exact text, it was:\n\n'Could you please not include a close up of mum in your wedding album? She's really sad and has been crying all day.' \n\nAnyone who knows the photographers website can get to our album - and there is ONE close up of her face out of 1000 photos. \n\nI think temptation has won over and she's gone to check out the pictures herself. \n\nIf I'm right, I have no control over that website and couldn't delete the photo even if I wanted to unless I reached out to the photographers. But that's crazy and if its the case I really really don't want to do that.\n\nEdit 3: okay, so final update. Thank you all for your advice and it did help me understand and have more sympathy of my mums phobia. Special thank you to those who felt the need to call me an awful daughter.\n\nI hate the idea of my wedding album giving her anxiety. So I have emailed the photographers the situation and asked for admin rights to the Web page. I have then gone through every photo and deleted any that included my mum, including the family photos she did agree to be in prior to the wedding (for those of you who seem to think I sprung this on her). \n\nNo one will be able to see them now. Have I kept them secretly for myself? You're damn right I have, and when my mum one day isn't here they will be the only photos I have of her. I'm going to treasure them.",
 "created_utc": 1701034480,
 "permalink": "/r/AITAH/comments/184lk8i/wibta_if_i_didnt_delete_the_photos_of_my_mum_from/",
 "score": 251,
 "url": "https://www.reddit.com/r/AITAH/comments/184lk8i/wibta_if_i_didnt_delete_the_photos_of_my_mum_from/",
 "comments": [
  {
   "comment_id": "kawkcdm",
   "message": "Just email your photographer and have her remove those few pics from the gallery. You can save the digital files for yourself.",
   "created_utc": 1701041978,
   "score": 25,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawl4t4",
   "message": "Run a background check and find out what kind of warrant is out for her that she's running from.",
   "created_utc": 1701042294,
   "score": 130,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawyxz3",
   "message": "I understand your mom's reluctance (to an extent). I'm retired LE, specializing in Domestic Violence/Family Law. Back in the early 2000s, a guy broke into my place, getting so far in he got dirt \u0026amp; grass on my sheets (window above bed). Since he had thought out the break in (evidence showed this), they never knew if he was a rando, or if it was related to my job. Since before then, I'm reluctant to be in any pictures, because of my job. The police also suggested I do not put pictures of me on the Internet. This doesn't bother me at all, but many friends/family are upset with me. Every time a camera comes out, I ditch. Most people understand, but a LOT don't. The ones that don't, I just ask if their picture is worth my life. If not, then don't take the damn picture!",
   "created_utc": 1701047831,
   "score": 53,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaw1ohi",
   "message": "Don’t show those photos to anyone again.  Give her the privacy she needs.  Tell her no one will see them.  They are locked up until she dies.  \n\nBut you treasure those photos!!!!  \n\nI do, as you seem to wonder why she is afraid of photographs.",
   "created_utc": 1701034960,
   "score": 58,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxl98r",
   "message": "Has she always been like this? Or is it new?\n\nI think people here are being too harsh. I used to have a similar issue (it’s still hard for me) and it is an absolutely miserable feeling. Women are taught their appearance is their whole worth. So when you don’t like your appearance, you feel absolutely worthless. I’m mostly better but my mom is still like that. \n\nMy mom has always refused to be in any photos which made me sad since I have no photos of her. She’s my mom. I want her to be happy and don’t want to make her sad. At her age she’s probably not going to radically change her mindset on this. People would post pictures of her publicly (Facebook etc.) which made her super upset and uncomfortable.\n\nI told her when she dies I’ll have no photos of her and she understood how I felt. So I make sure to plan around it, so that I can have the photos. \n\nBefore I take a photo, I let her know “I’m not posting it or sending it anywhere, it’s just for me”. Now I’m the only one who’s allowed to take her picture because some people will tell her that and then post them behind her back. But at least I have photos of her.",
   "created_utc": 1701057681,
   "score": 6,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaw6mch",
   "message": "NTA a bit... This is seriously odd. In a movie she would be on a witness protection program, or a secret assassin. Assuming it's not that then this is a phobia, and it shouldn't control anyone's life but her own. What does she do when she goes outside? My nearest quite small supermarket has 66 CCTV cameras inside, including 2 on every till. (I asked one of the store guys 'cos it seemed a lot. He told me every part of every shelf is covered at least once.) I'm sorry for your mum, this fear or self loathing must be horrible for her too, but she needs help, not to have herself hidden from all family occasions. But for now, remove the photos, but don't delete them.",
   "created_utc": 1701036766,
   "score": 53,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaw1odw",
   "message": "NTA. It's her responsibility to get her issues addressed. You don't have to delete valuable moments from your life to appease her. \n\nI could be more understanding if she has been in an accident that caused some disfigurement she can't get fixed or she had recently gained/lost a lot of weight due to stress/trauma... This though has been 30 years of her expecting others to bend to her and losing out on memories.",
   "created_utc": 1701034959,
   "score": 124,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxveid",
   "message": "im so glad this is not my life bc wtf",
   "created_utc": 1701063157,
   "score": 5,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax00wj",
   "message": "\u0026gt;My mum is vehemently against being in any photo  \n\u0026gt;  \n\u0026gt;I get the link to the album and warn her she's in some photos. She doesn't want the link and doesn't want me to give the link out to anyone else. I try and show her a few shots where she's in them but you can't really see her face to show her how nice she looks, but it makes things worse.\n\nya know, its okay for people to not want their photo taken, its their choice. just like parents who don't want photos of their kids online. what do we do? we respect their decision.\n\n\u0026gt;Without her knowing, my husband obviously sends the link to his family, I send it to my bridesmaids and just give my family the highlights for my mum.\n\n\\^that is not respecting your mothers decision on having her photos taken. the ones she was in you should have kept private/to yourself and asked the photographer to make edited versions of the ones shes in to send out (IE: remove her or blur her out)\n\n\u0026gt;She been sat crying all day and has been miserable about this since I told her I'd gotten the photos.\n\nyeah cuz you betrayed her trust and showed her massive disrespect. you should have kept those photos to yourself and talked to the photographer!\n\n\u0026gt;No one will be able to see them now. Have I kept them secretly for myself? You're damn right I have, and when my mum one day isn't here they will be the only photos I have of her. I'm going to treasure them.\n\n**\\^WHAT YOU SHOULD HAVE DONE TO START WITH!**\n\nYTA",
   "created_utc": 1701048266,
   "score": 19,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawoagw",
   "message": "Is it possible that your mum is in a witness protection program or is on the run from something? It’s very odd behavior.\n\nEdit: NAH I guess? You gave her a heads up. It’s common knowledge that the mother of the bride will be in some pictures during the wedding. Seems she either changed her mind or is worried because it’s on the internet… I still think she’s hiding from someone… maybe an abusive past lover or something? Idk. Anyway, NAH",
   "created_utc": 1701043560,
   "score": 14,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawuobg",
   "message": "We’re all about respecting boundaries, right. If Mum says don’t photograph me, that’s her boundary and I don’t get why you would try so hard to encroach on that. I hate being in photos. I don’t like them and my family know I don’t. It took me a while to get my photographer husband to accept that, but he has. No one NEEDS a photo, and those of us who don’t want to be photographed should be left alone. I will admit at some weddings I have stood for photos but only because it would cause more distress and embarrassment to continually refuse than to just stand in the group. Still hate it though. YWBTA",
   "created_utc": 1701046139,
   "score": 31,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxq66z",
   "message": "You shouldn't have told her and just kept those of her for yourself! She didn't need to know, now she is going to be sweating bullets worried about the bad men after her! Mafia? Russians? :D Witness protection is blown now! You can have him delete her photo but have one for yourself that she does not know about! It's not rocket science here, she is scared for a reason. Listen to her! You have no idea about her past do you? Does she ever speak of her youth?",
   "created_utc": 1701060152,
   "score": 4,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kay2icm",
   "message": "I’m glad you kept the photos (quietly) for yourself to enjoy, while taking them off the public site for your mum’s peace of mind. Her phobia sounds intense and it’s hard to reason or argue with a reaction so severe and obviously intellectually disproportionate. But you’ll want those memories in the future and it’s important to hang on to them. ❤️ It sounds like she tried her best on the day to be in pics for you and you’ve tried your best to support her afterwards. NAH.",
   "created_utc": 1701067862,
   "score": 3,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawfm3b",
   "message": "just respect her boundaries man there’s clearly something going on. i totally understand its your day and you want your mom apart of that but she’s hysterical over this and you’re so whatever about it. try talking with her about whats going on and see if she can get into therapy if shes not already. something clearly happened that made her fear being photographed and it doesn’t matter if its a small or big reason why because it’s seriously messing with her and those around her. my mom hated having photos taken of her too and it is so. frustrating. especially after they pass. so id say hang on to that photo you have of her bc itll be important to all of you one day after she passes on but dont share it around. just communicate and respect her. also respect that she just hates being in photos.",
   "created_utc": 1701040149,
   "score": 22,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawt23n",
   "message": "YTA for (before the edits) keeping the photos of her in the official album and sharing those photos to others when you knew the distress it would cause her. I understand wanting to have photos of your mother to keep for yourself but sharing them against her consent is extremely inconsiderate.",
   "created_utc": 1701045493,
   "score": 11,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawzoqd",
   "message": "\\\u0026gt; Except my photographers were onto her.\n\nI'd go with YTA. Yes her boundary is quite weird but it's weirder that you try to force her hand like that. You could have asked for a private shoot, you could have warned the photograph not to shoot her, you could have asked for the photo to not appear online...",
   "created_utc": 1701048128,
   "score": 14,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxt1vy",
   "message": "YTA\n\nShe has made her feelings very clear and you deliberately ignored them.  She made accommodations son that it would not interfere with your wedding and you took advantage of that fact to do something that you knew she would not like.  You then rubbed her nose in what you did.\n\nThat is all incredibly inconsiderate.  It doesn't matter why she doesn't want to be photographed.  It doesn't matter what she looks like.  All that matters is that she doesn't.  \n\nWhat you did was just mean.\n\nYou say you can't control what is up there \"unless I reach out to the photographer\". So reach out to the photographer.  That is pretty simple.  You should have told the photographer to not take close-ups of you mother to begin with.",
   "created_utc": 1701061763,
   "score": 6,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax5atb",
   "message": "I can’t stand to be in photos and my friends and family respect that. There was one of me in my daughter’s wedding and it still makes me physically ill when I think about it.",
   "created_utc": 1701050467,
   "score": 11,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawza1f",
   "message": "I wonder if she is running from something. It would have obviously been many decades ago but this type of reaction makes me think she has a secret she wants no one to know about.",
   "created_utc": 1701047964,
   "score": 6,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawzrhj",
   "message": "YTA, for sharing the pictures of her.  I totally support you having pictures of her taken and keeping them to yourself but sharing them when you knew that she absolutely hated having pictures of her taken and that it would definitely get back to her makes you an asshole.",
   "created_utc": 1701048160,
   "score": 7,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawtf6h",
   "message": "Good update. I would have done the same. I know you don’t understand (and I don’t either tbh) but it’s about bodily autonomy and that is so important to respect. I fully agree with your decision to rectify it as much as you can but keep copies for yourself. When the inevitable day comes you can put them out to bring you comfort but for now treasure them in private. You’re not a bad daughter at all!",
   "created_utc": 1701045644,
   "score": 7,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawbvuj",
   "message": "Except my photographers were onto her, and a few full face photos have made it through into the album.  Why didn't you tell them not to 'be onto her'?",
   "created_utc": 1701038757,
   "score": 14,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawmjhn",
   "message": "NTA\n\nDon’t delete them. You’ll be happy you have them when her day comes.",
   "created_utc": 1701042853,
   "score": 16,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawz5l2",
   "message": "Not to be paranoid or anything, but your mom might be a secret agent and is depending on you to delete her pictures so that the NSA doesn’t find her.  Shhhhhh.",
   "created_utc": 1701047915,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaykex3",
   "message": "Y’all need therapy",
   "created_utc": 1701082161,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax1522",
   "message": "No, don’t delete them. You’ll be happy you have them. You can however not display any of the ones with her in them.",
   "created_utc": 1701048724,
   "score": 7,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaw1paf",
   "message": "Let her be sad. That day wasn’t about her. And neither are the pictures.",
   "created_utc": 1701034969,
   "score": 15,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax92gw",
   "message": "Save the photos for yourself. You’re going to want them when she passes away, I promise you",
   "created_utc": 1701052111,
   "score": 4,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxcwjn",
   "message": "Woah. You can keep them yourself just not share? Why is this open source? You can make some private as I assume you paid. You own them.\n\nYour husband is a thoughtless AH. You both knew.",
   "created_utc": 1701053817,
   "score": 3,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxzynv",
   "message": "Yta… She let you take the pictures but Why are you passing the pictures around. After I got outta real bad dv relationship  I was so scared of being photographed or someone posting a picture of me online.",
   "created_utc": 1701066072,
   "score": 4,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawe5ml",
   "message": "NTA\n\nIs there any chance she is a notorious criminal and in the witness protection program?\n\nIf not, she sounds nuts.",
   "created_utc": 1701039607,
   "score": 7,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawongq",
   "message": "NAH. I totally get that you wanted pictures of her on your wedding day. Especially when photos of her are so rare. \n\nYour mom has issues with pictures, though. No matter how beautiful she looks in them, how how much people flatter them, she is not going to like them. I won't speculate on why she feels this way, just realize you're not going to change her mind. Her reality is pictures are horrible for her. You've just got to accept that this is the way she is. Maybe gently suggest therapy if you think she'd be receptive, because I don't feel like this much hatred of photos is reasonable. (And I strongly dislike having my picture taken also, so I get her to a point.)\n\nYou did the right thing getting the photos removed from the site. It sucks but it's what's best for her mental state obviously. And 100% keep those pictures. Put them on your phone so you can look at them whenever you want. For now you can keep them to yourself and enjoy them and the memories.",
   "created_utc": 1701043702,
   "score": 5,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax25b2",
   "message": "I hate being in photos\n\nIt’d hurt to have family who cared more about a photo than my own feelings \n\nYou could have told your photographers to start",
   "created_utc": 1701049131,
   "score": 6,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxehbq",
   "message": "Phobias are by definition irrational, so it’s not super weird. That said, who knows what the root is. \nMy brain automatically went to thinking she ran away from something and doesn’t want to get found, but I probably watch way too much true crime.",
   "created_utc": 1701054531,
   "score": 3,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawfiz6",
   "message": "NTA. Don’t delete it. When she has passed, you will have a photo of her.",
   "created_utc": 1701040114,
   "score": 8,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawoycf",
   "message": "NTA. Get prints made for yourself and ask the photographer to hide the rest. But she’s ridiculous.",
   "created_utc": 1701043820,
   "score": 7,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaws2qv",
   "message": "NTA at all. I despise being photographed on a phobic level but I do it anyway. It’s the only way to keep cherished family memories alive. Your mother is taking this too far. You were married and that’s an important milestone event for you and your families. She needs to suck it up and let things be. If she doesn’t want to have photographs that show her face, she doesn’t have to display them. Everyone else has a right to have those memories, regardless. I would suggest a therapist to help her find a way to manage her phobia.",
   "created_utc": 1701045078,
   "score": 4,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawafy8",
   "message": "Yta. No matter if she is considered beautifull or not, she has a right not having photos of herself spread every where. It might be discussable why she doesnt even want you to have pics of her as you are her daughter. But even if its your wedding you have no right to give her photos to anyone else without her permission.",
   "created_utc": 1701038210,
   "score": 10,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxe6fd",
   "message": "The amount of ableism in these replies is absolutely wild. I do not trust a single goddamn one of y'all voting not the asshole with boundaries or mental illness situations. Y'all would set fireworks off near a vet with PTSD because 'iT's ThEir ProBlEm'. The photographers actively and purposefully sought out the mother who ***clearly*** did not want her picture taken. OP even says in a comment that she was fine with that because she wanted a picture, and that was clearly more important. \n\nThe mother didn't ban photographers from the wedding. She *simply* asked to not have her picture taken.\n\nYou're all awful. And this sub is generally pretty good about this shit. But y'all're saying some shameful shit. If anything, blame the family for never setting their own boundaries and getting it to this point.",
   "created_utc": 1701054394,
   "score": 6,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaw1xzc",
   "message": "NTA it's your wedding not hers, she doesn't dictate what photos you choose to keep. You don't have to send her any copies. She needs to stop being selfish, this is for you, especially when she passes some day.",
   "created_utc": 1701035059,
   "score": 5,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxiue5",
   "message": "Is she in wit sec?",
   "created_utc": 1701056540,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxk0xn",
   "message": "So these photos she ok’d, under her assumption she was going to slyly render herself invisible, but it didn’t work. But then you tried to push the results on her when she didn’t want to see them and you know she has an extreme irrational phobia. Then your husband and you distribute.\n\nIt’s a real mild ESH to me. She has a wild phobia and has let it impact her whole family. She needs to see therapy about that. But you knowing her phobia tried to rub it in her face, kinda like waving a spider at someone with arachnophobia. That’s not nice either. The distribution side of things, well that’s just bound to happen - no one has wedding photos without sharing them really and everyone in the party probably wants their own, and you want a record of the event you can show people, and so that’s just reality.\n\nA little more sensitivity to her issue would be nice, and maybe she can work on it with a professional because this is impacting your lives. I wish you all the best and congrats!!",
   "created_utc": 1701057096,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxb5nq",
   "message": "Your mother needs professional intervention",
   "created_utc": 1701053035,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxif0d",
   "message": "Holy hell she needs therapy. I feel bad for her, that’s terrible",
   "created_utc": 1701056335,
   "score": 3,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxpvh2",
   "message": "yes. YTA.",
   "created_utc": 1701059991,
   "score": 3,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxv8ml",
   "message": "I hate having my photo taken but I also realize for my children and grandchildren and at other special events, it’s not about me.",
   "created_utc": 1701063056,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawyev9",
   "message": "YTA delete the full facial photos of her. You should have told the photographers beforehand to avoid her as much as they possibly could manage.",
   "created_utc": 1701047619,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxak7q",
   "message": "I’m saddened that you can’t have the full family photos because of this. But this phobia is not normal. Your mother would do well to speak to a therapist about this and see where this is coming from. If it’s body dysmorphia, she may need professional help.",
   "created_utc": 1701052772,
   "score": 2,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawsdn9",
   "message": "I just want to say that I have always been in this same bizarre boat. My mom absolutely refuses to be in any picture. I have none of her. My aunt was able to snap one a few heads ago and has it up in her home, and my mom will no longer go there. \n\nIt’s such a frustratingly sad situation to be in. NTA",
   "created_utc": 1701045205,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawsnpw",
   "message": "NTA. My grandmother was like this, the only photos I have that I cherish are the ones from my wedding.  Don't delete them.",
   "created_utc": 1701045324,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaww5pk",
   "message": "Yeah, it sucks, but it honestly reminds me of my own mom. She does not want her picture taken and be shown to strangers or my future in-laws because of past trauma (thank u biodad and internet creeps). However, we have plenty of pictures of us as kids with Christmases and birthdays, she's just not in them unfortunately, but understandable bc of her past trauma. I'd go with NAH for ur situation because idk if ur mom has any sort of similar trauma that she went through.",
   "created_utc": 1701046734,
   "score": 0,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaykl0i",
   "message": "NTA\n\nYour mom is being completely unreasonable and insane. None of this is an appropriate way to react.",
   "created_utc": 1701082292,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawyebb",
   "message": "I hate having my pic taken, but I'm not going to tell you to get rid of it or get mad at you for having them. Now if it's a cultural thing, like taking a picture will steal your soul, then maybe deleting them pictures would be for the best.",
   "created_utc": 1701047613,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxmhzd",
   "message": "Your mother needs counseling in the worst way.",
   "created_utc": 1701058288,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawz5w3",
   "message": "Responding to your updates. I think you did great. So she doesn't want anybody to be able to see her or any other reason to not have photos online, that's reasonable and her choice to make. \n\nBut also definitely keep the photos personally yourself. For your own memories later on, etc. \n\nShe definitely has some sort of illogical phobia. Because realistically, if she was present, people saw her, so what's the difference of a photo except maybe that she also herself can now see herself. Does she also have an issue with mirrors? \n\nBut choosing to do what you can to respect her in this is a great way to show you love and respect her as a person. It doesn't hurt you to get the photos removed from online. Then just don't mention the photos you've kept in event of her eventual inevitable death, even if 40 years in the future. \n\nI have a friend who doesn't love photos of herself, she's self conscious and I get that. She's consented to being in some, especially for special occasions, but otherwise avoids them. I'm glad to have some photos of her and our friendship for the memories.",
   "created_utc": 1701047919,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxu3ae",
   "message": "It's her face and she doesn't want it to be photographed. Of course it's your photos and you can choose to keep it but you will lose something else. It's not worth keeping it. NAH",
   "created_utc": 1701062364,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kay29km",
   "message": "I had a sweet friend who didn’t want certain pictures taken for example when we went parasailing and when she passed away I found the photos the staff there had taken.  I’m thankful for them now and I don’t show them to anyone.",
   "created_utc": 1701067689,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kay85gf",
   "message": "My mom was a heavy set woman. She didn’t like having her photo taken but she would still let it happen. When I was quite young around 7/8 the right side of her face was paralyzed by bels palsy. After that basically no photos were taken of her. She passed at 58. I only had one photo of just me and her together where I was old enough to remember the moment. A Polaroid I cut down to fit in my wallet. When I lost that wallet I was crushed. I had $400 that wasn’t mine in it but that didn’t matter. I just wished I could have that picture back. Cherish the photos and time you have with someone.",
   "created_utc": 1701072087,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaylt6d",
   "message": "YWBTA. Thank you for the update that you are willing to compromise. I have this same phobia and it’s difficult to navigate in a social media obsessed society.",
   "created_utc": 1701083249,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaynthi",
   "message": "\u0026gt; Except my photographers were onto her, and a few full face photos have made it through into the album\n\nIt's this line. This fucking line. Your edit can't save this bit. \n\nThe way this is worded is downright offensive, \"onto her\"? So they specifically went out of their way to photograph the person *clearly* incredibly anxious or straight up phobic of their picture being taken? Did you have them do that? Sounds like it. \n\nWhat the actual fuck. YTA.",
   "created_utc": 1701084750,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawht4a",
   "message": "YTA - what an awful daughter you are. You knew her boundaries and stomped all over them.",
   "created_utc": 1701041000,
   "score": 246,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawvcr1",
   "message": "NTA. It was your wedding, you get to decide what happens.",
   "created_utc": 1701046411,
   "score": 0,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax12gw",
   "message": "NTA, your mum needs therapy and needs to stop making her issue everyone else's. Way to take the attention and shine off your own daughters wedding day.",
   "created_utc": 1701048696,
   "score": 253,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawtso6",
   "message": "Wow! Is she in WITSEC or something? You would NBTA without further explanation.",
   "created_utc": 1701045790,
   "score": 255,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawu3uy",
   "message": "NTA, she's weird as fuck and totally unreasonable. She should talk to a professional.",
   "created_utc": 1701045911,
   "score": 253,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax2my3",
   "message": "NTA.\nAlthough your husband should have communicated before hand.. but it seems your mom has some serious issues about how she views herself and should see a therapist if this is that upsetting to her.\nSave the pictures for your private eyes only. Photos are memories and one day you will need these pictures to show future children what their grandma looked like if they don't know. \nPictures keep memories alive.",
   "created_utc": 1701049340,
   "score": 0,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax7uyw",
   "message": "She  might  be hiding from an abusive ex.",
   "created_utc": 1701051584,
   "score": 0,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxu0wl",
   "message": "NTA\n\nI don't know what your moms issue is, but I am very similar. Not to the point of sobbing over it, but I do not like my picture taken, AT ALL, by anyone for any reason. To the best of my knowledge, the only photo that exist of me in the last 20 years outside of security cameras is my driver license photo.\n\nIt's a little different for me though I guess because I am not married, have never been married, most likely will never be married, and have no family or kids.",
   "created_utc": 1701062324,
   "score": 0,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kawtkuc",
   "message": "NTA\n\nIf she steps out of the house in a modern city, she is recorded daily. Her phobia is not on you to cater to. She needs to seek professional help with that one. \n\nYou went above and beyond already IMO.",
   "created_utc": 1701045707,
   "score": 252,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxi7im",
   "message": "I want to say yta but I would be a hypocrit. I have 1 photo of a woman who was like a mother to me. I snuck a quick shot of her watching my youngest daughter eat ice cream. Its one of my most cherished pictures. She passed away years ago now.",
   "created_utc": 1701056239,
   "score": 0,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxejo2",
   "message": "NTA, she said she’d be cool about it at your wedding so it’s a little late to trash your wedding photos. I’d tell her unless she can explain to you a security issue she needs to stop carrying on.",
   "created_utc": 1701054560,
   "score": 254,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxwn4b",
   "message": "YTA.  You should have made sure the photographers didn’t even get any of her like that. You said they were on to her. You should have made clear how she was and she was off limits. Don’t be selfish and keep, be respectful and all copies deleted. You don’t need pictures to remember your mother.",
   "created_utc": 1701063916,
   "score": 255,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kax7f8e",
   "message": "Is she in witness protection? Hiding from a dangerous ex? She may have reasons you can can't even guess. Why can't you take her to seriously.?",
   "created_utc": 1701051391,
   "score": 255,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kay0kii",
   "message": "YTA. It doesn't matter what she looks like, being in photos is clearly a huge issue for her. And for your sake, she met you halfway with it for your wedding. She was caught unawares and ended up in a photo. I can understand wanting a photo of your mom, and in your shoes I would've done the same. She didn't know of it's existence, so you could've just saved it for yourself and not let anyone know. \n\nYou're TA for sharing the link **especially while knowing how big of a boundary it is for your mom**. You could've waited until you get the finished photos or save the best picks and then share those on your own, and edit your mom out of the published versions and keep the full ones to yourself. That way she would've been none the wiser and you could've just kept the photos of her to yourself without causing any distress.",
   "created_utc": 1701066486,
   "score": 254,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaxhkc1",
   "message": "Hi. Congratulations! I wish you and your new family of 2 all the best!\n\nYour mom needs therapy. She seems to have some kind of dysmorphia going on. There might be other areas of her life that are really messing with her enjoyment of living that are less obvious. But she needs help.\n\nGood luck to you all!",
   "created_utc": 1701055947,
   "score": 252,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kayv8th",
   "message": "Keep them to yourselves, why are you sending it around?! Sheesh\n\nYTA for trying to force her to see them and also sending it around. Privacy people.",
   "created_utc": 1701089505,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kayvb9z",
   "message": "It sucks your moms like this, but everybody has their quirks. She’s still your mom try to respect her wishes.",
   "created_utc": 1701089544,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaywp11",
   "message": "I don’t like pictures of myself. When I see me, I see my mother’s face looking back. This is not something I like reminding myself of.",
   "created_utc": 1701090314,
   "score": 1,
   "submission_id": "184lk8i"
  },
  {
   "comment_id": "kaywq7x",
   "message": "I hate photos,I don't care if someone else thinks I look great/beautiful/stunning blah blah. I HATE THEM. \n\nTake photos of the rest of you, but please respect my choice not to have photos of me. I absolutely hate when ppl take a pic and send to others. If I take a pic and send it to you thats my choice.\n\nRespect her boundaries. If you really wanted to keep one of your mum you should have kept it and never shown anyone or mentioned it. Of course get the photographer to take pics down. Such a. Blatant disregard for your mother's feelings and privacy.",
   "created_utc": 1701090332,
   "score": 1,
   "submission_id": "184lk8i"
  }
 ]
}