{
 "submission_id": "184q2wj",
 "title": "AITAH for telling my (21F) family that my partner (21M) forced me to do a paternity test?",
 "selftext": "My partner and I have been together for over four years and I recently gave birth to our daughter. We had kept the pregnancy to ourselves till our baby was born happy and healthy due to worries about complications as I faced a high risk pregnancy. \n\nWe told our families after she was born, while my family was ecstatic, his was questioning if we hid it for ulterior reasons (they’ve always heavily disliked me and believe I’m just with their son for money.)\n\nYesterday we took her to meet her grandparents from his side and, after some polite conversation, they dropped the bomb that they would be doing a paternity test that he agreed to. To not make myself look suspicious I agreed to it but afterward made it clear to my partner that I felt incredibly disrespect. Cue an argument where he told me it wasn’t a big deal if it was his and that the test was requested for by them to ease their uncertainty.\n\nFast forward to today, I was having lunch with my mother and told her about the incident which left her pissed off and calling my partner a couple of names for insinuating I could’ve cheated. My mother ended up telling my grandparents who in a rage told him they would no longer accept him in their house for disrespecting me in such a way when the child is practically his twin.\n\nWe had another argument about it and he screamed saying i ruined his image by telling them. AITAH?\n\nEDIT : Some of you are concerned about the hiding my pregnancy part so to clarify. My partner and I live a couple hours away from our families since we live by his university and typically only see each other on holidays and specials events. On top of that I have a very petite figure and had a rather small bump up until I gave birth so I was hardly showing as is which made hiding it a lot easier. Hiding it was a personal choice as I faced horrible anxiety due to constant bleeds throughout my pregnancy which made me fear the worst.",
 "created_utc": 1701046068,
 "permalink": "/r/AITAH/comments/184q2wj/aitah_for_telling_my_21f_family_that_my_partner/",
 "score": 211,
 "url": "https://www.reddit.com/r/AITAH/comments/184q2wj/aitah_for_telling_my_21f_family_that_my_partner/",
 "comments": []
}