{
 "submission_id": "184s28f",
 "title": "AITAH for breaking up with a guy because my son didn't like us together?",
 "selftext": "I've been going out with Dave for 3 months now. We knew each other through school events as we both have kids who go to the same school and also a few mutual friends.\n\nWe started dating when one day he asked me out of the blue and after a great few first dates, we'd see each other a few times every week. I have two sons and of course being a new relationship I didn't formally introduce Dave to them even though my oldest already knows who he is.\n\nThe closest thing to that was a festival where my kids, my cousin and myself went. Dave was also there with his family and we just waved each other hello. Then while the kids were playing a shooting game while I was just standing to the side watching, Dave popped up and we chatted for a little bit.\n\nFrom there my son asked about him and I confirmed we were dating. That was 6 weeks ago and my son didn't seem to be bothered by it.\n\nLast Tuesday my son outright told me he doesn't like me dating Dave and begged me to ''please find somebody else.'' I asked why and I asked if there was a problem with Dave and said he just didn't like me dating him. I probed a bit further but he wouldn't budge. He just kept saying he didn't like me dating him and the more he repeated it the more upset he was getting. His eyes were even getting red\n\nSo seeing he was serious about this and this being just a casual relationship, I broke it off with Dave the next day. He obviously was dissapointed and kept asking for a reason and being a casual relationship I figured I was entitled to keep the reason to myself.\n\nSo I just told him we've been going out the last few months to test the waters and that through no fault of his own or mine I wouldn't be able to commit to something serious. He asked if I was trying to patch things up with my ex. I told him it wasn't that but he didn't seem convinced.\n\nIt wasn't my job to convince him so I left things at that. \n\nLast night a friend asked me why I broke things off with Dave, I told her and she snapped at me saying I can't let my son ''control'' my dating life and how he was eventually going to get over it. Then she went off on how Dave was in-love with me and this broke his heart.\n\nAnd how its pathetic I didn't even get a concrete reason from my son. \n\nI've been divorced for over 2 years now. Started dating this year and neither of my sons have ever bluntly told him to not date a particular person. My oldest son begging me to do so for the first time is why I so bluntly had to end things with Dave.\n\nAnd I do plan on finding out what his problem with me seeing Dave was but I'm giving him space and letting him tell me when he's ready and when he sees I'm done for good with Dave. \n\nAITAH?",
 "created_utc": 1701051790,
 "permalink": "/r/AITAH/comments/184s28f/aitah_for_breaking_up_with_a_guy_because_my_son/",
 "score": 208,
 "url": "https://www.reddit.com/r/AITAH/comments/184s28f/aitah_for_breaking_up_with_a_guy_because_my_son/",
 "comments": []
}