{
 "submission_id": "184toht",
 "title": "AITA for getting pregnant while my SIL wanted to get pregnant but my brother wasn’t ready",
 "selftext": "My brother (26M) and I (24F) are no contact because his wife hates me for having a baby. \n\nLast Christmas, my boyfriend (now my husband) and I went to go hang out with my brother and sister in law. My brother and I have been pretty close for the most part and I got along with his wife. While hanging out, my sister in law kept talking about how she wanted a baby but my brother kept insisting he wasn’t ready and that’s why they weren’t trying. I had mentioned that we weren’t trying for a baby but I wouldn’t be upset if I did get pregnant. I had never wanted kids before meeting my boyfriend, who already had a son, and realized that I actually would want to have a baby with him someday, no plans of actually trying at the time though. Everything was fine and normal after that, until a few weeks later when I found out I was actually pregnant. \n\nFast forward a few weeks after finding out and I couldn’t hold back and had to tell my brother he was going to be an uncle. I told him while she was next to him on FaceTime and the energy completely shifted. He was happy for me but his wife wouldn’t say a word. I just shrugged it off until a few days later I noticed she unfriended me on Facebook and then discovered she unfollowed me on all social media. I reached out asking why she couldn’t be happy for me and why my pregnancy made her want to unfriend me. She blew me off and said it had to nothing to do with me being pregnant, despite this all happening after her finding out the news. \n\nAfter awhile I started hearing less \u0026amp; less from my brother, they wouldn’t go to family functions if they knew I was coming, and it had been months since I’d seen my brother. They would go and visit my mom and my mom would tell me what was said about me. My sister in law was saying that I “got pregnant” to be vindictive because I knew she wanted a baby but my brother wouldn’t try for one. She said my name gave her anxiety and after that my mom \u0026amp; brother were no longer allowed to talk about me or say my name around her. I ended up texting my brother after hearing this to defend myself and clear the air to make it clear that my baby was not planned and there was no way in hell I’d get pregnant just to spite someone else. That’s a huge life decision to make just to piss someone off and I’m not that kinda person to begin with. I also added that I’d like to sit down and talk with him to figure out what we can do to get things back to normal. She found out I texted him and that I knew what was said and went off on my mom for telling me what was said. I get her being upset because in a way she was telling my mom this in confidence, but I am also my mothers daughter and with the type of relationship we have, she is going to tell me what’s been said. \n\nAfter 6 months \u0026amp; many texts of me asking to meet up and talk, I finally got to sit face to face with my brother and talk about things. He apologized and listened to me thoroughly and seemed to understand what I was saying, and agreed with me that he just wants to mend things between us. I explained I just want an apology because I had a very difficult pregnancy and a lot of family in general wasn’t supportive of me because I wasn’t married so it’s been hard and lonely. He explained that things will get better and then tells me that now they started trying for a baby. After he told me beforehand he was set on waiting a couple more years. In my opinion, my sister in law is not very stable. She heavily drinks, is not well really, and has been through a lot these last couple of years mentally. I’m not discrediting that because I’ve been there, but that’s no excuse to ban your husband from speaking to and seeing his sister. \n\nNow my brother and his wife are expecting their baby early next year and still won’t talk to me. The last time I saw my brother was at a family members funeral a couple weeks before I was due, which is when he told me they were expecting. He promised he’d come to the hospital to meet my baby. My baby is now 3 months old and he has yet to meet her or even ask about her. He barely keeps in contact with my mom anymore and told her he won’t come visit her by himself, his wife has to be there too. My mom and I have lost all respect for her and no longer want anything to do with her. She’s threatened me and my family, won’t let me see my brother, and won’t even speak to me. I haven’t seen her in a year now. She’s caused a divide in my family and spun it to make me look like the bad guy by telling everyone I got pregnant to spite her. So I finally reached out to my brother one more time saying I’m done trying to fix what I didn’t start, and I think it’s best we don’t talk until he can stand up for me and put effort in to trying to fix this and his wife can get a grip on life. \n\nAm I the asshole for accidentally getting pregnant with the love of my life (my husband now) and having a beautiful baby, then cutting my brother off for good because his wife is jealous and has treated me like shit and he won’t stand up for me?? Cause I really don’t think so.",
 "created_utc": 1701056643,
 "permalink": "/r/AITAH/comments/184toht/aita_for_getting_pregnant_while_my_sil_wanted_to/",
 "score": 169,
 "url": "https://www.reddit.com/r/AITAH/comments/184toht/aita_for_getting_pregnant_while_my_sil_wanted_to/",
 "comments": []
}