{
 "submission_id": "184vi5d",
 "title": "I (M33) will be divorcing my wife (F31) because she feels its dangerous for me to be around our child (F-2 months)",
 "selftext": "My wife always complains about how clumsy I am. I do drop things by accident when my hand hits it unknowingly and so I do agree with her. But its not that bad that I'm knocking over things everyday. I really just laughed this off before when my wife brought it up but during the pregnancy she often started to say how she wont let me hold the child because of how clumsy I am. Again, I laughed it off at times and sometimes when I did take it seriously I told her theres a difference between knocking over the TV remote and dropping a kid from your arms. \n\nStill, I did not think abt it as much. But then my child was born and I was shocked at how reluctant she was to even let me hold the baby in the hospital. I suddenly saw her panicking when I was even around the baby. It caused a lot of fights and they've continued till now. Its been a couple of months and I have not been able to hold my baby more than thrice including once when I held her at the hospital. \n\nShe now sleeps in the other bedroom with the baby and doesn't even let me hold my own daughter even if I am sitting on the bed where there wouldn't even be a remote chance of her ever getting hurt even if I dropped her. She almost never leaves our daughter alone with me. \n\nI suggested I'd use a child carrier to take her on walks but she refuses that too, often times suggesting that I'd tip over and fall face first. \n\nI think she is overreacting and I have also suggested going to therapy together but all she said about the suggestion is \"Talking wont fix your body\".\n\nShe keeps telling me that I'll be the reason that our child would die if I ever held her and as a father I should realize how dangerous it is and comply with her. \n\nAll this has really affected me and I've become a lot more self conscious. Everytime I mess up doing something, she tells me that its proof that what she's saying is right. \n\nI'm a calm person and a pacifist at most times. Even during our fights I've tried to reason with her, find a middle-ground but I've realized that there isn't any. I love my wife and my child more than myself but I cannot continue this considering how I can't even hold my own child, play with her, take her on walks, etc. \n\nDay before yesterday's night, after a fight I snuck into her bedroom after my wife was asleep. I went to my daughter, I didn't hold her, I just held her hand and looked at her. I was emotional and I did whisper a few things to her (not that she could hear or understand because she was fast asleep). But this woke my wife up who was right beside her. She screamed at first and then told me to leave the room immediately. I told her that I was not going to hold her and that I was just there to see her and hold her hand. But she didn't believe me and accused me of being ignorant and selfish. I did lose my temper too and I offloaded these entire two months of frustration onto her. \n\nI feel terrible about how I acted that night. And I'm staying at a hotel as she told me to leave the next morning. I wasn't in a mood to argue either so I quietly left. \n\nI cannot seem to get over any of what has happened. And even though it hurts so much, I think I am going to part ways. ",
 "created_utc": 1701062864,
 "permalink": "/r/AITAH/comments/184vi5d/i_m33_will_be_divorcing_my_wife_f31_because_she/",
 "score": 12,
 "url": "https://www.reddit.com/r/AITAH/comments/184vi5d/i_m33_will_be_divorcing_my_wife_f31_because_she/",
 "comments": [
  {
   "comment_id": "kay6vw4",
   "message": "I used to work on inpatient mental health wards, primarily the mum and baby ward. Your wife is showing some concerning signs of postpartum  anxiety. I’d give your health visitor/midwife/doctor a call and express your concerns before the anxiety manifests itself in more harmful ways. Although preventing a father from bonding and caring for his child is harmful already.",
   "created_utc": 1701071089,
   "score": 136,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay3bno",
   "message": "Talk to a dr. Your wife sounds like she needs help asap",
   "created_utc": 1701068447,
   "score": 52,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaxyej2",
   "message": "Kinda sounds like she has post-partum anxiety or psychosis. Can you talk to her doctor and explain what's been happening?",
   "created_utc": 1701065042,
   "score": 158,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay3go8",
   "message": "Please call your wife’s doctor. This extremely controlling behaviour based on faulty logic js a sign of a post partum mental health problem. You don’t deserve this treatment but your wife’s psychosis puts her at risk of self-harm, suicide or actions that could endanger your baby.\n\nI’m sure you’re sleep-deprived so haven’t noticed the severity of this behaviour but your wife and child are both in danger. It is not uncommon for deaths to happen at this stage, your wife needs immediate psychiatric support.",
   "created_utc": 1701068547,
   "score": 150,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay3968",
   "message": "Your wife is sick, she needs professional help immediately.\n\nEven if you're the most clumsy person on earth, to deny your own partners relationship with their child based on a \"clumsy\" claim is outright abuse.",
   "created_utc": 1701068397,
   "score": 222,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaybqxq",
   "message": "I hope this doesn't get buried. I WAS your wife, after and before I had my child with untreated mental illness related to the baby, so I'm saying this with all my heart to you, PLEASE HELP HER. HELP HER TO HELP THEM BOTH. My husband almost left, several times, but got me help instead. Boy was I resistant, and livid, but I'm better now. If he hadn't helped, I don't know what would have happened, I'd probably not even understand why he left and still be so angry at him.\n\nThere might be no way to help your wife, but she is obviously sick and she and your baby need you more than they know or are able to express. So it might feel thankless but, i think getting her help is the right thing to do.",
   "created_utc": 1701074997,
   "score": 124,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaxygeh",
   "message": "NTA but damn your wife needs help. Call her dr ASAP",
   "created_utc": 1701065076,
   "score": 88,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay42gd",
   "message": "Your wife is not well and needs immediate medical attention.",
   "created_utc": 1701068987,
   "score": 152,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay265g",
   "message": "Your wife needs medical attention. This screams post-partum anxiety.",
   "created_utc": 1701067620,
   "score": 171,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaxx79p",
   "message": "Woah. Your wife's behavior is so off the charts, that I would be more concerned with her hurting your daughter. This situation is serious, and I would speak to a therapist about appropriate next steps, because it's not hard to imagine your wife trying to create a case for you to have no custody. \n\nI'm sorry this is happening, OP. You don't deserve it. \n\nNTA",
   "created_utc": 1701064264,
   "score": 190,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay6yze",
   "message": "If your wife is having mental issues, the baby may not be safe. I would definitely not leave the house. It is your child too. Call your local health department. Tell the agent how your wife is acting. Ask for advice and assistance. The agent should be able to guide you. You can try calling her family doctor or obgyn but with HIPPA I am not sure how far you will get. Has she tried to harm herself or anyone else? Has she threatened to harm herself or anyone else? If yes, you may be able to do a 72 hour involuntary admission to a mental hospital for an evaluation. The person at the health department should be able to advise you on the process to have someone involuntarily committed for a 72 hour in patient mental evaluation .",
   "created_utc": 1701071156,
   "score": 143,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay3jrg",
   "message": "Your wife has severe mental illness and needs to see a doctor immediately",
   "created_utc": 1701068610,
   "score": 104,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayabn7",
   "message": "Another person saying your wife urgently needs to get assessed by her doctor, they will understand immediately if you talk to them about your experiences and will have a process to deal with your wife’s anxiety and fixation.\n\nCan you approach her parents with your concerns, to try and get them on board? \n\nDon’t go into it with the mindset of “I’m being kept from my child and that’s unfair”; go into it with the mindset of “my wife is fixating unhealthily on the worst case scenarios and isn’t in a rational mindset to be able to put reasonable mitigation measures in place to deal with any perceived risk”.",
   "created_utc": 1701073818,
   "score": 62,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay2udx",
   "message": "Dude that is not normal, she practically sounds like she needs to be committed. Talk to a doctor about her behavior ASAP.\n\nNTA",
   "created_utc": 1701068098,
   "score": 120,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay82q6",
   "message": "NTA. At first I was like oh man if you’re actually really clumsy… (I am also prone to wobbling and dropping literally everything) but this is on another level. \n\nMy mother had post partum psychosis, sounds terrifying and terrible, but she didn’t attempt to harm me. She instead was obsessed with keeping me safe. She would allow people to hold me for very short periods of time, but would get very distressed about it. She wanted to see me at all times. This was in 1988 though and all the help she got was to be yelled at by her in laws and parents, and then told they would take me away from her. \nWhich ended her up in a mental ward. Luckily I was allowed to go with, as my mother was like they actually want to take my kid, can we work on the problem with my baby here? Doctors agreed that having me there would be better than not. \nShe got better after a few months, and was never over protective again. She had a normal amount of protectiveness as a parent. \n\nI mention this because of how your wife has been with you just being near the baby. It’s an extreme fear reaction and that’s not normal anxiety. It may have started innocently by being slightly concerned about you dropping things. And it’s turned into “husband = danger” which is where the problem is clearly. \n\nShe needs to see a doctor specifically about her fears, and I believe you both need to go to talk to a doctor. Her because she’s deeply unwell, and you because you need to know what’s actually being said. \n\nI’m so sorry, this sounds really heartbreaking for you. And I just wanna say, as a fellow clumsy person, I hold my niece all the time. From birth! Sure I don’t cart her about as I’m disabled, but I can stand with her in my arms just fine. We play just fine. My best friend/family member is her mother and she’s had some bad anxiety after the birth. But she doesn’t for a moment think I’d drop her kid. There is a difference between a remote and a baby, you’re right. \n\n\nI’m not sure if divorce is the first step before medical care, but it’s your life and your decision.",
   "created_utc": 1701072026,
   "score": 67,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay78yi",
   "message": "Your wife needs help. Get her to a therapist   Her behavior is abnormal. She's already doing parent alienation. Again, she needs mental help and there's nothing wrong with that",
   "created_utc": 1701071371,
   "score": 13,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayd5vk",
   "message": "This is above Reddit’s pay grade. You wife desperately needs professional help, she is sick. Being occasionally clumsy is not a reason to behave this way, and she has let her fears get away from her. I wish you all the luck.",
   "created_utc": 1701076176,
   "score": 38,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay4btc",
   "message": "NTA, but your wife needs help. If she won't see a doctor or therapist voluntarily, and try enlisting her family in this effort.  If that fails, get family services involved.  This is a mental health issue, not a divorce issue.  Best wishes for you both.",
   "created_utc": 1701069183,
   "score": 12,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay9ask",
   "message": "NTA! I'm clumsy to the point that my boss won't let me climb a ladder (I'm also scared of heights, so it's really not a good idea). I drop everything, I knock over shit all the time, and I'm constantly tripping over myself. I have 3 children who have made it 16 and 15 without being dropped (I once pulled my daughter down with me when I fell over when she was about 7, we were on grass and she landed on me anyway.. none of them will let me live that down still 🤣). My friends have never stopped me from holing their babies either.\n\nI do think that your wife may have ppd, though. Once you have both calmed down enough, you need to tell her how this is making you feel. For me, this would be a deal breaker.",
   "created_utc": 1701072990,
   "score": 12,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayy9lt",
   "message": "I am a pretty clumsy dude, that stops when you hold a kid though. \nI have 2 kids now, 10 and 5, and i'm still clumsy 🤷🏼‍♂️, never dropped/harmed one though.\n\nProblem here is your wife",
   "created_utc": 1701091156,
   "score": 10,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay0s3i",
   "message": "NTA, I think she’s in need of therapy cause this is unreasonable.",
   "created_utc": 1701066633,
   "score": 21,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay2lrv",
   "message": "You really need to contact your wife's doctor, because this sounds like postpartum mood disorder, or anxiety disorder, and it needs to be treated or else it's not safe for *her* to parent your child.",
   "created_utc": 1701067930,
   "score": 27,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay6nva",
   "message": "Whoaaaaaa. Yeah she needs to see a doc.",
   "created_utc": 1701070913,
   "score": 24,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaxwg3i",
   "message": "Nta but therapy isn't needed for you. She has issues she has to work thru. Everyone knocks stuff down once in a while.",
   "created_utc": 1701063795,
   "score": 82,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaymg41",
   "message": "Postpartum anxiety sufferer here - Please don’t divorce your wife.  She is 100% mentally ill, and mentally ill people rarely realize they are sick.   My anxiety started before the baby was born, I obsessively carried around a heart doppler and was miserable.",
   "created_utc": 1701083742,
   "score": 56,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay27uz",
   "message": "NTA.\n\nQuick question though, is she this paranoid about everyone or *specifically* you?\n\nIs she closing herself off from friends and family? Is she terrified to leave the baby even to the point of neglecting her own hygiene? Is she more depressed/irritable than she was before the baby or showing more outburst of crying or sudden rage?\n\nIf so, she might have postpartum depression. If that's the case she needs professional medical help. Either therapy, medication, or both. \n\nNone of this is your fault of course, but, to a degree, she might not be in control of her actions. Postpartum does some... Unexplainably terrible things to your mind and makes you act in ways you never thought capable of before. You are within your rights to do as you see fit with your relationship, I'm certainly not saying to stay, but she might need help which, for the sake of your baby if nothing else, you should make sure she gets. If not from you, then at least informing a relative or trusted person in her life.\n\nWishing you all the best either way, and congratulations on your baby",
   "created_utc": 1701067654,
   "score": 91,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayja7h",
   "message": "Unless you are literally the world's greatest Butterfingers, unable to wash the dishes without breaking half of them, then your wife is most definitely experiencing postpartum psychosis. She desperately needs medical help.",
   "created_utc": 1701081253,
   "score": 11,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayxg3r",
   "message": "Man. My heart goes out to you. I cried when I read the bit about just holding your daughters hand.\n\nAs a last resort explain to your wife that in divorce you will get joint custody and then you will get to finally hold your daughter and be able to be her father.\n\nNot that it helps your wife any, but kids are tough. All 4 of mine fell, took huge tumbles, got dropped, all sorts of stuff. Even if you did drop your kid she’ll be fine.\n\nNTA",
   "created_utc": 1701090720,
   "score": 8,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayyjd0",
   "message": "Sounds like post partum psychosis of some sort. It isn't right what she is saying but idk that she is in her right mind either.",
   "created_utc": 1701091296,
   "score": 10,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay2i7n",
   "message": "NTA. It sounds like your wife is suffering from postpartum anxiety and I would be concerned about the lengths she will go to in order to “protect” your daughter. Will life-saving vaccines be too dangerous? Visiting the doctor? Visiting *anyone?* What happens if she suddenly decides that the world is just too unsafe for her baby?\n\nThis kind of behavior needs to be talked about with her doctors because your wife is suffering and doesn’t even realize it. She likely needs medication to help her get through this period, one that can be deeply chaotic due to the massive shift in hormones coupled with this huge physical and life changing event of birthing a baby and becoming a parent.\n\nI’m sorry this is happening to your family and hope you can find a way to help her, but if she refuses it might be time to let the courts handle the legal aspects of you being able to have a relationship with your child and actually getting to hold her. If your wife (or ex by then) puts up too much illogical fight the judge might even be able to force her to see her doctor about this to address what is she is clearly struggling with so she can get back to even keel and your family (whether together or separate after that) can heal.",
   "created_utc": 1701067860,
   "score": 69,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay5p47",
   "message": "She’s either in some kind of psychotic episode or she’s purposely gaslighting you into insanity.",
   "created_utc": 1701070221,
   "score": 18,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay8hcg",
   "message": "Seek out her doctor and explain what’s happening. Get a therapist and a lawyer for yourself. You need to be prepared for her getting vengeful due to her illogical fear of you hurting your own child. I’m sorry and I wish you luck.",
   "created_utc": 1701072347,
   "score": 18,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaydxhv",
   "message": "Post-partum something is happening — depression, anxiety, psychosis, or a combination.  \n\nShe needs to be evaluated ASAP.",
   "created_utc": 1701076820,
   "score": 9,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaye1ml",
   "message": "Do your/her parents know you are not allowed to lift or hold your own baby. I'm sorry but this is ridiculous, she really really really needs help, even if she doesn't want it. She has no right to stop you from bonding with your child,  you can't have skin on skin contact to bond with your baby? This is going on abuse to both you and your baby this is not just an oh too bad oh well situation. Baby's bond through being held by you don't let her fears take that from you, if she were the clumsy one would she refuse to hold her child? Would she let you stop her from doing so? Don't let her do this.",
   "created_utc": 1701076913,
   "score": 8,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kb2fxwk",
   "message": "Vibes of Postpartum anxiety with intrusive thoughts a la OCD, but I worry there's some underlying personality disorder as well. Not enough history prior to baby to hazard a guess. She needs to see her doctor, and if she won't, feel free to notify your baby's pediatrician so they can bring it up organically at the next well-child check.\nShe will no doubt accuse you of scheming to make her look bad, but you're not doing this for you. You're doing this for your daughter. What happens when you're out of the picture and she's got nobody to direct her ire at but her child?",
   "created_utc": 1701140657,
   "score": 10,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaydibt",
   "message": "1. GET BACK INTO THE HOUSE. You were already in seperate rooms but this will be seen as you leaving the family home for your own accommodation and will make it harder if divorce is thrown in.\n2. She needs help. Call the midwives/health care visitor and describe what has happened. They can sign post you or take initial notes about the home situation.\n3. Remain calm and positive. The vent you had is normal but you remove yourself before you blow next time.\nGood luck",
   "created_utc": 1701076465,
   "score": 16,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayn9in",
   "message": "Call her doctor. My Mum was like this. It sounds like post partum psychosis. The whole endeavour destroyed our family. I'm not kidding",
   "created_utc": 1701084347,
   "score": 8,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayp8ib",
   "message": "Get. Back. In. That. House. \n\nThis is not even about losing the house in the divorce. This is about not leaving your actively psychotic wife alone with the baby. \n\nCall her doctor and catch him/her up on **everything.** Call CPS and do the same. Your baby needs help here. \n\nNTA\n\nI wish you best of luck. \n\nGet on the fucking phone now. Don’t wait. This is serious.",
   "created_utc": 1701085750,
   "score": 6,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayuwqm",
   "message": "OP, there's a lot of stories that start like this that end with kids being drowned or otherwise killed. I'm not saying that's going to happen here, but postpartum mental health issues make women do crazy things sometimes. Your wife definitely needs medication, possibly a psych evaluation as well. Not a doctor, but I've seen many female family members go through similar things. She won't get better on her own, it will just continue to spiral and get worse until something catastrophic happens. Don't wait, do it all this morning. Start collecting phone numbers now, start making calls when offices are open.",
   "created_utc": 1701089318,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaz9owz",
   "message": "Call your wife's OB/GYN. She has post partum anxiety.\n\nShe needs help, NOW. This is not healthy.\n\nThat said, until she gets help, I wouldn't leave her. Maternal health is something the US healthcare system completely ignores, it's awful that zero medical professionals have checked in on your wife to make sure she doesn't have post partum complications. You are her only advocate.",
   "created_utc": 1701096563,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kay5u4t",
   "message": "NTA of course. I just felt sad reading your post, your wife has clearly an issue, overreacting at this point is an understatement. I don't know what to tell you, but you shouldn't be so nice about it. You have the right to hold you daughter and spend time with her. If talking with her didn't work for months, unless she suddenly realize how fucked up her reaction is one day, nothing will change. I suggest if you want to hold your daughter, hold her. Regardless of what your wife says. If she can't adjust, file a divorce.",
   "created_utc": 1701070329,
   "score": 17,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaydhxf",
   "message": "First of all this sounds like a warning flag for post partem... speak with a medical professional for advice there. Secondly, you're your child's father, you don't need your wife's permission to hold your daughter. Don't let your wife's apparent issues spoil your time with your child.",
   "created_utc": 1701076456,
   "score": 8,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaydrgk",
   "message": "Try therapy for post partum depression. PPD can greatly impact how a mother treats anyone in her life, even a supportive and caring family member",
   "created_utc": 1701076681,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayduf2",
   "message": "Woah, that is seriously dangerous behavior - please call her doctor ASAP and get her in. I'd be terrified to leave her alone with the baby.",
   "created_utc": 1701076749,
   "score": 9,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayenl6",
   "message": "Since no one is saying it… NTA. I wish you the best of luck with your daughter.\n \nThere’s been a lot of mistakes raising the little one but they don’t get repeated. \n\nDoes your wife not see that a daughter’s strained relationship with her father will manifest dividends later on in life?",
   "created_utc": 1701077423,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayev26",
   "message": "I think your wife has post partum psychosis. Please do seek immediate help. Call health visitor if you have one assigned.",
   "created_utc": 1701077600,
   "score": 6,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayrkt0",
   "message": "You’re wife needs to be committed to a mental institution",
   "created_utc": 1701087306,
   "score": 8,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayvctf",
   "message": "Your wife needs serious medical help, this is not going to stop by itself and will probably even get worse as your child becomes older.\n\nEven if you do end up separating, your wife will still need help. This will be an extreme detriment to your childs emotional and mental growth.\n\nIf she is close to any family, please inform them as to what's going on and how serious it is.",
   "created_utc": 1701089567,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayyfi5",
   "message": "NTA.  Please call your wife's doctor.  She might be suffering from some postpartum mental illness.",
   "created_utc": 1701091242,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kayyjg2",
   "message": "NTA contact your wife’s dr and file for emergency custody immediately.\n\nYou are not the danger to your child your wife is.",
   "created_utc": 1701091298,
   "score": 7,
   "submission_id": "184vi5d"
  },
  {
   "comment_id": "kaykmna",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "184vi5d"
  }
 ]
}