{
 "submission_id": "184vi5d",
 "title": "I (M33) will be divorcing my wife (F31) because she feels its dangerous for me to be around our child (F-2 months)",
 "selftext": "My wife always complains about how clumsy I am. I do drop things by accident when my hand hits it unknowingly and so I do agree with her. But its not that bad that I'm knocking over things everyday. I really just laughed this off before when my wife brought it up but during the pregnancy she often started to say how she wont let me hold the child because of how clumsy I am. Again, I laughed it off at times and sometimes when I did take it seriously I told her theres a difference between knocking over the TV remote and dropping a kid from your arms. \n\nStill, I did not think abt it as much. But then my child was born and I was shocked at how reluctant she was to even let me hold the baby in the hospital. I suddenly saw her panicking when I was even around the baby. It caused a lot of fights and they've continued till now. Its been a couple of months and I have not been able to hold my baby more than thrice including once when I held her at the hospital. \n\nShe now sleeps in the other bedroom with the baby and doesn't even let me hold my own daughter even if I am sitting on the bed where there wouldn't even be a remote chance of her ever getting hurt even if I dropped her. She almost never leaves our daughter alone with me. \n\nI suggested I'd use a child carrier to take her on walks but she refuses that too, often times suggesting that I'd tip over and fall face first. \n\nI think she is overreacting and I have also suggested going to therapy together but all she said about the suggestion is \"Talking wont fix your body\".\n\nShe keeps telling me that I'll be the reason that our child would die if I ever held her and as a father I should realize how dangerous it is and comply with her. \n\nAll this has really affected me and I've become a lot more self conscious. Everytime I mess up doing something, she tells me that its proof that what she's saying is right. \n\nI'm a calm person and a pacifist at most times. Even during our fights I've tried to reason with her, find a middle-ground but I've realized that there isn't any. I love my wife and my child more than myself but I cannot continue this considering how I can't even hold my own child, play with her, take her on walks, etc. \n\nDay before yesterday's night, after a fight I snuck into her bedroom after my wife was asleep. I went to my daughter, I didn't hold her, I just held her hand and looked at her. I was emotional and I did whisper a few things to her (not that she could hear or understand because she was fast asleep). But this woke my wife up who was right beside her. She screamed at first and then told me to leave the room immediately. I told her that I was not going to hold her and that I was just there to see her and hold her hand. But she didn't believe me and accused me of being ignorant and selfish. I did lose my temper too and I offloaded these entire two months of frustration onto her. \n\nI feel terrible about how I acted that night. And I'm staying at a hotel as she told me to leave the next morning. I wasn't in a mood to argue either so I quietly left. \n\nI cannot seem to get over any of what has happened. And even though it hurts so much, I think I am going to part ways. ",
 "created_utc": 1701062864,
 "permalink": "/r/AITAH/comments/184vi5d/i_m33_will_be_divorcing_my_wife_f31_because_she/",
 "score": 139,
 "url": "https://www.reddit.com/r/AITAH/comments/184vi5d/i_m33_will_be_divorcing_my_wife_f31_because_she/",
 "comments": []
}