{
 "submission_id": "184yclv",
 "title": "AITAH for not allowing my mother and grandmother to see our newborn baby until they show me proof of whooping cough vaccination?",
 "selftext": "I am 32 and my husband is 37. I and am 39 weeks pregnant with our first child who will be born later this week after I am induced. \n\nI have asked my whole family to get the whooping cough vaccination if they would like to visit in the hospital or at home before our baby can get her 6 week needles in mid January. \n\nBit of a backstory, my mum has never been the most honest person and put my siblings and me through a bit of trauma when we were growing up. There was a lot of manipulation, verbal and physical abuse. She always played the victim and made my father to be the most horrible person in the world but we realise what she was really like in our teenage years. Please know that I would never leave my child alone with her. I tolerate her because my grandmother lives with her as my mum is her carer and I love my nanna so bloody much. \n\nWhen I originally asked my mum and Nanna to get the whooping cough vaccine. My mum and Nanna to get the whooping cough vaccine, Mum told me they didn’t want to get it. Fast forward a couple of months and Mum claims that they have got it. My Nan a who is an absolute saint says that she has got it and I believe her. The only thing is, I asked for screenshot of proof that they have actually had the vaccination. Mainly because I don’t trust Mum, but I told her that everyone has sent us one. After this, my brother, sister and father have sent us pics of their vaccination records just so that I’m not actually lying to Mum. \n\nWhen I called my mum today to let her know that the baby will be born in the next few days, she said she’d come and see me at the hospital. I said that would be amazing. I’d love to have you and Nana there. Are you able to pretty please send a picture of the certificate just cause they’re the last ones we’re waiting on. She said don’t worry about it, we will just wait the six weeks. \n\nChristmas is supposed to be at my mum’s house which means my husband daughter and I will be spending Christmas at home which is fine because Mum is honestly a horrible person and I realise that I probably sound horrible saying all of this but my siblings and I have had extensive counselling over the trauma, she put us through as children. \n\nMum said I’ve taken all the fun out of her, becoming a grandmother for the first time. She always makes out that she is the victim every single time something doesn’t go in her favour. \n\nSo am I the arsehole for asking for proof of a certificate or she cannot see our baby without proof of whooping cough vax until our daughter is six weeks and gets her needles? We are honestly just trying to protect our baby because she cannot protect herself.",
 "created_utc": 1701074173,
 "permalink": "/r/AITAH/comments/184yclv/aitah_for_not_allowing_my_mother_and_grandmother/",
 "score": 60,
 "url": "https://www.reddit.com/r/AITAH/comments/184yclv/aitah_for_not_allowing_my_mother_and_grandmother/",
 "comments": []
}