{
 "submission_id": "184zayb",
 "title": "I (37M) am being accused by my wife (38F) of not letting her have a relationship with our kids",
 "selftext": "We have 3 kids (7F, 5M and 1M), been married for 7 years and together for 11. \nWe have this recurring argument where she accuses me of not letting her have a close relationship with our kids. \nWhen the 5yo was born, she decided to not breastfeed and he was moved to his bedroom at around 6months. Since my wife is prone to insomnia and has a very light sleep, I was in charge of the great majority of the nights: get up, nappy change, prepare bottle, feed and put him back to sleep. Fast forward 5 years, I am still the one he calls in the middle of the night. Now we have a 1 yo boy that co sleeps with us. Every time the 5yo wakes up, I usually go to his bedroom and stay there for him to sleep or if he comes to our bedroom, I’ll bring him to his and put him back to sleep. \nMy wife says that, since I don’t let him sleep in our bedroom that I am depriving her of that. I do let him sometimes, most of times the little one wakes up and I am told to bring the 5yo to his bed again. Sometimes I just get up and bring him straight to his bed on autopilot really to make the less noise possible. \nLast night, my 5yo comes to our bedroom as always, my 1yo was awake breastfeeding. I bring my 5yo to his bedroom and she snapped. Started screaming that I don’t let him stay with us and I am depriving her of that relationship and I make it on purpose so the kids don’t rely on her. I decided not to engage and brought my 5yo to our bed. An hour later everyone was asleep except for me that was half in half out of the bed. \nAnother thing she brought up was story time. We have a routine every day where we read the kids a story before bed. When the little one was born, since she decided to breastfeed (and I supported her) she couldn’t be there so I read the story for the older ones and put both to sleep. According to my wife, I was making this on purpose so they would only need me and not her. \nMy wife is a SAHM and I work full time from home. I still don’t get how I can have a better relationship with my kids than her that spends all time with them… AITAH for thinking she’s not being reasonable?",
 "created_utc": 1701078345,
 "permalink": "/r/AITAH/comments/184zayb/i_37m_am_being_accused_by_my_wife_38f_of_not/",
 "score": 65,
 "url": "https://www.reddit.com/r/AITAH/comments/184zayb/i_37m_am_being_accused_by_my_wife_38f_of_not/",
 "comments": []
}