{
 "submission_id": "184zpne",
 "title": "Am I the A-H for not wanting to share with my husband?",
 "selftext": "My mom passed away and left some money. My husband knows but I told him I didn't want to put it in our joint account. He went on to say he always shared what he made and supported me while I mostly stayed home with our child who is 18 months old now. I'm also pregnant and due February. I worked off and on since our first was born. I may have been unemployed about 12 months total. My husband makes over 120k/year and is new to this type of income so he feels he has given so much. While he's working for money, I'm providing for our baby, pregnant, keeping the home up, preparing meals, taking care of his dog and I give him a ride back and forth to work. He almost got an inheritance once and said he would share it with me. The state ended up repossessing the inheritance. He brought that up when I told him that I didn't feel safe sharing with him. He also demanded that I share at least half or he would take me off our joint account. He said that he won't trust me if I don't put half into our account. I haven't quite yet received it but I don't feel secure sharing it in our account but I'd happily share it within my control. Am I wrong? \n\nThis man has threatened me in the past months making me fear if we were to divorce saying he would cut me off even then. Later would tell me he only said it because he was angry and would never do that.\n\nI'm not sure what to do. I want to speak to a lawyer first. My husband seems too excited about this and it's also making me nervous. He has full reigns even with \"half.\" I could just not care and I'm fine with that but he has been making me more nervous. \n\nPlus, I had a dream -I know, it's only a dream, he had other motives revealed once he got his half and I was running from him in my dreams. It was like the mask fell off. I do think I dreamed that, too, because his multi-millionaire boss insenuated he should consider a divorce and if he does, he can provide the best lawyers -the ones over all other lawyers in the state. My husband has threatened me with those lawyers in the past when we argued and he said he has me beat - he would win no matter what. His other boss isn't texting me back which also makes me nervous. He owes me money for a flyer I made for him and he's also a millionaire so should be no problem paying me. He use to communicate with me no problem so I'm confused. Could be something said by my husband that I'm unaware of? \n\nEver since my husband has known about the money I would be getting, he has seemed to love me more. His demeanor has changed. He's not so quick to offend me or say something horrible like he use to. He has even said people do really love you. I just feel I need to keep my guard up. \n\nWhat do I do? I already made the mistake of telling him. His loving behavior lately has made me feel like trusting him more. Is it manipulation? I weighed the costs and I'm okay if I lost \"half.\" I feel like some plan is brewing once he gets ahold of that money. I also feel it may be in my head. It doesn't help that just a couple hours ago my husband mumbled in his sleep something about the inheritance and something about a phone. (Which is weird because a phone was in my dream this morning. It wasn't his regular phone in my dream but a red phone I never seen him have. My dream was mostly me trying to get his phone because there was some big secret on it. He switched up in my dream and he was after me not caring if I got hurt. He even sent his men after me(maybe the lawyers). \n\nBringing up the dream may make this sound bizarre so without that included, am I the a-h for not wanting to put it in our joint account? My husband doesn't really owe much debts but he does owe $3,000 in child support to his ex. Is that another thing to consider? I'm so back and forth in what to do. If I don't do it, my marriage is over? I feel like I don't have a choice. It's not fair. I had nothing to my name until this. Plus I lost my mom. My mom lived in the housing authority with this tucked away from an inheritance she received from my great aunt passing 10 years ago. So my mom had a choice to get out of a poor environment and never did. She also referred to this as her trust for me and my brother so I think she held on to it all this time for us while living in poor conditions. To me, it's not just money, it's my mom's sacrifice for me.",
 "created_utc": 1701080055,
 "permalink": "/r/AITAH/comments/184zpne/am_i_the_ah_for_not_wanting_to_share_with_my/",
 "score": 34,
 "url": "https://www.reddit.com/r/AITAH/comments/184zpne/am_i_the_ah_for_not_wanting_to_share_with_my/",
 "comments": []
}