{
 "submission_id": "1851goi",
 "title": "AITAH for not supporting my wife’s work trip?",
 "selftext": "My (36M) wife (36F) is a language teacher and wants to go to a foreign country with her high school students over the summer for two weeks as part of her school’s elective immersion program. This would leave me to look after my three children, age 10, 7 and 5 with the help of my parents.\n\nI strongly disagree and we are fighting about it.\n\nFrom her prespective, she wants to be a good teacher and build her language program. She wants to win students over from other languages so her language doesn’t shrink. Another new teacher is going and feels that, as the more tenured teacher, she has to go. She wants me to be supportive of her career.\n\nFrom my perspective, the trip is totally elective and she never needed to do it in over a decade of teaching. (She argues this is exactly why she needs to go.)  I said I am sure another teacher would gladly take her place to take a free trip and the compensation. Her going has never been necessary to grow her program. I am the primary bread winner, making 6 times her salary, and I told her looking after three children while juggling the demands of my job is too stressful.\nAlso, I would miss her terribly and would have a hard time handling the stress of my work and raising kids by myself. I reminded her that we agreed that I focus on making mondy and she focus on child rearing so I could pay for the private schools, vacations and nice things that she wants, because I am a man with simple needs.\n\nI suggested she can be a stay at home mom and understandably, she is upset saying I am too controlling and unsupportive. We almost never argue and have a great marriage, but it looks like we are at an impasse.\n\nShe doesn’t think it is a big deal to go away for two weeks but I am very stressed out already about it. The children never separated from her for over a day. I would have to take a two week vacation which means no family vacation this summer.\n\nAITAH?\n\nEdit: after being called an asshole 10 times in a row, I texted my wife: “Go ahead. I will be supportive. Internet says I am an asshole.”\n\nShe replied: “Oh my god. You never realized how bossy you are?”\n\nEdit 2: For those calling me a checkbook daddy, etc., power tripping etc and hating on me, you and I both lack perspective. I grew up super poor and my mom worked as a babysitter so I could only see her once a week and I was traumatized by it. I worked very hard and can give my kids everything I dreamed of, including a mom that is always around. But seeing how upset my wife became, I decided to gain perspective.\n\nAlso it is unfair to say how much I make is irrelevant. I put in a lot of time into making money, and most of it goes towards private lessons, camps, maid, etc to make my wife’s life as easy as possible while I focus on work. My wife doesn’t have a grocery budget or budget on most things that cause stress. My wife tells me frequently how lucky she feels for my career success. Its BS that a man cant feel proud of that and take some credit.\n",
 "created_utc": 1701086750,
 "permalink": "/r/AITAH/comments/1851goi/aitah_for_not_supporting_my_wifes_work_trip/",
 "score": 20,
 "url": "https://www.reddit.com/r/AITAH/comments/1851goi/aitah_for_not_supporting_my_wifes_work_trip/",
 "comments": []
}