{
 "submission_id": "18578yh",
 "title": "UPDATE; For telling my ex that its not my fault he's homeless.",
 "selftext": "So I posted yesterday about my ex turning up at my house wanting for me to let him move back in with me. I said no, but a couple of friends thought I should let him and that messed with my head. R is my ex.\n\nA few people told me to change my lock etc. I did that and changed my alarm code as well as my step dad got his friend to put up 4 cameras around my house. I'm also going to start shutting the gate so that no one can walk upto the house without ringing the bell there first.\n\nI put in an Edit that I was going to me meeting with one of Rs friends wives, for lunch today and I have to say that it was informative for sure.\n\nI'll call her N, 30f and her husband Z, 29m.\n\nSo I went to meet her on my lunch break at a cafe near my work. It's a place that alot of my coworkers go to and I know the staff there as well. A few redditors thought that she might bring R with her so I wanted it to be somewhere I feel comfortable and have back up if needed. \n\nTurns out that I didn't need to bother about that. When I got to the Cafe N was there on her own. I grabbed some lunch and a drink and sat with her. We went throught the usual small talk before she started telling me what had been going on. \n\nR rang Z on Thursday morning saying he had no where to go and could he stay with them for a few days. Z spoke to N and they agree he could stay in their guest room. R went to their house after work and they had a long talk where R told them he has a flat lined up, but can't move in till January. Z and N agreed to let him live with them untill January as long as he followed some basic rules and paid for his own food. The rules were things like, no bringing women back there and if he went out drinking he had to be quiet when he got back so he didn't wake their daughter who's 6. He agreed to all this and paid for a Chinese for them all that night.\n\nThe next day after work R went to meet his dad in the pub for a few pints. When Z and N went to bed R still wasn't home. They were woken up at about 2 in the morning by R arguing with a woman. Apparently, R had met this woman in a bar, took her back to Z and N house, got his pleasure and then told her to get dressed and fuck off once he was done. She had gotten angry, which started an argument where R was saying some horrific shit to her. N took the woman down stairs and got her a taxi, whilst Z stayed upstairs arguing with R. \n\nOnce N had got rid of the woman she went back upstairs and tried to calm Z and R down. At this point R decided to take out his frustrations on N, calling her a bitch and telling her to do something useful and make him a sandwich before bursting out laughing like he'd made he funniest joke ever. This made Z lost it and pinned R to the wall by his throat. Side note, R isn't a fighter at all where as Z was a amateur boxer in his youth and can handle himself well. \n\nN managed to get Z to let him go and R was shoved in the guest room and told to sleep off he alcohol. Its a miracle that Ns daughter didn't wake up during this. \n\nThe next morning N got their daughter ready and went to her mums after telling Z to get R out of their house. Z agreed and after N left he woke R up and told him to pack his shit and leave. R tried to apologise and begged to stay but Z was having none of it and kicked him out. Going off the timing, I think he left there and came straight to my house.\n \nOn Sunday Z text R to meet up so that they could speak and they met up in a pub. Z has been friends with R since they were 11 and has never seen him act like he has been doing so he wanted to find out what was really going on.\n\nHe managed to finally get the truth out of R. Basically, R has been in contact with his dad for a lot longer than he told us, by this point its over 2 years. His dad is a raging misogynist that believes a woman's place is in the kitchen and bedroom. A man's place is to rule the house and be waited on hand a foot as well as deciding who can ans can't be in their lives. He's been dripping this poison into Rs ear and it's really taken a hold of him. Z told N that he just doesn't recognise R anymore.\n\nR wants to start living his life the way his father has told him he should. When Z pointed out that Rs dad is 62, living in a shitty one bedroom flat, not had a real relationship since Rs mum left him, has no friends, his family doesn't speak to him and that he's the type of guy that when he walks into a pub people finish their pints so they can leave and get away from him, R was furious. He told Z that his dad is just misunderstood. Z responded that people understood his dad and that's why they stayed away from him, he's Toxic. \n\nThis pretty much ended their conversation and R left. Z did find out that R does have a flat lined up for January, so that was true and that he's found a b\u0026amp;b he can stay in till the flat is ready at a minimal cost. Z and N have also decided to go NC with R as they don't need that toxicity around them, but especially not around their daughter.\n\nA few redditors had said it sounded like R was on drugs, so I asked N what she thought and she doesn't think so but can't be sure. She and Z think that R is just so far under his dad's thumb now that he's completely changed as a person. He believes that everything his dad says is gospel.\n\nShe did let me know that R has a burner IG account that he is using to check on my IG and I immediately made my account private. He had said something about seeing me waist money on a stupid amount of Christmas presents when I couldn't even help him out to Z on Sunday. I'd been to a Christmas Market on Saturday afternoon and had posted pics on IG.\n \nAll of this just made my resolve stronger that he will not be getting anywhere near my house again. It also made me realise that I dont have any feeling for him any more other than frustration at how he's acting and some sadness at how far he's fallen from the man I once knew. I thought that hearing he had another woman in his bed would annoy me, but there was just nothing, I couldn't have cared less. \n\nI thanked N for the info and we agreed to keep intouch. We won't be as close as we were when I was with R but it feels good to have someone who knows the entire situation and has seen Rs behaviour with his own eyes.\n\nThere were also some redditors that told me to ditch the friends that had told me to let him stay with me. Unfortunately, I can't ditch them completely as they're part of the friend group and that would just cause unnecessary drama, but I will be keeping my distance from them and only talking to them when part of the group. \n\nI'm currently at my sisters and we are going to watch a Christmas film to get us in the mood to decorate all our house's this weekend, so I will be on and off for the next few hours if anyone has any questions. Thanks for the votes and giving me some perspective. Reddit isn't all bad.",
 "created_utc": 1701103352,
 "permalink": "/r/AITAH/comments/18578yh/update_for_telling_my_ex_that_its_not_my_fault/",
 "score": 194,
 "url": "https://www.reddit.com/r/AITAH/comments/18578yh/update_for_telling_my_ex_that_its_not_my_fault/",
 "comments": []
}