{
 "submission_id": "1859sgj",
 "title": "AITA for attending my 6yo stepdaughter's ballet recital even though her mom said she'd leave if I was there?",
 "selftext": "I have been married to Tom for 4 years and we dated for 18 months before that. Tom has a 6 year old daughter, Evie, with his ex fiancé Diana.  \nI've always been involved in Evie's life. I stayed home from when she was 2 until she started kindergarten so she wouldn't have to spend all day in daycare. I'm the troop leader for her Girl Scouts and I coached soccer and tee ball for the one year she was interested in sports. I only work part time and I'm always the one that stays home when she's sick or school is closed. Evie is like a daughter to me.  \nDiana and I got along until Evie started to call me mommy 2 years ago. I did not ask her to do this and when Tom and I asked about it she said she loves me and wants me to be her mommy too. After that, Diana insisted that Evie needed to be in daycare 10-12 hours a day so she wasn't home with me all day. Tom wouldn't put her in daycare but Diana found one that would take her every other week and started her there immediately. Then she refused to let me talk to Evie at night (she used to call me before she put Evie to bed because apparently I was the only person that could sing her nighttime song right) but somehow it was my fault that Evie was crying at night and refusing to sleep. Then she stopped letting me talk to Evie at all on her weeks.  \nEvie was a mess when Diana stopped letting her have any contact with me and barely let her talk to her dad on her weeks. She developed pretty severe separation anxiety from me and Tom and would only eat or sleep if we were holding her. Daycare was also very tough for her and it was so bad that someone there called CPS on Diana. We got a child psychologist for Evie and managed to get primary custody. Diana has her every other weekend.  \nEven though Diana doesn't have custody, we still make sure she's as involved in Evie's life as possible. They FaceTime a few times a week and if Evie misses Diana we try to set up a time to meet at the park or go out for ice cream.  \nEvie recently started ballet and just had her recital last weekend. Diana made it very clear that I couldn't go because if I was there, she'd leave and she wasn't missing her daughter's first dance recital. Tom actually sided with her this time and told me to stay home and that he'll send me pictures.  \nI still went because Evie wanted me to be there and I was not going to lie to her and take the fall when she wants to know why I'm not there.  \nDiana got there early because she volunteered to help with hair and makeup so Evie already knew that she was there. Diana came out and saw me sitting with Tom and she told me I needed to go because Evie knew she was there and she would be crushed if she knew that she left. I told her Evie would be sad if I didn't show up and even more upset when she finds out the reason I didn't come is because mom didn't want me there.  \nDiana ended up leaving after saying a few choice words and missed the entire thing. When Evie asked about it I told her Diana wasn't feeling well. She was ok with that answer and seemed to forget about it after we took her out to eat and bought her a new toy to celebrate.  \nShe just got back from her weekend with Diana and the first thing she said is that Diana told her that I made her leave and that she wasn't sick. Tom and I ended up telling her the truth and now she's so upset, I wanted to know if I was the asshole for going to the recital.",
 "created_utc": 1701109549,
 "permalink": "/r/AITAH/comments/1859sgj/aita_for_attending_my_6yo_stepdaughters_ballet/",
 "score": 238,
 "url": "https://www.reddit.com/r/AITAH/comments/1859sgj/aita_for_attending_my_6yo_stepdaughters_ballet/",
 "comments": [
  {
   "comment_id": "kb0gm3j",
   "message": "I have this type of relationship with my stepson’s father. I’ve been in my stepson‘s life raising him since he was a year old. He’s now 10 and calls me Daddy Marc.\n\nHis father sees him one to two times per year, mostly to bring him to see his grandmother. He never makes his visitation time and his never paid child support. He does have lots of “opinions“ and demands which we don’t comply with. \n\nHis latest demand was to ban his son from playing golf, since his son likes to go to the course with me and play. Needless to say, we won’t be complying with that demand either. \n\nLast year, we told his paternal grandmother, that she did not need to restrict her visitation only to times when her son picked up the child. We trust her more than her son. \n\nShe has integrated well into our family, sees her grandson 1 to 2 times per month as she doesn’t live too close to us.  She just celebrated Thanksgiving with us.\n\nNow that the bio Dad is aware that his mother sees the child, he bothers us less and less. \n\nI thought I went into this relationship, knowing how bad it could be, but OP’s  situation sounds much worse.",
   "created_utc": 1701113022,
   "score": 174,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0duml",
   "message": "NTA it's a real shame Diana is harming her own relationship with Evie out of hurt spite. Hopefully she realizes what she's doing and who's really suffering for it before permanent damage is done to that relationship.",
   "created_utc": 1701112009,
   "score": 89,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0elfn",
   "message": "NTAH \n\nIt’s not like you have a restraining order against her. She’s just doesn’t want to share the mom title with you. \n\nShe wanted both her moms \u0026amp; her dad at the recital, and Diana couldn’t even put her feelings to the side for a few hours. \n\nDiana’s jealousy is really damaging her daughter’s mental health, she’s too young to be put into the middle of this petty high school drama.",
   "created_utc": 1701112282,
   "score": 182,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0ficd",
   "message": "INFO: what exactly happened to make CPS get involved and remove custody?",
   "created_utc": 1701112619,
   "score": 104,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0j70g",
   "message": "Info: At what point did Tom and his ex-fiancé break up? According to your timeline (unless I’m misunderstanding it), Evie was 6ish months old when you and Tom started dating.",
   "created_utc": 1701113965,
   "score": 37,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0dws2",
   "message": "I've been the mom in this scenario, to a degree. I have the children 99% of the time. If my ex and his girlfriend want to come to the kids' events, fine, it's not on me to tell them they can't support the kids. But you don't need to sit next to me and you don't need to pretend we are buddy-buddy. NTA",
   "created_utc": 1701112031,
   "score": 245,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0h7kl",
   "message": "Did Evie want you there? That's all that matters. \n\nDiana needs counseling before Evie cuts her out of her life. My stepdaughter has largely done that with her bio-Dad, who couldn't get past his anger and insecurity long enough to put her first.",
   "created_utc": 1701113240,
   "score": 115,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0gvfu",
   "message": "As a child with a horrible mother and a wonderful stepmother that refused to stop loving us even my mom went out of her way to be a bitch, thank you.",
   "created_utc": 1701113116,
   "score": 8,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb2kfxt",
   "message": "Info: How do you know that Diana baby trapped Tom? Did she confess or are you assuming?",
   "created_utc": 1701142573,
   "score": 20,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0en0m",
   "message": "I don't understand why husband told you not to go. Step-daughter wanted you there, you are for all intents and purposes the main care-giver for the child.\n\nOf course you should have been there. Sounds like Bio-mum is trying to drive a wedge between you.",
   "created_utc": 1701112298,
   "score": 220,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1fwer",
   "message": "I know it's not the question but people breaking up when a kid is 6 months old and immediately jumping into a long term relationship seems sketch to me. Like there's info missing.",
   "created_utc": 1701126004,
   "score": 25,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0eb27",
   "message": "This is a tricky one as it is nuanced in my opinion. Children are healthier with more productive/caring people in their lives, not less. Children with these types of communities, statistically, have better life outcomes. Now with that said, there are some problematic statements from every side (though we are getting most information through the lens of the SP). Some comments in the response section are also concerning but I won’t address that. \n\nFirstly, and imo as I am not an expert, this situation never should have escalated at the recital. A sit down should have happened, and should happen in the future beforehand. \n\nTwo, the daycare or stay with SP in the home conundrum was wild to me. \n\nThree, children aren’t property. They are considered a social good but not property. \n\nFour, limiting lies. Children are smarter than we give them credit for even if they seem “fine” or “seem fine” after hearing the false information. \n\nFive, a really good family counselor. I can empathize with the biological mother because most societies have seemingly “natural” (though they are not) foundations that say bio-parents are the tippy top of a raising children hierarchy. Tbh, if my child started calling another woman mommy I would feel a type of way initially. So I do think that there is a middle ground to explore. For example a different name perhaps for the SP… I don’t know. Whatever works best once it is talked over communally. \n\nI hope this makes sense. I definitely would say NTA overall but I can also see how this is a tricky situation that needs hashing out… together.",
   "created_utc": 1701112176,
   "score": 107,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb09l30",
   "message": "NTA in any shape of form, I applaud you for being there for your stepdaughter despite knowing what the situation could be. I understand her mother's hurt and her feelings are justifiable but her actions aren't. She has not acted appropriately and being so disrespectful to her daughter by leaving just because you was there, in my mind, is unacceptable.",
   "created_utc": 1701110466,
   "score": 179,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0wmp2",
   "message": "I have a feeling Diana’s version of things would be way different than yours.",
   "created_utc": 1701118866,
   "score": 92,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0kyr0",
   "message": "INFO: What was the timeline of your husband's break-up with Diana? I'm curious since you've apparently been dating him since Evie was less than a year old.  \n\n\nTBH, all the logical and decent side of me thinks you're not the asshole. But there is some instinctual side of me that sort of bristles at the idea that you became a SAHM to a child that wasn't yours as soon as you married her father. I'm not sure what that feeling I get is, but it does seem a little like you were looking for a kid to parent. Obviously, Diana is being pretty horrible, if everything you're saying is accurate. But I'm also trying to imagine how I would feel as a Mom who needs to work, if a new person showed up in my kids life and was available to parent them all day. I would definitely have feelings about it.",
   "created_utc": 1701114604,
   "score": 75,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1j1y7",
   "message": "The 3 adults need to talk to a counselor and get off reddit",
   "created_utc": 1701127238,
   "score": 17,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb12o5b",
   "message": "Probably not a popular vote but ESH.  All of you are assholes.  I am also a stepmom and I was a lot like you.  I thought I was doing the best thing for my stepson and all that changed when I had my own kids.  \n\nEvie has a mother.  You are a bonus parent whether you have full custody or not and you have to respect that.  You are going above and beyond in your role as a stepmom and its obvious you love Evie.  That is great.  But you are not her mom and she has a mom.  You have completely disrespected Diana's role as her mother.  I mean, some of it is deserved based on her behavior, but you don't need to add gas to an already out of control fire.  The better response when she started to call you \"mommy\" was to come up with another term equally as endearing but respectful to her mom.  \n\nI thought I was right and then I had my own children.  And as they got older and I understood what it was to actually be a mom, I couldn't imagine having to send my kids away and leave them to someone else to raise half the time.  The thought of it broke my heart and then I started to understand my stepson's mother a little better.  Years later we had a heart to heart where I apologized to her and explained I wasn't trying to intentionally hurt her.  She explained that watching another woman \"mother\" her son was sometimes so unbearable, she felt at times she couldn't control her emotions.  Had we just had more respect for each other and our roles in his upbringing, we could have saved a whole lot of drama. \n\nYou don't respect that Diana is her mom at all.  Your husband should have done more to make sure this didn't escalate the way it did, Diana should have been in therapy to help deal with her emotions in split custody, and you should have just respected that you are not her mother but a bonus parent from the beginning.  You should have stayed home.  You don't want to lie to Evie but your fine lying about her mother being sick?  The worst thing in all of this is that Evie will forever be the one to suffer.  She's going to take this behavior and issue with her for the rest of her life. \n\nYou all need to do better.",
   "created_utc": 1701121062,
   "score": 72,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb11j7s",
   "message": "ESH. You wouldn't lie to Evie about the reason you weren't there. But were completely fine lying about why her mom left. \n\nI understand that you love Evie like you're own. It's awesome she has so many people who love her. \n\nHOWEVER!!!! THIS ISN'T ABOUT YOU AND WHAT YOU WANT! You're being selfish. \n\nYou are purposely causing problems between Evie and her mother. \n\nYou couldn't have showed up later to the event and sat in the back and just waved? You HAD to sit with your husband and have her mom see you? \n\n\nEvie's mom needs help because she's letting you affect her relationship with Evie. \n\nYou and Diana should go to family therapy together.  Maybe you'd both be able to understand where the other is coming from to do parent better for Evie",
   "created_utc": 1701120647,
   "score": 42,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0otik",
   "message": "INFO:  Why did Tom side with Diana when she demanded you NOT show up at the dance recital?",
   "created_utc": 1701116012,
   "score": 12,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0hh0h",
   "message": "Wait so there's no restraining order or actual reason that two grown adults can't BOTH be there? No need to sit together, talk to each other, they can be on opposite sides and both be there for the daughter, but because one adult is demanding the other leave, the husband is somehow agreeing too?!?! WTH?!",
   "created_utc": 1701113335,
   "score": 28,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb168a7",
   "message": "Honestly? I think you could have skipped the recital, and told her the truth: you're letting her mom have a turn this time. You guys have Evie most of the time, and the mother has obviously lost her bond with her daughter. I know that's not your fault, but you could have given her a bit of space.",
   "created_utc": 1701122360,
   "score": 50,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1lhae",
   "message": "Poor Evie in all of this. \n\nSo, it's a mother desperately wanting to be the mother which she is and going all wrong about it in defence and the step mother that is most likely secretly delighted she is being called mummy and that real mum is being pushed out.\n\nSurprised at how many NTA there are. Story seems to have halve truths. \n\nI feel bad for the mum. Sounds like she is behaving based on her ex having an affair and marrying the affair and then to see it happening to her child too, her love being taken away. Sounds like pain and anger. \n\nThat sounds like the ultimate goal too. YTA.",
   "created_utc": 1701128218,
   "score": 11,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1wf5v",
   "message": "ESH - Not sure how much I believe OP. But at the end of the day, Diana is still Evie’s mom. She should have just not gone to the recital. Clearly something drastic had to happen to go from then being friends to Diana hating her so much and trying to keep her child away. Now she barely sees her only daughter. It’s the very least OP could have done.",
   "created_utc": 1701132688,
   "score": 13,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1xoe2",
   "message": "ESH \n\nLook. You’re a great parent to Evie. But you’re forgetting this is a coparenting situation with baggage. \n\nYou got involved *fast*. In my opinion you should never have been that involved that quickly. \n\nMom allowed it. For whatever reason, your husband allowed it. While you had zero intentions to alienate her mother, the dynamic you 3 agreed to created that. Helped create it anyway- obviously mom has toxic tendencies. \n\nShe asked for a single recital, the first, to just be between her, Evie, Dad. \n\nYour husband even asked you to honor that.  \n\nYou chose to disregard that, which caused more issues for your husband and yeah for Evie too. Your husband may have agreed to this once and then created boundaries. Perhaps he sees now the problems created by involving you so intensely so early. \n\nYou have a good heart. But this isn’t as simple as “what does Evie want”. These are also adult dynamics involved. And none of the adults are showing much forethought or understanding.\n\nYou know what you are dealing with, with the mom. And sorry but I absolutely am picking up on judgment and competitiveness from you.",
   "created_utc": 1701133209,
   "score": 12,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0y3sy",
   "message": "Controversial, but YTA.\n\nYour whole timeline REEKS of bs. Like beyond reeks of bs. You’re the affair partner turned wife after your husband broke up with Diana and she was pregnant. My money is on that you started “dating” when he was still with Diana. \n\nBy default, most of Evie’s milestones go to you, OP. Diana should get milestones as well. \n\nThis one, I would’ve stayed away from and just let your hubby and Diana attend. It would’ve gone a LONG way in trying to mend fences with Diana. Like it or not, she’s Evie’s MOM. You’re just the bonus parent. You need to learn to work with her for Evie’s sake.\n\nDiana is a hot mess with problems, yes, but you all can work it out.",
   "created_utc": 1701119404,
   "score": 37,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1fbqg",
   "message": "Can't say for sure. This seems very one sided and I'd like to hear from her mom.",
   "created_utc": 1701125784,
   "score": 18,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1xibi",
   "message": "ESH, and I call BS. Courts do not change custodial agreements just because Mom is being mean to the step mom, as another commenter pointed out. And your timeline is suspicious as hell, even with your alleged baby trapping story, which I do not 100% believe. And in any case, you seem to have absolutely zero sensitivity to the fact that you have fully stepped into the mother role to this woman’s child— as a stay at home mother to her baby, no less, while she does not have the financial option to do so. And then you go so far as to encourage her child to call you mommy? No. The first time that came out of the child’s mouth, you should have gently corrected and said, “you already have a mommy, but maybe we can come up with another special name you can call me.” It’s not that hard— nannies and daycare workers have to navigate that all the time. \n\nDiana is off the rails and making this whole situation even more difficult for her child, so she’s obviously an AH here. But you are pissing contest with this woman instead of thinking about Evie and trying to facilitate a relationship with her mother, as unstable as that mother may (or may not) be. Someone needs to be the bigger person, and it could be you. You need to think about your role in contributing and perpetuating this situation and do what you can to mitigate your part, even if Diana won’t do the same. PRIORITIZE THE CHILD, not just being right for the sake of it. And stop trying to take Diana’s place as mother, because you are not.",
   "created_utc": 1701133137,
   "score": 17,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0lz0p",
   "message": "Evie’s Mom sounds unhinged and she needs psychological help and support.\n\nBut let me get this right… Evie was born and you were already dating her Dad when she was only 6 months old. You completely took over as primary caretaker within a year and a half, and you were just the girlfriend (YIKES!), completely bulldozing her Mom’s wishes that she be in daycare. And you let Evie call you Mom when she already has a Mom.\n\nYou really overstepped and behaved poorly. Sounds like that was the start of everything and saying yes to Evie calling you Mom was super unacceptable, inappropriate, and disrespectful behavior on your and your fiancés part. Like WHO DOES THAT? \n\nSo Mom did what she thought she had to do to stop you from taking over her role. She isn’t behaving well, but frankly you pushed her to grasp at straws as you took over. A bit more respect and deference FROM YOU could have prevented this all from snowballing. And you know who gets hurt? Evie, who you love. And you’ve played a big part in setting up this untenable dynamic.\n\nYou really need to acknowledge the extreme part you’ve played in failing this kid and pushing her mother to insanity.\n\nESH.",
   "created_utc": 1701114967,
   "score": 64,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0u5of",
   "message": "ESH but barely. Diane is clearly an AH. You overstepped though and clearly Diane will cut her nose to spite her face. If you'd have backed off a bit at the beginning or created some boundaries it probably wouldn't have gotten to this point of hostility. When Evie called you mommy you should have reminded her that while you love her dearly, she already has a mommy but that you can be her bonus mommy or something. I would feel pretty crushed and disrespected by my ex's partner if she allowed my daughter to call her mommy especially when you've had the ability to be so involved in the child's life in ways she can't compete with since single moms rarely have the financial freedom to be SAHM or free time to be so involved in activities since they have to be the providers. On one hand she should be grateful her daughter gets to benefit from having a bonus parent, on the other she feels pushed out of her role, like she has to compete with you for her daughter's love, clearly she needs therapy to come to terms with having to share her role without feeling insecure. In this situation with the recital I think you should have respected Evie's parent's decision, both her mother and father agreed that you should fall back for this event, you insisted on coming knowing that Diane already said she would leave if you did and put Evie in shitty position. I feel like you dared her here and you knew she would follow through but you didn't care because you'd rather her not be there anyway. If you really were just all about what's best for Evie you would have not come to the event and let her have this moment with her mom, you could have told her ahead of time that you would catch the next one but that you wanted to let her mom to have a special night on her first recital with just them, no lies necessary. Evie is only 6, you have along future ahead of dealing with her mother, you should try to figure out how you're going to move forward with as little damage to Evie as possible. I hope for Evie's sake that Diane gets therapy and realizes she's only damaging her own relationship with her daughter by hating the person who loves and cares for her, until then I wouldn't add fuel to the fire.",
   "created_utc": 1701117966,
   "score": 12,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb2h5w5",
   "message": "I couldn't get past the first paragraph. Did you start dating Tom almost right after his fiance got pregnant with the daughter?\n\nI wouldn't want to see you either. But I also wouldn't try to keep you from attending a public event.",
   "created_utc": 1701141172,
   "score": 11,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb10d0a",
   "message": "Your husband asked for you to stay away this one time. Are you scared of him being around his ex. Wife? \nAre you afraid he is going to cheat on you the way you got him from Diana? \nI don't think this situation had anything to do with the child. This had to do with your Ego it's huge.",
   "created_utc": 1701120221,
   "score": 21,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0bava",
   "message": "You’re not wrong, but I think you likely knew getting involved with a man with a child would come with baby momma drama.\n\nYou and Tom and the “evil” mom will have to sit down and figure this out.\n\nDrama like this is why a deal breaker for me was someone who already had kids. The three of you are hurting the child with your drama, so better figure it out.",
   "created_utc": 1701111088,
   "score": 152,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0vred",
   "message": "JFC. All the adults are sitting here acting like AH while that kid is fucked over. ESH",
   "created_utc": 1701118553,
   "score": 24,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1erob",
   "message": "I want to hear the mother side to this situation tbh",
   "created_utc": 1701125571,
   "score": 24,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb168vk",
   "message": "Yes, YTA. And, you know it. You are in a battle of wills with the mother and neither of you is acting in the best interests of Evie. Just as Evie has a therapist, please consider one for yourself. Provide your therapist this post and they will know how to improve things for Evie. Good luck to everyone, and especially to Evie.",
   "created_utc": 1701122366,
   "score": 36,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb13l7b",
   "message": "I had to think about this one.\n\nSoft YTA but not because of the recital. I see you’ve been showing up for your stepdaughter and you clearly love her and care for her.\n\nWhen she wanted to call you mommy, you should have shut that down. You could’ve come up with another nice term but mommy is for her mom. You deeply hurt and offended her mom who reacted badly.\n\nThe outcome of your smug (admit it) and permissive reaction to her calling you mommy has created huge fallout for Evie, for her dad and for you and her mom. If you love Evie the way you claim, you must be the one to step up and end this conflict.\n\nI think you should think about this and offer a sincere apology to her mom about the mommy thing. Let her know you have reflected and you were wrong to allow that, even if it was Evie’s idea. Let her know that you realize you have overstepped. She is Evie’s mom and you acknowledge that and you deeply apologize for not having established some guardrails here.\n\nSit with mom and your husband and figure out a path forward that will not hurt Evie. I’m not asking you to step back from loving her, but this situation is hurting her and someone has to put a stop to it.\n\nEvie needs her mom and her dad. Having you is/ has been an amazing bonus that will add to her life.  I’m a stepmom as well.\n\nIf you are unwilling to do this for Evie’s sake and the sake of harmonious living, then you need to admit you’re just trying to win some kind of emotional contest and you’re pitting yourself against Evie’s mom in a way that is going to end poorly for everyone.",
   "created_utc": 1701121399,
   "score": 50,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0ybqu",
   "message": "Yes you are the A-hole. You should have respected your partner's decision to allow his ex to be the one to attend and not you. It seems you didn't like that and wanted it solely your way or the high way.",
   "created_utc": 1701119485,
   "score": 13,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0ijqu",
   "message": "INFO: how long after Diana and Tom broke up did you and Tom get together?",
   "created_utc": 1701113730,
   "score": 25,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0mnm5",
   "message": "I’m going with ESH. OP and Tom disregarded Diana’s feelings about Evie calling OP mommy. Everything was fine until OP just ignored D because she wants to be a mom without actually talking with D about it and coming up with a compromise. Diana is definitely an AH because of how she is dealing with Evie and Redditors are right that she’s harming her own daughter because of it but I have a hard time putting 100% of the blame on D. It must have felt so wonderful when Evie said she wanted to call OP mommy but Evie already had a very involved mommy. That decision was not only Tom and OPs to make. I suspect some other term of endearment could have been found but completely disregarding Diana’s feelings and place in her own daughter’s life was never going to end well.",
   "created_utc": 1701115216,
   "score": 22,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0heyi",
   "message": "NTA. Diana was fine with your free daycare. She was fine with you being the one to miss work to stay home with her sick kid. She was fine with all of it until Evie said she loved you too. Not more. Not better, just too. Then she decided that after all that you did for her kid you couldn’t be around her kid. She was fine with calling you every night to sing her to sleep until she wasn’t. Maybe if she’d have done some of things that you did for Evie when she was little she wouldn’t have this issue. The fact that she can’t sit in the same venue as you to watch a ballet recital is very disturbing.",
   "created_utc": 1701113314,
   "score": 31,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb12lkc",
   "message": "YTA for allowing this child (who has a mother) to call you mommy. There are lots of children that are cared for by family members or nannies on a daily basis due to working parents. Children and caregivers can become quite bonded and attached. However, A Nanny or Grandmother would naturally know how inappropriate it would be to allow the child to call them \"mommy\". As the adult, you explain the truth. It's that simple. The truth is, OP is not the mother, and Evie only has one \"mom\". A healthy boundary was not set by you, OP. You are the guidance \u0026amp; rationale for this child. Unless the child has some defiance and behavioral issues, I do not see how you could not use loving logic and common sense with her and at the same time, stimulate her creativity to find a special name appropriate for the dynamic you two share. O-ma (other mom) would have even been suitable or something endearing in another language that doesn't sound too much like Mom in English. I think you were incredibly insensitive and because you do not have your own child that you birthed, I don't think you fully understand the hurt this has caused. It is absolutely amazing that you love this child as your own and care for her in such a loving way, but you are creating blurred lines here too.\n\nWith that being said, I definitely think the mother is also an AH for leaving the child's recital, even if she has beef with you. She should have put her feelings aside and stayed. I do not think she is handling this situation in a mature way at all. But she may be enduring a lot of pain because of how things have gotten and doesn't have the emotional tools she needs to navigate the reality of all that is going on. \n\nYou all could benefit from counseling and maybe as a group.",
   "created_utc": 1701121037,
   "score": 39,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1wtmy",
   "message": "YTA. Stop trying to steal this little girl away from her own mother. You are the STEPmom not the real mom. Diana clearly wants to be in her child’s life. I agree she may not have gone about it the right way but you would go a little crazy too if your daughter suddenly started to call some other woman mom and prefer her over you. She felt like she was losing her child. You need to back down and know your place. There’s a difference between a bio parent choosing to see their kid only a few times a year and seeing a stepparent as more of a parental figure than the bio parent trying to be in their kids life but have less custody time. Yes the reduced time is her fault but you also drove her to that point by insisting to be seen as Evie’s real mother. You need to take a step back and let Diana have a better relationship with her kid. Be more firm in that you are her stepmom and not her mother and let Diana have her child back. Even your husband agreed that you shouldn’t have gone and last time I checked Evie is their kid NOT yours and you are continuously stepping over their boundaries when you have no right to. It is clear that you care for her which is good as it’s better than having an evil stepmother, but you also need to learn your place and stop stepping over the boundaries of her real mother. You keep saying you won’t lie to her, but you did lie when said why Diana left. And you said she would know if you said you were sick bc when she came home and hour later would know that you weren’t. She’s 6. She’s not gonna try and bring you to doctor and call you out on your lie. Literally all it takes is a yeah I just don’t feel good sorry and they move on. I have a 6 year old I would know. You seriously need to step back and know your place. That doesn’t mean you start neglecting her, but it also means you need to stop alienating her from her real mom and keeping your nose out matters between the REAL parents of Evie.",
   "created_utc": 1701132852,
   "score": 15,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1ly84",
   "message": "YTA, her mom just wanted to do something for her daughter to feel like a mom. Your husband was right about the drama, it's not needed. It wouldn't've hurt the child if you didn't show up, instead she would or could've bonded with her mom a bit which sounds like something you don't want.",
   "created_utc": 1701128413,
   "score": 11,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0xs6e",
   "message": "I have questions?  What country are you in?  In the US most ballet/dance recitals are in late spring. Then they break for summer. Starting up again in the fall. \n\nSecond Question- a 6 year old wouldn’t be in Girl Scouts and if you were the leader of her troop then Brownie would roll right out of your mouth after all the training you would’ve done quite  recently. Though it’s unlikely at 6 years old she’s in Brownies either. It begins in 2 nd grade. I had to. I had to do that for one of my kids, because there wasn’t a group that met right after school for us.  But usually second graders are seven or eight years old not six which would be a kindergarten or first grader.  \n\nSo I can’t help but wonder at the rest of this story.",
   "created_utc": 1701119285,
   "score": 8,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0yjpk",
   "message": "NAH.\n\nIf she is still very much involved with her kid it is understandable that she would be upset that some other woman is stepping in as mom. Especially when it’s not needed. The real AH here is your husband for not setting boundaries. All three of you need to talk about boundaries and co parenting. If she is uncomfortable with her child calling you mom then you need to respect that.but I also don’t think it’s wrong that you have a good relationship with your stepdaughter. This is coming from someone who was in your kids situation. Like literally, my step mom came into my life when I was 3. I don’t call her mom, but she definitely did more for me than my mom did.",
   "created_utc": 1701119566,
   "score": 8,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1oo76",
   "message": "YTA in my opinion. These issues started when the little one started calling OP mom. Her bio mom didn’t take kindly to it and as a mother I would be livid if my daughter started calling another woman mom. You are not her mother she has one so stop trying to replace her bio mom. OP is clearly a huge help in the little one’s life and that is great especially if Bio mom can’t be involved as much as OP but OP should of made it clear not to call her mom. Have your own kids if you want to be a mom stop trying to take someone else’s. Once you do actually give birth to a child then you will understand where bio mom is coming from.",
   "created_utc": 1701129521,
   "score": 8,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0v06b",
   "message": "NTA for going to the recital. But, the way you and Diana handled the rest…..  sigh.  Poor Evie. \n\nI would’ve tried to find a way to go so Diana didn’t see me before the start.  So both of you could see her. \n\nHide in the back, sneak in late. Evie knows what’s going on.  She’d think you were clever and smart.\n\nSince Evie wanted both of you there. \n\nAnd the story about why Diana left wasn’t the best.  You lost face there with Evie with how you handled why Diana left.  Dad tired to warn you. \n\nNavigating bonus parenthood is never easy even when all get along. There’s always oopsies, hurt feelings.  Been there done that. \n\nKids want things to be perfect, and when adults don’t want to behave, it’s best for the “adult” in the situation to get creative and find a way make it work, put the ego aside.  Kid will appreciate that and remember it.\n\nKids also remember parents having to be “right” and “lying” on important days and making kids upset.",
   "created_utc": 1701118273,
   "score": 4,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0wob5",
   "message": "Depends. Are you the reason they're divorced? If so, you are eternally the AH.",
   "created_utc": 1701118882,
   "score": 4,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1eaz1",
   "message": "Reddit seems to all be telling you you’re NTA but what I’m reading is a mother desperate not to lose connection with her daughter. She feels you are replacing her role as mother in her own child’s life. This isn’t a deadbeat parent where you stepped up and took on more than was required. This child already has a mother who clearly wants very much to have a good relationship with her daughter, and well intentioned or not you’ve made it difficult to form the kind of bond and attachment she wants since you are always there taking care of her all day every day, doing Girl Scouts, and everything else. This woman can’t even be a full time mother on her own week without it becoming a huge issue. \n\nI’m a mother of 2. It would be HARD to have some other woman come in to be a hero to a child that already has an active involved mother. Do you have any compassion for her at all? Would you want to be in her position with someone like you as the step mother?\n\nETA: my judgment is YTA. Your husband told you not to come. You’re interfering with the coparenting relationship and yet again asserting yourself on top of this mother as if you’re the most important person.",
   "created_utc": 1701125394,
   "score": 13,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1pqoh",
   "message": "Everyone saying NTA- put yourself in that position. Imagine your ex husband remarried and his new wife became your kids Girl Scout troop leader, soccer coach, all things you can’t do because you work full time. I can see why bio mom would have issues. She should be the bigger person ideally, but to what end? She’s a human with emotions.ESH",
   "created_utc": 1701129959,
   "score": 13,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0gj2p",
   "message": "NTA - The most important thing is what is BEST for your stepdaughter. She needs all her parents to get along. It seems that you have done everything to include her Mom \u0026amp; she is doing everything to not include you.\n\nThere are books that might help with this.\n\nThe first one that comes to mind is How To Parent With A Toxic Ex\n\nI’ve never read it but I’ve seen it at my local library in the Parenting Section of books\n\nIt’s not healthy for your stepdaughter the way that her mother is handling you being in her child’s life.\n\nYou’ve already detailed that this has harmed her so much that one of her day care providers had to call CPS about the trauma her mother was causing her.\n\nIt sounds like her mom needs to take some parenting classes with a therapist to teach her how to handle her anger, disappointment, \u0026amp; to teach her better ways to handle the jealousy she feels that her daughter loves you too \n\nBecause as a mom I’d probably be a little sad that my child wanted to call someone else mom too.\n\nHowever, if that person was taking care of my child and in a parental role with my child and was AMAZING with my child, then THAT is the BEST scenario I could hope for!!\n\nBecause we see far too many cases of children being tortured \u0026amp; murdered by an ex’s spouse or partner.\n\nAnd at the end of the day, we want the BEST \u0026amp; Healthiest Life for our children! 💜💜💜",
   "created_utc": 1701112991,
   "score": 26,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb17xvv",
   "message": "I dunno you sound like a good person but everything is very annoying like why do you sound perfect and her mom sound like a prick lol. I can’t lie I would be upset if my kid called someone else mom, I feel like the adults should have come up with something else for her to call you.",
   "created_utc": 1701122986,
   "score": 7,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb12q0a",
   "message": "\nESH. \nEvie’s mom needs to grow up and act like a mother. She needs to put Evie before her own feelings. \nAs for you, you’re alienating her mother. You’ve came in there, spent more time with the kid, encouraged her to call you Mommy, trying to replace her actual mother. \n\nYou and your husband could have found another nickname for you to be called, instead you did something that would lessen even more her actual mother’s role in her life. \n\nYou guys are pretty immature. You have a kid in the middle of all of this, and you’re all trying to act based on your own benefits.",
   "created_utc": 1701121082,
   "score": 9,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1f8v4",
   "message": "YTA for pretty obvious reasons. Even your husband told you not to be there. Smh",
   "created_utc": 1701125754,
   "score": 10,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb2np37",
   "message": "I wouldn’t have gone. Especially since her dad asked you not to go. It would suck, but there’s always next time.",
   "created_utc": 1701143982,
   "score": 9,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0jnot",
   "message": "Info: What were the circumstances of Tom and Diana's relationship ending?\n\nEvie is 6, but you and Tom have been together for 5.5 years?",
   "created_utc": 1701114134,
   "score": 12,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0r9e4",
   "message": "ESH\nSounds like everything was fine until the child began calling you mommy. \nAnd both you \u0026amp; her father embraced \u0026amp; encouraged it. But then act surprised when mom was willing to share everything else but the title.",
   "created_utc": 1701116907,
   "score": 13,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb0uyn7",
   "message": "I’m counting out this timeline. Evie is 6, you’ve been married to her father for 4 years and dating him for 18 months. Were you the other woman? When Evie started calling you mom, what did you do to reinforce her mother as her mother? It sounds like Diana thinks you’re trying to replace her, and honestly on first glance, I can see why. Is she handling her emotions the best way, maybe not… But this timeline is a bit questionable for me.",
   "created_utc": 1701118258,
   "score": 10,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb30o9g",
   "message": "YTA. \n\nThis breaks my heart. This poor child. I am both a bio mom and a step mom. I would be devastated if my child's step mom behaved like you. I am sure I'd do things I'm not proud of. You clearly love this child and that is great but you completely crossed a line. \n\nI've been raising my step daughter most of the time because her mom is a recovering addict. I've been in her life for five years. She asked to call me mom years ago and we shut that down real fast. Your step daughter has a mother, you can't erase her and it was wrong of you to let her call you mom. As a step parent, your goal should not be to outshine the child's bio parent. You will never win and the child always suffers. Love and support them but never try to replace. And always help foster the relationship with mom. \n\nShame on you and your husband. Get everyone in therapy and start to mend the bio mom relationship now.",
   "created_utc": 1701150951,
   "score": 11,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb1m67u",
   "message": "ESH. This isn't about you. This isn't about the ex. This is about a little girl you both insist on putting in the middle.\n\nYou knew in advance she was going to cause an issue if you went. You could have talked to your stepdaughter in advance. \n\nShould you have to have missed the recital? Of course not. But you don't live in a perfect world. You don't deal with what should be. You deal with what is.\n\nAnd all y'all fckd this up big time and a little girl paid the price. \n\nY'all need to have the custody agreement modified to include a provision that neither parent can talk badly about the other. It obviously won't stop her, but at least she can face consequences. Also, might not be a bad idea to ask for mandatory counseling for everyone. Y'all need it.",
   "created_utc": 1701128504,
   "score": 7,
   "submission_id": "1859sgj"
  },
  {
   "comment_id": "kb26da2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1859sgj"
  }
 ]
}