{
 "submission_id": "185ac3v",
 "title": "AITAH for getting upset at my BF for proposing to me after sex?",
 "selftext": "The man I love finally proposed to me after 4 years of dating and after birthing his daughter and he couldn’t have done it any worse than proposing right after sex\n\nI told him I really wanted this proposal to be meaningful and special. It doesn’t need to be anything social media fancy or anything. Just something meaningful. I thought he was going to take me back to where we first met (college campus in the middle of the field) something like that\n\nI never had anyone do anything super special or meaningful for me. I feel like trash that’s only good for sex. I use to hate men at one point because I felt like they only see me as something to use for sex. For a long time I was always used for sex by men in the past. I just hate how obsessed with sex men are. Like all every guy ever talks about is sex sex sex, get a hobby! \n\nI also had a traumatizing past in my teenage years of being sexually exploited so sex isn’t really something I care for unless it’s with someone I really love. I know my BF loves me for more than just having sex with me but I guess it just reminds me of my trauma being proposed to right after he finished inside me. I was literally cleaning myself after sex and I turn around and he’s on his knees proposing. I cried out of sadness. I was then very furious. He was confused. He thought he was doing what I asked, “proposing after making love to the love of my life.” Sounds sweet and all. But we had kind of aggressive add with choking and swearing at me (my BF has a degrading kink) this wasn’t romantic. It was far from it \n\nThis was just one thing that was very important to me and I feel like my BF was being disrespectful doing this. This is NOT a story I would share to with my daughter, friends, family. When someone asks “aww how did he propose?” I don’t want to tell this story that’s going to make me start balling my eyes out in a bad way. It’s just embarrassing\n\nI feel like a lot of people on reddit don’t care about proposals and marriages, even though it may not be important to you…. it IS important to me\n\nI told my best friend about what happened and she thinks I should break up with him because he doesn’t respect me. She says there are a lot of better guys out there who care enough to put some effort in something that’s meaningful to me. But I do love my BF, I have a life with him, we have a daughter. I don’t want to start all over when I already have a family who I love so so so much. I guess I just have to accept the fact I don’t deserve more….",
 "created_utc": 1701110875,
 "permalink": "/r/AITAH/comments/185ac3v/aitah_for_getting_upset_at_my_bf_for_proposing_to/",
 "score": 74,
 "url": "https://www.reddit.com/r/AITAH/comments/185ac3v/aitah_for_getting_upset_at_my_bf_for_proposing_to/",
 "comments": [
  {
   "comment_id": "kb0od04",
   "message": "Umm…what? You have trauma around sex and you’re with someone who has a degradation kink. Is this a mutual kink or do you just let him do it to you because reasons?? Is it enjoyable and pleasurable for you?",
   "created_utc": 1701115843,
   "score": 64,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0idas",
   "message": "NTA, but is the degradation and choking a mutual kink? You didn't mention him providing any aftercare, which is incredibly important especially if you have pre-existing concerns about being used for sex.",
   "created_utc": 1701113664,
   "score": 21,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0eeuy",
   "message": "I proposed to my wife BEFORE sex, which is by far the better way to go about it",
   "created_utc": 1701112215,
   "score": 71,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0x1lg",
   "message": "NTA for all the reasons being said, but I wanna address your comment about having a life with him. I definitely understand not wanting to give up on someone you love. This was really shitty (regardless of/especially if he knew about your trauma), and it's up to you to decide if there's something worth staying for. That said, do you like him? Sure you love him, but do you really like him? Is he going to be able to put the effort into a relationship to make you feel loved in return? There's no point staying because of what's already passed. You can't change the time you spent w him, but you CAN choose someone else who will add to your happiness. I don't know enough to recommend what you do, so please consider the relationship carefully",
   "created_utc": 1701119018,
   "score": 69,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0ksnc",
   "message": "Just going to say that as a single man, i really don't get how he dropped the ball on this one. First meeting, first date restaurant, anywhere picturesque.. the place where he decided \"yes, i have a child with this woman\" .. okay last one might be a bad example if it was unplanned or it happened in the bedroom... \n\nSo many options and we went with that one.. im not surprised you're disappointed.",
   "created_utc": 1701114544,
   "score": 123,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0prdd",
   "message": "I thunk you should tell him that it's a story you can't tell and don't have any pictures... Request a redo. See what he says. I think his reaction to thise statements will show you everything you need. He will either realize that's true and do a redo... Or he will get weird or mad. Then break up.",
   "created_utc": 1701116357,
   "score": 12,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0g471",
   "message": "NTA. \n\nAlso, given your trauma with sex, I don't know that having *degrading* sex is a good idea here. You clearly have some issues seeing your value and that kind of sex is only going to feed the issues. \n\nFurther, if my husband choked and demeaned me then tried to call that lovemaking, I'd lock him in the goddamn shed and call it an act of love. \n\nYou want a proposal that means something. That's not a very high standard. So long as you told him that beforehand, only an absolute moron would think this proposal was worthwhile. \n\nPeople crying about gender roles and expectations are fully welcome to not participate. Not participating is far better than this shitty proposal.",
   "created_utc": 1701112840,
   "score": 252,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0ld2k",
   "message": "NTA.\n\nI don't think it makes sense for someone with so much unresolved sexual trauma to be in a relationship with a guy who has a violence kink. I don't see how you can heal in these conditions. I'm sorry for all you've been through.\n\nThere is a lot of inaccurate and unhealthy thinking in your post. It is beyond time for you to work with a therapist. Life can be so much better for you.",
   "created_utc": 1701114748,
   "score": 139,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0ni4q",
   "message": "NTA you do deserve better than that and it's depressing that people are telling you otherwise.",
   "created_utc": 1701115530,
   "score": 75,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0jstd",
   "message": "Info:  Does your boyfriend know about your feelings and attitudes about sex?",
   "created_utc": 1701114186,
   "score": 114,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0f0ft",
   "message": "Holy shit, NTA- WHAT THE HELL is with the guys in here telling you YOU'RE in the wrong for not wanting your proposal to happen RIGHT AFTER HE'S BEEN CHOKING YOU AND CALLING YOU NAMES?? Is through bar THAT low? Is this subreddit that flooded with mouth-breathers who think women should just be happy with whatever shitty scraps men deign to toss their way?? Fuuuuuuck that noise.\n\nGIRL. Girl. You do deserve better. If he can't see how fucked up that is, idk what to tell you! You're absolutely right. How is that convo going to go? \n\"Oh hey man, how did you propose to your wife?\"\n\"WELL I'd just finished raw dogging her while choking her out and calling her a whore, then while she was cleaning up I asked her to marry me. Romantic right?\"\n\n**Seriously. Ask him if he'd be comfortable telling his fucking mother and father how he proposed to you, IN EXPLICIT DETAIL. See if that'll get through to him.**",
   "created_utc": 1701112437,
   "score": 133,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0kj55",
   "message": "NTA\n\nThe standard proposal after a dinner date would have been miles better than this.\n\nAlso please ignore the hateful comments. We got some trolls in here for some reason.",
   "created_utc": 1701114449,
   "score": 45,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0hnmy",
   "message": "NTA. You deserve better.\nYou're worth more than what you can give to other people. Don't give up yet.",
   "created_utc": 1701113401,
   "score": 44,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0tcrc",
   "message": "NTA. I do not think proposals matter, but by that I (and most people imo) mean some massive fancy proposal isn't required. That doesn't mean any proposal is good and I wouldn't just pop one out after degrading sex, may as well ask after a horrible argument.\n\nA big thing here to ask is your boyfriend has a degrading kink, but do you enjoy it too because if not you don't have to do it just because he likes it. Also choking is simply dangerous AND damaging and very easy to take too far. Also for me I wouldn't count choking within degradation kink.  You don't have to practice a kink he likes that is very 'one sided' and kind of shitty and given your history it seems like something you both wouldn't be into and as you referenced it you make it sound like this wasn't even sex you enjoyed/liked/had a good feeling about. Basically the way you talked about it makes it sound like you're doing sexual acts you don't like and that are probably triggering for your trauma just because he wants it.",
   "created_utc": 1701117672,
   "score": 12,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0jwe6",
   "message": "I ask this with kindness and respect but are you sure you're ready for an engagement? It sounds like you have some trauma you need to work out before you can be in a successful relationship. There are some cliches that are cliches for a reason: you have to love yourself before someone else will love you, we accept the love we think we deserve, no one can make you feel inferior without your consent. They're cheesy but they're also true. I don't mean to be offensive and I know this sounds harsh but you do not come across as someone who should be in a serious relationship. You absolutely deserve better but if you don't believe that then you probably won't ever get it.",
   "created_utc": 1701114222,
   "score": 75,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0k7kg",
   "message": "You're NTA. But this is actually more complex.\n\nLike, at first I thought \"what's the big deal, sex isn't bad, OP seems to have a pretty negative view on it\". I was abt to say you might be too prudish.\n\nBUT holy sht, you have trauma around the topic and he doesn't factor that in?! When he's supposed to know you better than anyone, seein as he wants to be your husband? That's a completely different story!\n\nPlus, I'm a bit concerned abt the degradation kink thing. That's something I'd never even consider playing out with someone who doesn't exactly have the most carefree attitude towards sex, and justifiably so. Even with consent, that's...really not a good idea. I mean, oc a trauma survivor can be into it as well, but that's further down the road in their healing journey, if at all. I feel like it does more harm than good if the person hasn't come round to actively liking sex yet.\n\nSo...Idk you, obviously. But you might want to listen to your gut and not say yes quite yet. Too many red flags, imo.",
   "created_utc": 1701114334,
   "score": 90,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0xkc5",
   "message": "\u0026gt;But we had kind of aggressive add with choking and swearing at me (my BF has a degrading kink) this wasn’t romantic. It was far from it\n\nIt sounds like this is a bigger problem. You clearly don't enjoy being choked and cussed at. Who cares if it's his fetish? It's literally degrading. He should get a better fetish.",
   "created_utc": 1701119206,
   "score": 34,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0xods",
   "message": "Info - why does your best friend want you to break up with this guy? It won’t be only because of this incident. No way would a best friend suggest you breaking up a family over ONE isolated incident if she otherwise liked this guy for you (even if this was a big screw up). Out of curiosity: what else does she have against him? What does she see that you don’t?",
   "created_utc": 1701119246,
   "score": 43,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0zd0c",
   "message": "I'm not going to kink shame your bf, it is what it is, but I'm not hearing an enthusiastic yes from you. Kinks only work when both participants gain from it. If it doesn't do it for you, you're allowed to say no. Also, aftercare, have you had a discussion about what you need afterwards? As for the proposal, tell him if he wants a yes, he needs to do better. What he did was disrespectful.",
   "created_utc": 1701119864,
   "score": 23,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0t25c",
   "message": "\u0026gt;I also had a traumatizing past in my teenage years of being sexually exploited so sex isn’t really something I care for unless it’s with someone I really love\n\n\u0026gt;He was confused. He thought he was doing what I asked, “proposing after making love to the love of my life.” Sounds sweet and all. But we had kind of aggressive add with choking and swearing at me (my BF has a degrading kink) this wasn’t romantic. It was far from it \n\nOP, have you told him about the trauma, because this reads like he has no idea about it.\nIf he does know about the trauma, leave him, it's not worth wasting even more time.\nIf he doesnt......how do you expect him to not do shit like this. Have you told him you don't like it?",
   "created_utc": 1701117566,
   "score": 30,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0rz9e",
   "message": "You are not compatible. Do not marry him. Stop dating him. You have trauma related to sex and he has a degradation kink. Those are two incompatible viewpoints.",
   "created_utc": 1701117170,
   "score": 22,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0tuhy",
   "message": "Please get help to resolve your sexual trauma issues \u0026amp; then re-evalute your current relationship; best wishes ~",
   "created_utc": 1701117853,
   "score": 7,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0xrtl",
   "message": "NTA honey I am so so sorry",
   "created_utc": 1701119281,
   "score": 8,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb16fub",
   "message": "NTA. And neither is he, really. \n\nIt sounds like his idea of “meaningful” and your idea of “meaningful” does not match up. I see where your best friend is coming from too, especially if they’re very protective of you since they know about your past traumas. \n\nTell him honestly that to you, sex is not “meaningful” to you and that you want him to try again, that it doesn’t have to be fancy or over the top, but to think about how *you* would want to be proposed to. If he’s still confused, because yes, men can be exceptionally dense at times (my father thought it was a good idea to gift my mother a hair dryer for Christmas one year when they were younger and he was very excited about it but she was expecting something…not quite so practical 💀) then give him suggestions: where you met, somewhere that holds a special memory to you of us and that doesn’t involve sex, a restaurant or place that you both enjoy.\n\n*If* he truly cares about you, he won’t be upset at this and he’ll put in the effort. \n\nIf he makes a big deal over it, gets angry or upset or thinks you’re being unreasonable, *then* maybe reconsider the relationship.\n\nThe whole thing sounds more of like a misunderstanding and different “priorities” (I’m not sure of the word to use here but like, to him sex is meaningful and in his mind that’s the perfect time but to you it’s not and has ties to trauma). If he’s truly a good man and genuinely loves you, he will, not necessarily realize he was *wrong* since he wasn’t, but that the two of you have differing views of “meaningful” and he won’t be upset at trying again in a different way. Which isn’t exactly a bad thing as long as you keep communicating openly with each other about those differences. \n\nAlso, have you talked to a therapist about your traumas? Maybe that could also help too.",
   "created_utc": 1701122436,
   "score": 7,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0wm73",
   "message": "I don't know if an engagement consultant is a real thing, but it needs to be for some of these dudes.",
   "created_utc": 1701118861,
   "score": 12,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0wrd8",
   "message": "Did he know how important it was? Does he know about your past trauma? Also was the degrading kink consensual? \n\nI know it’s not for the same reasons but I am asexual (well, Demi sexual so I do kind oh enjoy sex with my loving partner just like you described) - I always have to remind myself that I’m the odd one out and most people love sex. If the kink is consensual so it could have been romantic to him - as in, he felt able to be himself fully with you.\n\nBut I sense that he’s just been insensitive and selfish throughout.",
   "created_utc": 1701118913,
   "score": 7,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0ynk2",
   "message": "Oof. Ooofff. I seriously want to say so much more but have no idea where to start. That is a HORRIBLE proposal. Literally the worst. I have sex related trauma too and that would be my worst nightmare.",
   "created_utc": 1701119605,
   "score": 8,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0d30j",
   "message": "If you said yes - tell him you are withdrawing your yes. And \n\nThat he needs to try the proposal again in a way that is meaningful to BOTH of you. If he does another equally stupid proposal decline and tell him to try again.  He will figure it out eventually.",
   "created_utc": 1701111727,
   "score": 45,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0ttrc",
   "message": "Does he know about your past trauma? Have you ever explained it to him and are you okay with his kink? Because if you aren’t, you shouldn’t be doing it. I think your views on sex is what makes you feel like it’s dirty and you should absolutely go and speak to a professional to truly help you process your feelings around sex. NAH if you haven’t told him about your feelings surrounding sex.",
   "created_utc": 1701117846,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb12yka",
   "message": "There's no question your boyfriend definitely should do a better job of understanding your needs, wants and boundaries. But I'm glad you're not listening to your \"best friend\" on this matter. I'm sure she's trying to show empathy and support, but telling you break up with him over this seems just foolish and immature. \n\nIf you and your boyfriend really do love each other and can envision your lives together long term, then it would behoove you to share with him exactly why you are so upset. He needs to know and truly understand what went wrong. Then, together, perhaps the two of you can decide to reset the proposal clock for him to surprise you with something that will be meaningful and special to you both.\n\nAlso, given your past traumas, a candid conversation where you convey to him your needs in the bedroom, along with some firm boundaries, would probably be a good thing too.",
   "created_utc": 1701121168,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1d8ob",
   "message": "The reason you haven’t had better is because you accept less and hope they’ll change. He doesn’t have to try any harder because you’ll accept his crumbs. He knows you aren’t going anywhere regardless. I agree that he doesn’t respect you, his disgusting behaviour is not your fault - this is who he is - but the more you allow him to disrespect you, the less respect he’ll have and worse he will treat you.\n\nMy mum got cheated on and beaten by my dad, she loved him and didn’t want to break up the family.  Guess how my life panned out..: I learned that love is chaotic and got the same. Stop trying to make a turd into a prince",
   "created_utc": 1701124982,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0etsi",
   "message": "I don’t want to bash the other gender but from my personal experience, men and be a bit dense when it comes to romance.  If you have communicated with him and explained why it was inappropriate and why it hurt you so much and he still doesn’t understand then it’s up to you to decide if you are willing to work on your relationship and help him develop some self awareness and emotional maturity.\n\nYou have had his child so I think you ate at bare minimum deserve a decent proposal you can enjoy telling your family and Friends. \n\nPlease don’t listen to any of these red pill comments blaming you, Reddit is full of them! 💊\n\nHonestly if you were the AH I would tell you. \n\nDon’t lower your standards you deserve a fair committed loving and respectful relationship.",
   "created_utc": 1701112367,
   "score": 32,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0lspj",
   "message": "NAH.  Your boyfriend just seems a little dense. Explain it to him clearly that this wasn't what you wanted, and that you want him to do it again in a more meaningful way.\n\nYou also need to have a completely separate conversation with him and reflection with yourself.\n\n1- Does he know about your sexual trauma? 1b- Does he UNDERSTAND the severity?   \nMy wife does not know about the kink I have, where I want her to be tied up all day and serve as my sex slave once a year.  She means so much more to me than that, and she has a ton of trauma on trauma, so I haven't even introduced the idea. This is called common decency. However, if I didn't understand the severity of her trauma, I would have brought it up a long time ago.   \n\n\n2- Have you really dealt with this trauma? Are you seeing a therapist? Sex is a big part of marriage and trauma can make sex very complicated, having a professional involved is always a good idea.",
   "created_utc": 1701114904,
   "score": 31,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb109z3",
   "message": "Ew throw the whole man away…NTA",
   "created_utc": 1701120191,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb13kxs",
   "message": "NTA if you feel it is degrading. It is. Doesn’t matter what anyone says. You deserve better. Best of luck I hope you are able to find real love.",
   "created_utc": 1701121396,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb151dd",
   "message": "Stop everything right there. Just freeze exactly where you are. I cannot comment on the sex part of all this as I myself have no interest in sex and never plan on having it (no trauma, just asexual). But you should not, under ANY circumstances, throw your life away on some sunk cost fallacy for anyone who has made you believe you \"don't deserve more\".\n\nI'm going to say this now and I want you to pay close attention, OP: I do not know you. I've never met you in my life. But you nor anyone on this planet should EVER settle for the known simply because it is known. We only live once. Do you really want to spend the rest of this fragile, brief yet wondrous life believing you \"don't deserve\" to be loved and respected by the person you choose to spend the rest of your life with? \n\nIf the answer to the above is yes, please seek therapy. If the answer is no, then at least you can make an informed decision.",
   "created_utc": 1701121925,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb151oj",
   "message": "this is...terrible. the mind of a man is one i'll never understand",
   "created_utc": 1701121928,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1n763",
   "message": "You’ve been with this man for about 4 or so years while going along with him and his kink and now you want him to change. A romantic proposal to you by him simply cannot happen because his views on women aren’t romantic and probably won’t ever be. You write of sexual exploitation you experienced as a teen but can’t see that your man is also sexually exploiting you. \nSitting down with a therapist and discussing your relationships, past and present, would be of enormous help to you. Re-think marriage to him first, then move on to therapy. You won’t regret it. 💕",
   "created_utc": 1701128922,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1qdhx",
   "message": "So my ex also liked rough sex and for the longest time I thought I did too. Now that I’m with someone who actually loves me and respects me I realize I was being abused. I don’t miss being slapped or choked or forced to do things. It actually feels good now and we don’t need violence because we have passion. I guess before since there was no passion we had to substitute something else to make it exciting. \n\nNothing wrong with sharing a kink when it’s done mutually and with love and respect. But that’s not how it happened in my last relationship and I wonder if you can relate? I was too inexperienced at the time to realize I didn’t like it. \n\nThe way you felt after he proposed to you should tell you everything you need to know. Sex that makes you feel gross and unloved isn’t normal. It seriously doesn’t have to be that way. Breaking up with my ex was the biggest gift of self love I have ever given myself. Be honest with yourself about what you want. Sending you strength!",
   "created_utc": 1701130218,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0t2y6",
   "message": "This literally is a plot point in big bang theory minus the having a kid part.\n\n\nAnd I agreed with Penny. Leonard shouldn’t have proposed in the middle of sex. And neither should you.\n\nPersonally I’m someone who wants a private proposal….but not that private or intimate",
   "created_utc": 1701117575,
   "score": 7,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0uvlc",
   "message": "Please dump him.  This will NOT get better.  You deserve better, and you can have it.  Get out now.",
   "created_utc": 1701118228,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0vlxu",
   "message": "She's right there are way better men. This guy fucks then proposes to you in post nut clarity. So is it meaningful? Yea but he's still using you for free sex lol",
   "created_utc": 1701118497,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb105of",
   "message": "You’re never an ah for having feelings, you feel how you feel and on a separate note, this isn’t the right guy for you. He might be nice and mean well but it sounds like his kink will be problematic for you both, it’s as if being able to share it will you has made him feel closer and more intimate to you, but for you it’s more like something you tolerate and certainly didn’t put you in the mood for a proposal. End it now",
   "created_utc": 1701120148,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb11ls4",
   "message": "NTA. Ur boyfriend sounds weird as hell and I’m wondering if the degrading sex kink is something mutual or something you’re doing out of a trauma response? Wishing u all the best, u deserve better girl 💕💕❤️❤️",
   "created_utc": 1701120674,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb11twg",
   "message": "1. You have past trauma, no matter what his kink is there are surely ways around it that won’t inevitably feed into your self image and trauma.\n2. He sucks. No amount of love is worth being degraded 24/7 (no matter his behaviour in bed) \n3. Yes you have a child together, which probably means he believes the hard parts over\n4. Sit down with him and explain how moronic he was, explain that your disappointed because anyone would be receiving that type of proposal \n5. Do not for a second believe that you aren’t worth more than a shitty ass proposal, your worth more then the world could handle that’s why there’s only one of you. \n6. I like your friend, keep her.",
   "created_utc": 1701120757,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb11wli",
   "message": "Can I ask why you think asking for what you want would mean starting over? I know this seems like something that is obvious to you right now, but to me the benefit of pursuing that conversation and however it turns out would be to do things in a different direction. Not start in the same spot and go exactly the same way as before. And I'm curious as to why you think your only options are to stay and have nothing you want or to leave and have nothing you want.\n\nAbsolutely NTA. And I gotta tell ya. I enjoy kink and I'm not a marriage person. But personally, neither of those things stops me from believing that you absolutely deserve to feel special and romantically treasured, and that wanting intimacy in your partnership that isn't born out of sex is very. Very. Very. Fucking reasonable. This shouldn't be something you need to justify to other people. It's okay to want a marriage proposal that makes you feel seen.\n\nInstead of writing this off as something you absolutely have to accept, is there a way for you to take a breather and just think through it a bit? Get a good night's sleep, medicated if you have to, and just spend a day or a week somewhere you can be uninterrupted and just spend time with yourself? Like go to the park with a book or visit a friend or family member without your bf. Go somewhere else and get a change of environment. I know this suggestion may seem trivial, and you may still come to the same decision anyways, but it doesn't hurt to give yourself room to turn it over fully first.\n\nI think you are worth the chance on seeing how you might feel with a change of environment for a day. Things don't have to be this way. You don't have to feel this way.",
   "created_utc": 1701120784,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb11y4g",
   "message": "If he knows your trauma history, and he has a degradation fetish, and you're reliving your trauma to please him as a part of your intimacy, this proposal sounds like a testing of your boundaries more than a proposal. Be sure you understand why you find yourself in this relationship before you make any permanent decisions. \n\nI suspect you'll find yourself souring on this partner sooner than later.",
   "created_utc": 1701120800,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb12vjv",
   "message": "You mentioned that your bf has a degradation kink but you never said that you enjoy it. If you dont then its not really a kink for him..more like SA. I would offer the advice that you should at the bare minimum take a break from the relationship. You need to love yourself before committing to marriage or even dating. My heart goes out to you, i feel like I am reading a version of my younger self here. You deserve love. Just like your daughter does. She will feel this way about herself if you dont show her how she is supposed to feel about herself. Also, i know 4 years might seem like a long time \u0026amp; i understand that you share a child with this man but if you leave now, in 4 more years from now it will feel like ancient history. I know you love him but i really hope you decide to love you first stranger❤️",
   "created_utc": 1701121138,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb12xdr",
   "message": "Usually I am on team \"It's the thought that counts\" when it comes to most iffy proposals and engagement ring posts on here, but I don't feel the same for this one. I am SO sorry that he proposed like this. I would be upset and angry too, and don't even get me started on how he did it after degrading and choking you. That is definitely not how I would describe \"making love\" I completely understand the embarrassment about people asking how he proposed because I've been asked that a few times from both friends/family and coworkers. I'm not saying you should break up with him, because I don't know how strong your relationship is,  BUT you absolutely deserve more. Don't feel that you need to settle just because you have a daughter together. Talk to him and tell him why it made you sad, tell him everything you said in the post. I know it won't be the same, but at the very least he needs to do it properly.",
   "created_utc": 1701121157,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb145uk",
   "message": "Sounds like you need to be with someone who treats you better.",
   "created_utc": 1701121609,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb14gzp",
   "message": "\"I never had anyone do anything super special or meaningful for me. I feel like trash that’s only good for sex.\"\n\n\"I guess I just have to accept the fact I don’t deserve more….\"\n\nBased on these two quotes, and the tone of the post in general, it definitely seems like you have self-worth issues that you need to work on.\n\nNow after considering that, take a look at these quotes:\n\n\"For a long time I was always used for sex by men in the past.\"\n\n\"I also had a traumatizing past in my teenage years of being sexually exploited so sex isn’t really something I care for unless it’s with someone I really love.\"\n\n\"But we had kind of aggressive add with choking and swearing at me (my BF has a degrading kink) this wasn’t romantic. It was far from it\"  \n\n\nYou never mentioned actually liking being choked, sweared at, etc., and you only specifically mentioned that it is a kink for your BF. Based on this, and your history of sexual trauma, I'm really worried that you don't actually like it, and instead you have put yourself into a relationship where your feelings of worthlessness are reinforced. On some level you might actually prefer a relationship like that, because it is what you know and what you have come to prefer due to your past and your core beliefs. But I think you should see a therapist and potentially work through some of these issues.\n\nYou are NOT the asshole. But please, you need to work on your self esteem. I'm NOT saying you should break up with your partner, because I don't know much about him. I'm just saying you should analyze your situation and his role in it, and try to identify if he is helping or hurting your self esteem. Maybe see a couples therapist if you want to make it work with him (which would probably be a good idea since you have a child with him).",
   "created_utc": 1701121722,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb14o7m",
   "message": "My fiancé proposed to me with a huge kisses candy with the ring 💍 on it and he was on his knees right in the middle of the restaurant full of people I had no idea it was coming lol 😂 I was in complete surprise but the way he had the whole thing set up and some of the workers were involved with it was just incredibly romantic. Now the way your man did it I would’ve decked him right there lol 😂 u say he loves you and you love him but the question is does he respect you? For him to ask you to marry you as your cleaning up after you just had done sexual relations with this dude and u turn around and he’s on his knees bday suit and asked u too marry u doesn’t seem to have that much respect for u. Ask yourself this if your daughter called u and told u this how her bf asked her to marry her would you think the dude respected her ? Something u should think about also u stated u don’t deserve more !! That tells me you don’t think highly of yourself low self esteem honey u need to love yourself and know you deserve better and much more. Never settle for anything less when u can get better. You need to work on you  therapy because from what I read u have been through a lot and putting yourself down. Don’t do that. Know your self worth sweetheart I have 3 daughters and a grand baby I tell them all the same things. Take care of yourself your daughter is looking at you and she’s going to follow you for guidance make the right choices. God bless",
   "created_utc": 1701121794,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1a092",
   "message": "I wouldn't just dump him for this. Was it a tactful delivery? Absolutely not. Tell him no. No marriage until he sits and thinks about how important this is to him. And tell him to try again. But yes, he really fumbled this one.",
   "created_utc": 1701123762,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1a6if",
   "message": "Are you ok? You mentioned you had trauma, are you ok with the kind of kink he has, and the kind of person he is? This isn’t just about when he proposed, the relationship sounds a bit difficult to say tbh.\n\nN no, nta. There’s just a lot going on there",
   "created_utc": 1701123826,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1a9dj",
   "message": "But the question you’re failing to ask if he knows about the trauma. Because if he does and still does this then why is she with him. If he does. Or know because she has never told him then how is he I’m the wrong for doing something he may genuinely think she enjoys? Believe it or not there are a lot and I mean a lot of woman that like sex like that.",
   "created_utc": 1701123856,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1ai8l",
   "message": "Ok.. I get the \"it wasn't the most romantic\" part .my husband (best friend and love of my life) got so emotional when we were just picking up my ring, that he lent over two of our friends and proposed right in a pub car park...it doesn't really matter where he proposes...the absolutely disturbing part of this story is you have been used by men in the past for sex and this was after a choking session..you are not ready to be married to this person or anyone...you should never not feel 100% safe and loved no matter what.kinks you both enjoy... and it sounds like you don't enjoy this. Do not get married.",
   "created_utc": 1701123948,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1b1vo",
   "message": "Not the asshole, but your BF is a dumbass.",
   "created_utc": 1701124155,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1bhv3",
   "message": "NTA - TALK TO HIM. Tell him why that was the wrong way to go. Men can be trained if you talk to them.",
   "created_utc": 1701124321,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1c02z",
   "message": "NTA and i know this is a stereotype for this subreddit but you should really consider breaking up with him he seems awful I’m sorry you have to deal with him.",
   "created_utc": 1701124512,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1d3xs",
   "message": "Only you know if he really just made a foolish mistake or not. The whole thing just seems a little suss if your friend is telling you to break off the relationship for something that was just a little tone deaf.\n\nI dunno. The degrading thing really makes me dislike him.  That's not cool.  You can say it's fantasy or whatever, but if it's really happening, that's not a fantasy. A fantasy is when he is alone with his dick in his hand.",
   "created_utc": 1701124934,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1dmef",
   "message": "All I wonder is why OP loves someone who likes choking her. I can't get past that comment. It's as though OP for some reason thinks she deserves to be treated so badly. She refers to them having sex, not making love which makes me think some previous trauma has caused her to think she's in a loving relationship when she's clearly not.",
   "created_utc": 1701125129,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1hu2b",
   "message": "Don’t fall for the sunk cost fallacy. \n\nYou allowing him to stick around is the example that you’re setting of how she should be treated. (Waiting 4 years to be proposed to, him not respecting you as mother of his child, putting in no effort, etc) \n\nYou deserve better, OP. \n\nI’d use therapy first since you guys have a family and if things don’t improve I’d leave",
   "created_utc": 1701126759,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1tcwr",
   "message": "This really is a creative writing sub ain't it",
   "created_utc": 1701131434,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1xemn",
   "message": "NTA also degradation kink??? He literally finds it sexy to degrade you. That should be a MAJOR red flag. It's fundamentally unhealthy to find it appealing to treat your partner inferior. That shows you what he really thinks of you.",
   "created_utc": 1701133094,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1zab7",
   "message": "Drop him. First of all, there are plenty of men out there who aren't sex-obsessed. Secondly, any man who likes to degrade you during sex when you don't like that is just finding an excuse to be abusive.",
   "created_utc": 1701133872,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb235b9",
   "message": "NTA. he has a degradation kink, but do you? what steps does he take in terms of aftercare? choking and degrading are very emotionally charged kinks and without proper aftercare it is very difficult for many people to draw lines between bedroom roleplaying and casual sexual abuse. in no reasonable interpretation of BDSM safe practice would it be alright for someone to propose to their partner immediately after choking and insulting and cumming inside of them without soothing them first, not unless those individuals were the most lifestyle of lifestylers",
   "created_utc": 1701135430,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb2c0et",
   "message": "NTA. He sounds revolting. I'm so sorry. Just because you're connected by having a child together does not mean you should stay with someone who makes you feel terrible. You should never cry over your own proposal. That's extremely inappropriate and juvenile of him.",
   "created_utc": 1701138997,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb2nfjh",
   "message": "Ask him to propose again.",
   "created_utc": 1701143863,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb34ct5",
   "message": "Sister.\n\n1)you have past sexual trauma. \n\n2)your boyfriend has a degradation kink that includes choking you and swearing at you. \n\n3)you feel like you’re being ‘used for sex.’\n\nForget the stupid proposal. Why are you with this man? Inertia?  Is he at least a decent father to your mutual child, something you don’t mention? How does he add value -and I do not mean money- to your life?",
   "created_utc": 1701153361,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb3omqn",
   "message": "I've read this post before but you didn't use the term creampie this time. YTA for making this up/copying another thread",
   "created_utc": 1701169288,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0yxtn",
   "message": "Well, here's the upside...you found this out before you made the mistake of marrying him, and now you know he's inattentive to your needs, doesn't respect your journey or wishes, and is defensive when called on it. BTW, sexual trauma doesn't sound like it's very well managed with a degradation kink....yet another thing he sounds woefully inept and callous about. That can't be how you want to be made love to.\n\nBetter move on, before you do something REALLY stupid.\n\nDump this idiot, then get some therapy to avoid guys like this.",
   "created_utc": 1701119711,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0ctos",
   "message": "Your best friend is right, you could find someone that treats you how you want to be treated, proposing after degrading sex isn’t romantic nor is it normal",
   "created_utc": 1701111632,
   "score": 32,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb10soj",
   "message": "Dude chokes and degrades you and you’re concerned about the way he proposed. \n\nI don’t want to live in this world anymore",
   "created_utc": 1701120377,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0wnva",
   "message": "My husband told me he loved me for the first time right after sex. During would have been a problem. After was perfect.\n\nI don’t think I’d have minded this as a proposal, personally. But everyone is different! And if he’s proposing, he should know you well enough to know that for you, this wasn’t the time or place.\n\nYou’re not wrong in having your feelings. However, I would rethink getting engaged and married at this point. It sounds like you have a lot of trauma to work through, which should be your top priority.",
   "created_utc": 1701118878,
   "score": 10,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0qwwa",
   "message": "NTA but I’m going to agree with your best friend. It doesn’t sound he respects you",
   "created_utc": 1701116780,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0szrc",
   "message": "NTA\n\nSo he knows you have a history with sex being used to control you, and he has a degrading kink?   Are you ok with that?  \n\nIgnore the proposal for now.  He sounds like an abuser that hides his absue with a kink.",
   "created_utc": 1701117542,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0zov1",
   "message": "My ex-husband proposed during sex, and it took many years to understand that when a man puts no effort into the proposal, he doesn't actually value you or your relationship. The no effort proposal was just the start. He put no effort into the wedding, our marriage or our children. \n\nAs someone who also experienced a lot of trauma growing up, I accepted things most other women wouldn't. And trust me, no healthy minded woman would have accepted that proposal.\n\nMy advice, run girl before that one child becomes 3 and you're eventually left on your own with them all.",
   "created_utc": 1701119983,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb11y5z",
   "message": "NTA. If he proposed after sex, given your history of being used for sex and the rough encounter you’d just had (which you described as his kink and not yours), his proposal at that moment seems insensitive, and at the very least shows that he doesn’t really know you that well (which really makes me wonder if the two of you are ready for marriage).\n\nI agree with the folks who said if you really love him and want to stay in the relationship, you should tell him why the way he proposed hurt you, and that you want a proposal that you can at least share the details of with his family and yours (cause does he really want you to share the details of that proposal with people?). If his response is respectful and understanding of your feelings, and he takes advantage of a proposal redo, then he’s shown you he has the maturity to be a husband and put in the work that a marriage requires. If he acts like a jerk in response to you sharing your feelings about what happened and just dismisses them, then that is not only a sign that he isn’t ready for that level of partnership, but also of how he’ll continue to treat you if you move forward and marry him. \n\nAlso, YES, you deserve more that. Everyone deserves a partner who knows them, and is willing to listen to and consider their feelings. \n\nLastly, when you said “Maybe I don’t deserve more than that,” it honest to God broke my heart. If you think that, you really should consider seeking out counseling to address the way your past trauma is still affecting you. It has clearly broken your self esteem to the point where you are wondering if you’re allowed to have feeling and wants in a relationship that are different from your partner’s. That will affect how you let your partner treat you, whether you stay with your current boyfriend, or decide to move on. That’s not healthy, and after all you’ve been through, you deserve to not just have a partner who cares about your feelings, but to believe that you deserve that.",
   "created_utc": 1701120800,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb124mi",
   "message": "He is selfish and you are NTA.  You asked him to propose with something meaningful, and that’s what he did, he proposed at a time that was meaningful to HIM, he never thought about you.  You should break up with him.",
   "created_utc": 1701120865,
   "score": 3,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0q3m4",
   "message": "NTA. It’s a huge red flag that he doesn’t take in consideration your trauma when planning a proposal. He did this for him and what he would like and didn’t care about you as a person in this equation.",
   "created_utc": 1701116482,
   "score": 5,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0qqet",
   "message": "NTA. Sure, sex can be romantic, but it's not romantic for a proposal. Some comments are wow, you act like you don't know what bare minimum means. OP, never think that you don't deserve respect. You do.",
   "created_utc": 1701116713,
   "score": 6,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0r8lv",
   "message": "When I was very young I had a boyfriend pull the same 'proposal after sex' move. Long story short, he turned out to be an inconsiderate lying asshole and I dodged a bullet. I wouldn't marry this dude...",
   "created_utc": 1701116899,
   "score": 4,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0gcng",
   "message": "Does he know all that? \n\nBecause if he's that of a great guy and if he knew all of what you're feeling about sex, pretty sure he wouldn't have done this proposal. \n\nIn your post, you said that he was confused which means that he might not have known.\n\nMight want to share your feelings and have a discussion with him",
   "created_utc": 1701112926,
   "score": 10,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0p8s7",
   "message": "I hope you said no. And that you want a do over. F that. If i ever get proposed to (unlikely) it better be romantic af or im saying no.",
   "created_utc": 1701116167,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0sbf4",
   "message": "Do you have it degrading kink,  or is it something you put up with? NTA you probably needed to tell him exactly what you wanted. You will probably need to do this fyour entire marriage.",
   "created_utc": 1701117294,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0toff",
   "message": "Mmmm doubt",
   "created_utc": 1701117791,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0tzb2",
   "message": "Then you shouldve said no like Taylor Swift. \n\nAnd you need counseling. You are carrying too much baggage that does not need to be passed onto her. \n\nYou have an extremely unhealthy relationship with sex as well.",
   "created_utc": 1701117903,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0v1zy",
   "message": "NTA. Is he really this clueless or did he sabotage it on purpose to make you feel like you’re the problem.",
   "created_utc": 1701118293,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0vf7p",
   "message": "You can’t expect more than that in your current situation 😂😂😂",
   "created_utc": 1701118427,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0vm3k",
   "message": "Take a break for week or two from each other.  Then say, Let's start over again.  Tell him you want to be surprised with a romantic proposal.",
   "created_utc": 1701118498,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0xky1",
   "message": "NTA. Proposing after sex is not 'meaningful' and not a story I'd personally like to share. \n\n\u0026gt;my BF has a degrading kink\n\ntbh the proposal combined with the backstory you shared makes it come across to me like this was part of the kink.",
   "created_utc": 1701119213,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb10j5g",
   "message": "NTA Now about the sex, sex, and sex comment. Men tend to lean toward physical touch as intimacy and that is why you see it often. Your BF might be a bit clueless but he did propose. You might take some time to explain it to him straight forward and how he could redo the proposal, doesn’t have to be something crazy and could be as simple as right after finishing a movie that you both like and before anything else happens. You could literally try and stay calm and say “I want to marry you but I don’t want to explain our proposal to people because that’s embarrassing. Would you mind picking a new date and asking me at that time so we can have a more appropriate situation to tell people.” You might try doing the movie thing as an example. If you are as damaged as you say you are with sex then you might not want to feed into his kink.",
   "created_utc": 1701120282,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb1202r",
   "message": "There are so many red flags in this post and I think both of you are the ass.\n\nFirst, you’re in a relationship and have a child with this man and despite your traumatic sexual past, you engage in rough kinky sex. What the heck girl.\n\nYou’ve allowed your body to be used in a way that is trash - absolute trash. This only reinforces your trauma. \n\nThen after obviously enjoying being treated like crap in the bedroom and likely enjoying it, you’re surprised with a proposal that isn’t rainbows and butterflies. \n\nGood grief. Respect yourself. Get therapy and get out of the abusive relationship in the bedroom - unless of course - you like it. If so, deal with the proposal the way he gave it. It’s “love”. Ya right. This marriage won’t last.",
   "created_utc": 1701120819,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb12q03",
   "message": "NTA- Your expectations were pretty normal even if your level of distress was not. Proposing to a partner with sexual trauma in that way was a wild choice and it's concerning that it didn't occur to him that it would be upsetting to you.\n\nThe fact that you felt the sex that happened right before was far from romantic while he thought it was such a clear expression of love/romance he chose that time to propose means you guys are on totally different pages and need help communicating. 4 years into a relationship you shouldn't have such drastically different perceptions about what your partner wants or how they feel. If this is a pattern and not just a one off miscalculation I'd look into couples counseling. \n\nIn general does he do things that show he notices and cares about what specifically makes you feel special and loved? Is he usually a better judge of how his actions will make you feel? Are you communicating about kink and degradation in the moment and only taking sex in that direction when you are both in the mood for kink? Have you told him you don't experience sexual degradation as romantic and loving, and do you feel that you can ask for more romantic and loving sexual experiences if and when you want them?",
   "created_utc": 1701121082,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb13dr8",
   "message": "I would be open and honest with him see if he changes if he doesn’t tell him to kick rocks!",
   "created_utc": 1701121322,
   "score": 2,
   "submission_id": "185ac3v"
  },
  {
   "comment_id": "kb0zhn9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "185ac3v"
  }
 ]
}