{
 "submission_id": "185bfyl",
 "title": "AITAH for not saving baby items to give to my SIL \"someday\"",
 "selftext": "We have a 2 year old girl and not planning on having anymore children. I have so many baby things I am ready to depart with. When my mother-in-law found out I was donating these things to charities and neighborhood collections, she got very upset and demanded I hand them down to my sister-in-law (her daughter) instead because she's going to need everything when she has a baby. They are not struggling financially.\n\nI've given her tons of stuff already, she's taken boxes full of baby clothes, toys, walker etc. She's not pregnant and who knows if when she is she will have a girl.\n\nI don't mind letting her have them, but they live in a different city 5 hours away, we only see them a few times a year and our car is always packed with luggage and 2 dogs, we don't have lots of room to bring stuff down. I hate all the clutter and my growing kid is running out of room for new stuff. I just want to donate a bunch of like-new things to the toy and clothing drive right now. I'm tired of storing all this stuff and who knows when she will get pregnant (it took us 3 years).  I've offered to save a few things that are high value and/or special items, but they are making me feel guilty for not saving everything for her! AITAH if I donate these items instead?",
 "created_utc": 1701113619,
 "permalink": "/r/AITAH/comments/185bfyl/aitah_for_not_saving_baby_items_to_give_to_my_sil/",
 "score": 76,
 "url": "https://www.reddit.com/r/AITAH/comments/185bfyl/aitah_for_not_saving_baby_items_to_give_to_my_sil/",
 "comments": [
  {
   "comment_id": "kb0j9ps",
   "message": "No, OP, NTA. \n\nYour MIL sounds like she has a scarcity mindset and also probably had a strong system for hand-me-downs when she had children. \n\nHave you talked to your SIL? It might be good to get a confirmation from her that you can use when MIL gives you shit. \n\nPlus, baby stuff gets outdated quickly with safety advancements. If you save all your stuff for someday, it will likely be more trash than help. There will always be other hand-me-downs nearby that they can take advantage of if and when they need them.",
   "created_utc": 1701113993,
   "score": 96,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0jbts",
   "message": "Your mil can store them at her place or they can go directly off to donation.",
   "created_utc": 1701114014,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0noet",
   "message": "It's the storage, but also the transport. Both cars are always full whether they come to visit us or we go to visit them. Only like 1-2 items make the cut each time.  \n\nThey think because we have a much bigger house than they do we shouldn't mind holding them. They are hoarders and I'm a clutter-phobe lol",
   "created_utc": 1701115593,
   "score": 96,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0nl1k",
   "message": "NTA\n\nTell MIL and SIL to come get the stuff if they want it, if not donate or toss it.  Put the ball in their court with a deadline for when the stuff will be given away and stick to it.  They get the chance to get the stuff they want but make it their responsibility to come get it at your convenience and by your deadline.",
   "created_utc": 1701115559,
   "score": 56,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0k4yj",
   "message": "NTA I would donate them without even mentioning it. They don’t need to know your every move. Alternatively, hey SIL, would you like to go through the baby things before I donate it to charity?",
   "created_utc": 1701114308,
   "score": 32,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0jxze",
   "message": "NTA. Your house, your stuff, your rules.",
   "created_utc": 1701114238,
   "score": 25,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0nd2e",
   "message": "NTA. First you need to talk to SIL to see if she even wants them. If she does tell her she needs to drive down to get them within the next week. \n\nWhatever you do don’t offer for MIL to take what she feels your SIL might need, that is such a waste of a valuable resource for people in need. \n\nOutside of basic clothes and supplies like bottles and bibs, baby items can have such sort life spans. The boppy wrap around now is considered a hazard, as are many vibrations chairs. Safety features improve every year, and people have different tastes in the clothes they want to dress their children in. \n\nSIL may just want her own new stuff as well. My sister saved so much stuff as the first to give birth assuming her younger sisters and SIL could use the items down the line. Drove her husband nuts with totes and totes of clothes in the garage and strollers and other bulky items laying around. By the time anyone gave birth half of the bulky items were outdated, so of course we wanted the new version that were more user friendly and had better safety features. Even if the items were still acceptable safety wise and easy to use, there still maybe a reason for you SIL to not want them. For example my sister had a perfectly good stroller, but i knew I wanted one designed for running, and my other sister knowing she was going to try for kids close together wanted one designed for multiple kids. As for the clothes and smaller items, the only items any of us were really interested in were the hand made items from our mom, grandma, and aunts, and she wanted to save most of those for her future grandchildren. Well that and the outfits I bought myself for my nieces, as I bought items that I was drawn to, so of course they were my style.",
   "created_utc": 1701115477,
   "score": 23,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0rr3v",
   "message": "\u0026gt; they are making me feel guilty for not saving everything for her\n\n\n\" i am absolutely fine with giving you everything, i didnt know you were ready to pick  everything up ! when are you availzible to come pick up the rest ? Im in a rush tho because i am running out of place for the kid's New item. Is (date) ok ?\"",
   "created_utc": 1701117086,
   "score": 18,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0ux2r",
   "message": "NTA but why not tell your SIL and/or MIL that you need them out of your house so they need to come and pick up what they want by a certain date or else they are going to charity? \n\nFor favors like this it’s typically on the recipient to manage the logistics. It’s not your problem to store stuff for them indefinitely nor is it your problem to transport things 5 hours away. But it would be kind to give family the right of first refusal if you’re just giving these things away",
   "created_utc": 1701118242,
   "score": 12,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0wvb3",
   "message": "NTA\n\nUnless SiL or MiL is willing to drive down the day you want them out of your house, they can STFU.",
   "created_utc": 1701118954,
   "score": 8,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb15gto",
   "message": "Stop telling those women what you are doing!",
   "created_utc": 1701122080,
   "score": 7,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0p31l",
   "message": "I'd give them a deadline and if they can't come and get in within, say, a month or two, then they clearly don't care that much. Put the onus on them. \n\nNTA.",
   "created_utc": 1701116109,
   "score": 5,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0t1un",
   "message": "\u0026gt;I'm tired of storing all this stuff and who knows when she will get pregnant\n  \n\u0026gt;she got very upset and demanded I hand them down to my sister-in-law\n\nYour MiL demands they be given to get daughter, then you bring them to your MiL's house and she can keep them until it's time.    \n\nNTA",
   "created_utc": 1701117563,
   "score": 7,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1f2e6",
   "message": "Unless SIL has herself asked, ignore MIL. \n\nwhen i was dealing with infertility, the few practical hand- me- downs during in my basement taunted me.",
   "created_utc": 1701125685,
   "score": 6,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1t8cc",
   "message": "nta...'sorry, I just feel like the ladies at the shelter could use them more .' If she can argue with that, then she'll just look ignorant. Or maybe she'll just shut up about it.",
   "created_utc": 1701131382,
   "score": 5,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1vqbd",
   "message": "Donate, especially with the holiday season coming up and so many people in need.  It's none of MIL's business whatsoever and someone, preferable SIL, needs to tell her that.",
   "created_utc": 1701132407,
   "score": 5,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb15hsm",
   "message": "NTA.  You already gave her a lot of things.  This is none of your MIL's business.",
   "created_utc": 1701122090,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb17jba",
   "message": "Tell MIL she’s welcome to store it but it’s leaving your house.",
   "created_utc": 1701122837,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1z5xj",
   "message": "How does MIL know what your donate or when?  Ohhh, because you TELL her.  So stop telling her.",
   "created_utc": 1701133821,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0mh57",
   "message": "NTA you need the room and your SIL doesn't have a baby. Ask your MIL to store things or donate them. You can't live your life based on what might happen in your SIL's.",
   "created_utc": 1701115150,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0ssl3",
   "message": "NTA tell your MIL to fuck off",
   "created_utc": 1701117469,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb11r3l",
   "message": "NTA  After talking to husband to tell him what you going to do, because he'll probably be the one getting a phone call, tell MIL that you'll be donating everything on such and such date that you no longer have storage room for it. If MIL complains tell her she's welcome to it if MIL picks it up by that date. Or it will be donated.",
   "created_utc": 1701120728,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1396i",
   "message": "Why does your MIL dictate what happens to your stuff?? Put her on an info diet and donate til your heart’s content.",
   "created_utc": 1701121276,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1vg1i",
   "message": "Your donation could help those that are struggling instead of giving everything to SIL. Just the fact Mil said you need to give everything to Sil I would donate.",
   "created_utc": 1701132291,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1z43g",
   "message": "What I'm hearing is that your MIL has just offered to collect and store 100% of the baby-item hand-me-downs she wants your SIL to eventually receive.",
   "created_utc": 1701133800,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb20wc2",
   "message": "Pack it up.  Tell your SO to tell MIL and SIL to come pick it up by a specific date or pay for shipping it to them.  It's on them to get it.  You might give them an extra few days to be nice, but by a week after the date you set, donate it all.\n\nYou don't have to be the caretaker of the stuff.",
   "created_utc": 1701134530,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2cn25",
   "message": "NTA I worked at Babies R Us.. Do you know how many upgrades, changes, and new fangled items came in over the course of a year? Tell your MIL you don't want to deprive your SIL the joy of baby shopping, doing a registry, having a baby shower with new items, picking her own theme and patterns for the nursery. Her new baby, whenever it gets here, deserves all the firsts your baby had. Save anything that my have come directly from MIL or could be sentimental, and donate the rest.",
   "created_utc": 1701139259,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2fywz",
   "message": "There are so many people who are struggling and could use these items right now. Check with your local churches or police departments- around the holidays many of them have lists of families you can “adopt” and provide Christmas gifts for. The stuff would immediately be put to good use and be much appreciated… a better alternative to it cluttering up your house while waiting for someone’s imaginary future baby.",
   "created_utc": 1701140670,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2qrpz",
   "message": "Stop telling your mother-in-law about the things that you have to give away and just give them away and donate them. I'm pretty sure there are a lot of people out there that can use those things. Who already have children",
   "created_utc": 1701145409,
   "score": 3,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb0su17",
   "message": "NTA\n\nIf your MIL wants them to go to her daughter then she can either pay to ship them, take them to her, herself, or store them at her house until your SIL can collect them.",
   "created_utc": 1701117483,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1323j",
   "message": "NTA. Tell MIL she's welcome to bring a truck or van to take (and store) whatever you're done with, or she can accept that you're going to donate locally.",
   "created_utc": 1701121205,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb14bzk",
   "message": "Tell your MIL she's welcome to drive down and pick it all up, but give her a deadline or that will forever be \"someday.\"\n\nOnce the deadline passes, donate everything.",
   "created_utc": 1701121671,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1ebfg",
   "message": "Does MIL live locally? Tell her she can take whatever she likes and store it at hers but otherwise she is shit outta luck.\n\nAlso, I'd just let your partner do the bulk of the communicating with their mom. She sounds like a handful.",
   "created_utc": 1701125399,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1g46q",
   "message": "NTA. Tell her if she wants her daughter to have them then she needs to take the stuff otherwise you're donating it. I would still donate stuff she doesn't know what you have.",
   "created_utc": 1701126089,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1if05",
   "message": "NTA.  Mattering on how you both feel about MIL and how well you get along with SIL, you could call her up and ask her if she wants any of it.  Tell her that her mom wanted her to have it and be like, \"I think this might be a hint from her that she wants you having a grandbaby....\"\n\nIf she wants, great, ask to split shipping...",
   "created_utc": 1701126987,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2fkpl",
   "message": "Hey sis, or SIL, MIL who ever, we are getting rid of all our baby items. We will NOT have room in our car during our next visit. \n\nIf you'd like them instead of me just donating them to charity,  then I absolutely have a hard deadline of getting all this stuff out by \"date\"\n\nWe just can't transport them to you, and so we just have to get rid of this stuff. We are happy for you to have it, but the onus is going to be on you to make arrangements to come get it. Thanks heaps.\n\nEdit: sorry, NTA",
   "created_utc": 1701140500,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2p1hm",
   "message": "Stop being such a doormat.\n\nAsk your SIL if she wants the stuff.  If she says no, get rid of it and tell your MIL to STFU.  If she does, give her a deadline to **come get it** and be very clear that missing the deadline without asking to reschedule means it’s all getting donated and tell your MIL to STFU.",
   "created_utc": 1701144576,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb375jd",
   "message": "NTA. When someone gives you something for free, expecting a 5 hour car drive (10 round trip?) for free delivery does not need to be included. I have a 10 month old, as the cloth we received from others or bought him become too small (very quickly) my wife washes them, folds them and puts them in a large tot by age. We offer em to friends or friends or friends, if nobody gets them we donate. Our house isn’t small but it’s not huge, don’t have space to store stuff for someone else. \n\nIf your MIL or SIL wanted these items they would offer to drive the 5 hours and pick them up. If they weren’t assholes they’d even offer to watch your child for a few hours to give you some much needed rest.",
   "created_utc": 1701155340,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3y22k",
   "message": "Box the shit up, take it over to MIL and tell her it's hers now, she can drive it to SIL or donate it herself.",
   "created_utc": 1701175411,
   "score": 2,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb131eq",
   "message": "NTA. Tell your SIL if she wants these things she can pay to get them shipped to her home.",
   "created_utc": 1701121198,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb13rfo",
   "message": "Tell MIL that you need to get all of these items out of the house in the next week.  Give MIL the option of coming to your place and picking up the items she wants (and the rest will be going to the charity donations the following day).  MIL can either store them or make the 5 hour drive to SIL.",
   "created_utc": 1701121462,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb14dd1",
   "message": "NTA, SIL or MIL is welcome to come pick up your outgrown baby stuff by \"date\", otherwise you'll donate it.",
   "created_utc": 1701121686,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb17023",
   "message": "\u0026gt;they are making me feel guilty for not saving everything for her!\n\nSorry, but this is on you. They aren't \"making you feel guilty.\" You are allowing them to make you feel guilty. STOP IT. \n\nGive them a date to pick up *everything* they want (even if they have to rent a van) and tell them if they don't come get stuff by that date, you're giving it to all (every scrap) to charity. Also, anything they don't take in one trip gets donated to charity. This is your MIL, so your husband should be the one telling them to get their butts in gear. \n\nYou are more than a storage space for hoarders, OP.  Please try to keep that in mind. \n\nNTA unless you keep being their doormat.",
   "created_utc": 1701122642,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb17stn",
   "message": "Give your MIL a deadline to pick up the baby items, then she can store them for SIL. If she misses the deadline then donate the items. NTA for not wanting to store them indefinitely!",
   "created_utc": 1701122934,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb187fj",
   "message": "If they want it, they can store it. NTA",
   "created_utc": 1701123086,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb18h2b",
   "message": "NTA If they want them then they can keep them in their own homes or get a storage unit, if they don’t want that then donate everything.",
   "created_utc": 1701123186,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb18rn9",
   "message": "NTA \n\ntell your MIL to handle the shit handoff so you dont need to pack/hold on to it till the next holiday when you see SIL",
   "created_utc": 1701123296,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb18yt2",
   "message": "Definitely NTA. \n\nI see SIL lives 5 hours away? Does MIL? Can you have her pick them up? \n\nOr maybe give them a time frame if the boy live far away. “Hey you have until X day or we are going to clear them out because we ran out of space.”\n\nHonestly, both of those options are above and beyond. I would simply donate them 🤷🏻‍♀️",
   "created_utc": 1701123372,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb19o8d",
   "message": "NTA\n\nJust give a call to your SIL, and ask her if she wants some things that are left, she can come to get them",
   "created_utc": 1701123636,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1aeoi",
   "message": "NTA. Donate it all.",
   "created_utc": 1701123911,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1aix7",
   "message": "Bring the stuff to MIL’s house and tell her to store them.",
   "created_utc": 1701123956,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1ap33",
   "message": "The Mom can come get them AND store them too. If she doesn't want to do that, she absolutely better not be dictating that you keep them when you have no room and don't want to.",
   "created_utc": 1701124021,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1arir",
   "message": "NTA - store them with the MIL she can transport them if she feels so passionately.",
   "created_utc": 1701124047,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1bce2",
   "message": "NTA. This is none of MIL’s business and there’s absolutely no need for you to feel guilty. You aren’t a free storage unit for your SIL’s hypothetical future baby. To shut MIL up, tell SIL that if she wants the rest of the baby stuff, she has until date X to come get it, and anything left after that date will be donated.",
   "created_utc": 1701124263,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1bgfm",
   "message": "Perhaps give both MIL and SIL fair opportunity to figure how they will pick things up from you ? Set your (reasonable) parameters, and then stick to it. There isn’t anything to be gained by commenting on the logic (illogic) of their request. Just set out your reasonable boundaries. If they can’t manage to gather the stuff with fair notice and fair time given, they don’t have grounds for griping. Be sure to have hubby on board with the reasonableness of your ground rules.",
   "created_utc": 1701124306,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1byrt",
   "message": "Tell MIL that she’s more than welcome to pick up said items and store them! NTA",
   "created_utc": 1701124499,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1d172",
   "message": "NTA. I was in a similar situation. I was pressured to save stuff and I did save a lot of it but when my nephew was born 5 years after my youngest it turns out they didn't want a lot of the stuff I held onto. Also, even if you clean stuff well before you put it in storage, stuff that's been peed on, pooped on, spit up on, etc. tends not to be desirable after years in storage. Even some of the clothes started to degrade. The material on the high chair seat started flaking off. The bottles developed a film on them that couldn't be washed off... I don't even understand how. Save books... that's about it",
   "created_utc": 1701124904,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1d3zf",
   "message": "NTA.\n\nSomeone could need/use that stuff now, rather than being stored away by SIL for if/when she needs it.\n\nIt's your stuff. You can sell, bin, burn, or give it away if you want to. No one is entitled to your daughters old things, especially when getting said things, including a 5hr trip to get them there.",
   "created_utc": 1701124934,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1dksb",
   "message": "Stop telling MIL you are donating things and just get rid of them!",
   "created_utc": 1701125112,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1dppo",
   "message": "NTA she can buy them off of you and pay for the shipping otherwise she can go kick rocks.",
   "created_utc": 1701125165,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1e7jg",
   "message": "\"If you want free stuff, come and get them. Nut up or shut up. My home is not your storage unit.\"\n\nBut just a wee note - I've saved some small, unique, and beautiful pieces to give away as gifts for friends and family who might be expecting in the future.\n\nNTA.",
   "created_utc": 1701125358,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1gbhj",
   "message": "Let your mil know you’ll drop it all off at her house",
   "created_utc": 1701126169,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1ix97",
   "message": "Tell your MIL you didn't realize that she would want everything and you will ask from now on. Ask SIL about big ticket items and donate the rest without mentioning it. People don't need to know everything, especially if they are dramatic. Moving in silence is a powerful skill.",
   "created_utc": 1701127187,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1jehf",
   "message": "It's nice to do but if you don't gave the storage then get rid! Is there any special pieces you could keep like a nice outfit to pass on? Or coat. \n\nI got my nephew a brown leather jacket like Biggles on my first date with my husband. My sister kept it for years for me. Then the year before I got pregnant she gave a box of stuff for a colleagues daughter and didn't feel like sorting through it all. She said there's a jacket in there it's the only thing I'm bothered about getting back. It didn't come back, I was super sad about it!",
   "created_utc": 1701127374,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1jhjl",
   "message": "Tell your mother in law to come and collect it, situation resolved.",
   "created_utc": 1701127407,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1jjvd",
   "message": "NTA, tell SIL you'll ship everything if she pays for it, if not it's going to charity.",
   "created_utc": 1701127432,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1kprp",
   "message": "NTA\n\nUnless your MIL wants to rent a van, drive to your house and take everything she wants to save for her daughter to her house then just quietly donate it and get your space back.",
   "created_utc": 1701127902,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1lc3r",
   "message": "If your mil wants to save the items let her know she is welcome to pick them up but you want the space and keeping the items is not a negotiation, \n\nSome baby stuff might be obsolete or even recalled by the time she needs the items, (unlikely) \n\nI remember I handed down a nice glider chair to one of a family friends children and it was eventually recalled or there were reports of people leaving the babies unattended and the baby getting hurt by falling out, I immediately showed the mother the article though so she was aware.",
   "created_utc": 1701128157,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1mhub",
   "message": "NTA.\n\nif you're feeling benevolent, you could put aside an item or two, but if you do, let your MIL store it. In fact, save something bulky and awkward that you never really used because it wasn't really useful and drop it off with MIL. \n\nOtherwise, donate or sell as you see fit. It's yours.",
   "created_utc": 1701128635,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1ojcr",
   "message": "Why don’t you ask you MIL if she would like to keep them as you do not have room for it. \nNTA.",
   "created_utc": 1701129466,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1pczy",
   "message": "Tell your MIL that you'd be happy to box everything up and drop it off to her for her to store for your SIL.  Or if MIL doesn't live nearby then perhaps she'd like to pay to have everything shipped to SIL.",
   "created_utc": 1701129803,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1pmn3",
   "message": "NTA get rid of them and just tell them you donated it to good causes who need the stuff right now rather than cluttering up your house or hers. They sulk them in future you don’t save them anything. They’re not entitled to this stuff. Just get rid and ignore. Your MIL continues then info diet comes into play.",
   "created_utc": 1701129914,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1r54q",
   "message": "NTA I don't understand where they have the audacity to DEMAND that you do anything. They would have been given a two finger salute (the middle finger).I don't do well with demands.",
   "created_utc": 1701130529,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1rd4l",
   "message": "NTA. Tell your MIL she's welcome to hold onto the items, otherwise they're getting donated.",
   "created_utc": 1701130620,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1sdhx",
   "message": "NTA. If your MIL wants them so badly, then she can store them at her place until your SIL starts having kids. And your MIL can figure out how to transport it.",
   "created_utc": 1701131032,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1sdj6",
   "message": "NTA but your MiL needs to learn her proper place. This is none of her business, and she needs to hear that in no uncertain terms. Spell it out like you would for a naughty child. Put her in check.",
   "created_utc": 1701131032,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1t303",
   "message": "Offer them to her if she comes and gets them - or if she pays shipping so you can mail them.  Let her know when you are going to donate them if she doesn't do either one of those things. Not really related to your situation, but I need to overshare.  I had someone purchase a gift for my baby.  Once she had a baby she asked for the item back.  The sense of entitlement raises its head in quirky ways!",
   "created_utc": 1701131321,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1ute6",
   "message": "Sounds like you can save a trip to the donation zone and drop it off at mil to store!",
   "created_utc": 1701132033,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1uv3c",
   "message": "Take it over to MIL house and she can store it.  Say here’s SIL baby stuff you don’t want me to give away   I  can’t store it but if you want it here it is.",
   "created_utc": 1701132052,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1v64c",
   "message": "NTA-Not to go all Ms. Manners on you but a gift once given belongs to the recipient. Said recipient can do whatever the hell they want to with THEIR items. (that means they were yours and you can give them away and MIL and SIL dont have a leg to stand on).",
   "created_utc": 1701132177,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1v849",
   "message": "Give everything to MIL. Let her deal with it getting to SIL,",
   "created_utc": 1701132199,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1vd8a",
   "message": "omg.... NTA your MIL is being weird.",
   "created_utc": 1701132258,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb1yiiq",
   "message": "Unless your SIL has a baby girl during the same season as your daughter, the clothes are going to be unusable. A summer baby cannot wear clothes for a winter baby at a similar age. In most cases they are in infant/newborn for literally days/weeks before they outgrow them.",
   "created_utc": 1701133557,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb24v6t",
   "message": "NTA, but save your relationship with your MIL and take the stuff to HER house and have HER store it for you.",
   "created_utc": 1701136125,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb25q9k",
   "message": "Some of your used things may be outdated. And gently used clothes need to go to those who really need them. \nDonate. \nThen save some stuff, then tell MIL to come pick it up. Give her a firm date when they need to be picked up.  \nAnd if they don't, then donate or start charging storage rates.",
   "created_utc": 1701136470,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb267i3",
   "message": "I would say if they want them that badly, pay for shipping and I will\nHappily send them off",
   "created_utc": 1701136662,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb26z1h",
   "message": "NTA. Your MIL is the asshole.",
   "created_utc": 1701136968,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb28x4c",
   "message": "Nta. MIL needs to relax and mind her business. Or she can come get the stuff and stash it until….whenever.",
   "created_utc": 1701137749,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb29omd",
   "message": "Donate freely. There is such a giant surplus of used baby stuff literally everywhere. You should not be inconveniencing yourself and family by hoarding stuff for a baby that hasn’t happened yet.",
   "created_utc": 1701138053,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2ce74",
   "message": "NTAH and No is a complete sentence.    \nMake it their problem. \"If you want anything, come get it. Anything left after this date is going to charity.\"   \nTurn it back on them. If they ask you to store it at your place. \"No, I don't have the room.\" Don't explain, defend or get lost in details.    \nIf they continue, \"If you don't want it badly enough to keep it at your place, then I can't help you.\"   Again no explanation, no defending and no details.",
   "created_utc": 1701139155,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2dcch",
   "message": "NTA\nUgh, my man’s family gave him bags AND BAGS of baby shit when I was pregnant and I did not want any of it. Hand me downs are cool and nice and helpful, but I wanted the experience of getting it all ourselves and I wanted my daughter to have new, nice things🤷🏼‍♀️ They got weird if we said no, so we just gave it to the Mission as they kept piling it on us. Even an incomplete car seat?? No, thank you.",
   "created_utc": 1701139558,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2ddkj",
   "message": "NTA\nI’d tell mil “I’m handing all of this off to someone else who needs it now. Sil only needs it hypothetically in a few years and it’s all in my way. Sorry.”\nOr tell her nothing at all, do what you want to with it and tell mil less about your plans to part with stuff you no longer need. \n\nAlso, Is your mil actually my dad? Are they maybe the same person? My dad hates for me to donate stuff because someone in the family might need it… and he’s not entirely wrong. I have 5 siblings and some of their children are now having children. I have about 23 nieces and nephews, the youngest of which will turn 3 this month. I have 5 great nieces and nephews with the youngest being 4 weeks old, but I digress…\nLike you, I don’t mind handing off items I’m parting with to family in need (or even potentially in need down the road). I just don’t think the hand off should inconvenience the hell out of me. \n\nI’m just lucky my dad only lives an hour away, so I just tell him he better pick up what he wants by x date and keep it at his house because it’s all leaving mine. \nBut for whatever reason, my dad cannot stand to part with things and he can’t stand for me to either.",
   "created_utc": 1701139573,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2fdg7",
   "message": "NTA it’s your stuff do with it as you wish. Give MIL and SIL a list of what you got. Tell them if they want it to come and get it by a date. You will not be storing it and it will all be donated after the date. By the time she has a kid she’ll want to get her own stuff anyway.",
   "created_utc": 1701140415,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2fgq1",
   "message": "go ahead and donate, but also it really doesn't matter if your sil has a daughter or son, the baby will not care if it's blankets are pink or whatever, so that one line inclusion kinda shows a bias you might wanna think about",
   "created_utc": 1701140453,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2id8f",
   "message": "NTA - just tell them no and be done with it",
   "created_utc": 1701141689,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2k0gn",
   "message": "Give the SIL a time frame then. Tell her she can come to your house on a specific date and take everything she wants. If she doesn't come, assume she's good and continue donating. NTA",
   "created_utc": 1701142389,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2k2ai",
   "message": "She isn’t even pregnant ffs. If I was your SIL, I wouldn’t want any of that unless it was a family heirloom. NTA.",
   "created_utc": 1701142412,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2mb3l",
   "message": "Nope. She hasn’t asked personally for them it’s just her mom . Its your stuff and you can do whatever you want with it.",
   "created_utc": 1701143377,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2mi5j",
   "message": "NTA \n\nGive them a time limit to come pick it up or find somewhere for you to store it until they can. Tell them they can pay (NOT PAY YOU BACK) for a storage unit. If you’re feeling really generous, get a quote on having it shipped to them and have them send you the money.",
   "created_utc": 1701143459,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2mmpj",
   "message": "NTA - I'm going to focus on one line here  ***She's not pregnant and who knows if when she is she will have a girl.***  This...there is no guarantee that either of these things will happen. \n\nYou could ask your SIL if there's anything particular she wants, but also tell her you just can't store it anymore.",
   "created_utc": 1701143514,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2nd17",
   "message": "NTA. OP stop feeling guilty. Make it a problem for MIL to deal with. Start dumping it at MIL’s house to store. If she wants them saved for her daughter’s potential future pregnancy, she can store them.",
   "created_utc": 1701143832,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2q30t",
   "message": "Send collect om delivery to your sil with( if possible) your mils address as the return address.\nIf they want the stuff, they can store it and pay for its transportation. \n\nNta",
   "created_utc": 1701145074,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2snfx",
   "message": "NTA, ever. Its not her stuff and even if it was gifted once you give a gift its gone.",
   "created_utc": 1701146368,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2uvi9",
   "message": "NTA. If MIL wants to hang onto a bunch of stuff for your SIL then let her, but make sure SIL actually wants it- I’d send a GC to both of them outlining the options: a whole bunch of gendered baby stuff and toys beyond all the things SIL has already chosen from needs to go- it can go to MIL for SIL to collect or a Christmas gifting drive. Lay on the charity aspect thick and give them a deadline (if I don’t hear back by X I’ll be donating them)\n\nDon’t be defensive or sound hurt, just focused on the logistics",
   "created_utc": 1701147567,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2w23v",
   "message": "There are so many charitable organisations that would be thrilled to receive good quality toys and clothes.\nWomen’s shelters, toy libraries etc…\nDonate away. Guilt free. NTAH",
   "created_utc": 1701148232,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb2y9jq",
   "message": "This is an easy solve, give them to MIL to store for SIL. They are out of your house and no longer your problem.\n\nDont make things so difficult",
   "created_utc": 1701149505,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb33hlm",
   "message": "NTA. Hold on to some extra cute stuff and donate the rest. Otherwise MIL is more than welcome to store and give them to SIL.",
   "created_utc": 1701152769,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb33ucv",
   "message": "NTA...tell your MIL she has x amount of time to come get the stuff to store or take to SIL; it's not your responsibility to take it to them. \n\nIf she wants to pay for shipping, fine. If she doesn't. Bye.",
   "created_utc": 1701153012,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3636b",
   "message": "NTA. Tell your MIL that you will absolutely donate them to your SIL if she can store them at her house until your SIL might need them. Sooo dumb….",
   "created_utc": 1701154573,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3cpfn",
   "message": "Nta if you want it come get it. Don't bring tmit to them and give them a deadline to take before donating. Don't go out of your way.",
   "created_utc": 1701159622,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3mdws",
   "message": "NTAH. She doesn’t need it and who knows when or even if SIL can or will use it. So until then, it’s probably sitting in either SIL/MIL’s house collecting dust. Your MIL is being unreasonable and resembles hoarder behavior. It would be better donated to charity so it can be used right now.",
   "created_utc": 1701167550,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3our3",
   "message": "NTA\n\nTell her that she can keep the things in her house and/or pay for transport - if they want them .",
   "created_utc": 1701169457,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3rkf7",
   "message": "NTA. I had the first grandbaby in my family, and no one expected me to save anything! Also, part of the fun and excitement when having a baby is picking out all the things you need. 😊 And honestly, what a pain to have to hold on to stuff and have it take up space to give to her some day *in case* she ever has a baby. It's easier to donate and get it out of the house. Your MIL and SIL need to get a grip.",
   "created_utc": 1701171411,
   "score": 1,
   "submission_id": "185bfyl"
  },
  {
   "comment_id": "kb3wquw",
   "message": "NTA",
   "created_utc": 1701174662,
   "score": 1,
   "submission_id": "185bfyl"
  }
 ]
}