{
 "submission_id": "185euuq",
 "title": "AITA for deciding to quietly change my will without telling my wife?",
 "selftext": "My (34m) wife (32f) and I just had our first baby today.\n\nWe were in the delivery room, all was going well, and I was holding her hand trying my best to be supportive. She was in pre-labor and was experiencing irregular contractions that she said weren't painful yet. I told her how much I loved her and that she was doing great but made sure not to talk too much either.\n\nAll of a sudden, my wife tells me to \"please get out.\" I ask her what happened, and she says she just doesn't want me there right now. I stand there in surprise for several seconds, after which the midwife tells me to get out or she'll call security.\n\nI feel humiliated. Not only was I banned abruptly from watching my child's birth, but it was under the threat of force.\n\nThroughout our marriage, I've suspected that my wife wouldn't be with me if it wasn't for my job and family background. Her eyes don't light up when I come home from work. I start our long hugs and she ends them early. Her eyes wander when I'm talking to her. I don't think she loves me nearly as much as I love her.\n\nI'm not accusing her of being a gold digger. She may \"love\" me on some level, but I don't know that she has ever been *in* love with me. If I died tomorrow, I don't know if it would take her very long to move on.\n\nI live in a state where the right to an elective share is 25% of separate property. We don't have a prenup, so this means that my wife has a right to at least 25% of my separate property if I die even if I were to disinherit her in my will. I've decided to will her 30% of my separate property (was previously 100%) and 100% of our communal property if I die. The rest of my separate property, including income-producing assets and heirlooms, goes to my children and other family members.\n\nAITA?",
 "created_utc": 1701121877,
 "permalink": "/r/AITAH/comments/185euuq/aita_for_deciding_to_quietly_change_my_will/",
 "score": 31,
 "url": "https://www.reddit.com/r/AITAH/comments/185euuq/aita_for_deciding_to_quietly_change_my_will/",
 "comments": []
}