{
 "submission_id": "185f85k",
 "title": "[ Removed by Reddit ]",
 "selftext": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
 "created_utc": 1701122742,
 "permalink": "/r/AITAH/comments/185f85k/removed_by_reddit/",
 "score": 2,
 "url": "https://www.reddit.com/r/AITAH/comments/185f85k/removed_by_reddit/",
 "comments": [
  {
   "comment_id": "kb1f7pn",
   "message": "Don't go over there anymore.",
   "created_utc": 1701125741,
   "score": 172,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb17nwi",
   "message": "I would not tolerate an aggressive dog around my child. NTA.",
   "created_utc": 1701122884,
   "score": 108,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb19or7",
   "message": "NTA. I have dogs and when guests are around i know that i have to keep them away temporarily. Your cousin is completely irresponsible.",
   "created_utc": 1701123642,
   "score": 73,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb27hvt",
   "message": "NTA - My dog is nervous and fearful, and she does not like children. I keep her away from kids for everyone’s safety. It’s not rocket science.",
   "created_utc": 1701137176,
   "score": 59,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1cg8q",
   "message": "NTA\n\n\"Uwu it's a smaller dog\" it's still an effing dog bite. It's still serious. I really cannot STAND people who think that \"little dogs\" are less dangerous. I've had friends SERIOUSLY injured (I mean hospital and scars) by \"small dogs\" who were left untrained and unsupervised because everyone thinks that a little dog is harmless and oh it's FINE if it bites. \n\nThese are often the EXACT same people who look at a large dog, decide it \"looks\" scary, and try to outlaw the breed based on BS. It drives me nuts. If that ever happened to my hypothetical child? That dog would be in serious trouble.",
   "created_utc": 1701124682,
   "score": 219,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1a2wl",
   "message": "NTA\n\nI love dogs. So much.\n\nBut I would kill one, including my own, without so much as a second thought if it hurt my child. \n\nReport the incident.",
   "created_utc": 1701123789,
   "score": 48,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2b9e7",
   "message": "That dog should have had a muzzle on it.  Any dog that bites like that unprovoked and unpredictable has major issues.  If it ever bites a stranger, she'll be held accountable.  \nYou were too nice.",
   "created_utc": 1701138690,
   "score": 25,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb18wxy",
   "message": "Report the bite to the local warden. Your cousin is an irresponsible idiot and SHE will be the reason her dog is put down.\n\nEdit: corrected relation",
   "created_utc": 1701123352,
   "score": 129,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2dxbv",
   "message": "Your cousin is a POS. NTA",
   "created_utc": 1701139806,
   "score": 11,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb29y2o",
   "message": "If anything bit my kids …..dogs, people, anything, I’d boot that MFer into the cheap seats.",
   "created_utc": 1701138157,
   "score": 28,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb263uk",
   "message": "NTA, and I'm not sure about your animal control rules, but your cousin is very lucky you haven't pursued legal action. Where I live, if an animal bites someone, it's put down. (Not recommending, and don't necessarily agree with it, but that's literally what happens in these cases.) Your cousin is naive to have thought the dog behaving quietly in the room would result in good behaviour in public. I honestly wouldn't visit her house again with the dog there. I'm so sorry your kid was hurt 🌻",
   "created_utc": 1701136621,
   "score": 20,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb29nlh",
   "message": "NTA. Control your dog or somebody will control it for you.\n\nMay also be time to find a professional to help your son overcome his fear. There will always be dogs around.",
   "created_utc": 1701138042,
   "score": 18,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1gmfg",
   "message": "NTA. Take the money op, that'll teach her more than words. It's her house, but she knows the dog is nasty and still let it out. You said a viscous thing in the heat of the moment, and that has shock value too. Don't feel bad for your words, they were said in (justified) fear and anger. Hopefully your son will be fine, but this must absolutely be the last time that dog and your son, or any child, are in contact. If she won't keep it kennelled for the whole visit, you will have to stop visiting, and tell everyone why. But please try to get your son to meet some nice dogs so he knows it isn't all dogs that are nasty.",
   "created_utc": 1701126288,
   "score": 33,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1qwwj",
   "message": "Simply. Don't. Go. I mean. The dog has a problem. Don't put your kid in that situation. Its also the dogs home. Dog=shit, don't go.",
   "created_utc": 1701130436,
   "score": 29,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2ldaa",
   "message": "Nta for defending your kid\n\nYTA for continuing to take your kid to her house.",
   "created_utc": 1701142977,
   "score": 18,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1ohws",
   "message": "NTA!! Ugh! This is why so many people excuse bad behavior from a small dog. Because it's tiny. It's not that bad. NO NO NO NO NO.  \n\nThat dog was BEHAVING because it was AWAY from all the people and festivities. If you went to the doctor submit the medical bills against your cousin's home owners insurance. And any relative who disagrees with you, cut them off or go low contact. Your kid was INJURED in a way that was so freaking preventable.  \n\nI have dogs. I would trust my nieces and nephews with my dogs. But I would not trust my dogs with my nieces and nephews. Too many opportunities for something to go wrong.",
   "created_utc": 1701129450,
   "score": 20,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2c44g",
   "message": "Report the dog.\n\nIt broke skin. That’s the legal benchmark.",
   "created_utc": 1701139038,
   "score": 19,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2cgy0",
   "message": "NTA, but why are you going over to her house knowing she has an aggressive dog and doesn’t like to keep it contained?",
   "created_utc": 1701139187,
   "score": 7,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2fu54",
   "message": "NTA\n\nThis is the kind of dog owner people hate. She really has a stark lack of common sense.",
   "created_utc": 1701140612,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2jxg7",
   "message": "NTA at all. Who TF lets a dog out near kids when they know it has behavioural issues? I have a cat that is a total C\\*\\*T to children. If a kid is coming over, the cat gets locked in the garage so it cannot monster the poor child. Would not even consider letting it out while the child was still there no matter how well behaved it had been while locked in the garage.",
   "created_utc": 1701142352,
   "score": 6,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2fs4x",
   "message": "I am an animal lover, 100%. But if this situation happened to my son I would probably have reacted the exact same way. NTA.",
   "created_utc": 1701140588,
   "score": 10,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2mqv6",
   "message": "my parents had a rescue dog (shepard lab mix) that bit my child’s hand when giving it a treat. 2 months later it charged my son (still a toddler) snarling at him in the back yard. I killed it right then and there and buried it on their property in front of them. be a better pet owner or face the consequences. the animal doesn’t get a pass because of its size or my relationship to the owner. 2 strikes and i will kill it.",
   "created_utc": 1701143562,
   "score": 17,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2r1dl",
   "message": "NTA. I adore dogs, but your cousin is an incredibly irrepsonsible dog owner.\n\n\"Aaaw, they're so small and cute, they wouldn't hurt anyone uwu\"\n\nBS. My mailman told me that the worst dog bites he's even gotten are from the small ones.\n\nI'm so sorry your kiddo got hurt. I hope they heal quickly. :(",
   "created_utc": 1701145544,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb247aa",
   "message": "ESH. The dog owner the most. They need to address their dogs aggression issue before it causes more damage than a bit of broken skin. Little dogs can cause a lot of damage. \n\nIf you know your cousin has an aggressive dog and your son is afraid of dogs, stop taking your kid there. I would 100% keep my daughter away from any aggressive animals. She is a bit scared of dogs and needs a lot of coaxing to meet a new dog, even if it is just laying there wagging it's tail. I would not take her to a house where an aggressive dog lives. It's not worth the risk to me.",
   "created_utc": 1701135854,
   "score": 13,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2l41o",
   "message": "take him to the hospital, and tell them what dog it was that bit him. Make sure they make a record of it. \n\nThat way, the next time this dog bites someone, it’ll get put down.\n\nNTA for yelling that; and don’t go over there anymore.",
   "created_utc": 1701142865,
   "score": 8,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb18y8q",
   "message": "NTA.  Your cousin is an AH and the dog should never be allowed in your house again.  Even if locked up in a room.  You knew before you couldnt trust the dog and now you know you cannot trust the cousin.",
   "created_utc": 1701123366,
   "score": 28,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2q4pv",
   "message": "NTA- WTF. I am a dog lover but I am also someone currently taking anti rabies shots for a stray dog bite. Its bloody painful. My incident was my fault but your cousin let this happen.\n\nAlso the relatives who sided with her are asshole. You need to go LC with them and also ask them what would they do if the dog had attacked their loved ones.",
   "created_utc": 1701145097,
   "score": 8,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb28e2y",
   "message": "NTA, report the bite to animal control. The next person that dog bites will be its last.",
   "created_utc": 1701137533,
   "score": 8,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1mvia",
   "message": "NTA but it is their house that has the dogs, so I wouldn’t go over there. You can’t really demand someone puts their pet away in their own home and trust they’ll stick to it, you can only control whether you enter that environment.",
   "created_utc": 1701128790,
   "score": 12,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2fpzz",
   "message": "NTA, but stop going over there.",
   "created_utc": 1701140562,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2lfvp",
   "message": "NTA for how you handled it at the time.\n\nBut you never should have gone. Either they board the dog over Thanksgiving or you don’t go.",
   "created_utc": 1701143008,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb30ve0",
   "message": "Nta, don’t go over there anymore. I have a dog I don’t trust with kids and when there are kids or a lot of people over she’s locked up in a bedroom watching Alaska state troopers(idk why that’s my go to for her). Anyways your cousin isn’t a responsible dog owner, if that was a pitty (I’ve got 2) and it bit someone’s kid everyone would shit a brick. A little dog that can’t behave shouldn’t be allowed to run amuck.",
   "created_utc": 1701151075,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb27ubj",
   "message": "NTA.  File a report for the bite.",
   "created_utc": 1701137311,
   "score": 5,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1anz2",
   "message": "Report this dog. Your cousin is obviously a shitty pet owner.",
   "created_utc": 1701124009,
   "score": 10,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1wvea",
   "message": "ESH, stop going to her house.",
   "created_utc": 1701132872,
   "score": 13,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb27oec",
   "message": "Report the bite. Sounds like the dog is aggressive especially since it made a beeline for a child that wasn't even interacting with it. Totally unprovoked attack.\n\nReminds me of a family Christmas at my in laws. Husband's Aunt is holding her little rat dog, yippy thing. There a bunch of young kids running around, preschoolers primarily. Son wants to pet the dog, we ask. Aunt says, oh no dog doesn't like people and will bite. I say excuse me? Do you think it's a good idea to have him.around a bunch of kids?\n\nWell apparently this dog was her baaaaby and I was rude to question her. \n\nLast time we went to a big family gathering because of the damn bitey dog.",
   "created_utc": 1701137246,
   "score": 9,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb214jc",
   "message": "ESH. Your cousin is an irresponsible dog owner. She knew that dog did not like children and had a bite history, and let it out anyway. Stupid does not begin to describe that decision.\n\nBut why are you taking your small child to a home with a dog you know will bite him given the chance? Don't take your child there as long as the dog resides there. End of story. Accidents happen. So does idiocy, as you've found out the hard way.\n\nAnd please get your son help for his fear of dogs while he's still young. Dogs exist in this world, and being afraid of them to the point of avoidance is going to be a hindrance to him. He needs to understand dogs and have a healthy respect for them, but not to fear them.",
   "created_utc": 1701134622,
   "score": 7,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb269kl",
   "message": "esh, her for going back on y’all’s agreement and not training her dog correctly…you for continuously taking your kid over there knowing how her dog is",
   "created_utc": 1701136685,
   "score": 7,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1e4jz",
   "message": "ESH don’t go over there again. You need to make sure to not put your child in a situation where a dog is allowed to be around children. This isn’t the dogs fault it’s your cousin’s. That being said if you bring your kid there again. It’s all on you.",
   "created_utc": 1701125325,
   "score": 32,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb31iol",
   "message": "NTA. You set a boundary and she stomped it. In most states, an aggressive dog like that can/will be made to be put down after biting incidents",
   "created_utc": 1701151478,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2m4s6",
   "message": "NTA\nYour sin got injured because of her failure to secure the dog! What’s more is she released it despite knowing you two had agreement that it would be kept in a separate partitioned area away from the little boy. \nUnacceptable on her part!!!",
   "created_utc": 1701143307,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2qajs",
   "message": "NTA - she knew her dog would act in this way yet she irresponsibly let him out around your child.  I am sure she feels badly about the incident but it is her fault for not taking precautions such as putting the dog on a leash.  My brother has a dog that nips people and they kept it in a carrier and only let it out for them to hold.  They were very watchful of it around everyone and were not irresponsible with their responsibilities.",
   "created_utc": 1701145177,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2qsvn",
   "message": "NTA. Tracks with her being a flagrantly irresponsible person that she has raised an out-of-control dog. If it were me, for any other hapless children’s sake and for the sake of the dog, I’d give her an ultimatum to get to a dog trainer or that I’d call in a report about a dangerous dog with an idiot owner.\n\nDon’t forget to watch the bite for signs of infection.",
   "created_utc": 1701145425,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2r23b",
   "message": "She must muzzle dog in future in addition to seclusion. The dog is aggressive and will continue to be toward your child. No more awe being good moments are acceptable ever.",
   "created_utc": 1701145554,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb31g6q",
   "message": "NTA but your cousin sure is. I've had dogs all my life and I used to be a trainer. To say I'm a dog lover is an understatement, but if a dog went after my child - or any child - my response wouldn't be much different. If any guest in your home is afraid of dogs you put them in their room or kennel. It doesn't matter if they are the sweetest dog in the universe, when someone is afraid of dogs their energy and scent will likely put the dog at least a little on edge which increases the potential for an incident of some sort. Not to mention the plain lack of hospitality in making a guest uncomfortable in your home. No, your cousin was bang out of line. Do report the bite to the dog warden so there's a record. If this upsets your cousin, too bad. There is no excuse for a dog behaving like that. She needs to train him and deal with his behavior issues before she gets sued and the dog gets put down. I hope your son is recovered. The poor child didn't deserve that.",
   "created_utc": 1701151435,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb338bq",
   "message": "NTA\n\nMany years ago my aunt babysat my baby brother, he was also 4, she let her dog in the same room. That dog was small, mixed mutt with poodle like curly hair/fur. \n\nThat dog, as soon as they were in the same room, ripped apart my little brothers face, they had to rip the dog off of him and by that time his upper lip was split apart with pieces hanging on by shreds. He had to receive plastic surgery that permanently altered his smile forever. \n\nOP you are LUCKY that dog decided to just bite the ankle and not jump for anything else. I would have also kicked the dog, possibly in the neck as well, to get it off of my baby brother, let alone my own child.",
   "created_utc": 1701152596,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb34pp1",
   "message": "My father was the biggest dog lover anyone could ever meet. But his number one rule, once a dog bites and breaks the skin, that dog is gone. Don’t care who’s dog it is, old or young, big or small, it is gone…done. \n\nMy niece was dating a guy for just about six months when his dog bit her 4 year old son, she took him to the ER to get checked out, got a piece of the boy’s ear bleeding.  Before she got back with her son, her boyfriend had already surrendered his dog. He had that dog for six years. \n\nI would never step foot in her house again. That’s a dangerous dog.",
   "created_utc": 1701153608,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb34yfv",
   "message": "NTA \n\nThe fact that the dog attacks people is worrying. That dog needs to be muzzled and kept away from children. Or put down, sorry to say.\nDogbites can turn bad very easily. It was an ankle this time, what about next? What if it had decided to jump?",
   "created_utc": 1701153779,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb35ca7",
   "message": "File a report, this dog is a menace with her blessings.",
   "created_utc": 1701154046,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb37u0l",
   "message": "NTA. Mama Bear in full effect. \n\nIt's good your cousin owned it, and offered. Even though you declined, recognize she did try after fucking up. \n\nBut she's shown she is someone who cannot be trusted at that level. Do not bring your child over there again, no matter what promises are made.",
   "created_utc": 1701155839,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb38lco",
   "message": "Report the dog to the relevant animal control/ council etc and NEVER take your kids over there again.",
   "created_utc": 1701156405,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb39wp9",
   "message": "You should report the dog bite.  It has happened multiple times and a child could lose an eye or be physically scarred.  \n\nEveryone else is making excuses because they don’t want to be the “bad guy.”",
   "created_utc": 1701157409,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3av8r",
   "message": "NTA, you were very restrained not to really wallop the mfer right then. Apart from anything else your son is now probably going to be afraid of dogs forever.\n\nTo be fair, it isn't the dog's fault. Too many people see keeping a living animal in their homes as a right and not a privilege, and to hell with both the animals themselves and anybody they menace. This woman shouldn't be allowed to have dogs.",
   "created_utc": 1701158153,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3b6yn",
   "message": "Yea a family member of mine had a dog like this (snapped regularly. It was old and blind but w/e). I hated that dog, but no one ever made a fuss about putting it away. I got to spend Christmas Eve as a 5ish year old in the ER getting stitches on my face.\n\nAbsolutely NTA.",
   "created_utc": 1701158415,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3c0p9",
   "message": "ESH. \nYour cousin is an AH for not training her dog properly and for leaving him out when she still had guests. \nYou’re an AH for bringing your child with a fear of dogs into a house with 3 of them and then threatening to kill one of them. \nGet your son some help for his fear because dogs are everywhere and it’s something he’s going to need to learn to deal with.",
   "created_utc": 1701159068,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3cgfs",
   "message": "NTA. Lucky the dogs still alive IMO. You would be the AH if you back again tho, your cousin was warned and disregarded the warning once and would likely do it again.",
   "created_utc": 1701159418,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3cu0c",
   "message": "NTA for saying it. It was heat of the moment and protecting your child can really make you do things you would never consider normally. \n\nYou would be the asshole if you actually killed the dog though as there are many other solutions now that the moment has passed.",
   "created_utc": 1701159720,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3cvpq",
   "message": "NTA. I have a 4 year old son myself and would lose my mind if a dog attacked him regardless of its size. Even if the dog isn't big enough to severely injure or kill him, the bites can cause permanent scarring or even get infected. And being attacked like that can cause a lifelong phobia of dogs. But, were I you, I just wouldn't attend any future family functions at her home or if she brings her dogs to to a function. It's unfortunate but your son's safety is more important.",
   "created_utc": 1701159758,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3djro",
   "message": "This is why I don’t do dogs. Put that thing away if it likes human flesh. I’m cool with the dogs that chill… but as soon as they’re nipping I’m out of there. She’s TAH🥰 100% for not letting you know and making accommodations for her letting the dog out. Like it goes straight to the yard. Away from the kids.",
   "created_utc": 1701160306,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3i5qp",
   "message": "NTA - In my clumtry if a dog Bit and broke the skin it'd be euthanized",
   "created_utc": 1701164133,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb3idv2",
   "message": "Your cousin is very stupid. No the dog wasn't \"behaving\", it was put away. If it was \"behaving\" it wouldn't have bit your son. \n\nThere's nothing to be divided on here. Your cousin was wrong (and stupid) and you were justified in protecting your son and being angry that your cousin's idiocy led to your son being injured. The family that disagrees with you are wrong. Your cousin and family should be thanking you for your restraint in not punting that dog into a wall because that would have been a justifiable reaction too. \n\nIt being a smaller dog doesn't mean shit. Small dogs can be extremely aggressive, and while a small dog is not as likely to kill as a larger dog, they can absolutely cause disfiguring injuries to children.",
   "created_utc": 1701164319,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb25dza",
   "message": "I am a dog lover and i would say you aren’t the asshole for saying what you did in the heat of the moment (tho actually intentionally killing a dog that you can remove from the situation without killing it- is extreme, so if you did kill the dog in that circumstance, you’d be a piece of shit. You wouldn’t be a piece of shit for using necessary force to get the dog away from your kid though). \nBut here is where you go from here: don’t go to your cousin’s house anymore. She has proven that she doesn’t care about her dog biting your kid. It is inevitable that this will happen again. If you do go to her house again, then YOU will be the asshole for putting your kid in that situation again. If you go there again and the dog bites your kid, it will be YOUR fault because you know she isn’t going to keep her dog away from your kid.",
   "created_utc": 1701136333,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1nzkl",
   "message": "OP isn’t very bright.   No way I’d take my toddler child to a house where a dog that bites children lives.  \n\nI would spend the holidays alone before I’d subject my innocent s d defenseless toddler to that.  \n\nGet a grip OP, this is as much your fault as the cousin.",
   "created_utc": 1701129240,
   "score": 9,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb23ffb",
   "message": "NTA - sounds like the dog is territorial and its aggression is escalating. The dog desperately needs training and your cousin needs to respect people's boundaries.",
   "created_utc": 1701135544,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2caot",
   "message": "It’s your cousin’s house and her dog.  Why would you bring a kid there if they are scared of dogs?  She didn’t force you to go there, you could have just said no thanks, my kid is scared of dogs.",
   "created_utc": 1701139114,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2f7v8",
   "message": "Even a small dog can kill a child. She needs to either have it go through training or give it to someone who can tame the aggression or keep it away from other people.",
   "created_utc": 1701140350,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2gqqh",
   "message": "Nta, but if you go over again, you will be the AH. Also, all small dogs with that type of behavior issue need to be gassed. Shit gets tolerated because their damage is limited and they're small so the behavior hasn't been bread out of them. Unlike larger dogs who get put down. So yeah, fuck that little rat",
   "created_utc": 1701140993,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2oo26",
   "message": "When I was 7 my grandma’s dog bit my leg. I had to go to the hospital and get stitches. I still have a scar but no big damage was done. But still the damn thing but my leg enough for a quite a bit of blood to run. My mom later went to my grandma, her MIL, and told her that if she (grandma) didn’t get rid of the dog she (mom) would poison the dog. My grandma gave the dog away. My advice, don’t go to your cousin’s anymore. If that dog goes for your kid I, and I’m sure many others, wouldn’t blame you if you killed the damn thing. Cousin should know not to let the dog out especially with a history of aggression. But she sounds like a dumbass and might do it again. You also know how the dog acts and it has already but your kid. Don’t risk it and don’t go back. If she invites you tell her you’ll go once she gets rid of it. Ball will be in her court.",
   "created_utc": 1701144413,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb32sek",
   "message": "Your family that disagrees is basically putting the dog over your son. Your son did nothing. The dog ran straight for him. Report the bite. The relatives siding with the dog don’t have to see your child again if that’s their attitude regarding your child. Make sure they all know in case they didn’t see what happened that they disregard your son over a dog which is why they need not participate in your son’s life moving forward.  I bet their tune will change and if not, too bad.  No wonder why your cousin thought it was okay to let out the dog…. Makes me wonder who encouraged her or agreed it was a good idea.  Keep note of who is who. You might not get such a clear message again.",
   "created_utc": 1701152298,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1qnaq",
   "message": "Why do you go to her house?\n\nAnd why are you not investigating why your kid is afraid of dogs?",
   "created_utc": 1701130326,
   "score": 7,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1ae3q",
   "message": "The dog attacked and bit a child, drawing blood. I'm sorry to say, but that dog needs to be put down. It will kill a child eventually.\n\nOh and to add, its all the owner's fault. Clearly, the dog has not been trained properly and now it is a danger. The cousin should have their other dogs taken away from them and rehomed, too. They are not a good dog owner.",
   "created_utc": 1701123905,
   "score": 6,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1o332",
   "message": "NTA. Unless you do actually kill the dog, of course. But your cousin is keeping her head in the sand about her dog. Pup clearly needs to be kept away from the children, and she needs to look into getting some proper help for the dog. In the meantime a muzzle is needed when the dog is around people and has a tendency to bite.",
   "created_utc": 1701129280,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2pc9a",
   "message": "I am once again asking small dog owners TO TRAIN THEIR DOGS AND STOP TREATING THEM LIKE HARMLESS TOYS.\n\nTentative ESH, mainly because I think threatening animal cruelty is a step too far, even if you were bluffing.",
   "created_utc": 1701144715,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1k1jv",
   "message": "NTA- this is why I hate small dogs. So many owners/people don’t take their aggressive behavior seriously.",
   "created_utc": 1701127628,
   "score": 7,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb257ln",
   "message": " YTA  \nWhy are you going to a place where you fear for your child's safety?",
   "created_utc": 1701136262,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb25j2y",
   "message": "NTA at all. Clearly the dog in question has a history of behaviour, it should come as no surprise that it played up again. Something needs to be done to change/correct the behaviour. \n\nAnd while it was lovely your cousin invited you over to her home, maybe keep the dogs away from the visitors.",
   "created_utc": 1701136389,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1teu2",
   "message": "YTA for going to their home. You know they have a biting dog, don't go there.",
   "created_utc": 1701131456,
   "score": 5,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1w64m",
   "message": "So you go to your cousin's house when you know that she has dogs and you take your son who is afraid of them there? Then you proceed to threaten her dog to be stomped on because he did what he usually does? Yeah YOU ARE THE AH. If you tried to tell me that. I would have escorted you right TF out and you would never return. YOU TOOK YOUR SON THERE YOU KNEW WHAT COULD HAPPEN YOU DID IT ANYWAY. If you attempted to touch my dog again you wouldnt live to see tomorrow .",
   "created_utc": 1701132586,
   "score": 6,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb25f6n",
   "message": "OP sorry this happened to your son.\n\nis it wrong of me to be like hey not a pit mix. Because I have a pit mix mutt who is respectful of babies and small children, does not force attention on kids who shy away, and has never bitten anybody",
   "created_utc": 1701136346,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2ccxh",
   "message": "Call animal control.",
   "created_utc": 1701139140,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2hw43",
   "message": "ESH.  Don't threaten to hurt the dog just because the dog did exactly what the dog does.  The owner knows the dog doesn't like kids, it's up to them to keep the dog away from kids.\n\nIt's perfectly fine to be mad at the owner, since the owner did something stupid.  But c'mon man, you can't threaten to hurt an animal for doing exactly what you knew it would do in that situation.  Id sooner hit the owner for stupidly endangering my child than I would hurt the dog for being a dog.\n\nDon't take your kid over there again, or insist the owner board the dog offsite for the duration of the visit so the owner cant do something stupid.",
   "created_utc": 1701141489,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1nea3",
   "message": "YTA for bringing your child into that situation. Even if a dog is put in another room there are lots of people around that might accidentally let it out.\n\nJust don't go over there for holidays.",
   "created_utc": 1701129002,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb17x52",
   "message": "NTA\n\nPeople need to be responsible for their pets.  It sounds like they did everything right, but had a lapse in judgement and tried to resolve their mistake as well.  It's understandable that people took both sides, but you should be more than justified in them not bringing their dogs to future events.",
   "created_utc": 1701122978,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1lnue",
   "message": "NTA\n\nHopefully, your cousin sees this attack for what it is. Her dog attacked a little kid. Her dog bit a little kid. Little kids should not ever be unsupervised with a dog with questionable behavior. You say this dog is known to have issues with small kids. Your cousin's behavior was completely irresponsible. \n\nBut instead of psychically causing pain to the poor dog, because domesticated animals act the way a master allows. We owners are completely responsible for how our animals react with others. Remind your cousin that animal control will take the dog and put it down. If your cousin doesn't see how serious this really is, it will happen again and could be much worse. Even a small dog can cause a lot of damage to a small child. She could lose a lot if she were sued. Compensatory and punitive damages could be quite expensive. \n\nIf she's judging whether or not to allow her dog around small children by the dog's behavior at the moment instead of the dog's history, she's playing roulette with her livelihood.",
   "created_utc": 1701128293,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1qnsj",
   "message": "NTA, I have dogs and I wouldn’t allow a known bitey or aggressive dogs around children. A) it sounds like there are more people than usual in her house, I wouldn’t let the dogs out unless they are used to that many people. B) the dog is known to go after children. At the very least, it should be on a leash until everyone leaves.",
   "created_utc": 1701130331,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1ytxr",
   "message": "I have a huge goofy golden retriever. He loves kids. Would I *ever* let him around my nephews unsupervised? Hell no. He's still capable of catastrophic damage. Would he? Probably not. But things happen. Dogs get hurt, startled, etc. (Not talking about your child OP) Kids are really shitty to animals sometimes. You owe it to both of them to protect them from the other.",
   "created_utc": 1701133685,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2pc4h",
   "message": "NTA. Put the dog down.",
   "created_utc": 1701144714,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2saz0",
   "message": "NTA. In the UK if your dog injures someone and they press charges, you are liable for a fine, up to 3 years in prison, and the dog will be put down. \n\nWhilst I don't think threatening to curb stomp a small creature who only got this way because of being poorly raised by its owner is ok, I totally understand how after seeing your child get hurt you'd be extremely upset and angry.",
   "created_utc": 1701146189,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1kb31",
   "message": "Yeah dumbass don’t take your kid around a shithead dog",
   "created_utc": 1701127734,
   "score": 0,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1ox2k",
   "message": "ESH\n\nYou took your kid to a home where you know there’s a dog that has issues with kids. \n\nShe broke her word and let the dog out.",
   "created_utc": 1701129621,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1je6v",
   "message": "NTA for saying that, but the asshole for forcing your son to be in proximity of other dogs.",
   "created_utc": 1701127371,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1vtif",
   "message": "Poor behavior from the dog reflects on the owner who has no control over her own dog. Agreement breach- ur cousin was acting like a child n now she has to face the consequences. NTA. But massive AH to the cousin.",
   "created_utc": 1701132443,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1x0cr",
   "message": "I would not tolerate an aggressive dog injuring my child. \n\nThe dog could have bitten him in the face. He could have needed stitches! Your poor boy. You’re NTA.",
   "created_utc": 1701132929,
   "score": 0,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb231kz",
   "message": "I hope you reported the dog bite.",
   "created_utc": 1701135389,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb25xui",
   "message": "NTA. If the dog ever gets reported doing this again it will be put down, regardless of anyones feelings.",
   "created_utc": 1701136554,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb27n6s",
   "message": "NTA- the dog should be put down. I know it sounds harsh but either it gets put down or the cousin should pay a trainer to correct this bad behavior. Or even better don’t go to your cousin’s house.",
   "created_utc": 1701137233,
   "score": 0,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2ieur",
   "message": "Yta for knowingly bringing your son around a nasty dog. \n\nNta for telling your cousin that. Super irresponsible and inconsiderate dog owner and host!",
   "created_utc": 1701141709,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2k7zt",
   "message": "Regardless of how bad the bite was, I would take my child to the ER. The animal control will get involved and this will cause your cousin to be responsible for their dog. This will also cause the dog to be documented as aggressive in case this happens again to someone else.",
   "created_utc": 1701142479,
   "score": 4,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1fwr0",
   "message": "NTA I am a huge animal lover. I am also a Mother. If a dog attacked my son, I would react the same way. Although I would’ve screamed at your cousin. This is her fault. She knows her dog does not do well around children, she shouldn’t of let him out. Even if he was “behaving” it was too risky.",
   "created_utc": 1701126008,
   "score": 1,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb261wj",
   "message": "A child’s life and safety over a doggy out on “good behaviour” 110% of the time. What the actual fuck was your cousin thinking? Dog bites are absolutely filthy too and can lead to severe infections, tissue necrosis, even amputations. I wouldn’t be giving that dog, or your cousin, another chance. Dog off the property if your kid is coming or sorry fam, we ain’t coming. \n\nNTA",
   "created_utc": 1701136599,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb26e4j",
   "message": "Dog owners are the worst. \n\nNTA but maybe you should have realized how moronic your cousin is to have such a shitty dog in the first place.",
   "created_utc": 1701136735,
   "score": 3,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb2mmao",
   "message": "I do not approve of what she did. However, your response to injuring the animal is despicable. Wtf are you doing going over there? Are you brainless? Never would i take my children to a home where there is an unpredictable animal. You are BOTH the AHs",
   "created_utc": 1701143509,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb1chrn",
   "message": "Report the dog bite and never go back there again.",
   "created_utc": 1701124699,
   "score": 2,
   "submission_id": "185f85k"
  },
  {
   "comment_id": "kb25jep",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "185f85k"
  }
 ]
}