{
 "submission_id": "185h7s5",
 "title": "AITHA because I said something to my husband's female coworker hinting at \"not sharing\" my husband?",
 "selftext": "Recently I (47f) accompanied my husband  (49m) of 3 years on his cross country business trip. We had a great time and did a lot of site-seeing when he got off from work. We were there for a month and really took in the sites. \n\nTwo days before we were to leave, a newly divorced female coworker (38f) arrived. She called my husband to ask for information regarding the work they would be doing the next day and to where they which site they would be traveling to. Or so it seemed that's what the phone call was about. I was sitting in the hotel room listening to a 45-50 minute conversation between my husband and this woman, which went on way too long (IMHO ) and had stopped discussing work arrangements about five minutes into the conversation. The conversation veered into a different territory. She shared what hotel she was staying at (the same as ours 🫤), what side of the hotel she was on,  where she was parked, what she was driving, where she like to eat, food she loves, things she likes to do in her spare time... I finally gave him a look that said, \"enough of that! \"\n\nWhen he got off the phone, I gave him the \"what fors\"  of inappropriate conversations between coworkers. He got very defensive and asked if I was insecure. I was immediately put in a \"questioning my perspective position.\"  I thought for a moment, and decided I was not being insecure. After much *deliberation* between us, I finally cut it TF off-- I stated, \"would you ever expect, encourage,  or support that conversation, with the subtle intonation and perceived flirting from the other side of the phone, to come out of my mouth if I was talking to a married man and for that long?\" \n\nHe looked dumbfounded. It probably dawned on him what was actually happening and dawned on him harder that I was not going to tolerate it. Not. One. Bit. \n\nThe next day, she drove him to work the work site. I lost my shit, but remained ultra cool. They parked her car and walked up to the hotel together. We met out front as my husband and I were going to go to dinner. We all chatted a bit. We discussed some decent restaurants in the area. Then my husband excused himself to get a file she would need for the next day. As we e leaving the next day, I asked if she wanted any of our unopened leftover snacks, paper goods, etc. She said she thought that would be a great idea. Then I looked her dead in the eyes, and told her, \"We've got so much stuff left over. Cheese , crackers, unopened food, there's quite a bit that should hold you over for at least a week. I'll share just about anything with you, but I won't share my husband.\" \n\nShe looked like she had been caught with her hand in the cookie jar. She stood frozen in time and I refused to look away. My husband arrived with the file, and she excused herself. \n\nThat night, as my husband and I were packing, I encouraged him to call her room and ask if she wanted anything we had that hadn't been opened or used. She politely declined. \n\nI'm also a divorced woman. I know the perception people may have. It's also exactly why I would NEVER talk to a married man for anything other than professional exchange of information and certainly wouldn't have allowed the conversation to progress past the point of a professional nature. Must certainly not for nearly an hour! \n\nHusband says I overstepped. I say I caught the bullshit before it hit the ground. \n\nWas I the AH for calling it like I saw it?",
 "created_utc": 1701127623,
 "permalink": "/r/AITAH/comments/185h7s5/aitha_because_i_said_something_to_my_husbands/",
 "score": 18,
 "url": "https://www.reddit.com/r/AITAH/comments/185h7s5/aitha_because_i_said_something_to_my_husbands/",
 "comments": []
}