{
 "submission_id": "185i84p",
 "title": "AITA for telling my brother that he should consider his wheelchair-bound wife's health before getting her pregnant?",
 "selftext": "My brother and sister-in-law have been married for 10 years, and I love them dearly. My sister-in-law has been in a wheelchair since childhood due to a car accident that left her paralyzed from the waist down. She's an incredible person, and I consider her like a sister.\n\nA few days ago, they announced to our family that she's two months pregnant. I got worried because I know that pregnancy can be very risky for women with disabilities. I've read that they're more likely to experience complications like pre-eclampsia, blood clots, urinary tract infections, premature birth, and need for a cesarean section. Additionally, they might have difficulties sensing contractions, pushing during labor, and caring for the baby after birth.\n\nI tried expressing my concern to my brother, but he got a bit offended and said I was disregarding their choice. He mentioned they had planned this pregnancy for a long time and are prepared to face the challenges. He said they have the support of her family, friends, and doctors, and they'll provide all the care the baby needs.\n\nI didn't want to hurt them, but I think they're being irresponsible and selfish. They're putting my sister-in-law's and the baby's lives at risk just to fulfill the desire for a biological child. They could have adopted or used a surrogate, but they chose to risk it all.\n\nWe haven't spoken since, and they're very upset with me. My mother called me, saying I was very insensitive and should apologize. My husband agrees that I should apologize too. However, I feel like I was just being honest and realistic. AITA?",
 "created_utc": 1701130231,
 "permalink": "/r/AITAH/comments/185i84p/aita_for_telling_my_brother_that_he_should/",
 "score": 231,
 "url": "https://www.reddit.com/r/AITAH/comments/185i84p/aita_for_telling_my_brother_that_he_should/",
 "comments": []
}