{
 "submission_id": "185ix96",
 "title": "AITA for refusing to get my MIL a Christmas gift this year?",
 "selftext": "\n\nMy Mil has her birthday on the 27th December and always makes a massive fuss that we can’t mention Christmas on the 27th and it’s just got to be about her birthday. (Decorations etc all have to come down and she won’t ask the kids what they got for Christmas or anything about Christmas at all on that day!)\nLast year I got a large Christmas bonus and wanted to get everybody something lovely. she really likes designer bags so I got her one she has always wanted which was more than four times the cost of everyone else’s gifts.. so to justify it I needed it to be a Christmas/ birthday gift. \nOn Christmas Day last year I gave her the wrapped gift and explained that it was a joint Christmas and birthday gift and she would understand why when she opened it… well, she refused to open it. She put it to the side and said “I’ll open it on my birthday else I’ll have nothing to open will I”… I was due to work on the 27th so wouldn’t be at her birthday and said I’d really like to see her open it as it’s a special gift. She said “you know how I feel about my birthday being so close to Christmas and how awful it is for me and you’ve done this on purpose to spoil Christmas for me” … she then gave me the gift back and stormed off.. she spent the rest of the afternoon shut in her room sobbing. (Loudly!!)\nHer husband told me to go and get her something else for her birthday, but I said no. )maybe I’m the AH here!) .. I told my husband I was done with doing the present shopping for her and he can do it from now on… he hasn’t got her anything yet for this year for either Christmas or her birthday and I’m not going to help choose anything… as I’m typing this I’m feeling like I’m probably the AH as I just don’t think she deserves anything for acting the way she did 🤦‍♀️.. but my husband is rubbish as gifting , so AITA for refusing to help and knowing she will probably end up with no gift at all?",
 "created_utc": 1701132065,
 "permalink": "/r/AITAH/comments/185ix96/aita_for_refusing_to_get_my_mil_a_christmas_gift/",
 "score": 150,
 "url": "https://www.reddit.com/r/AITAH/comments/185ix96/aita_for_refusing_to_get_my_mil_a_christmas_gift/",
 "comments": [
  {
   "comment_id": "kb1vn3j",
   "message": "Omg NTA!!!!  Return the gift. Get your money back.  Leave it to your husband.  It’s HIS mother. Let him deal with her childish temper tantrums.",
   "created_utc": 1701132370,
   "score": 175,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb20w58",
   "message": "I'd show her a pic of the purse and go \"Yeah, if you hadn't acted like a 4 yr old and stomped off to your room to cry you'd have seen why it was a 2 in 1 gift. I returned it yesterday. \"  But I'm super petty like that.",
   "created_utc": 1701134528,
   "score": 186,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1w7x6",
   "message": "NTA\n\nYour MILs behavior is beyond childish and absurd and well into lunacy. Stop catering to the crazy.",
   "created_utc": 1701132607,
   "score": 157,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1wrlj",
   "message": "Return the gift but get a picture of it, and send it to her after the fact to show her what her childish behavior cost her.",
   "created_utc": 1701132828,
   "score": 174,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23tzu",
   "message": "\u0026gt;AITA for refusing to help and knowing she will probably end up with no gift at all?\n\nNTA.\n\nSo... when it comes to gifting, your husband practices weaponized incompetence.  If he's bad enough at it, you'll just do it for him, right?\n\nTime to play his (and his mother's) game, and play it better than they do.  \"Clearly I'm no good at selecting gifts for your mother, and I'm not going to risk disappointing her again.  It's your job from now on.\" \n\nIf she doesn't get Christmas and/or birthday gifts, or if they are lousy, just smile sweetly and say \"\\[Husband\\] was in charge of those, you'll have to ask him about that.\"\n\nJust be ready for the drama, because there will be plenty of it.\n\nDoes she even know what you got her last year?  Because if she doesn't, she should.  I hope you returned the bag but it wouldn't hurt to have a photo of it handy to show her in case it gets brought up.",
   "created_utc": 1701135704,
   "score": 157,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1v5ec",
   "message": "I can’t believe a grow ass adult acts so immature over her birthday ! NTA! your MIL is a giant AH",
   "created_utc": 1701132169,
   "score": 20,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1wyiy",
   "message": "NTA. He's hoping you will cave and do it for him. Don't.\n\nIt is too bad he's not good at gift giving but with a mother like that it is no wonder.",
   "created_utc": 1701132908,
   "score": 162,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1zzdl",
   "message": "I can understand her feelings about keeping her birthday separate from Christmas. I’m sure she got a lot of “combined” gifts in the past that were really no better than what the rest of her family got for Christmas alone. But you spent *more than double* the amount you’d normally spend, and she refused to accept that, which is childish as hell. So yeah, I’d step away too. \n\n(Did she ever open the gift? What happened?)",
   "created_utc": 1701134153,
   "score": 192,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb206zh",
   "message": "NTA\n\nYou should have asked the drama queen if she wanted you to go all Wise King Solomon on the gift, and give her half then and half on her birthday. \n\nDon't back down with your husband. If he wants to cater to her need to feel special, he can shoulder the responsibility that comes with that.",
   "created_utc": 1701134240,
   "score": 44,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb21nxw",
   "message": "What ever happened to the purse?\n\nAnd you are NTA. MIL is your husbands mother. He’s a grown man. He can handle gifts.",
   "created_utc": 1701134836,
   "score": 32,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb24zwr",
   "message": "My birthday is the 26th of December and I get many combined gifts that in all honesty shouldn’t be combined. Whilst I appreciate her frustration since I’ve had the same. \n\nThat said, her expectations are unreasonable and even if you mentioned the cost and what it was it wouldn’t have been enough for her. \n\nNTA and enjoy the new bag",
   "created_utc": 1701136179,
   "score": 31,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb260ca",
   "message": "All decorations taken down??  that is a bridge way too far. \n\nI'm hoping you returned the purse and got your money back. \n\nYes, your husband should be choosing the current gifts for his mother.",
   "created_utc": 1701136582,
   "score": 32,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb22e3t",
   "message": "Nope. NTA. My birthday is on the 27th too and I have never pitched a fit or acted like an asshole because Christmas is the same week.  I actually like my birthday at Christmastime because I never had to go to school on that day.  \n\nLet your husband buy his pathetic, entitled Mommy her gifts and save your time and money.  She's too GD old to be acting like a ridiculous, tantrum throwing toddler.  Treat her like one and put her on a present time out.",
   "created_utc": 1701135128,
   "score": 87,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1wn38",
   "message": "NTA. \n\nShe’s an entitled ass. A grown adult should be more than capable of coping with a joint present. She ruined Xmas for herself.",
   "created_utc": 1701132778,
   "score": 45,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1we5w",
   "message": "NTA - she's over the top.  I can't imagine dictating how people give me gifts!",
   "created_utc": 1701132677,
   "score": 22,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb22zts",
   "message": "NTA.\n\nMIL is an asshole for being this childish.\n\nFIL is an asshole for enabling it.\n\nHusband is the biggest asshole of the three by a massive amount. Him letting you just eat all that abuse is not ok.",
   "created_utc": 1701135370,
   "score": 42,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb22u9l",
   "message": "\u0026gt;my husband is rubbish as gifting\n\nFFS, gifting is not a god-given talent like perfect pitch. Anyone can give good gifts. It’s just that the “I’m bad at gift-giving” people choose not to put any thought or effort into really seeing their recipients and giving gifts that say, “I pay attention to you,” or  thinking of ways to upgrade the recipient’s everyday life, or finding a way to delight the recipient.\n\nYou‘re NTA but your husband sure is. Let him deal with the big birthday baby this year while you sit demurely with your lovely designer bag in your lap.",
   "created_utc": 1701135307,
   "score": 55,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb20apb",
   "message": "I hope you returned the gift and earmarked the amount to do something nice for yourself. That is so discouraging to go through.  I hope you can get some space from the situation.",
   "created_utc": 1701134283,
   "score": 17,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb24wlc",
   "message": "NTA - so I am a December baby and I get the whole everyone else gets birthday and holiday gifts - Christmas/Hannukah whatever… but us December babies get the short end of the stick. That being said she is old enough to have children that are married she should get over it already! \n\nGood for you for making your hubby di the gift buying - it is his mother so should be his responsibility!",
   "created_utc": 1701136141,
   "score": 16,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb209nd",
   "message": "NTA. Let her dwell deep within Bitterland on her own.",
   "created_utc": 1701134271,
   "score": 15,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23yb5",
   "message": "NTA You picked out a thoughtful and pricey gift for your MIL, and she was rude and ungrateful. She’s had *a lot of years* to deal with her birthday being so close to Christmas. There’s no reason why your husband can’t pick out her gifts from now on. \n\nI can be really petty and would’ve kept the bag to use whenever she was around.",
   "created_utc": 1701135752,
   "score": 14,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2527g",
   "message": "NTA but I NEED to know what happened to the purse!!!",
   "created_utc": 1701136204,
   "score": 14,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb25ezt",
   "message": "NTA, but a grown woman storming off to her room to bawl over when she opens a gift is unhinged.",
   "created_utc": 1701136344,
   "score": 12,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26w5n",
   "message": "NTA -  even born well into January folks get \"Merry Birthday\" presents.  Both events are about quality time and memories. So...WTF is with a loud, all-day crying jag being your memory for last year?!?! I hope you get an awesome, holiday independent gift for yourself (maybe a designer bag ;) )",
   "created_utc": 1701136935,
   "score": 12,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb253d1",
   "message": "NTA. You are simply removing yourself from the merry-go-round of manipulation.",
   "created_utc": 1701136216,
   "score": 10,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb253gg",
   "message": "A grown woman with grown children is acting this way??? Get a grip.",
   "created_utc": 1701136217,
   "score": 10,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb25s3j",
   "message": "Well, nta, but I want to know if the silly woman found out what she missed out on. If she doesn't know and you still had it for some odd reason, you could give it again this year with the same stipulation. Just rinse and repeat until.... Could be fun!",
   "created_utc": 1701136490,
   "score": 8,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb29v9z",
   "message": "INFO:  Did she ever get the designer bag?  After her dramatics, I would have returned it.",
   "created_utc": 1701138126,
   "score": 9,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23ftc",
   "message": "NTA - Hubby can deal with his mom.",
   "created_utc": 1701135548,
   "score": 8,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23q2g",
   "message": "NTA.\n\nShe's a freaking adult and needs to grow up. Millions of people cope with having holiday birthdays or sharing their day with another relative whose birthday is close to theirs. She's the AH, as are her enablers, not you.\n\nPlease don't take down a single ornament until you're ready. If that means she won't visit you, too bad for her. She has no right to demand you curtail your celebration because she was born so close to Christmas. Tell her she should have been born sooner.\n\nYou're perfectly justified in handing this nonsense off to your husband. Do yourself a favor and remind him one more time. He probably thinks you're not serious, so if you don't spell it out, you will get the blame for her having no gift. \n\nMy MIL's birthday was December 30. She didn't demand we take down the tree, but she insisted we owed her two \"good\" presents and not one combined gift. Her son was lousy at choosing gifts, but that wasn't my problem.",
   "created_utc": 1701135659,
   "score": 7,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb24idg",
   "message": "NTA!!!  What happened to the handbag you got for her?  I wouldn’t get her anything either.  Let your husband take care of her gifts.",
   "created_utc": 1701135979,
   "score": 8,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2898o",
   "message": "People born on or around Christmas tend to get their presents mushed into one. Meanwhile, people with birthdays in other months get a birthday gift and then get a gift on xmas.\n\n\n\nNo one gets a gift in April with a happy birthday and merry Christmas, too, on the card.\n\n\n\nMil has probably had her birthday glossed over so much that when she got old enough, she got obnoxious about it since she could make demands as the matriarch.\n\n\n\n\nShe was still rude and dramatic about it.\n\n\n\nI dont think you were an asshole. But honestly I would have got her a cheap gift just to have something to open, like candy and then the big one for her birthday since you know she is touchy. \n\n\n\n\nNTA",
   "created_utc": 1701137479,
   "score": 7,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb24zi3",
   "message": "Please tell us the rest of the story…\nWhat has MIL been like the last year?",
   "created_utc": 1701136174,
   "score": 7,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb25ge9",
   "message": "NTA! Don’t buy her anything! Ever!",
   "created_utc": 1701136359,
   "score": 6,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26emc",
   "message": "NTA! \n\n\nMy sisters birthday in on Christmas and every year she picks another date and lets us all know the date that she would like to celebrate on. She usually does sometime in January. For a grown woman to act this way is childish. Had she opened the gift (my understanding was that she didn’t open and gave it back to you unopened?) , she would have understood why. And saying she wouldn’t open it because she wouldn’t have gifts to open on her bday is such ungrateful behaviour. I’m sure the rest of the family would have gifted her bday presents on her actual birthday. I feel like if she hates her birthday being around Christmas so much, she would have figured out how to navigate that by now. The fact that she was loudly sobbing in her room acting entitled and ungrateful is absurd. She ruined Christmas for herself and her family on her own.",
   "created_utc": 1701136741,
   "score": 7,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28tgg",
   "message": "NTA- what a baby. She’s too old\nFor this shit.\nI’d expect this from a 12 year old",
   "created_utc": 1701137708,
   "score": 6,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28x5b",
   "message": "I've received a combined Xmas, Birthday, Easter, and Mother's Day gift one year because it was an expensive present.\n\nEven though it was December,  January, April, and May, I did not throw a tantrum because I am not selfish and know the value of money.\n\nWe have even had \"two year gifts\" in my family.\n\nYou're NTA. Your MIL is a twat.",
   "created_utc": 1701137749,
   "score": 7,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2dq14",
   "message": "I would never buy that stupid woman another gift. \n\nEver.",
   "created_utc": 1701139720,
   "score": 8,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23ido",
   "message": "NTA",
   "created_utc": 1701135575,
   "score": 6,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23tvi",
   "message": "NTA. I hope you returned that gift. \n\nI get children being temperamental when birthdays and holidays are so close, but she's a little old to be having a temper tantrum. I'd get her a bag of dog shit before I'd get her anything else.\n\nAlso, this is ultimately your husband's responsibility. If he wants to be negligent, let him.",
   "created_utc": 1701135702,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb23vel",
   "message": "Nta. I hope you returned her gift and used that money to get yourself something extra special. And look if he ends up not getting her a gift or a crappy one that’s fine. That’s his mom. If he doesn’t feel like getting her anything that’s on her. When she complains be honest “I really don’t like how you treated me last year after I went out of my way to get you an amazing gift that I paid for myself. So to avoid problems from now on all your presents will be chosen and bought for by your son. If you don’t like it then you can take it up him”",
   "created_utc": 1701135720,
   "score": 6,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb25k7w",
   "message": "NTA \nfor entirely different reasons, I understand the frustrations of gifting to MIL. I turned that one job over to my husband years ago as I just couldn’t anymore. He does shitty - but I don’t care (it was freeing and you deserve this feeling). \n\nshe honestly receives his shitty gifts just the same as when I put all the thought, energy, time and money into her gifts.",
   "created_utc": 1701136402,
   "score": 7,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2c2nm",
   "message": "Nope, ntah........my dad's bday is 12/17, my FILs is 12/23, my moms is 1/5, and my sisters is 1/19......If I didn't combine gifts, I'd go broke. I usually budget 50/60 for bdays and 80/90 for Christmas.\n\nSpacing it out makes it affordable and possible.",
   "created_utc": 1701139022,
   "score": 6,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26q6d",
   "message": "NTA \u0026amp; this is coming from someone who’s birthday is literally a week after Christmas \u0026amp; also have a brother who’s birthday is 4 days after Christmas. You did absolutely nothing wrong. Big/expensive gifts can be a joint present. She needs to get over herself \u0026amp; her family needs to stop allowing her to be so childish. \n\nThe petty me wouldn’t even remind my husband \u0026amp; see what happens.",
   "created_utc": 1701136869,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26qql",
   "message": "Histrionic personality?",
   "created_utc": 1701136875,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26ug0",
   "message": "Did she get the purse last year? Did she thank you?",
   "created_utc": 1701136916,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb27ol6",
   "message": "Yeah, you're definitely NTA. What a child.   \n  \nMy cousin was born on December 26th. We were always really careful to give him a second present and his mom would insist it be wrapped in regular birthday paper instead of Christmas paper, but that was the extent of the \"demands\". He's nearly 40 now and says he's just happy people remember his birthday. He doesn't care if gifts are for both, he thinks it's cool he gets better stuff than everyone else. In his words, \"This is great! Unnecessary, but great!\"\n\nYour mother-in-law needs to get over herself. Like seriously. It's time for your husband to shop for her if he wants her to have a present. Wash your hands of the whole thing. She deserves to get a crappy card and whatever he can find at 4 pm on Christmas Eve.",
   "created_utc": 1701137248,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2a45u",
   "message": "UpdateMe!",
   "created_utc": 1701138223,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2qti4",
   "message": "NTA My bday is the 25th, and I don't expect anything  typically. I get a little sad and hurt when people I give nice gifts to don't reciprocate in kind or have given me frankly rude gifts when they have money. Those people don't get nice gifts from me anymore lol. I haven't had a birthday party. I get cake on the day and usually some separate bday gifts, but that's all. I like combined xmas bday cards. I always appreciate seeing people i love and having the day off. But she sounds super emotionally immature, maybe a little narcissistic as well? The FIL sounds to enable her behavior. Rather than him telling you off when you did something so kind, he should be telling his wife how rude she's being to you and ask her to apologize to you! Your husband should also be correcting his parents' childish behavior. They should apologize to you. FIL's behavior rings narcissist enabler to me, just saying. Anyways, you did nothing wrong. That's so nice you tried to give her something so awesome. Now let hubs deal with her gifts and def don't go get her anything for this year. She returned it to you, so no gifts. Hubs should have been dealing with his parents' gifts all along and should be solely responsible for it going forward. Her behavior is beyond entitled and embarrassing. And again, it's not about her bday being on a holidqy, it''s about her being a child woman.",
   "created_utc": 1701145433,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb25oef",
   "message": "NTA MIL needs to grow up! Let your husband deal with her gifts.",
   "created_utc": 1701136449,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb268j1",
   "message": "I hope you kept the bag for yourself - and when she admired it you could say \"yes what a pity you didn't want it!\".",
   "created_utc": 1701136673,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26w54",
   "message": "I’d take a pic and say oh look what your gift was too bad you didn’t want it 😂",
   "created_utc": 1701136935,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb27svf",
   "message": "NTA - ah hell no. She’d never get a gift from me again, no Christmas, no birthday, no nothing. So disrespectful, so childish.",
   "created_utc": 1701137295,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28jlo",
   "message": "NTA in the least...I have a sister with a birthday on December 27- she is almost 50 and as self centered as she can be she has NEVER acted THIS entitled \u0026amp; childish. You are completely right with giving buying for her back to your husband...let him pacify her all too childlike behavior!!! Get a refund and buy something nice for yourself or someone else who will actually appreciate the gesture. 🙂🎁",
   "created_utc": 1701137596,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28pcx",
   "message": "Ok ok my birthday is literally on the 27th and this behavior horrifies me! I am always so grateful anyone thinks of me and chooses to gift me on either or both. It is accepted with deep gratitude for the expression of affection. Wow… this is beyond the pale.",
   "created_utc": 1701137661,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb29bo9",
   "message": "My Mother will be 95 the day after Christmas. We make an effort to make it about her, but sometimes she gets Christmas/Birthday gifts together. She has never complained. Tell MIL to grow up.",
   "created_utc": 1701137909,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb29drs",
   "message": "NTA- l laughed after reading this.  My youngest daughter’s birthday is also 12/27.   Now that she’s older she’s learning that by combining Christmas budget and birthday equals a great gift or gifts.  Your MIL sounds awful.  Putting away Christmas decorations by her birthday because its a few days later.  I definitely wouldn’t put my Christmas decorations away for someone who acted like that.",
   "created_utc": 1701137933,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb29k4p",
   "message": "Bullshit and attention seeking. NTA. My birthday is near Christmas and it is in no way “awful”- people ask me if it is and I always tell them that it makes no difference to me, it’s when my birthday’s always been so it doesn’t matter!! She’s decided to use this for attention and you’re right not to tolerate it anymore. She needs to grow up.",
   "created_utc": 1701138004,
   "score": 2,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2by2a",
   "message": "Been married 20 plus years and never bought my mil a Christmas present. She \nDoesn’t  like me and I don’t like her back. That in itself is the gift that keeps on giving.",
   "created_utc": 1701138971,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2dasc",
   "message": "NTA NTA NTA. \n\nI can u derstand she may not want joint presents every year from everyone, because some people use a joint present as an excuse to spend less, and the person would prefer to have 2 separate gifts like everyone else would get. \n\nBUT you told her it was an extra special gift and that's why it had to be part of both. \n\nShe cut her nose off to spite her face. She could have opened it, seen what it was, and would obviously have been over the moon and understood. But she chose to rude and ungrateful and entitled. She could even have opened it and if she still didn't think it was 'special' enough for a joint present then she could have been disappointed (although she shouldn't coz she should be grateful for the gift) but if she was that put out after opening it thats her choice. \nBut she chose to ruin it for herself and everyone else by storming off and moaning at you and not even opening it. And didn't even save it for her birthday. She just handed it back to you. \n\nYou MUST return the bag and get a refund. She does not deserve that gift anymore. \n\nBut like others have said, I'd take a picture of it so you can send it to her in a group chat and say something like ' this year I wanted to get you (MIL) something extra special, which is a lot more money than I'd normally spend, which is why I explained it had to be a joint Xmas and birthday gift. But as I knew it was something special you wanted, I was willing to spend that extra to get you this special gift. However, even after explaining it was an extra dpecial gift, you flatly refused to even open it, were extremely rude and hurtful to my feelings, and extremely ungrateful for the thought and effort and money I spent on you. As you clearly didn't want it, and felt it was so terrible of me to have bought you an extra special joint gift, I've returned it to the shop, so you don't need to worry anymore. I won't do it ever again. This is what I had got you just so you can see what the big deal was about. From now on il leave it up to husband to choose your gifts as mine aren't good enough. \n\nGET A REFUND ON THAT BAG!!! \nDO NOT GET HER ANOTHER GIFT FOR HER XMAS OR BDAY.  Let your husband deal with it. She's his mum, he can deal with it. And if he doesn't get her anything, it's his fault. You've told him he needs to get her something. \n\nDo not waste another penny on that ungrateful bitch of a child. \n\nUse the money you get refunded to buy yourself something extra special. Or treat yourself to a nice new handbag instead. Lol. When she asks you where you got it, just say you used the extra money you got from the refund of her bag to treat yourself to something nice instead as she didn't want it. \n\nShe can cry and moan and kick up a stink about 'being sorry' and 'she didn't mean it' and 'she didn't realise it was a special gift, and  'she'd love the bag, but its all meaningless and fake. She'll learn not to be so ungrateful and unappreciative to others in future. \n\nDo not back down.",
   "created_utc": 1701139540,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2dj6y",
   "message": "NTA but I wonder if she grew up never celebrating her birthday because her family always combined it with Christmas. As a child that would be hurtful, especially if she had siblings who she had to watch celebrate their special day year after year. I have a daughter who’s birthday is a few days after Christmas. We’ve always had a separate, special celebration with decorations, parties, cakes, presents, and a few trips over the years. I wanted her to have her special day just like her sister who has a summer birthday.",
   "created_utc": 1701139639,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2djx2",
   "message": "NTA! its called looking a gift horse in the mouth and she did it with pride and cried crocodile tears to prove a point. My mom does this to me with Xmas gifts. So I get her simple stuff. Like soaps and candles and such.... inexpensive but still nice is some way....",
   "created_utc": 1701139647,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2dmxu",
   "message": "I’d keep it or take it back.  NTA and I’d be done and let her son take care of her.  She’s childish and self absorbed .",
   "created_utc": 1701139683,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2dpzw",
   "message": "NTA, is she a child?\nShe expects to be worshipped on the 27th?",
   "created_utc": 1701139719,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2e009",
   "message": "NTA, your MIL was being childish. \n\nI can definitely relate to having a birthday close to the holidays and feeling like it’s often overshadowed by that, especially as an adult. My birthday is Dec. 14th, my dad’s is Dec. 3rd, and my aunt’s is Christmas Day, and we’ve all gotten “combined gifts.” Heck, sometimes we ask for them that way, that’s how I got my PS2 as a kid. Your gift was 4x what you spent on anyone else, it’s totally justifiable to say it was a combined gift. \n\nSeeing as this happened last year I really hope you either returned it, got your money back, and spent it how you saw fit, or just kept the bag for yourself and flash it in front of her this year.",
   "created_utc": 1701139837,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2e091",
   "message": "NTA.  She’s been playing that weird game for decades.  What a tiresome charade for everyone around her.  She can fook right off",
   "created_utc": 1701139840,
   "score": 5,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2e0jt",
   "message": "NTA she needs therapy to address her childhood trauma, especially if you have a history of giving two separate, thoughtful gifts in prior years. \n\nIf this was a one-off and MIL has been lovely with everything else, I’d advise you to reach out to her on a non-holiday day and meet up with her to talk, and you can tell her what the intended gift was and you had hoped she would make an exception for an exceptional occasion you were excited to share with her. \n\nIf this is just another notch in a pattern of selfish behaviour, fuckit drop the rope and MIL can enjoy the most impersonal mall kiosk selection of stinky candles and cheap bubble bath.",
   "created_utc": 1701139843,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2m5qk",
   "message": "My mothers birthday is also 27 December. As a normal human, she makes none of this fuss",
   "created_utc": 1701143318,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2uh4o",
   "message": "I would probably tell her exactly what you got her “you know mil, last year I got you that gorgeous designer bag that was \u0026lt;outrageous cost\u0026gt;. Since it was that expensive I couldn’t justify it as a solo present. But since you threw a tantrum like a tired toddler, I’ve returned it and gotten you two seperate gifts just like you wanted.” And then give her undies and socks.",
   "created_utc": 1701147350,
   "score": 4,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb1y3f1",
   "message": "Christmas joke (NSFW) A 17 year old male walks into a drug store. He says \"I've been invited to Christmas dinner at my new girlfriend's house. Afterwards I hope there is a chance I get lucky, you know what I mean\"\n\nClerk: \"How about condoms then? They could come in handy. Here's a pack.\" The young man after paying walks to the door, stops, smiles, comes back: \"you know what, the mom is also smoking hot, I think I'll take another pack, just in case I get extra lucky.\"\n\nChristmas eve comes around, the boy sits at the dinner table and doesn't say a word. After a while his girlfriend says: \"if I had known you were so quiet, I wouldn't have invited you.\" the young man replies \"if you had told me your dad works at a drug store, I wouldn't have come.\"",
   "created_utc": 1701133385,
   "score": 23,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb25c75",
   "message": "NTA, but as somebody whose birthday is 28 December, I can empathize with her just a little bit. No excuses for her being so rude, though.",
   "created_utc": 1701136314,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26eo8",
   "message": "NTA\n\nDid you return the gift? Please say she didn’t actually get the designer bag after throwing a tantrum!\n\nI get it about BD being near Christmas, know others in the same situation, but they handle it with grace.",
   "created_utc": 1701136741,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26f9l",
   "message": "NTA-  your MIL is acting so childish. Return the gift, she doesn’t deserve it.",
   "created_utc": 1701136748,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb26s5v",
   "message": "NTA!!  My Mom had her B-Day on the 20, December, Christmas, then was Married on 27, December. She complained a bit as a kid having to just grab a present from under the tree. But never let that carry over to my late brother, or our families. \nI would reiterate to your Husband, you are done. Good luck OK \u0026amp; Happy Holidays \u0026amp; Merry Christmas 🎄",
   "created_utc": 1701136891,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb272x9",
   "message": "NTA. Get two lumps of coal, and give her one for Christmas and the other for her birthday. Make sure to wrap the second one in birthday-themed wrapping paper, so she knows it's birthday coal and not Christmas coal. Or maybe wrap it in a giant photo of the handbag you bought her and returned.",
   "created_utc": 1701137011,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb27z2f",
   "message": "Drama queen! NTA! She didn’t even even give it a chance. You told her it was a very special gift and you were excited to give it to her. And you’re right from now on your husband can do her gift shopping. Shame on her.",
   "created_utc": 1701137363,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb280di",
   "message": "Mine is a week after Christmas, I have never thrown a fit or outlawed the word Christmas on my birthday. \n\nThis is a MIL is your husband's mom, husband's job to shop for situation.  \n\nNTA",
   "created_utc": 1701137379,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb280w5",
   "message": "NTA. Keep the bag for yourself.",
   "created_utc": 1701137385,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb285qx",
   "message": "She sounds like a bratty 8 year old having a tantrum. NTA!",
   "created_utc": 1701137441,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28b5s",
   "message": "NTA\n\nShe is far too old to be acting like a spoilt petulant child.\nYour FIL has enabled this behaviour for years and I wouldn't buy her a single gift. Like you say, your husband can tend to this from now on. He should be doing this anyway, it's his mother and he's just lazy. Take away the bag.",
   "created_utc": 1701137500,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28b8l",
   "message": "Nta. My grandmother was born Christmas, and I am a cousin are dec babies. We all got combined presents. It sucked. But you dont act like this well into adult hood.",
   "created_utc": 1701137501,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28cac",
   "message": "This belongs I  entitled people \n\n\u0026gt;Her husband told me to go and get her something else for her birthday,\n\nI would of cracked up laughing, grabbed the bag and gifted it to MIL enemy lmao",
   "created_utc": 1701137513,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28e09",
   "message": "My family combines birthday and Christmas presents every year so that we can give better presents. And we have spring birthdays… what is this woman complaining about?",
   "created_utc": 1701137532,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb28p8g",
   "message": "You are NTA. I have a birthday close to Christmas, and we celebrate with the tree up and enjoy the day. She's pettier than a 4yo.",
   "created_utc": 1701137660,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb292rt",
   "message": "NTA!\n\nShe didn’t like your choice so let her son pick out something.  If it’s sucky, she can deal with it. \n\nMy brother’s birthday is on Christmas Day and while we do set aside the Christmas gifts and wrapping and such to have birthday cake and a little mini-party, he’s accustomed to getting joint gifts, especially if it’s something expensive that he really wants. One year, myself and our three other siblings went in together and bought him a $500 game console which he was thrilled about. He’s appreciative of any gift and knows quality is often better than quantity. Then again, he’s a mature adult so maybe that’s the difference.",
   "created_utc": 1701137810,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2a2cp",
   "message": " NTA.  Let hubs buy the gift.  Extra points if he wraps the gift in Xmas paper.",
   "created_utc": 1701138204,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2b53p",
   "message": "NTA - my aunt's birthday is on Christmas Day and she rightfully used to complain about getting a Yule Log cake for her birthday, but I've never heard her throw such a tantrum before.  Let your husband deal with his mother from now on.",
   "created_utc": 1701138641,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2bsuk",
   "message": "I do feel bad for the MIL. My mom’s birthday was in December. She suffered the birthday/Christmas curse. It isn’t fair to do that to someone. In no other holiday is it okay to act that way. But almost everyone treated my mother who would make Christmas meal, get the tree set up and organize the gifts and relatives for that holiday. \n\nAt the same time your husband is a big boy now. He should be in charge of her present. If he fails it’s on him. You are a surrogate mother who is there to pat his back and guide him through life’s niceties unless he is severely disabled and has a brain disease. \n\nYou’re NTA",
   "created_utc": 1701138913,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2bvv1",
   "message": "Don't say a word to that ML. Get your money back from the gift and never speak to her again, she is toxic.",
   "created_utc": 1701138948,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2colj",
   "message": "Nta.  Your hubby ‘s mom, his problem.  Not your monkeys not your circus,",
   "created_utc": 1701139277,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2dhyg",
   "message": "How immature! Let your husband deal w/his mother. Stay out of it.",
   "created_utc": 1701139624,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2ffcz",
   "message": "My son's b-day is the 27th He always is given the option to open his b-day presents on Christmas or wait and open them later he always picks to open them 2 days early lol he's 11 going to be 12.",
   "created_utc": 1701140437,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2fmcy",
   "message": "NTA people with close to Christmas birthdays usually do get shorted but it doesn’t sound like you normally do this. She was being a baby",
   "created_utc": 1701140520,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2kfcy",
   "message": "As someone whose birthday is easily lost in the holidays, I kind of understand where she’s coming from. It sucks when your birthday disappears. But what I don’t get is throwing a dramatic hissy fit. It does no good, as you are demonstrating. You are NTA.\n\nI think it’s a good idea to have your husband do the honors of buying her presents. If he forgets this year (CYA, remind him he’s doing it) that’s on him. Just be sure to warn him (via text so you have a record).\n\nI’m curious. What happened to the purse?",
   "created_utc": 1701142566,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2ldr7",
   "message": "What happened to the purse??",
   "created_utc": 1701142982,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2mzgv",
   "message": "The only part I think you are a little bit of an AH on is not dropping it when she said she would open it on her birthday. Like you all could have maybe scheduled a call or FaceTime after work and yea you don’t get to see the reaction firsthand but I don’t think that should be the point of gifting. I think you should still be able to get joy from knowing you got someone a special gift but maybe some aspects can be on that person’s terms too. \n\nLike I hate opening gifts in a public place so there’s been many times I’ve gotten gifts at dinner for birthdays and noted that I would open them at home. My family was always cool with that and we enjoyed each other’s time.",
   "created_utc": 1701143668,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2qcj4",
   "message": "I can sympathize somewhat with her wanting to make her birthday special. My dad is a Christmas baby and he never had a birthday cake or a birthday celebration until he was a married adult. He only had joint gifts until that time. But he doesn't make people not mention Christmas, take down decorations, nor act entitled. He understands if a gift is joint because it's larger. My daughter who is a January baby encounters the same thing. Large gifts may well be Christmas- birthday. Oh well, she's pleased to get them. \n\n\nMIL is overreacting in a big way. I'm sure she likes having a separate gift but really,  a gift is a gift. It's something someone is giving you that they thoughtfully picked out or made; it doesn't matter in the larger scheme of things, what the occasion is, it's truly the thought that counts. \n\n\nI don't blame you for not wanting to shop for her anymore and there is no reason that your husband can't do the gifts for his mother. NTA and it's too bad she never learned to be thankful and gracious about gifts. She really was acting entitled.",
   "created_utc": 1701145203,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2qkzy",
   "message": "AM I THE ONLY ONE WHO NEEDS TO KNOW IF SHE EVER DID SEE THE BAG I AM SO CURIOUS!? OP plzz update!!",
   "created_utc": 1701145318,
   "score": 3,
   "submission_id": "185ix96"
  },
  {
   "comment_id": "kb2jh7o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "185ix96"
  }
 ]
}