{
 "submission_id": "185orbc",
 "title": "AITAH for being upset over not getting a plate on Thanksgiving?",
 "selftext": "I love cooking and I love holidays. Ever since the price of groceries went up I haven’t enjoyed cooking or even planning meals. This Thanksgiving I was extra grateful to have a really nice meal. I couponed and took the bus to three different stores to make sure I had everything needed. I had to work a double shift but I stayed up all night to prepare everything. I even made note cards with instructions for my partner and sent texts throughout the day to remind him.\n\n\nWhen I got home I walked into the kitchen to the sink full of dishes and an empty dishwasher. I asked my partner why the dishes didn’t get done and he said “They all wouldn’t fit and some of the pans were too big so I didn’t know what you wanted to do with them”. Instantly annoyed because wtf did he mean what I wanted to do? God forbid the dishwasher has to run twice and some hand washing was needed. I go to the fridge and don’t see any leftovers. I ask him where my food is and he goes right into talking about how good the food was. He told me the turkey looked awesome and it was my best one yet. How my kids got to eat seconds. He invited three of his friends who didn’t have anywhere to go and they “took the leftovers off his hands for him”. \n\n\nMaybe it's because we haven’t been able to afford much meat lately or it’s because I followed a new recipe, regardless I was really looking forward to this meal. I asked him where my food was? I asked him where the turkey carcass was because I make soup from it and I don’t waste food. He just looked at me and said “it’s all gone”. He couldn’t save me so much of a roll. He told me that I didn’t tell him to save me some and he thought I was going to eat at work. I started telling him how excited I was and how hungry I was and his response was “Well I paid for the food so I can do whatever I want with it, next year you can pay for it and get a plate”. I took a sleeve of crackers and locked my bedroom door. \n\n\nAbout 20 minutes later I hear him getting in the shower and my kids knocking at the door. They told me about their day and how yummy the food was. My oldest apologized for eating two plates and I instantly felt like an asshole. I told him I was so happy he enjoyed it (he is a picky eater) and no need to say sorry. They spent the rest of the night telling me what they were going to ask santa for. \n\n\nMy partner said I was a selfish asshole because so many people got to eat and I could just go donate plasma for money to make another meal on my day off.  AITAH?\n\nMore INFO: I just returned to work two days before Thanksgiving. I take the bus or walk until I have gas money. We are not married and all of these comments have me wanting to pack up and run, but I can't. It's technically his house and his money.",
 "created_utc": 1701149997,
 "permalink": "/r/AITAH/comments/185orbc/aitah_for_being_upset_over_not_getting_a_plate_on/",
 "score": 44,
 "url": "https://www.reddit.com/r/AITAH/comments/185orbc/aitah_for_being_upset_over_not_getting_a_plate_on/",
 "comments": []
}