{
 "submission_id": "185ptix",
 "title": "AITAH for calling my sister \u0026amp; her husband out for wanting to put down their 13 year old dog after the dog bit their son?",
 "selftext": "Doggo still alive btw, this happened 4 years ago \u0026amp; I ended up adopting him. He just turned 17 \u0026amp; the incident was brought up again this past weekend.\n\nSo my sister’s son was learning to walk \u0026amp; fell on the dog who was asleep. What felt like a reaction time of a millisecond the dog bit their son on his cheek \u0026amp; dog was kicked out of the house while sister \u0026amp; her husband took their son to urgent care to receive 1-2 stitches on his cheek \n\nWhen they came back dog was still waiting outside the house but instead of bringing him back in \u0026amp; keeping him separated, discussing it with family/friends, exploring other alternatives, they dropped him off at a shelter nearby \u0026amp; when the employee asked what they could help with, the husband said “I don’t care, he bit my son, you can euthanize him, whatever, we don’t care” \u0026amp; drove home\n\nMy sister told me a day after doggo was dropped off at the shelter what happened \u0026amp; verbatim i asked “first and foremost is [her son’s name] okay?” After listening to her vent i then asked “do you know if [dog’s name] is still alive? I wish I knew sooner i would’ve adopted him, I’m going to the shelter now to see if he’s still alive”\n\nWe didn’t speak for months because of this. They claim i care more about the dog than their son. They say that because i do not have children of my own i could never understand what they went through \u0026amp; therefore fail to realize the choice they made was a reasonable one\n\nI argue that although i dont have any children of my own, i can still understand \u0026amp; empathize the upset, anger, \u0026amp; fear they must’ve felt, but to ditch the dog all alone in a shelter they had for his whole life (13 years) over a mistake is absurd to me because there shouldve been other options explored before euthanizing \n\nDog is small breed, 15 lbs at most, never had an aggressive incident like that before or after\n\nSo, AITAH for failing to see it from their POV?\n\nPS fast forward to today there is no scar on the kid, \u0026amp; he is not traumatized by the dog. He will ask for the dog when i come to visit \u0026amp; feed him treats. Took awhile for me to feel comfortable bringing the dog around but it was roughly a year after the incident \u0026amp; because sister insisted it’s behind them. Everything was chill until this past weekend sister’s husband brought it up \u0026amp; got all sassy with me. He claims everyone he shares the story with totally agrees with his actions in wanting to euthanize because the child comes first \u0026amp; i called him out on being rash \u0026amp; using the “i have a child/im a parent” card to excuse their extreme measures \u0026amp; reactions\n\nPSS if my sister’s husband is reading this, i still think you’re a huge 🐱",
 "created_utc": 1701154058,
 "permalink": "/r/AITAH/comments/185ptix/aitah_for_calling_my_sister_her_husband_out_for/",
 "score": 96,
 "url": "https://www.reddit.com/r/AITAH/comments/185ptix/aitah_for_calling_my_sister_her_husband_out_for/",
 "comments": [
  {
   "comment_id": "kb3f6cb",
   "message": "NTA. But..\n\nDog owners who are not responsible with the dogs are assholes. And the parents are the assholes here.\nWhen you have a dog and a young child you should be extra careful.\n\nTo be honest, it was not even dog's fault. If their kid fell on me while sleeping, my first reaction would be to punch whatever fell on me as a reflex. And I am not even a dog. They are the assholes",
   "created_utc": 1701161652,
   "score": 143,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3ege2",
   "message": "NTA.  Irresponsible pet owners.  Just because the kid is small and isn’t being malicious doesn’t mean an animal is not going to react.  I also understand that their kid’s safety takes priority over an animal, but it sounds like they used pup as a scapegoat. That they took out their guilt and feelings of inadequacy out on pup.  They don’t deserve.  Glad he’s safe and loved.",
   "created_utc": 1701161054,
   "score": 76,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3gfqs",
   "message": "NTA. My 9 year old dog bit my 1 year old on the cheek because my daughter was whacking her with the vacuum stick while I wasn’t looking. We had the same initial reaction to get the dog outside and take our daughter to hospital but I called my mum to pick up my dog. Dog stayed with my parents for a couple of months but we have her back with us now with much stricter rules around to stop it happening again. They’re animals and at the end of the day if they feel threatened or overwhelmed they can react just as we would. Daughter is fine, still loves the dog but gives her space and dog will remove herself to another room if she feels overwhelmed",
   "created_utc": 1701162706,
   "score": 34,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3gk5v",
   "message": "NTA i’m sick and tired of people who expect animals to react the same way a human would do (under perfect circumstances cuz we are violent as fuck) they do not have our reasoning skills, we expect them to live with us ,who dont share their langauge with them and basically get abused/killed for not understanding us\n\nThe dogs reaction was completely normal, he was startled, hurt and thought he was under attack, he should absolutely not be killed for that\n\nWas it an accident that the child fell.. off course it was, but animals are expected to put up with a lot of shit that goes directly against their nature\n\nMost (not all) bite incidents are caused by humans, be it intentional (bullying, intentionally hurting a dog, doing something that goes directly against an animals nature, have a child riding on their back etc ) or accidental (like a fall) and I will go further then that when an animal truly seems to attack out of nowhere without any accidental/intentional triggers its either a genetic thing (again thats the fault of humans for our shitty breeding practices) or due to not raising an animal with clear instructions making an animal confused (again they dont have human reasoning skills) we are massively failing our pets in so many ways… good luck finding a malicious animal that just wants to hurt people cuz they want to hurt people, thats something humans do\n\nA lot of animals dont get proper exercise/mental stimulation making them a pent up ball of energy and frustration, but they better not dare show anything\n\nToo often animals are not seen as living beings with their own feelings and language, but as a living doll that should accept being fully dominated without giving any pushback ever, no matter how confusing the dominating instructions are either\n\nThank you OP for taking the senior dog in, BiL can fuck right off, I hope he never has a pet again he doesnt deserve one",
   "created_utc": 1701162812,
   "score": 19,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3gjs3",
   "message": "NTA but Ty for adopting that senior doggy and giving them a good life",
   "created_utc": 1701162803,
   "score": 23,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb38kx0",
   "message": "NTA - the dog was family too and had an obvious and predictable reaction that was bound to happen - the parents should’ve been prepared to respond to something like that. Needlessly cruel of them to express their okay-ness with killing a creature that is their family. I sincerely hope they do not bring any more animals into their life.",
   "created_utc": 1701156396,
   "score": 40,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3a3si",
   "message": "people like your sister's husband should not have pets ever if they can't differentiate between an aggressive dog and a dog that was startlet and reacted in a \"dog-way\". What a heartless human being to just drop him off to be euthanized. \n\nGlad you saved him!!",
   "created_utc": 1701157562,
   "score": 21,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3sr9n",
   "message": "NTA. Our family dog bit my little brother once when he sat on her. She went outside for an hour, my little brother was told off for deliberately sitting on the dog. The dog came back in after an hour, lived her entire life and during her long life never bit anyone again. I don't blame her, if someone sat on me, I'd hit them.",
   "created_utc": 1701172210,
   "score": 3,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb377to",
   "message": "This is the type of shit that boils my blood. People who have animals prior to kids and don't properly intervene when necessary should have never had an animal in the first place. \n\nThe dog did what dogs do. Don't get me wrong, I feel bad for the kid, but the dog reacted out of the surprise of being fallen on. The poor dude was napping and a tiny human fell on him and he reacted out of his own safety, but to put him down over that isnt fair. NTA, id adopt the little homie too, he didn't deserve that.",
   "created_utc": 1701155385,
   "score": 26,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3nh67",
   "message": "ok, so reading this, all dog owners are probably guilty of letting their guard down around pets, and accidents do happen.\n\nI can truely emphasize with the dad, and the dog rightly? was seperated from the child. I wouldn't have felt safe keeping both together.\n\nHowever, taking him to be destroyed is overkill. Rehoming yes, and if the parents don't know how to keep both animal and child safe, they shouldn't have pets.\n\nI'm so glad you rehomed him, you are an angel. Can't really understand why dad is still upset.",
   "created_utc": 1701168399,
   "score": 12,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3ax2j",
   "message": "NTA. The kid fell and hurt or surprised the dog and it reacted. It's not like the dog just decided to lash out for no reason. \n\nWe have a cat, me hubby and our 6yo have all copped a scratch here and there. Our cat is still young and sometimes gets a bit too excited playing. We make a certain noise or yell her name and she normally stops. We wouldn't toss her away like garbage because of this.",
   "created_utc": 1701158193,
   "score": 7,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3m471",
   "message": "My childhood dog attacked my face when I was in elementary school. It wasn’t bad or anything, it was scary at the time but I never was scared of him and it didn’t cause any issues. He never bit me again after that and was a great boy until he passed a few years ago. If dogs are attacking then it’s because they feel like they need to, it’s never their fault. I do think dogs with behavior issues need owners that can give them more care and training and patience they need but it’s never the dogs fault",
   "created_utc": 1701167337,
   "score": 9,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3pla4",
   "message": "NTA. Those idiots would never ever see that dog again if it was up to me. Their actions say a lot about who they are and I agree husband is a major 🐱 Our dogs may be part of our lives but to them, we are their entire lives. They are family. They don’t possess the ability to reason, how can people not understand this? You’re entirely too nice, I’d tell sister and husband to go fuck themselves.\n\nEdit: show that 🐱 this clear NTA thread full of people much smarter than him and tell him to shove it up his ass",
   "created_utc": 1701170005,
   "score": 6,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb40it4",
   "message": "NTA. Dog was surprised and reacted.\n\nPS don't the rules require you pay a dog tax now?",
   "created_utc": 1701176746,
   "score": 2,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb4217r",
   "message": "Children often relentlessly harass pets and some parents refuse to correct their behavior so some dogs simply get fed up. 100% never the dogs fault in this case. Its always the parents fault but their egos cannot handle this so they just blame the animal.",
   "created_utc": 1701177523,
   "score": 2,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb42a1a",
   "message": "NTA, a 1 time bite with no aggression due to a surprise wake up is super different from other types of dog bites that maybe would result in the dog being put down.",
   "created_utc": 1701177643,
   "score": 2,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3ii87",
   "message": "NTA. It's the parents' responsibility to ensure their child is in a safe environment. The dog should not have been sleeping somewhere that the child could fall on him.\n\nThey should have had the dog and child separated, especially during that early stage of learning to walk.\n\nMy brother has hunting dogs, and they always have a baby gate up to keep the dogs out of the living area when the baby has the run of the area.\n\nAll dogs should be treated as a potential danger around small children moving in unpredictableways, regardless of how good they actually are.\n\nI'm so glad you were able to locate and adopt the dog.",
   "created_utc": 1701164421,
   "score": 4,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3kwj6",
   "message": "nta. I AM a parent. **they** overreacted, **they** should have been paying more attention to **their** child.\n\na **SLEEPING** dog with **NO** agression, gets a **10+ lb toddler falling** on top of them, when the dog itself only weighs a bit over 10 lbs, would make ANYTHING react.\n\nI'm a full grown human, If another full grown human landed on me, I would yell and hit too.\n\nand BIL is a liar, they aren't \"over it\". so be prepared to hear about this at at least 1 family holiday a year.",
   "created_utc": 1701166384,
   "score": 5,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3b4o5",
   "message": "They probably just felt guilty for putting their son and dog in that situation. Dog and boy did nothing wrong, Mum and Dad did.\n\nI'm so glad you rescued the doggo, I wish that was their first instinct. Adopt him to a family without small children. But no, straight to euthanasia, boooo BIL, booo 👎",
   "created_utc": 1701158364,
   "score": 4,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3m8v8",
   "message": "NTA. I once reflexively punched my dad when he was trying to wake me up for school. It wasn't intentional, and my parents never even considered abandoning me. Honestly, it sounds like they don't deserve the dog, and I'm 1000% happy that you ended up with it instead. Give the pupper scritches from me 😀",
   "created_utc": 1701167437,
   "score": 4,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3khtn",
   "message": "so NTA did you sister have the dog before meeting husband?",
   "created_utc": 1701166054,
   "score": 2,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3obfk",
   "message": "I am very much a dog person, and I can see wanting to avoid the dog being euthanized... and arguably, the parents should have tried to avoid letting a child just learning to walk do so around a sleeping dog.\n\nBut I also absolutely understand having a visceral reaction in this situation, and I definitely think that rehoming the dog was the right move, and in fact, it was arguably the minimum.",
   "created_utc": 1701169047,
   "score": 2,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3y3ck",
   "message": "NAH but dogs who bite children should be put down.",
   "created_utc": 1701175432,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3kir8",
   "message": "Yes, YTA. The dog who bit a toddler should be removed from the house immediately. In some countries it would have to be put down by law, and pretty much everywhere it would be allowed to put down if the owners chose to. Them driving it into shelter instead was already humane enough.",
   "created_utc": 1701166074,
   "score": 250,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3w15l",
   "message": "NTA, you're sister's husband definitely TA and since she wasn't actively antagonizing you, your sister less of TA",
   "created_utc": 1701174238,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3w3gm",
   "message": "Lmao look at all the child free comments saying NTA, y’all so delusional it’s kinda crazy",
   "created_utc": 1701174275,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3wp3w",
   "message": "Hey I think u r a hero u absolutely did the right thing. So happy for u and your new family member. Dogs r wonderful. Not only r u a hero but u r a life saver. God bless u and your new doggie.😇😇",
   "created_utc": 1701174633,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3u86v",
   "message": "YTA, the dog bit the child.  The child takes priority over an animal.  Not sure what is so hard to comprehend here.",
   "created_utc": 1701173150,
   "score": 252,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3si7w",
   "message": "If a dog bites a child it goes into the ground.\n\nYTA.",
   "created_utc": 1701172044,
   "score": 251,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3f4iq",
   "message": "YTA for the last comment.",
   "created_utc": 1701161608,
   "score": 239,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb3awct",
   "message": "I'd prefer to have put down the kid, then the parents.\n\nNTA",
   "created_utc": 1701158177,
   "score": 232,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb42bnf",
   "message": "Huge NTA ,\n   And your sister and her husband sucks , shame on them. My mom and I feed stray cats in our locality ,  we are doing so for years ,everyday 8-10 cats come to our house to eat three times a day and some of them even like to sleep in our house during the day and some little ones even became our family member because either their mothers died or their mother gave birth in our house. My mom has been bitten by cat once because she didn't see a cat was sleeping on floor and stepped on her tail , I have been bitten and severely scratched to the point of going to hospital,  once I was scratched because the cat felt like I needed a red tattoo in my leg I guess and had to go to hospital, another time I was scratched because the kitten thought my hand was a nice place to sharpen his nails , diva cat I guess and off to hospital I went ,and the third time it was a cloudy day lights were off and I couldn't see a pregnant cat was sleeping on our floor and I stepped on something of her I still don't know to this day what did I step on ,and she bit me directly in a vein on my toe, this one was severe because the poison directly went to my blood  according to doctors,doctors gave me five injections on the spot , and there were other sceduled for later dates, the on the spot injections included two injections on my toe, one of them was a big injection( the injection was so huge I can still see it in my nightmares) directly to a bone in my leg  , the injection was bent when doctors pull it out ,so you can guess it hurt like hell , my leg was so swollen that I couldn't walk for two days , another one was injected directly through the spot where the cat bit.  But the cute thing is, the cat mama came back to our house  next day  amd sneak in through our window  to see if I was still alive , how generous of her , I love her so much 😭, unfortunately she died a year later  and now her son is my mom's adopted son and his daily routine is to bite and scratch me gently, oops I went way off track.\n  Anyways my point is after getting injured by cats so many times we are still feeding them all to this day, my mom allocates a portion of her budget every month for the cats and they aren't even our pet cats, how can your sister and SIL be so heartless to abandon the poor doggo just because of a little mistake? I thought pets are like children to people , how can they even think about killing the dog just because it bit their child once? So they are killing one child for another child's safety when a situation like this is easily avoidable in future. People like them don't deserve to have any pets.",
   "created_utc": 1701177665,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb42pf5",
   "message": "To add onto everyone else’s NTA *the dog was 14 at the time of the incident*. The dog was *already old*. Older dogs have shorter fuses when pulled or hit or landed on by children.",
   "created_utc": 1701177852,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb43mri",
   "message": "The dog doesn’t deserve to be kill but I definitely wouldn’t want it in my house anymore that baby could have lost his eye",
   "created_utc": 1701178309,
   "score": 1,
   "submission_id": "185ptix"
  },
  {
   "comment_id": "kb43tua",
   "message": "everyone that's still reliving this 4 years later are A Holes (and there must be bigger issues here b/c only your sister and nephew are over this)..  your \"**PS fast-forward\"** shows no harm no foul every thing worked out**.** *Calling your BIL a 🐱 is not moving on and him bringing this up was not moving on.*",
   "created_utc": 1701178405,
   "score": 1,
   "submission_id": "185ptix"
  }
 ]
}