{
 "submission_id": "185ppsh",
 "title": "AITA for getting mad at my wife after discovering that she had sabotaged a former relationship of mine so she could be with me.",
 "selftext": "I am 34M married to 31F, we have been married for 3 years and have dated for a year before that. We have a 2 year old and she is pregnant with our second. Everything about our lives is absolutely perfect. She is the love of my life, but I found out today something that is really messing with me.\n\nMy wife and I work together for the same large company. We were nothing but acquaintances for the longest time. She was just that pretty girl at work who seemed a bit stuck up. We hardly ever talked, I didnt even think she knew my name at all. We were on the same office dodgeball league for a summer, but that was it.\n\nI had another girlfriend when I was 28, we met online. She was great, but 5 months into the relationship, a friend sent me screenshots of an online dating profile with her name and pictures. I confronted her and she vehemently denied it all. But the evidence was right there and I couldnt trust her anymore, so we broke up.\n\nJust a few months later, I started dating my wife after we had matched online. We had never even had a full conversation before matching with each other online, but suddenly there was this spark and the rest was history. We moved pretty fast, we both wanted to settle down, have a family. She’s a wonderful mother to our kids and the love of my life.\n\nBut recently I found out that she had sabotaged my relationship with my ex all those years ago by following my private Instagram with a fake account, saw photos of me and my ex, stalked her account, and took pictures from her private instagram to upload to a dating app. And the rest was history.\n\nHow I found out was after she got a new iphone for her bday and she gave her old phone to me to erase and sell online. One of her burner IG accounts was the exact same profile that had followed me right around the time of my breakup. She is still following me and my ex with that account. She probably forgot to unfollow.\n\nIt was really freaking weird and I confronted her. She confessed to everything but kind of blew it off, like “Oh well I had such a big crush on you, I did what I had to do. And it worked out, didnt it?”\n\nI admit, the way she blew it off was so strange to me. I told her I dont know who she is anymore. She got upset at me and said “So you value a 5 month relationship over your wife?” and said that we were “meant to be.” I got really upset and called her crazy, which led to her crying in our room and refusing to come out.\n\nI dont know what to think. My friend is telling me to just let it go, that if anything its a cute story to tell the grandkids one day. But it just creeps me out how she had always given me the cold shoulder before we started dating but all that time she was obsessed with me to the point of sabotaging my relationship. Shes never done anything else dishonest or sneaky to my knowledge so this is just wildly out of character for her.\n\nIdk how to word it. I guess its nothing, maybe my friend is right. What do you guys think? Was I too hard on her? Should I just let it go?\n\nTL;DR: Just found out my wife of 3 years had sabotaged a previous relationship in order to be with me.",
 "created_utc": 1701153653,
 "permalink": "/r/AITAH/comments/185ppsh/aita_for_getting_mad_at_my_wife_after_discovering/",
 "score": 58,
 "url": "https://www.reddit.com/r/AITAH/comments/185ppsh/aita_for_getting_mad_at_my_wife_after_discovering/",
 "comments": []
}