{
 "submission_id": "185q7tr",
 "title": "AITA for leaving my sleeping date at the theatre?",
 "selftext": "Hey all\n\nWent on a date with a guy I really hit it off via text. Everything went well, we were very attracted to each other and spent a day or two texting before meeting up.\n\nAfter work today we decided to have a first date\nMind you we both are 28m and 30f\nGot there, he was already 3 drinks deep. I decide to catch a drink or two to catch up, ease off of nerves, he also decides to keep drinking and occasionally snatches up my shots (I never finish at once, usually\nSip) to finish them.\n\nIn person, conversation is less imaginative. We start talking and he starts the convo by telling me how much he hates short hair on women (mine is shortish) but i pull it off.\nThen he goes to look for a photo of something. As he is scrolling through his gallery he mentions he has pictures/videos of\n\nA) his junk \nB) his having sex with other women\nC) his threesomes with his ex\n(He asks me if I’ve ever been in a threesome to pre empt the above)\nD) he reveals his ex (who he insisted was just an ex girlfriend up til now) was his ex fiancé \nE) his frat escapades and adventures \n\nI must have visibly expressed my distaste. He picks it up a bit and apologizes for “hurting [my] feelings”\nI reply I find it tacky, especially considering he asked me out and expressed an intent to date for a serious relationship and, in his words, “was past that part of his life”\n\nWe leave and he doesn’t want to part ways, wants to make it up to me, we go to another spot. He orders 6 beer flights and downs 4 by himself. Obnoxiously drunk and all over me. Suggestive, flirty, trying to kiss me. Asks if I wanna go to the movies. Fine, I can forgive being drunk though I’m slowly over it.\n\nIn the theatre he lies to the ticket attendant, sneaks us in (he’s a fucking lawyer mind you, he can afford it), buys me snacks. Passes out 15 minutes into the movie. I’m well over it by this point. He had hinted several times how he wants to leave and hook up.\n\nI try to wake him up. No dice. Every time I try he snores even louder. So I left him there. It was a terrible date and night.\n\nHe called me when I got home an hour later to apologize but also insist im an asshole, called me fat, told me he had to drink to tolerate me etc. and cussed me out. He says I’m insecure.\n\nI know he uses reddit and don’t care. \n\nAITA?",
 "created_utc": 1701155658,
 "permalink": "/r/AITAH/comments/185q7tr/aita_for_leaving_my_sleeping_date_at_the_theatre/",
 "score": 100,
 "url": "https://www.reddit.com/r/AITAH/comments/185q7tr/aita_for_leaving_my_sleeping_date_at_the_theatre/",
 "comments": []
}