{
 "submission_id": "185rde1",
 "title": "Husband always says “I make all the money so stop questioning me!”",
 "selftext": "So we’ve been married for 30+ years 3 adult children. We have remodeled and flipped houses, very hands on being my previous profession in interior design and my husbands experience in construction ( he’s a developer) hands on meaning I literally ripped out and finished what was replaced including painting the entire exterior and interior of our homes. So I became a SAHM as we both agreed to before the multiple home construction projects began and multiple kids. I have devoted my time to guiding our kids thru private school apps (it’s ridiculously stressful for all) and providing all guidance and support for our kids. Kids now growen and out of the house and I am now being told “he makes all the money so I don’t have a say in how he spends” nothing new gone on for years! My current concern is nearing retirement and he seems completely oblivious. When I mentioned that even though I don’t hav a paycheck my fees for all I have done to further our family are significant had I presented a bill, he mocked me. He has a very stressful job, makes a lot of money but I’m tired of him rubbing in my face that he’s the one with the paycheck. AITAH for voicing concern about spending so close to retirement while reminds me I don’t make the money?",
 "created_utc": 1701160467,
 "permalink": "/r/AITAH/comments/185rde1/husband_always_says_i_make_all_the_money_so_stop/",
 "score": 39,
 "url": "https://www.reddit.com/r/AITAH/comments/185rde1/husband_always_says_i_make_all_the_money_so_stop/",
 "comments": [
  {
   "comment_id": "kb3dxod",
   "message": "NTA. I would get a job if I were you, to get on the safe side. Financial abuse and insecurity is no joke.",
   "created_utc": 1701160623,
   "score": 228,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3m6l3",
   "message": "NTA.\nIf he’s very defensive you probably don’t have as much as what you think. Or he is just a super controlling AH. What he’s saying is ridiculous. Your kids are grown. You did a duty. Do you want to live the rest of your life with someone who treats you like this? You have decades left to be loved and cherished. Something to think about.\n\nThis sounds like financial and emotional abuse. Loving husbands don’t act like this.",
   "created_utc": 1701167389,
   "score": 222,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3iph3",
   "message": "Tell him that regretfully you are going to have to consider a divorce because that would be the only way that you can protect yourself.",
   "created_utc": 1701164590,
   "score": 177,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3msfa",
   "message": "Attorneys explain the law \u0026amp; facts to such people every day.",
   "created_utc": 1701167861,
   "score": 38,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4avkz",
   "message": "Divorce lawyer or couples therapy. He can chose.",
   "created_utc": 1701181636,
   "score": 36,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3gpij",
   "message": "NTA - see what a judge says....",
   "created_utc": 1701162941,
   "score": 182,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3rjnn",
   "message": "NTA but you really need to speak to a lawyer.  At least understand what your options are, this could get quite messy.",
   "created_utc": 1701171397,
   "score": 59,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3uyjt",
   "message": "Nta\n\nYou wouldn't be the first woman that gets fucked over at retirement age by their spouse that held all the finances.",
   "created_utc": 1701173600,
   "score": 57,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb424w2",
   "message": "This is absolutely financial abuse. Just because he makes the money doesn't mean he's God 🙄",
   "created_utc": 1701177573,
   "score": 18,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb46dtf",
   "message": "NTA but you’re in trouble. Your husband does not respect you and you are in abusive relationship. Financial abuse is still abuse. You may be better off to just leave and get a job to start contributing to your pension.",
   "created_utc": 1701179611,
   "score": 35,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3e3jo",
   "message": "Never become dependent on a man. \n\nThis is what it results in. Go and get a job and divorce his ass.",
   "created_utc": 1701160757,
   "score": 100,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb48qsi",
   "message": "You're NTA, but you fell for the oldest con in history, which is that of the provider husband. There's a reason why women fought so hard to be able to hold paying jobs, which is exactly to not be in this situation. Lack of income and financial dependence is also the most common reason why women don't leave abusive relationships.\n\nYou need to get some sort of income for yourself, preferably without him knowing about it, lest he tries to sabotage you. The only way to guarantee you'll have control over money is by making it yourself.",
   "created_utc": 1701180692,
   "score": 56,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3xcta",
   "message": "NTA. If the agreement was division of labor and funds, and he now takes back the funds after you invested 20 years of labor - that's fraud. Talk to a lawyer, not to get a divorce but to habe him/her calculate how much you WOULD get in a divorce. Shared assets, alimony, retirement funds etc. Then present your husband with that bill. My guess is you would be legally entitled to A LOT MORE than what you both are currently thinking you're entitled to. My mom did this with my dad and it changed his tone real quick. \n\nHe's a complete ass for a) pulling out of a deal with his dedicated wife of many years b) not honoring how much you invested in this marriage c) making you think you aren't entitled to any of your shared money. That is exactly what a marriage is, shared assets and responsibilities, and he is pulling out of a legally binding agreement after profiting from it for over 20 years. \n\nAppalling. Good for you for realizing he is being unfair and you're worth more!!",
   "created_utc": 1701175016,
   "score": 30,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3es1b",
   "message": "You are not the asshole. Your contributions to the family, even if not in monetary form, are significant and should be acknowledged. It is reasonable to express concerns about spending and discuss retirement plans as these are shared responsibilities in a long-term partnership.",
   "created_utc": 1701161323,
   "score": 37,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb408hb",
   "message": "Price out the cost of child care and house cleaning.  Total the amount owed for your work. Present him with an invoice next time he mouths off. Meanwhile get a job and a secret account.",
   "created_utc": 1701176593,
   "score": 11,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb457kz",
   "message": "NTA and get a lawyer OP. They will be able to tell you how much you contributed to your family and husbands business. You do deserve half of his earnings as he wouldn’t have the life and business he currently owns without you.",
   "created_utc": 1701179061,
   "score": 9,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3h13z",
   "message": "well, i hope your children are good to you. NTA",
   "created_utc": 1701163209,
   "score": 15,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3zg2s",
   "message": "NTA, your husband is abusive.",
   "created_utc": 1701176169,
   "score": 6,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4cuov",
   "message": "Wow reading commentary and OP this is going to be an interesting thread. \n\nLet’s just bluntly put it out there you are not an AH for expecting your spouse to discuss with you. I made 10x my wife’s income even before she went part time and I’ve always treated it as our money. Occasionally, I have to remind her to keep in mind our spending (she isn’t bad it’s more of avoiding lifestyle creep) because she doesn’t track any of our spending. \n\nAs to the rest of it have you and your husband ever sat down and review the finances? There’s nothing wrong with spending near retirement if the money has been invested well and often you have the income to do it at that point. Now my wife and I discuss big expenses but for the most part when it comes to investing and budgets I handle all of it - not because I make the lion share but frankly I have a far better grasp of the numbers. Investments are 100% in my court and I’ve started large investment purchases before even discussing with her. When I do fill her in on the loop she never bats an eye because she’s watch the impact over the years. In terms of budgeting - she really doesn’t have a budget she has to manage. our spending is in line with our plans and the only things we discuss ahead of time are car purchases. \n\nThat works for us. Ive always been happy to walk my wife through all our finances and she has a broad sense of when we will retire (50s) and items like that but she doesn’t care to really go through line by line. So I’ve got a breakdown of instructions for all accounts I maintain in a safe - it’s an if I die file to be honest.  I will say if she started questioning purchases without being willing to go through all the numbers I’d probably be annoyed and push back. So if the context is like that - our husband may have a point even if he is being an AH. But you aren’t wrong to want to get into it and discuss it with you. I’m be curious about the context of the discussion. Are you questioning the purchase or are you asking to learn more about your shared finances?",
   "created_utc": 1701182484,
   "score": 8,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4hgsk",
   "message": "This is flat-out financial abuse.",
   "created_utc": 1701184387,
   "score": 7,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4824w",
   "message": "Is he quite all right? If this is a sudden change, what’s going on? Or was he always a domineering AH?",
   "created_utc": 1701180382,
   "score": 6,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4opk0",
   "message": "The fact as. He would not be making so much without you. Your support and sacrifice plays into his success",
   "created_utc": 1701187167,
   "score": 7,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4e7hh",
   "message": "OP, time to start paying attention to your family finances. Don’t be that woman that thinks her marriage is a team player situation and then finds out she’s been had when it is far too late. \n\nWith your skills and altitudes you’d probably make a good general contractor for house flipping. Getting your GC and real estate licenses wouldn’t be hard, and you could start taking on projects now that your kids are grown and out of the house.  You’d probably actually enjoy it!  \n\nYour husband might also appreciate not being solely responsible for supporting the family and might see you differently once he sees you taking action outside the house.  You owe it to yourself to have life be meaningful now that the kid rearing is done. \n\nMy mom went back to work and is 76 with a career she still enjoys and a vibrant life. My MIL never returned to the workforce and is overly invested in the minutia of her grandchildren’s lives and their weekly card playing (Bridge) night, and has a bit of a screw loose as my husband calls it.",
   "created_utc": 1701183051,
   "score": 5,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4qmty",
   "message": "NTA.  \n\nIt sounds harsh, but he's committing a type of financial abuse.     \nShow him research on the value of SAHM's, it's eye opening what financial value they provide.  \n\nYour husband is just a jerk.  \nAlso, I was a SAHD, my wife out-earns me a lot, and she doesn't do that to me. \n\nFinally, you might consider responding in kind.    \nIt'd be rude, but maybe you need to remind him that from a legal perspective in a divorce, you're entitled to half of everything he earned, so he should shut up, or you'll make him put up.",
   "created_utc": 1701187897,
   "score": 5,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4xuh7",
   "message": "NTA, his mentality is toxic and you are supposed to be an equal partner in all of this; he does not respect you or anything you have sacrificed to raise and educate your children. You may want to get a job just to have a safety net.",
   "created_utc": 1701190561,
   "score": 5,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb51za0",
   "message": "Run a credit check on both your names. I’d be concerned that he has debt you are not aware of, but might get stuck with in a death/divorce.",
   "created_utc": 1701192050,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3rux7",
   "message": "NTA ….. also, all developers wives are ironically “interior designers”",
   "created_utc": 1701171610,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4gdyn",
   "message": "What is he spending on? Married for 30 ? have a discussion and sort it out. You both are doing something right to stick for so long and raise kids . Dialogue will fix everything.",
   "created_utc": 1701183952,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4gp5k",
   "message": "NTA. He was able to make that money because you supported him and raised your kids. That is both your money and if he doesn't feel that way it's a problem. I would be looking for a financial advisor.",
   "created_utc": 1701184077,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4o67j",
   "message": "NTA and if this is a significant change in behavior there could be something going on. As others have said, talk to a lawyer before he spends all of the money for both of your retirements.",
   "created_utc": 1701186964,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb51olr",
   "message": "There is not enough information here.\n\nClearly dude is being jerk. \n\nBut need details",
   "created_utc": 1701191946,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb543nv",
   "message": "NTA. Also, he’s failed in his responsibilities as a provider, if that’s his designated responsibility. \n\nAs far as I’m concerned, if he wants to abuse “traditional standards of marriage” by claiming he makes all the money and you don’t get a say in anything, that’s cool. You’re under his care and he’s responsible for your future. All👏By👏Himself👏. He needs to step up and ensure that BOTH of you are taken care of then. Spending be damned. If he wants to take on that responsibility and cut you out, let him. Reminding him that you depend on him is neither out of line nor nagging. If he’s done his job (like he seems so high and mighty about), then he shouldn’t have a single problem breaking down how he’s taken care of those in his care and PROVIDED for BOTH of your futures. \n\nIf he’s just an arrogant and disrespectful prick who is irresponsible and not providing for his family, then get a job and keep it moving without him. Providing is more than just a paycheck, my guy. \n\nBesides, your kids are grown. He’s not your master and you’re not a slave. Go do something for yourself and drop this little boy like a hot potato.\n\nOh, and legally (not to be construed as legal advice), if he wants to be a miser to you with the money, he can try on divorce and see how alimony feels. Then he doesn’t get a say in what you get. A judge does. And after the time you put in as a SAHM and the decades of unpaid labor you’ve done, he’ll probably pay you a decent amount.",
   "created_utc": 1701192811,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5jrdr",
   "message": "Ask your husband if there is a will, a trust, a POA or an estate plan for all of your assets. If not, tell him you want to get started on this to avoid fees and taxes and probate.  Tell him you have been following financial tips on instagram or tiktok - like lawmother. Tell him you want to be sure your kids are taken care. While you are doing this go to all the meetings with the attorneys and take notes. Be sure you have copies of your tax returns, bank and broker statements, and keep your copies separate and in a safe place. \n\nYou may want to find someone to talk to - therapy - and also find a different therapist for couples therapy.",
   "created_utc": 1701198393,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5k6ub",
   "message": "I met a lady who was with a husband like this. He didn’t pay into anything for her. She was 65 when he left her and she had literally nothing. No credit. No money. No proper job history. Nothing. She was absolutely fucked.   \n  \nHe’s going to leave you in the dust with nothing once he can. Sorry.",
   "created_utc": 1701198547,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3qti2",
   "message": "NTA - You are correct to raise concerns. Your husband’s thinking here is disrespectful. You’re right to call him out on it and should persist to ensure he understands. Maybe go strike? Just stop doing anything you currently do for him whether it be cooking, cleaning etc. If he questions it, just say you’re the one that keeps the house so he has no say on how you choose to keep it. He should get the message.",
   "created_utc": 1701170894,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb46sic",
   "message": "So when you have a bit of free time assuming you have access to your financial information take that information along with you to have a chat with a really good divorce attorney so you clearly understand your position as well as what you’d be entitled to if you divorced.  \n\nIf your husband has decided he is going to spend your resources as only he sees fit then you may wish to seriously look at if you’d be better off divorcing him.  \n\nNot saying it is the only solution nor that it’s one you should jump into.  But I would say either he gets his head on straight or you take your share and live your best life.",
   "created_utc": 1701179797,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb478r5",
   "message": "NTA, saying that once is a marriage-ender.",
   "created_utc": 1701180006,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4j1if",
   "message": "NTA. This is abuse. No question, no equivocation -- abuse. It falls under the category of financial abuse, if you want to look into it further. \n\nSeeing a therapist specializing in couples counseling may be helpful for you. He's unlikely to accept that his behavior is abusive unless a third party tells him so. He may not even accept it then, but at that point you will at least know you've done what you can to salvage the relationship, if that's what you want.\n\nYou could also very rightfully consider divorce if you are unhappy with him. Often when a partner gets defensive about finances, they are actually hiding the fact that they don't have as much money as their partner thinks, or they have hidden debts they haven't told you about. Don't let this AH ruin the rest of your life.",
   "created_utc": 1701185007,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4mpgq",
   "message": "NTA. If you don’t love him divorce his ass and then we’ll see how much the courts value your contributions. I’d wager a lot different than his personally convenient analysis.",
   "created_utc": 1701186412,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4nyp1",
   "message": "Speak to attorney about the matter ASAP.",
   "created_utc": 1701186885,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4r33b",
   "message": "Unless you have a prenup everything that he has is half yours as well",
   "created_utc": 1701188067,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4tcab",
   "message": "I thought you were my mom for a sec 😳.... You are NTA, I would go with people's suggestion to get a job, but you should also make a spread sheet of all your shared assets and personal (jewelry, clothing etc..). My mom's friend was blind sided by a divorce after 20+ years and he had hidden or sold everything without her knowledge.",
   "created_utc": 1701188907,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4tucc",
   "message": "Girl, get get yourself half of \"his\" money for the rest of your life and spend it with a new partner who loves to let you spend his and your money.  Know your worth.",
   "created_utc": 1701189093,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4xq8a",
   "message": "If you live in the US, that money is BOTH of yours. There's no \"my\" in marriage unless you let him get away with it.",
   "created_utc": 1701190518,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb50104",
   "message": "NTA. If you divorce him you can find out through the courts exactly how much money is his. I'd take alimony for retirement.",
   "created_utc": 1701191352,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb50g6y",
   "message": "Maybe the a hole missing context tho idk what you’re “nagging” him about spending money on and if y’all haven’t been flipping houses in a while I’m sure you half is gone since it would be weird to expect him to only spend his share Ob bills and childcare so yea idk if op has given this context plz reply if so",
   "created_utc": 1701191504,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5fn9n",
   "message": "If you were in Ireland he’d be in trouble as financial control over another person is illegal.",
   "created_utc": 1701196919,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5gpn2",
   "message": "What you do OP is next house he wants help with. Decline to help. Let him find his own interior designer. Once he starts bitching about the cost then make a snide comment about how you could do it cheaper. Do it strictly from a business point of view.",
   "created_utc": 1701197299,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5ispk",
   "message": "Maybe she could get back to interior design.",
   "created_utc": 1701198047,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5ml1i",
   "message": "I think the only way YTA is to yourself in that you stuck around for 30 yrs with a serious shit stain and let his attitude be the example to the kids.\n\nMa'am, you've eaten enough shit. Bring up what you will when you want.",
   "created_utc": 1701199381,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5mmv9",
   "message": "NTA. Naw he doesn't make all the money, you both have money. He can only do what he does because you do the other half. In my marriage there is no hers or mine. There were years where I was the only earner, and currently she out earns me by about 30%, but at no time have we ever said \"my money\".\n\nPresenting the bill was really petty though and you should have expected that response. That's not how this discussion should go at all. You are married and you share it all unless you made the choice to keep finances apart.",
   "created_utc": 1701199399,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5mn1o",
   "message": "Your husband doesn't respect you or love you. You should realize this and do something with this realization",
   "created_utc": 1701199401,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5n2sc",
   "message": "NTAH Your contribution is equal (at the very least) with renovations as his is with his job. You have both clearly been working full time at your various pursuits, all of which were for the benefit of family and financial security. Others are right, though, when they say you should get a job OP, and my guess is you  would be a great benefit to others flipping houses. Hopefully, you will be able to buy and flip houses on your own. What money you make there would be entirely your own, and he would have no say in how you spend it when you are retired!",
   "created_utc": 1701199555,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5ow3f",
   "message": "NTA-Answers like that mean he has blown through the retirement account and/or is probably cheating. Time to just go get yourself a part time and save it all in your own separate account so you are prepared for when evidence of his affair comes to light.",
   "created_utc": 1701200191,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5oxar",
   "message": "NTA but you're only thinking of the stress you had to endure for years as a sahm. It's incredibly stressful as the only working parent to bring in income to support a whole family. Thar weight is increasingly bearing and a huge mental burden.  If you don't want him to downplay what you did don't downplay what he did.  But he should be smart enough to realize everything thing he has is half yours too.",
   "created_utc": 1701200203,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5teae",
   "message": "NTA get some legal advice about what u r entitled to and how to go about protecting yourself. knowledge is power get information about what would happen in various scenarios including but not only divorce. Once you have the information you can then decide how u want to move forward but even a part time job would not only give u some cash of your own, it gets u out, meeting different people, learning new skills it could b really good for you. Be very careful tho he is financially abusive and has been for a long time, get all of your advice first and really consider ALL your options before confronting your husband.",
   "created_utc": 1701201774,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5tt6f",
   "message": "Sounds like you'd make a great property manager. \n\nPull all your skills to work, and when you don't have time to do the housework, cook or run errands,  tell him to do it himself because you're too busy saving for your retirement. \n\nP.s. As soon as you stop doing unpaid work in the house or for him, husband will see that you are NTA.",
   "created_utc": 1701201921,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb49nb3",
   "message": "NTA, divorce the cunt and take him for half.",
   "created_utc": 1701181098,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb42xsm",
   "message": "NTA He should understand and  recognise your contribution before kids in flipping houses as well as, your efforts as housewife. A calm ,long and detailed discussion is necessary.",
   "created_utc": 1701177966,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb48lse",
   "message": "Get a job please , secure yourself financially in some way and talk to a lawyer. \n\nMy fiancé is the main provider on our house and he covers 90% of big expenses and I still have a say in how money is spent in regards to our things and the things we do as a couple. Our house that we move into next year was paid by him but that’s OUR house , I was the main one designing and picking things for the house that house was like a little project for me just because he paid doesn’t mean it’s just his house , it’s OUR home and I’ll be dammed if he makes decisions on OUR home without consulting it with me first . I don’t care if he makes/has the most money, we’re in a relationship and we’re making decisions together about OUR relationship.",
   "created_utc": 1701180630,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4g1o6",
   "message": "Has he been like this for all these years?",
   "created_utc": 1701183811,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4hiax",
   "message": "You guys need to have a serious conversation about retirement and what his plan is; ideally it's decoupled from any conversation of savings since it seems a sore spot for him. My parents are on their late 50's. They haven't saved much because mom has fought it constantly. She is a stay at home wife and hasn't even worked enough in her life time to qualify for social security. Her plan is seriously for my dad to work forever and then one day die. She has no plan after that. \n\nYour husband may not see it as a big deal because he may have zero intention of ever retiring. I unfortunately know a lot of people with this mindset. They have hustled and grinded for so long that they don't know how to exist without work and the thought of it terrifies them.\n\nEdit to add: NTA",
   "created_utc": 1701184404,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4q568",
   "message": "If I were you, I would contact the lawyer, not to fall for divorce, just yet, but to find out where you stand financially and legally.\n\nBut first, gather copies of income tax, what you owe, what you own, any investments, and anything else pertaining to finances.\n\nYou are in trouble here. This is how he views it. He actually thinks it’s his money… The fucking audacity!!\n\nYou need to keep quiet you can’t let him know that you’re looking into anything because he sounds like the kind of guy that’s going to start hiding money. Play along like everything is fine.\n\nAdditionally, if you do go see a lawyer, which you should, don’t tell anyone. You can’t risk telling a friend if her husband is his friend. He can’t have any clue because it’s going to get dirty real quick.\n\nSeriously protect yourself you haven’t worked your ass off for 30 years to have it all pulled out from under you.",
   "created_utc": 1701187711,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4rjm0",
   "message": "The state simply doesn't view it all as his money. If he doesn't like the bill you handed him, he'll like the bill the state gives him even less.",
   "created_utc": 1701188239,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb512l7",
   "message": "NTA, but your husband is. The 2 of you agreed on a division of labor as PARTNERS. Your labor is not to be discounted. If you are concerned about financial abuse, see a lawyer. There may be a free or low cost consultation available in your community. Call your local women's shelter for a referral.  \nYou certainly have the right to insist on a conversation about retirement planning. Since he is sensitive about it, watch your tone. Ask questions and offer suggestions. Don't tell him what to do. You're partners.",
   "created_utc": 1701191728,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb51xfq",
   "message": "sounds like you have a child for a husband",
   "created_utc": 1701192032,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb53k8t",
   "message": "NTA.  He is, though.  Unfortunately, it's not an uncommon refrain.  As if being a stay at home parent is worthless.  Regardless of who earns what, the money is both of yours.",
   "created_utc": 1701192617,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb558cf",
   "message": "I don't want to sound mean but OP needs to be thinking of herself  here. Best to consider getting financially stable on her own and getting out. It like she's already looking on Social Security. gov at \"Your Social Security Statement\" - shows you how your finances stand. Also checking how many credits of work you have. This is extremely important for retirement. \nWithout savings and a safety net, retirement is going to be extremely rocky.",
   "created_utc": 1701193209,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb55cyy",
   "message": "One partner should never rub ANYTHING in the others face... But on the other hand, if you're nonlonger raising kids and want to contribute your own money, maybe it's time to return to your career.",
   "created_utc": 1701193253,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb55dip",
   "message": "If his behavior has changed in recent times....ie - for years he used to be more forthcoming and operated with an air of respecting her contributions and has now changed his tune  - then OP might want to start looking for evidence of an affair. He could even be squirreling away money in anticipation of leaving her high and dry...whether for someone else or just divorcing.  Though I've read that men typically have a side piece waiting before they make that leap.",
   "created_utc": 1701193259,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb56qy1",
   "message": "NTA. I stayed home for years. My husband made a comment like that once and I warned him if he ever said it again I would go to work full time. He has never said it again. Get a job immediately do not allow someone to talk to you that way as if taking care of everything at home isn’t extremely hard as well.",
   "created_utc": 1701193744,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb56wq2",
   "message": "NTA tell your husband its both of your money and that he can either share the decisions now or you'll make certain you get access to your share in a divorce. Seriously, what an unappreciative financially abusive asshole.\n\nEDIT: Traditionally, a SAHM is the one that controls the family cheque book.",
   "created_utc": 1701193800,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb56y9p",
   "message": "This doesn’t sound like a marriage that has legs.  If I were you I would be consulting an attorney now to ensure you are protected.",
   "created_utc": 1701193815,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb56ysk",
   "message": "Your husband contributes to the household and should be able to spend some money - just as you contribute to the household and should be able to spend some money.  Both of y'all should have a say in what happens with large sums of money -- I say large sums because I don't believe either of you should check with the other for smaller purchases.  \n\nINFO:  You don't mention how much he's spending and how that affects your overall financial wellbeing.  For example, is he spending $5 on lottery tickets every week ($260/yr) and brings home $10k/month, or is he spending $150/wk golfing ($7200/yr) while bringing home $35k/yr?\n\nAs far as his comment, it sounds completely like an AH thing to say.",
   "created_utc": 1701193821,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb57wyc",
   "message": "Talk to a lawyer, you are entitled to at least 50% of his money.",
   "created_utc": 1701194151,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb58o2t",
   "message": "My deceased husband did something similar after I became disabled. He was incandescently angry because I had made much more money than he did so economies were going to need to be made. At one point, he said he was *gonna throw me out but he was going to be nice and let me take my clothes* and then divorce me. My response was this: we had been married over ten years in a community property state so half of everything was mine. And, since he had often shot his mouth off *publicly* that he was going to divorce me for becoming disabled, the courts would not look kindly on that. Further, since I was disabled, I would receive the house and he would receive the mortgage payments and utility bills. I would receive the vehicle and he would have the payments. Plus, even though there was no alimony in our state, since I was disabled, I would receive separate maintenance payments due to being disabled. And so on. Told him to consult an attorney if he didn't believe me. Cooled his jets deluxe though he was often an AH to me. Some months later, though, he got a terminal cancer diagnosis. I did his home hospice care with the help of friends though it was harrowing.",
   "created_utc": 1701194419,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb596j2",
   "message": "NTA. Assuming you've been married that long, just divorce him for half his retirement.",
   "created_utc": 1701194604,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb59yuk",
   "message": "Financial abuse and abuse stemming from control of the finances is unacceptable and worth concern over for you. You two are a team, he isn’t the coach and quarterback. Mocking you is likewise unacceptable behavior. You need to re evaluate his behavior and this relationship and consider getting your own job to at least alleviate some of your concerns and keep your options open as you continue to communicate with him over these issues.",
   "created_utc": 1701194887,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5a2dw",
   "message": "Get a job keep all that money for yourself if he questions it I made it I decided how to spend it",
   "created_utc": 1701194922,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5a43i",
   "message": "NTA\n\nYou agreed on a labor-splitting plan, which includes the results of those efforts. \n\nIf all the money is his, the family is yours.",
   "created_utc": 1701194939,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5a6qf",
   "message": "When money becomes a point of fighting each other it always goes wrong. It is about building a life together, and now that the kids are grown why not get back into your interior design career? Then you'll have your own money to spend how you please and he'll see the flaw in his argument",
   "created_utc": 1701194966,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5cksk",
   "message": "I’m sorry you are experiencing this. You are NTA at all. I think it’s common for men to have this mentality, and they just happen to forget everything you’ve done and keep doing for the house. Not really much any of us can do here, except say I feel for you, and you aren’t wrong for being concerned. Especially the retirement thing. Imagine he’s been neglecting that, then you find out a couple years before he plans to retire. I don’t think he’s truly grasping the role of a provider. In my opinion, a husband and wife own everything equally, especially the money hubby brings in. That was the whole agreement, you pay for everything, I be SAHM and take care of the house. When did the agreement change? The way I see it, you are the one eligible for retirement, you raised those kids and moved em out. You did your job. Time for hubby to pay the piper.",
   "created_utc": 1701195824,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5d55x",
   "message": "NTA, Tell him that despite him \"making all the money\" a court will have no issue giving you half and requiring he make alimony payments with the rest. 🤷🏽‍♀️\n\nIf you don't want to be that confrontational, get your own job and tell him that you're now making your own money and he'll need to start doing his own housework for himself. Clean up after just yourself, do your laundry and not his, nothing says \"I contribute around here\" like the sudden lack of the contributions you make.",
   "created_utc": 1701196025,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5f0pk",
   "message": "NTA, unfortunately, it sounds like you’ve allowed him to get away with this for far too long. He’s not likely to change his tune at this point if you want to affect any real change, the ball in your court you’re gonna have to make some hard decisions on what to do about your future, and whether or not, it includes him.",
   "created_utc": 1701196696,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5f26g",
   "message": "\"When I mentioned that even though I don’t hav a paycheck my fees for all I have done to further our family are significant had I presented a bill, he mocked me\"  -    \n\n\n  \nThis logic is insane to me.    If he died tomorrow you would still have a house to clean and kids to take care of. Who are you sending the bill to?",
   "created_utc": 1701196711,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5ittn",
   "message": "Dude...where is your self respect. Fuck that guy.",
   "created_utc": 1701198058,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5p8u9",
   "message": "Get a job. Contact a lawyer to see how assets would be split. You don’t have to divorce. You do need financial questions answered because he’s a prick to you financially.",
   "created_utc": 1701200315,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5phcm",
   "message": "NTA. Divorce him - get the money that's due to you and be rid of his abusive BS",
   "created_utc": 1701200399,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5slh3",
   "message": "Get a job ASAP",
   "created_utc": 1701201494,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5ulos",
   "message": "My abusive ex used to say this to me all the time to \" keep me in line\"",
   "created_utc": 1701202200,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5wt7h",
   "message": "Actually, him saying that it is all his money as he has been supporting her all these years, sounds like, one 50%of the assets and spousal support. Sounds like a winner, and she can continue to do what she loves",
   "created_utc": 1701202972,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb5xhj1",
   "message": "NTA.  Get a job and then make a chore chart and sit his ass down and discuss the division of house chores.  If he objects in any way it will most likely come across as sexist so be prepared.  Explain your side of equality in your marriage.  If he still won't see reason it's a pick your nuclear option situation. Divorce, or sit your ass on the couch and hire a maid.  You deserve respect, you've more than earned it.",
   "created_utc": 1701203207,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb68zln",
   "message": "Doesn’t matter who makes the money, you or him. Unless you have a prenup whatever he makes is equally yours….just like any partnership. Let him know you can decide together how your money is spent or you can take your half in a divorce and decide yourself.\n\nI had a friend who let their spouse control all the money and poof one day they repoed the car and the next week he got notified the house was being foreclosed on.",
   "created_utc": 1701207208,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb69cjv",
   "message": "NTA, fuck ur dumb ass husband. you have done a lot of work over the years and he wouldn't have been able. to get to where he is if you didn't do the things you did.",
   "created_utc": 1701207333,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb6c95o",
   "message": "Ew. I don’t like him at all.",
   "created_utc": 1701208349,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb6fjxv",
   "message": "NTA\n\nLadies, this is why you should never depend on a man financially, the women telling you this advice are not bitter or envious of you being a SAHM, they want you to protect yourselves💔",
   "created_utc": 1701209508,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb6m2cr",
   "message": "NTA. Ladies, *never* sacrifice your financial stability.",
   "created_utc": 1701211936,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb6mdt0",
   "message": "Time to divorce. Talk to a lawyer and then see what the court says about your sweat equity. Do this before he spends down your retirement money.",
   "created_utc": 1701212059,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb6r6pw",
   "message": "He has made his feelings about his wife's contribution to the family VERY clear.  The best option is to consult a lawyer, find out where the money is stashed and take her half.  She needs to get out of there.",
   "created_utc": 1701213966,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb6s30v",
   "message": "Reading between the lines he probably low balled your side of the work and thus y'all are probably broke with no retirement because he treated you as free labor for decades. Willing to bet he also owes the IRS a lot of money, has been floating from remodel to remodel, and is too embarrassed to tell you that it was all a shell game.\n\nI bet he bought the properties when they were high and sold low too as flippers end up doing because they think the bubble will keep going.\n\nYou should take a look at the books when you can to know where you both really stand and just how screwed you are.",
   "created_utc": 1701214331,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb71e2b",
   "message": "My answer would be, \"Nah, bitch! Ima ask my questions and speak my mind and you're going to sit there and listen. If you don't like that, we can go to court and let a judge put the 'ass' in assets for you.\"",
   "created_utc": 1701218117,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb72i77",
   "message": "He sounds like a dick.  It’s completely reasonable to voice concerns over finances.",
   "created_utc": 1701218570,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb77s1b",
   "message": "One thing I will thank my mom for is that she taught me never to rely on a man.\n\nPlease start to look for work or at least start putting $20 every time you go grocery shopping. It’s a small enough amount that will probably go unnoticed and will add up if you’re needing money to get out",
   "created_utc": 1701220715,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb439v7",
   "message": "The kids are grown get job so you don’t have to depend on him anymore",
   "created_utc": 1701178132,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4gbyl",
   "message": "NTA. Your husband is the AH. You have been partners for decades, he couldn’t have done what he did without you but he’s saying, “Mine!” Make sure you know what you have. Copy records. Make sure you have access to all bank accounts.\n\nI was a SAHM for part of our marriage and I work but make much less than my husband. We have always considered everything ours, but I was lamenting a bad year and said one thing about how it was his money and my husband corrected me quickly!! Reminded me we were always partners and it didn’t matter who made it. You deserve the same.",
   "created_utc": 1701183930,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4u9am",
   "message": "This is abuse.  You did the work that made that money.  You need to see the finances or get a lawyer.",
   "created_utc": 1701189246,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4ul89",
   "message": "NTA and thats abuse both financial and mental. Get yourself a job and stash your own aside. Also if you still do house flips and whatnot then tell him to go take care of the whole thing himself next time since he thinks you're value is invalid. Either way it sounds like his actions, words and overall attitude towards you needs either really good therapy or a reality check. I mean no offense ofc this is just how it sounds to me. If I'm missing something definitely let me know.",
   "created_utc": 1701189367,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4w0z0",
   "message": "I make all the money in our relationship, with 4 kids, and always find the common decency to treat my wife with respect and love.\n\nNTA.",
   "created_utc": 1701189899,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb415ls",
   "message": "How old are these adult children? If you're kids are 25 then you've been unemployed for 2 decades since your kids went to school...",
   "created_utc": 1701177075,
   "score": 4,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4w4s5",
   "message": "File for divorce and when he sees the spousal support and division of assets he'll sing a different tune.",
   "created_utc": 1701189938,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4ws6y",
   "message": "NTA  \n\n\nJust acknowledge that he doesn't have the leverage he thinks he does by making money.  just *stop* doing the stuff you do and see how long it takes for him to get annoyed.  Then remind him that if you divorce, you will *definitely* be telling him how he spends some of his money.",
   "created_utc": 1701190177,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb579ni",
   "message": "Divorce",
   "created_utc": 1701193925,
   "score": 2,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb3itbr",
   "message": "\nYou are not the asshole for voicing concerns about spending, especially when it involves the future and retirement planning. Financial decisions in a marriage should ideally be a joint effort and your contributions to the family, even if not monetary, are valuable and should be respected.",
   "created_utc": 1701164679,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4e0gx",
   "message": "Solution:  Get a job.\n\nIf you kids are off to school every day, you could find work and make money, too.\n\nYou agreed to be a SAHM; he didn't force you.",
   "created_utc": 1701182973,
   "score": 3,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb51tsk",
   "message": "\u0026gt; When I mentioned that even though I don’t hav a paycheck my fees for all I have done to further our family are significant had I presented a bill, he mocked me.\n\nYou presented a bill for doing stuff for your family lol. I would mock you too. You really asked for it, and I feel no sympathy for you.",
   "created_utc": 1701191997,
   "score": 1,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4y4wb",
   "message": "YTA, you state you’re concerned about retirement but you’ve already been retired for 30 years. If your husband won’t tell you his plans for retirement that’s totally on him, if I were you I’d go out and get a job so I wouldn’t have to rely on someone else for money..",
   "created_utc": 1701190667,
   "score": 1,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb51lt7",
   "message": "You get half of everything in the case of divorce. Just think about that. NTA but he is.",
   "created_utc": 1701191918,
   "score": 1,
   "submission_id": "185rde1"
  },
  {
   "comment_id": "kb4kni6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "185rde1"
  }
 ]
}