{
 "submission_id": "185tt3q",
 "title": "Aitah for attacking my MIL?",
 "selftext": "Morning everyone I'm (26F) and I want to get everyones advice on my situation that happened yesterday, I don't want to make it long for you guys so I will just get right to the point.\n\nYesterday I had dropped off my daughter to my husband mother house because I had an allergic reaction to dragon fruit, it was my first time trying it because my sister wanted me to try it as it was really popular. My husband took me to the hospital and luckily the doctors were able to prescribe me for medication that I had to get at the pharmacy, I didn't like it one bit because it was itching my whole body and my hands were sore.\n\n\nThis was in the day time by the way, when I clear to get at the hospital my husband and I drove back to his mother's house. When we got there we didn't see our daughter so we were guessing that she was in the game room like she always is when she's over at her grandmother's house, I found my mother-in-law in the kitchen making Spanish rice the Dominican way and when she seen me she was really startled but at that time I didn't know why.\n\nWhen I found my daughter and I seen her appearance I screamed like honestly, tell me why this old bitch put perm in my child hair? My daughter has really curly hair from me so it Is going to take a while to get her curls back, my adrenaline was rushing so bad because my daughter hair looked a mess her hair looked so straight. My daughter was upset, she was crying and saying that she thought Grandma put conditioner in her hair because that's what Grandma told her and mind you my daughter is only 4.\n\nI realized this in many Hispanic households, many mothers don't like the curly hair. My friend is Dominican and her mother is so colorist, he mom doesn't like her \" negro\" hair she says and her dark skin.\n\nGuys I know what I did was crazy but I did not care because I don't play about my kids, I told my daughter to stay in the room. I just want to say I gave that bitch the hardest slap known to mankind, I even threw a glass at her and my husband had to stop it. Eventually she did step on the glass that was on the floor and that made me happy, after that I told my husband that she can't see my daughter again because I can't trust her and I told him if he doesn't check her I will leave him. I think that was too much but I was very heated.aita?",
 "created_utc": 1701170522,
 "permalink": "/r/AITAH/comments/185tt3q/aitah_for_attacking_my_mil/",
 "score": 67,
 "url": "https://www.reddit.com/r/AITAH/comments/185tt3q/aitah_for_attacking_my_mil/",
 "comments": []
}