{
 "submission_id": "185voth",
 "title": "AITAH for ignoring my daughter until she apologizes",
 "selftext": "I (60 F) am currently ignoring  my daughter (43) until she apologizes to myself and my husband (60 step-father).  By ignore I mean not initiating contact.  If she calls I'll answer but only to make sure it's not an emergency concerning my granddaughters and I keep the conversation to under 15 minutes.  This has been going on for over a year now.  She rarely calls. \n\nDaughter has a history of lashing out or just being dismissive to family members out of nowhere.  She takes a bad day out on anyone that falls into her radar.  Including her kids. She took aim at my husband,  her youngest brother, his wife and my aunt over a year ago and I called her out on it.  They had zero contact with her, she just randomly started blocking family on social media.  Mind you, she had just recently called me asking if I would pay an emergency vet visit (I said I would) knowing I do not work (caregiver for my aunt) and it would be my husband's money she was asking for.  \n\nWhen I discovered she had blocked him I called her.  She went TF off on me saying I didn't tell her who she had to have contact with.  She went on to attack me for not having come to visit yet.  She had recently moved and the property had a cottage that her father had moved into(my abusive ex). I had told her I'd come visit if she would let me know when her dad was traveling. She never did and I again explained that I would visit when my ex wasn't there. She accused me of trying to be a wedge between her and dad.  The conversation ended badly and I decided to remove myself from her social media when the passiveaggressive posts immediatelystarted.  That was met with me being blocked from my granddaughters phones.  \n\nShe called about a week later with a medical questionnaire she needed information for.  She knows my medical information and also knows I am adopted with zero family medical history.  I answered her questions and told her if she needed more information to email it to me, I considered her to be far too much like her father and until she apologizes I really didn't have much to say to her.  She hung up. \n\nSince then I have sent a family gift for Christmas,  put some money in cards for my granddaughters birthdays that will be either hand delivered or left to them in my will. My daughter has called around 3 times once being just before her birthday.  \n\nSo, am I the asshole for demanding an apology? (I have suggested therapy but she doesn't believe in that)",
 "created_utc": 1701177044,
 "permalink": "/r/AITAH/comments/185voth/aitah_for_ignoring_my_daughter_until_she/",
 "score": 155,
 "url": "https://www.reddit.com/r/AITAH/comments/185voth/aitah_for_ignoring_my_daughter_until_she/",
 "comments": []
}