{
 "submission_id": "185z20a",
 "title": "*UPDATE* WIBTAH IF I DIVORCE MY HUSBAND OVER FINACIALL ISSUES",
 "selftext": "Hello everyone, I know I have been asked to give an update and I am sorry it took a while and I don't know if i am even doing this right, but things have been wild. so on to the update we are getting divorced.  We did talk and he had tried to change his mind and say he was sorry that he will do better but at this time the damage was done. We did talk about everything, and he does feel remorseful. He did move out and my two kids and I have the house and he did go to be with his mom until he can put money away for him and his daughter to get their own place. He asked that we stay friends and I'm okay with that because my children still want to call him, and I don't mind that. Right now, things are extremely hard for them, but we are working through it and that's the best thing we can do. I talked to the kids to see if we can do family counseling and they both said yes and so I think with some help we will be fine. Financially I am fine. and now my primary job told me I can bring the kids to work any time I need to have them with me if I don't have childcare, so I get to spend more time with them too! I know they are worried about mom but my main concern is their mental health so that is my primary focus I want them to be okay. Thank you all for opening my eyes and helping me express how I have been feeling and I just truly appreciate you! ",
 "created_utc": 1701186362,
 "permalink": "/r/AITAH/comments/185z20a/update_wibtah_if_i_divorce_my_husband_over/",
 "score": 187,
 "url": "https://www.reddit.com/r/AITAH/comments/185z20a/update_wibtah_if_i_divorce_my_husband_over/",
 "comments": [
  {
   "comment_id": "kb4nnrg",
   "message": "I'm glad your primary job is being so understanding and allowing you to bring your kids in with you as needed.  Once everything settles your kids will be happier with being able to see you more often",
   "created_utc": 1701186771,
   "score": 127,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb566nc",
   "message": "Having read the OP, please please run a credit report on yourself on somewhere like credit karma - if anything looks remotely off pull an official report. Hopefully he never screwed with your credit but my biodad fucked up my bio mothers on the way out the door.",
   "created_utc": 1701193544,
   "score": 55,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5hzc4",
   "message": "I was in your position, only, I was the offending spouse. I ran up high credit card debt, refinanced it with a loan, and ran them up again. When I confessed my situation to my CPA wife, it was the last straw in our relationship. Not only did we get divorced, but I also filed for bankruptcy. There were numerous psychological and fiscal reasons I did what I did, but I’m in a much better place now. I don’t fault my ex-wife. In fact, we remain really good friends and coparent very well. It took all this to “shock” me back to reality and make major changes in my life. \n\nMy ex did what she needed to do and is definitely not an AH.",
   "created_utc": 1701197754,
   "score": 100,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5g0ci",
   "message": "Glad to hear you got out and stook up for both yourself and your children OP! We are exactly the same age I'm so happy to read that someone else made the opposite choices I did and saved themselves. \n\nI read the original post and it happened after I got married too. They worked and from the looks of it had an amazing work ethic. Moved in together and everything just halted and they refused to work, put everything on me and we ended up homeless TWICE. \n\nThe worst of it was our lights getting shut off, figuring out we owed over $1700 on the electric bill my ex fought to have put in her name and she switched to paperless without confirming her email so she \"never got the bills\" therefore never paid them. \nI sat in the dark in the middle of winter for almost 2 WEEKS, had no access to heat or hot water, and had to drain EVERY penny of mine I could find, and my friend (now my current bf) gave me the rest which was like $600. \nMy ex said she had nothing and somehow didn't get paid and just packed up and went to her Mom's house. I have no family anymore for various reasons (including marrying them) so I couldn't do the same even though I'm the one that's always worked from home (meaning I couldn't work for almost 2 weeks). Luckily got the money back when my job had me apply for an emergency charity fund, so I could still pay rent and other bills and not get evicted a third time. I \"made too much money\" for any state assistance programs. \n\nTurns out she had $500 saved up she just didn't want to spend because she was seeing someone else in another state and was saving up for a plane ticket to go visit and didn't want to have to start over and delay her trip. 🙃\n\nFinancial abuse is serious, OP. It's been almost 2 years and I'm still around 6K in debt, and my credit score is still trash after paying over 2K of it. Be proud you didn't let yourself or your kids get to these points. This is a super important decision you made for your life and you should hug yourself every time you begin to doubt you're doing the right thing. \n\nAmazing job, OP!",
   "created_utc": 1701197049,
   "score": 33,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb54szk",
   "message": "So happy you’re leaving that draining relationship!! It should’ve been 50/50 from the beginning. When you divorce him make sure all the marital debt is split between both of you 😁 you’ll get a little if not most of your money back! Good luck!",
   "created_utc": 1701193060,
   "score": 41,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb573mw",
   "message": "Im so happy for you. Please also get counseling for yourself.  It really helps to talk it out.",
   "created_utc": 1701193867,
   "score": 18,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5aq3c",
   "message": "Good for you. You sound like the type person who will get on your feet and do well. Wishing you all the best.",
   "created_utc": 1701195160,
   "score": 10,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb508i1",
   "message": "Good for you",
   "created_utc": 1701191428,
   "score": 8,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb61fs6",
   "message": "\\\u0026gt; He asked that we stay friends and I'm okay with that because my children still want to call him, and I don't mind that.  \n\n\nI am sorry but no. you should not. at least not in the near future. co-parent. bring the kids for playdates, whatever. But not friends. That has an emotional component to it and can  lead to trouble down the line when there is a new partner. because you'll never have properly seperated from each other.",
   "created_utc": 1701204576,
   "score": 8,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5g5es",
   "message": "Hey, thanks for the update. I think you did the right thing, but I'm sorry you had to experience this sadness. It is no fun being with a partner that won't contribute $$ towards the family's bills. I wish you best of luck in the future.",
   "created_utc": 1701197099,
   "score": 7,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb58pon",
   "message": "No don’t stay friends cut him off it’s just a way for him to get back with you. How about you move with your mom and let him deal with the house you did mention it was under his name. You know he’s not going to help you with any bills.",
   "created_utc": 1701194435,
   "score": 14,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5z3ho",
   "message": "What has he been spending his money on all this time? He should have a nest egg the size of the GDP of a small nation by now since he doesn't pay bills. Sigh. Anyway not your problem, OP. You did well to give him the boot. Hope you have a wonderful Holiday season with your kiddos.\n\n\u0026gt;he did go to be with his mom until he can put money away for him and his daughter to get their own place",
   "created_utc": 1701203766,
   "score": 5,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6jy9z",
   "message": "I didn’t see the original post until now, but OP — I am just dying of curiosity: What the hell was he doing with his money?\n\nHe pays for nothing, including the wedding, can’t contribute anything he makes to expenses, but a house that he agrees to YOU buying (?) — so what was he doing with his money since you basically paid for his living expenses? What was the reason he must have stated, even if just an excuse?\n\nGood for you OP. You did good.\nWhat a… LEECH!",
   "created_utc": 1701211127,
   "score": 5,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6r95c",
   "message": "My question is where the fuck all his money is going if you're paying most of that stuff? Honestly at this point he should have more than enough saved for a house. Unless he's got a spending problem somewhere else.",
   "created_utc": 1701213994,
   "score": 4,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5hldp",
   "message": "It's sad when people need to get a divorce. Financial problems usually are at the heart of it. I hope everything works out for you.",
   "created_utc": 1701197613,
   "score": 3,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5zjs3",
   "message": "You are an amazing mom I wish you all the best!",
   "created_utc": 1701203921,
   "score": 3,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb60190",
   "message": "I read you OP first. I'm glad you left him. That's awful! I wish you and your family good fortune.",
   "created_utc": 1701204088,
   "score": 3,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb62x5b",
   "message": "Yessss 💜 we love a glow up. Proud of you for doing what you needed to",
   "created_utc": 1701205087,
   "score": 3,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb64w59",
   "message": "I am glad you are feeling decent about the outcome. Don't give him anymore money.",
   "created_utc": 1701205779,
   "score": 3,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6edzm",
   "message": "Info: did you find out where all their money is going?",
   "created_utc": 1701209091,
   "score": 3,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb4wrk3",
   "message": "Where's original post?",
   "created_utc": 1701190171,
   "score": 7,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5mxfn",
   "message": "im proud of you. shit happens. we make mistakes. we fall in love with people who dont have our best interest. it happens. dont hold it against yourself. you did the right thing, youre fixing things up, youve got your whole life ahead of you. you did good",
   "created_utc": 1701199503,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5tj8r",
   "message": "Question: did you pay the mortgage on the house?",
   "created_utc": 1701201823,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5x0t4",
   "message": "Good on you, OP.  Reading your first post, there were so many red flags, im really glad to see a positive update.  good luck!!",
   "created_utc": 1701203046,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5y0vc",
   "message": "You made the right decision!\n\nAlso, I'm loving the sad judgemental guys who's posts are automatically collapsed. They're saying yta but didn't read everything, obviously. \n\nKeep trying, guys! You'll get it one day! I believe in you! 😂",
   "created_utc": 1701203395,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb638mt",
   "message": "Just hoping the best for you. I'm so sorry things went like this, but with time, it'll get better, stay strong.",
   "created_utc": 1701205198,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb67ujc",
   "message": "Good luck",
   "created_utc": 1701206808,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb68v02",
   "message": "My question is how they planned on affording a mortgage, bills, most likely cars and 3 kids on that low of income in the first place. Especially at almost 30, poor life choices all around imo.",
   "created_utc": 1701207163,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6bu36",
   "message": "I read your first post. I'm glad you're trying to better your life for you and your family. Your spouse sucks for being a shitty partner. He's not invested at all in you or your future together. He's just riding along on your coattails while you do all the work. Fuck that. You must put you and your kids before someone treating you like a door mat.  Your story leaves a lot out. Was he always like this? Did yall not talk about your future at all before you got married? \nGood luck. You're on the right track! \nDon't listen to those quoting vows and other crap like that. No matter what your vows were, nowhere in them does it say to treat you the way he's been treating you. You only have one life. You'll find a partner that has the same life goals and values as you. Make sure you always protect your financial assets.",
   "created_utc": 1701208205,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5sy7r",
   "message": "Omg the sad man comments here. Women are over having man children to raise. There are plenty of men around, for those who are into men, who are willing to financially contribute to family without reminders and a spouse-mommy. Why stick with someone who is not yet ready to leave parent home? Jeez. You made a good decision, OP.",
   "created_utc": 1701201616,
   "score": 2,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6kn96",
   "message": "ESH, because I skimmed your first post, and you and he both clearly don’t understand what marriage is. You were still acting like a newly dating couple with how you kept your affairs so separated.",
   "created_utc": 1701211390,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb66h6l",
   "message": "Why do people get married? Marriage vows seem so frivolous now. \"Richer or poorer\" \"sickness and in health\" \"death do you part\" Why not just enter into a contact with negotiable terms, like a prenup. No one takes marriage vows seriously anymore.",
   "created_utc": 1701206333,
   "score": 0,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6eg7n",
   "message": " He never answered me and just got upset. To the point where he even threatened to take out his penis to show me he was a man. My MIL had to calm him down.",
   "created_utc": 1701209113,
   "score": 0,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb75fcx",
   "message": "It's really interesting you didn't consider him in your post. Tells me all I need to know. Let this man into the wild, you don't love him.",
   "created_utc": 1701219764,
   "score": 0,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5xj1b",
   "message": "Idk the story but if you divorced him cause something out of his control caused financial trouble (like prices of everything fluctuating etc) YTA. If it was something he caused (such as racking up debt for no good reason, excessive spending) NTA.",
   "created_utc": 1701203222,
   "score": 254,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb4ovjc",
   "message": "[removed]",
   "created_utc": 1701187228,
   "score": 240,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb66p45",
   "message": "That's the main reason people get divorced. But I guess Vows mean nothing to people.. Richer and for poorer till DEATH do you part...My wife has spent us into oblivion, yet I'm not going anywhere... Ahh well to each their own... Good luck...",
   "created_utc": 1701206410,
   "score": 255,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5wf8o",
   "message": "Yeah I remember this. I definitely think that you are. When people get married they take vows to be there for each other through thick and thin. For Better or For Worse for richer or for poorer. And well I feel you did need to make some changes in the relationship I feel like you're setting a horrible example that finances should come before family love Etc.\n\nWhy is it that you couldn't have talked to your employer about the situation previously and been able to bring them in for child care then. So many things could have been done differently. But it really just sounded like you were looking for a reason to leave in my opinion",
   "created_utc": 1701202838,
   "score": 249,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb4n26q",
   "message": "What if he divorces you over spelling issues?",
   "created_utc": 1701186547,
   "score": 193,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5pdo9",
   "message": "For richer or for poorer. YTA",
   "created_utc": 1701200362,
   "score": 238,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5qkjy",
   "message": "This is why men aren't getting married anymore. YTA.",
   "created_utc": 1701200783,
   "score": 237,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb5lffn",
   "message": "So much for, for richer or poorer. YTAH",
   "created_utc": 1701198983,
   "score": 238,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6g3bi",
   "message": "OP, I’m very happy with your update.  While I don’t have the same concerns you do (children), I’m experiencing a little of the same.  The fear one feels with financial insecurity is mountainous.  It’s overwhelming, where you can barely think of anything else.  I’m very glad to read you’re in a better place.  Now you can breathe.",
   "created_utc": 1701209704,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6ojbt",
   "message": "You're a great mom.",
   "created_utc": 1701212899,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6x7j7",
   "message": "“ let’s be friends”… sure, you can be friendly… But when you were figuring out your finances or parenting, don’t assume he’s going to be friendly. Don’t be friendly if he wants money. Don’t be friendly when he wants you to take his parenting time but he never makes it up.\nBe firm but friendly.",
   "created_utc": 1701216419,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6xneb",
   "message": "He moved in with his mom to save money? Where is all the money he’s already saved? I’m telling you this guy is hiding something, he’s spent his money on something else, gambling? Secret gf?",
   "created_utc": 1701216600,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb6y7fu",
   "message": "What was the original post?",
   "created_utc": 1701216827,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb71k1p",
   "message": "Thank you and I’m so happy things are working out for you.  You are an inspiration to others in your shoes.  Congratulations 🎉",
   "created_utc": 1701218184,
   "score": 1,
   "submission_id": "185z20a"
  },
  {
   "comment_id": "kb799y5",
   "message": "You made the right decision here, hon. The leopard doesn't change his shorts, but even if he did do a complete 180, how could you ever trust a man who was so willing to exploit you? I'm glad things are looking up for you and your children.\n\nAs for staying friends, that's more than I could manage, but there's really no need for anyone to judge you on that. If you feel that's what's best for you and your children, that's fine. But do NOT, under NO circumstances EVER, help him financially. Because if you do, he WILL take advantage of you again, whatever he promises. He may try to scrounge off you by playing on your sympathies for his daughter. Do NOT give in on that. Whatever sob story about not being able to afford new shoes for her or whatnot he comes up with, you need to stay firm here.\n\nAll the best!",
   "created_utc": 1701221321,
   "score": 1,
   "submission_id": "185z20a"
  }
 ]
}