{
 "submission_id": "1860tzd",
 "title": "AITAH For Disagreeing With A Gender Double Standard?",
 "selftext": "My girlfriend (26 F) and I  (26 M) were at an amusement park waiting in line for a rollercoaster. The lines are packed and she’s behind me, while a few people are in front of me. Out of nowhere she whispers to me “ switch spots with me”. I ask her why because I don’t get what she’s doing. She says just do it, I’ll tell you later. I ask whats going on and she then pulls me back and stands directly in the spot I was standing.\n\n I ask, “ why did you do that” to which she replies, “ I’ll tell you later”. Eventually the gates open and the last people in front of me get on the ride. She then leans over and whispers, I was asking you to move because I didn’t want you standing behind that little girl. \n\nI instantly get upset about it, because she’s done this before. We’ll be in public, I’ll just be walking beside her or standing beside her and she’ll pull me away from an area because a girl or woman is there. \n\nSo I didn’t speak to her on the ride and was visibly hurt and tearing up because it honestly feels dehumanizing at times. \n\nAfter the ride, I bring it up that she didn’t need to move me out of the way, because I wasn’t that close. She argues that I was too close and I point out the fact that I wasnt even in arms reach of the little girl. She tries to argue that the girl was alone in line, but I point out that her dad was there holding her hand the entire time and talking to her in the line beside us. \n\nEventually I start getting more upset and ask her, “ was I too close because I’m a person or because I’m a guy? Because you switched and stood in the exact same place as I did”. She avoided answering directly for a while but eventually said, “ woman are less intimidating standing behind someone”. Which to me made no difference here because I’m shorter than her and weigh less, so it couldn’t be just physical intimidation. At this point I’m tearing up and just express how I felt really bluntly. I said, “ you must think people see me as a predator, because I don’t get how it’s acceptable for you to do the exact same things that I’m doing, but you start calling me out when its me doing it”. \n\nThe child predator part was SUPER brash, but at the time, I was feeling very  ostracized as she’s done this multiple times in similar situations.\n\nAITA For disagreeing and expressing my thoughts in the way I did?\n\nEdit: past situations weren’t kids, they would just be women in general. Whether its in a crowd, in a line, walking, or on a subway.",
 "created_utc": 1701190838,
 "permalink": "/r/AITAH/comments/1860tzd/aitah_for_disagreeing_with_a_gender_double/",
 "score": 197,
 "url": "https://www.reddit.com/r/AITAH/comments/1860tzd/aitah_for_disagreeing_with_a_gender_double/",
 "comments": []
}