{
 "submission_id": "18606d7",
 "title": "AITA my mother just passed away",
 "selftext": "So, my mother just passed away. She had set up a trust. In that trust I was beneficiary to all personal property. Since she passed over a holiday, the trust did not secure the property and change the locks. (My sister somehow acquired a key the night before she passed, as my mother never wanted her to have one) Not even 6 hours after, my sister entered the property and cleared out the house, only leaving the washer and dryer, and dust. Now, originally I had planned to go down to go through everything. Take most of the sentimental items and then give all the furniture, clothing, jewelry, etc to my sister. (She is not the sentimental type, and would most likely sell anything of value anyway)Now though, knowing how she handled the situation the trust wants to go after her and get everything back, and they also want to get law enforcement involved. There’s history here, where my sister has done stuff like this before. Stolen large amount of money (six figures) from a dying family member, and that’s only one thing. She has never faced any kind of consequence for her actions. The thing is, the trust will only grow peruse action if I say so. Would I be the asshole if I had the trust go after her? Or should I just let it go. I know the last thing my mom would have wanted was a fight, but she was also so terrified of someone doing exactly what my sister did to her.",
 "created_utc": 1701189152,
 "permalink": "/r/AITAH/comments/18606d7/aita_my_mother_just_passed_away/",
 "score": 17,
 "url": "https://www.reddit.com/r/AITAH/comments/18606d7/aita_my_mother_just_passed_away/",
 "comments": [
  {
   "comment_id": "kb4uyzu",
   "message": "Sounds like a juicy lawsuit to me, I'd also pursue pressing charges.\n\nI'd only be content with making her life into shambles.",
   "created_utc": 1701189508,
   "score": 137,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb4vj08",
   "message": "She broke the law, you will be NTA for pursuing this matter. Not to mention she did all this whilst your mother was dying! I’m sorry for your loss OP",
   "created_utc": 1701189715,
   "score": 182,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb4x15i",
   "message": "NTA\n\nHonor the deceased by getting back what she intended you to have. \n\nHonor a rules-bound society worth living in by ensuring your sisters' acts bring her consequences. \n\nI am so sorry for your loss. How awful you have to deal with this on top of it. Let the trust do the work for you. Take care of yourself.",
   "created_utc": 1701190267,
   "score": 119,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb4uby3",
   "message": "NTA. What’s yours is yours. Get ‘er, tiger!",
   "created_utc": 1701189272,
   "score": 68,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb51hgj",
   "message": "NTA. \n\nI’m kinda - sorta going through a similar situation with my sister‘s passing in April \u0026amp; her live-in GF. \n\nPlease instruct the executor of your mom’s trust to initiate civil and criminal proceedings against your sister.\n\nBad people continue to do bad things because one good person failed to step up and do the right thing.",
   "created_utc": 1701191875,
   "score": 63,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb4x3vu",
   "message": "NTA. When is comes to these things families can get real strange. If you ask once and she says no, then sick the law on her or you will never see the sentimental things you want.",
   "created_utc": 1701190294,
   "score": 20,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb567it",
   "message": "NTA. I'm sorry about your mom. But I'll be even more sorry about you if you're ever in a vulnerable position \u0026amp; your sister comes after you, clearing you out or worse. Things can change in an instant in another 20 years, \u0026amp; she may be your last living relative, given power of attorney for all you know. Life can get real weird.\n\nThink of it as street code. You got hit by a gang of one. Thankfully your gang is more powerful. Now you can send a message never, ever to f with your gang again. \n\nShe is a VULTURE. Sick everyone on her. Her past 6-fig scam may surface with evidence to convict in the process. That the estate wants to bother with it is a great sign.\n\nThe sooner you give the okay, the likelier it is you'll get jewelry, etc. back. Honor your mother's intentions. What sis did is despicable, \u0026amp; you'd never put up with this had a neighbor done it. And I feel your pain. My mother is terrified of someone doing the same to her. And my brother is a shark. This scenario will be mine soon. Please don't let DNA stand in the way \u0026amp; let her deliberately beat your \u0026amp; your mother down like this. Good luck",
   "created_utc": 1701193553,
   "score": 19,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb4vfzy",
   "message": "NTA. That was theft. She stole your stuff and did so deliberately.",
   "created_utc": 1701189683,
   "score": 45,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb52kqh",
   "message": "NTA\n\nYou should have her arrested for theft.  Absolutely, let the trust go after her.\n\nPeople like continue to do these things because nobody wants the hassle of pursuing them.\n\nGo get her!",
   "created_utc": 1701192263,
   "score": 24,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb54jtm",
   "message": "NTA she’s a thief let them Pursue it",
   "created_utc": 1701192972,
   "score": 9,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb50a4v",
   "message": "Go after her",
   "created_utc": 1701191444,
   "score": 8,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb58hnr",
   "message": "NTA.  The trust needs to go after her.",
   "created_utc": 1701194356,
   "score": 8,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6odm6",
   "message": "Legally speaking everyone belongs to the trust, not a person. So the items needed to be inventoried, called, and all calculated. Then, after that, the executor (after paying any debt against the estate, decides what happens to what's left, usually with instructions from the deceased, etc. \n\nIf the trust doesn't pursue legal action, there might not be enough left in the estate to pay the debts, and that causes a whole other world of issue. \n\nLet the trust manage the legal battle. That's their job. \n\nSorry for your loss, and sorry that your sister is a dumpster fire.",
   "created_utc": 1701212836,
   "score": 7,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb563h9",
   "message": "Time for sissy to learn about consequences",
   "created_utc": 1701193513,
   "score": 6,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb58xtx",
   "message": "You should take the advice and report it and go through with the lawsuit.",
   "created_utc": 1701194517,
   "score": 6,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5a17g",
   "message": "Sue and enjoy the results. Money breaks familes.",
   "created_utc": 1701194910,
   "score": 6,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5kpq9",
   "message": "Sadly I've seen this sort of thing play out in my family as well.  There's no easy way out of it, but the best thing to do is to follow the legal advice you've already been given and report it to the authorities.  You would only be the AH if you allowed her to get away with this for a second time.\n\nThis is something that no one should ever have to deal with, especially right after losing a parent.  You have my condolences and good luck",
   "created_utc": 1701198732,
   "score": 7,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5g1nr",
   "message": "Similar story happened to a family member. His dad died from covid at home and some of the family members raided the house of valuables before the body was cold. They apparently even took the watch off his wrist. It enraged him so much, he pursued legal action. He only wanted a few sentimental items but he was so enraged by the behavior, it pushed him over the edge. Do what you have to do. Your sister deserves consequences for her behavior. NTA.",
   "created_utc": 1701197062,
   "score": 5,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5e6ej",
   "message": "NTA honor your mothers wishes. And show your sister that her actions have consequences.",
   "created_utc": 1701196396,
   "score": 4,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5g72c",
   "message": "It'll only encourage her to try it again if you don't.  NTA.  Get the authorities involved immediately.",
   "created_utc": 1701197116,
   "score": 5,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5hbye",
   "message": "I would file a police report immediately.",
   "created_utc": 1701197519,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5jvx6",
   "message": "If she has also done it before, she will do it again.  Protect your family.",
   "created_utc": 1701198438,
   "score": 4,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5tey6",
   "message": "File a robbery report. She isnt authorized to take anything but she did. That is THEFT.",
   "created_utc": 1701201780,
   "score": 4,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5l7a7",
   "message": "Why let her get away with it again? NTA",
   "created_utc": 1701198903,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5ld52",
   "message": "Sounds like theft to me.",
   "created_utc": 1701198960,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5lm60",
   "message": "NTA Go get a trust attorney if you don't already have one.  Go after her and get everything back.  Get the police involved and press charges.",
   "created_utc": 1701199049,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5olq6",
   "message": "NTA. Your sister is a thief and no doubt keeps it up because she's gotten away with it.\n\nTime to stop the cycle.",
   "created_utc": 1701200091,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5sthn",
   "message": "Go after her fuck the bitch have her locked up",
   "created_utc": 1701201572,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5tyu7",
   "message": "NTA. Crucify her. Let the trust go after her (and they should, they dropped the ball and let this happen). Play stupid games, win stupid prizes.",
   "created_utc": 1701201977,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5w4ux",
   "message": "NTA, and yes, get the police involved.",
   "created_utc": 1701202737,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5xen8",
   "message": "NTA absolutely do not let it go, your sister needs to face consequences for her horrid actions. What kind of person burglarizes their dying mother's home?",
   "created_utc": 1701203179,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6dxzl",
   "message": "Something very similar happened to one of my former collegues.  She sent her sister a text giving her a \"heads up\" that the lawyers were filing a police report in case she wanted to return the items she accidentally took.  Sister had a checkered legal past and returned almost everything within the following day and a half.",
   "created_utc": 1701208934,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6v2tw",
   "message": "This kind of behavior is exactly why you were supposed to inherit your mother's things, not your sister. They aren't just things to you, they hold sentimental value for you, not just monetary value. \n\nShe did this to herself. If she cared about your mother, she would have been with her, not clearing out her property.  I'm sorry for your loss and for everything your sister is putting you thru",
   "created_utc": 1701215545,
   "score": 3,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5bcgj",
   "message": "If this is sister’s MO…why ask this question?? when will it ever stop? I’m guessing never since everyone is enabling!!!!",
   "created_utc": 1701195381,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5fkoi",
   "message": "She stole what belongs to you. Press charges and then go NC with her.",
   "created_utc": 1701196894,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5nlen",
   "message": "NTA. you should press charges",
   "created_utc": 1701199736,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5syo5",
   "message": "If you don't, then you will be a massive AH. \n\nShe's banking on you being too pathetic to stand up for what your mother wanted. \n\nPress charges, let her have her last bit of parenting because of the actions she took after her mother's death.",
   "created_utc": 1701201620,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5yoaf",
   "message": "Press charges and let the law handle it.\n\nFinal wishes are sacred.",
   "created_utc": 1701203624,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb62b4u",
   "message": "You should move forward with legal action. Your sister made her decision knowing it was against the law, she can now face the consequences. You would not be the AH if you did this. \n\nYou would be TAH if you didn't.",
   "created_utc": 1701204875,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6404m",
   "message": "Do it. She deserves all the shit. I am very sorry for your loss.",
   "created_utc": 1701205465,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb64gem",
   "message": "Go after your sister. \nThis matters. Get the belongings back and go about it your way and the trusts way. Then, distance yourself from her and move on with your life.",
   "created_utc": 1701205625,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb652wz",
   "message": "Tell the trust to go after your sister. What she did was Despicable. She's a goddamn vulture. Actually she gives vultures a bad name.🙂",
   "created_utc": 1701205844,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb68y7d",
   "message": "Go after her. Absolutely NTA. Allow your mom to rest in peace.",
   "created_utc": 1701207194,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6anx7",
   "message": "*You* aren’t doing anything. She is simply facing the ramifications of her choices and actions. *You* aren’t going after her, your beloved mother’s trust and estate are. If she didn’t want to do the time, she shouldn’t have committed the crime",
   "created_utc": 1701207798,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6boql",
   "message": "\u0026gt;Would I be the asshole if I had the trust go after her?\n\nNTA\n\n\u0026gt;Or should I just let it go. \n\nFuck no.  Do it ASAP before she has a chance to sell off most of it.",
   "created_utc": 1701208154,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6j1hn",
   "message": "Press charges.  Fuck people like your sister.  NTA.",
   "created_utc": 1701210782,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6k4k1",
   "message": "Have the trust go after her\n\n\nI've  never understood why certain family members always have to do things like this. It usually makes the rest of the family hate that member",
   "created_utc": 1701211194,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6ofdv",
   "message": "Don't let your sister abuse your mother further. Light her thieving ass up. Let her experience the full repercussions of her actions. This is not a time for peace, she disturbed the wishes of her dead mother, that's reprehensible. Make her regret her selfishness.",
   "created_utc": 1701212856,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6q7eg",
   "message": "Do it.\n\nYour mother was terrified she'd do this and she did.\n\nNTA, avenge your mother!",
   "created_utc": 1701213569,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6qhfc",
   "message": "NTA your sister is cold hearted and would probably step over your body to get a dollar. Don’t let her get away with it",
   "created_utc": 1701213682,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb73u3z",
   "message": "What is the benefit of letting her get away with it? I mean, how does it help her? (Remember: enabling terrible behavior does not help someone)\n\nYou WNTBAH. Let her suffer consequences for once in her life. Maybe she will finally learn that not everyone is going to roll over and be her victim.",
   "created_utc": 1701219111,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb77635",
   "message": "Do not let this shit go.  Let the trust go after her.  Actions have consequences.",
   "created_utc": 1701220472,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb779wy",
   "message": "Your sister cleaned out your Mom’s belongings before she was even in the ground… Take her to the cleaners! NTA.",
   "created_utc": 1701220514,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb77ggn",
   "message": "I think your sister is terrible. She continues to do things like this because she has had no consequences.  Set the trust on her like a pack of rabid raccoons. There doesn't have to be a fight. Let the trust do the hard work. Actions have consequences.",
   "created_utc": 1701220587,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5kf9k",
   "message": "you can't assume your mom did or did not want a fight... you KNOW she didn't want her possessions absconded with.",
   "created_utc": 1701198630,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5ybg0",
   "message": "I am so very sorry for your loss.  I know you have a million details to take care of, PLEASE be sure to take care of yourself during this trying time.  Sending you healing hugs.",
   "created_utc": 1701203498,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb5zuvk",
   "message": "NTA",
   "created_utc": 1701204027,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb60esc",
   "message": "The Vulture needs to be held accountable. \nNTA...",
   "created_utc": 1701204219,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb617h6",
   "message": "You're NTA and I would probably get law enforcement involved ASAP but if you are really conflincted you can call her tell her she has 24-48 hrs to put EVERYTHING back or you will be letting the law deal with it.",
   "created_utc": 1701204496,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb63att",
   "message": "NTA\n\nI'm so sorry for your loss.\n\nDo your mother the honor of allowing the trust to assure her final wishes are met and that your sister finally has consequences for her horrible actions.",
   "created_utc": 1701205220,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb63me1",
   "message": "Nah, call the cops and tell her your sister robbed the house and owned and was entitled to nothing in it. Or I guess call sister and tell her she either makes everything available and lets you take what you want or you call teh cops on her.\n\n\u0026gt;I know the last thing my mom would have wanted was a fight, but she was also so terrified of someone doing exactly what my sister did to her.\n\nSounds like she did want the fight or she wouldn't have prevented her having a key or making you the sole person responsible. Sister did exactly what your mother didn't want so I wouldn't let her.",
   "created_utc": 1701205331,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb63pj5",
   "message": "NTA, she can return the stuff or face legal consequences.",
   "created_utc": 1701205362,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb65j8e",
   "message": "Of course you're not the AH. I'd go after her just on the principle of it. If she gets away with that, it reinforces to her that it's something she can do later to you or others.",
   "created_utc": 1701206003,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb68a04",
   "message": "Nta. Do it. Otherwise she will always thinks it’s okay to do this. If your mom wanted her to have everything then she would have given it to your sister. But she gave it to you. Have the trust go after her now before the pawns things or “accidentally” loses things. Honestly I think your mom would be more ashamed that your sister acted that way.",
   "created_utc": 1701206959,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb68c60",
   "message": "Call the cops press whatever charges u can, use all the knowledge you have of the last time she did this, get as much as u can back, do everything and anything you can. Your sister needs to face the consequences of her frankly disgusting actions. Do everything you can to take everything from her then smile at her and ask if her greed was worth it? Then go NC and live ur life. I would b full on scorched earth destroying the bitch, get angry, get her charged because she didn’t just take some bits she cleared the place. You reap what u sow. She needs to know ur done, do not let her get away with this and do it now!!!!!!",
   "created_utc": 1701206980,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6b60k",
   "message": "If you are feeling hesitant about getting her into serious trouble,call her and  tell her to return the stuff or there will be dire consequences for her.",
   "created_utc": 1701207975,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6fse7",
   "message": "You sister deserves to reap what she sowed.",
   "created_utc": 1701209593,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6g4uy",
   "message": "I’m so sorry for your loss, and that your sister has not honored your mom’s wishes. Sending hugs and I hope you receive everything you are entitled to.",
   "created_utc": 1701209720,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6jy49",
   "message": "Get her ass. \n\nHow is this even a question",
   "created_utc": 1701211125,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6k32u",
   "message": "So if you knew this was your mom's fear, why are you posting if you'd be the asshole? You already know the answer",
   "created_utc": 1701211178,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6l99q",
   "message": "Call the police and file theft charges against her",
   "created_utc": 1701211627,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6mcia",
   "message": "NTA and let the trust go after her. Actively help them any way you can. What your sister did is amazingly toxic and rude.",
   "created_utc": 1701212046,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6n7yx",
   "message": "NTA.",
   "created_utc": 1701212379,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6nudl",
   "message": "She is depending on the fact that you won’t want a fight and expects to face no consequences. It’s up to you to decide if she deserves to continue treat people like this. I would not. I go after her with everything I could. \n\nNTA",
   "created_utc": 1701212623,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6o15r",
   "message": "NTA, there is a reason your mom left it to you. Have the trust file a complaint and let the law do what it will",
   "created_utc": 1701212698,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6v9i1",
   "message": "NTA",
   "created_utc": 1701215620,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6vwmu",
   "message": "NTA and press charges. Maybe this would be a wake up call for her.",
   "created_utc": 1701215884,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6w57u",
   "message": "NTA\n\nYou should absolutely go after her. She's a thief, plain and simple,and she needs to face consequences.",
   "created_utc": 1701215983,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6wi5e",
   "message": "NTA, go after her. She stole EVERYTHING. She deserves the consequences.",
   "created_utc": 1701216130,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6yk4t",
   "message": "Let the dogs off the leash.",
   "created_utc": 1701216973,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6zjfo",
   "message": "Oh you definitely want to get police involved. Your sister is in soooooo much trouble.Let the trustees do their job. \n\nYour mom made arrangements the way she wanted, let them be honoured. Screw your sister.\n\n\nSorry about your mom.’💕",
   "created_utc": 1701217366,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6zmi9",
   "message": "NTA. I eagerly await the update where she was arrested and some belongings were recovered.",
   "created_utc": 1701217400,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb6znbw",
   "message": "Nta, please go after her she needs to learn what she did was wrong, plus the lawyers are recommending it as well. Press charges as well",
   "created_utc": 1701217410,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb724hg",
   "message": "DO IT!!! \n\nNTA",
   "created_utc": 1701218415,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb734b8",
   "message": "NTA! Thieves deserve every minute of hell they get! Do it!",
   "created_utc": 1701218819,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb74ga3",
   "message": "NTA press charges get your stuff back man it’s all you got left",
   "created_utc": 1701219363,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb74njx",
   "message": "NTA. Definitely press charges.",
   "created_utc": 1701219446,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb757mm",
   "message": "NTA   I would figure out what the Trust has in it - remember though you are in the right here, lawsuits tend to make attorneys wealthy.   Definitely you are not the AH here...but make sure you won't be bankrupted proving that.  I'm so sorry.  Your sister is a nightmare",
   "created_utc": 1701219676,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb77elz",
   "message": "Someone has to step up and do the right thing. She keeps stealing because no one has pressed charges. Press charges and save the next poor relative she has in her radar.",
   "created_utc": 1701220567,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb77h0w",
   "message": "Do it. \n\nAnd I'm so very sorry for your loss, compounded by your sister being dishonest and greedy.",
   "created_utc": 1701220593,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb78lkn",
   "message": "Press charges",
   "created_utc": 1701221042,
   "score": 2,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb78tbp",
   "message": "The trust needs to go ahead and make the decision as the fiduciary, and yes of course it needs to be returned, at the very least. \n\nTell her “return every item removed from the house or we will file a police report”, then give a date she let her know the date (three days time) is firm, there will be no extensions even in the case of an emergency. .",
   "created_utc": 1701221130,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb79s4x",
   "message": "NTA \n\nThis is not what your mom wanted to happen, she set things up the way she did on purpose. Your sister is breaking your mom’s last wishes, you should 100% go after her on it. It’s not ok.",
   "created_utc": 1701221527,
   "score": 1,
   "submission_id": "18606d7"
  },
  {
   "comment_id": "kb79x3x",
   "message": "Take legal action asap",
   "created_utc": 1701221585,
   "score": 1,
   "submission_id": "18606d7"
  }
 ]
}