{
 "submission_id": "1862sn0",
 "title": "AITA For telling my wife she should have listened to me after she got arrested?",
 "selftext": "Me (50M) and my wife (49F) have a 23-year-old daughter. She has a good job and lives in a house in the suburbs. She has been renting a house since she got a job. Our daughter doesn't really tell us about her social or love life; even when we ask, she just gives us vague answers. My wife hates this; she feels like she is entitled to know about our daughter's private life (i.e., her social life, work life, love life, sex life, kinks, et cetera). It turns out that for about 6 months, our daughter has been seeing a 43-year-old man. I don't know if they are dating or friends with benefits. I'm not sure, but my wife found this out when she was helping our daughter move into her house. She had gotten a copy of her key, so when my wife wants, she can go into her house, and she doesn't need to call our daughter to let her know she can just walk in. At first, I didn't know about the key, but when I found out, I was in shock.\r  \n\r  \nMy wife found out about my daughter dating the older guy by secretly following my daughter around to see where she goes and tracking her phone.\r  \n\r  \nShe followed them back to her house, and she demanded to know what was going on. However, my daughter told her to leave; she refused, and my daughter said if she didn't leave, she would call the police. She left, came home, and told me everything. Obviously, I don't want my daughter to date a man who's twenty years older than her. I think it's gross, but I also think that what my wife did was wrong and an invasion of privacy. However, my wife told me that she's her mother, and because she's only 23, our daughter's business is also her business. I told my wife that our daughter is an adult and lives on her own. If she wants to do this, we may not agree with it, but there is nothing we can do. My wife didn't agree and said, \"No, that doesn't mean she can date an older man if she wants.\"\r  \n\r  \nI didn't want to fight with my wife over this, so I just said, \"Okay.\" My wife continued to stalk her and enter her house without asking, and she also stalked and threatened to injure the older man because of this. Because of this, my daughter called the police, and when I told the cops about the situation, they understood it to some extent and gave my wife a warning. They told us what she did was stalking and harassment, and that we needed to leave our daughter alone if she called them again. They would have to arrest my wife. After this, my daughter continued to harass our daughter and her boyfriend. She showed up on her dates at her house.\r  \n\r  \nMy daughter then got a restraining order against her mother. I told my wife she needed to stop; all she was doing was making her want to be with the man even more. I told my wife she was breaking the law and that if she continued this, she might go to jail. She asked me if we should give her an ultimatum. Her idea was to tell her that if she continued to see the man, we would never talk to her again, and she wouldn’t be apart of our family. My wife said our daughter could be part of our family after she broke up with him. I told her this wasn't a good idea because if he is abusive, we shouldn't push her away; we should still keep a line of communication open, and I told her we shouldn't use our parental influence to try and force her into doing what she does or doesn't want to do. After I told my wife that, she said, \"So we should just allow our daughter to do whatever she wants, and we should just accept that?\" I got frustrated, and I just said \"Whatever\" and left.\r  \n\r  \nI texted my daughter, asking her if I could see her. She said okay, and we met for lunch. I asked her why she was seeing a man old enough to be her father, and she told me she was just \"into much older men.\" I tried telling her about the red flags of dating someone older, but she still wanted to do it. I told her that I didn't agree with the relationship, but I would support her and be there for her if she needed it. My daughter said, \"Thank you.\" After that, I told my wife about the meeting with our daughter, and my wife got mad at me for doing that. She said, \"We are supposed to have a united front.\" I told her there was nothing we could do except be there for her, but my wife is still adamant about doing something. I told her our daughter got a restraining order against her. If she keeps this up, she will go to jail. I tried telling her that, and the cops who came by our house tried telling her that, but she still didn't listen.\r  \n\r  \nShe went to my daughter's house and basically broke in and yelled at our daughter, telling her, \"Better end this relationship now. I don't care what you want or what you are into.\" Because of the yelling, one of our neighbors called the police, and my daughter told the cops everything. The cops asked if my daughter wanted to press charges, and she did, so my wife was arrested. She was charged with violating a restraining order, breaking and entering, assault, and harassment. I paid my wife's bail, but she still has a trial.\r  \n\r  \nMy wife claimed that the cops were racist for arresting her (we are a black family). I got frustrated, and I told her no. She was arrested for breaking multiple laws. I told her she should have lied to me and wouldn't be in this situation, but she got mad at me. She told me our daughter disrespected her, and she is tired of the \"disrespect.\" She also said it was wrong of me to tell her it was her fault. Also, I told her that it was a little hypocritical of her to claim she doesn't like our daughter's disrespect, even though she constantly disrespects her parents all the time. For example, when we go to their house to stay there for a holiday or just visit, my wife will yell at them and cuss them out sometimes. She told me that was different because she's in her 40s and our daughter is \"barely in her 20s,\" so our daughter \"has to respect us.\" My wife also got mad at me for telling her it was her fault she got arrested. AITA For telling my wife her getting arrested was her fault? \r  \n\r  \n",
 "created_utc": 1701195765,
 "permalink": "/r/AITAH/comments/1862sn0/aita_for_telling_my_wife_she_should_have_listened/",
 "score": 251,
 "url": "https://www.reddit.com/r/AITAH/comments/1862sn0/aita_for_telling_my_wife_she_should_have_listened/",
 "comments": []
}