{
 "submission_id": "1863wdc",
 "title": "AITIA for calling out father in law for caring about pronouns.",
 "selftext": "So I genuinely need to know if I’m the AH bc people are still mad at ME. \n\nSo on Thanksgiving we were at my wife’s parents. It was me, her, our 2 kids, my wife’s brother, his wife, their kid and my in laws along with mother in law’s two siblings. \n\nIt’s annoying for me to go over there bc they parrot whatever Fox News is saying that season. And ofc this year, pronouns got brought up. My BIL and FIL started complaining that it’s so annoying people care so much. So I chimed in that the only people I ever vocally see complain about pronouns are Republicans, like they’re doing now. \n\nThey said they don’t care about pronouns (right after complaining about pronouns). So I just “oh. Okay. Good to know.” My FIL was a real jackass about it like he is most things. My BIL was trying to keep the peace which I can appreciate. \n\nI made the decision then and there to call my FIL “she” and “her” since he so adamantly said he didn’t care about pronouns. When my MIL asked who wanted what dessert I grabbed the “order” from people in the dining area. When I got to the kitchen I said “\u0026lt;Jim\u0026gt; said she’ll have chocolate pie”. My MIL looked confused but didn’t say anything. I’m pretty sure my FIL heard this but didn’t say anything. \n\nLike an hour later my FIL said something a little out of character so I said “wow, did you ever think you’d hear her say that?” to my brother in law.\n\nWell this really tripped my FIL off. He got upset and said he didn’t know what I was trying to pull but I’m not funny. I just said “my bad I thought you didn’t care about pronouns. Would you prefer I called you ‘him’?”\n\nHe never answered me and just got upset. To the point where he even threatened to take out his penis to show me he was a man. My MIL had to calm him down. It was pretty late so people began heading out soon after but it did get pretty awkward. I did feel a little bad but also I feel that my point was made. I said sorry on my way out but he didn’t respond to it. \n\nMy wife says it’s still awkward talking to her parents on the phone and I do feel bad. So AITA? My wife thinks I was out of line.",
 "created_utc": 1701198505,
 "permalink": "/r/AITAH/comments/1863wdc/aitia_for_calling_out_father_in_law_for_caring/",
 "score": 213,
 "url": "https://www.reddit.com/r/AITAH/comments/1863wdc/aitia_for_calling_out_father_in_law_for_caring/",
 "comments": []
}