{
 "submission_id": "1863x4f",
 "title": "Aitah for telling my boyfriend I will get an abortion if he doesn't drop his mom?",
 "selftext": "I'm (23F) has been withy boyfriend (23M) for 8 months, we were college buddies before but we had feelings for each so we're here now. \n\nYesterday my boyfriend was taking me to see his mother for the first time because we had big news to tell her, I am 5 weeks pregnant with our first child. I know I'm really young to have a child. Ok, I was happy to see his mom because he talked good about her so I was intrigued and meeting her, and if I knew she didn't like me I would have never went there.\n\n\nI remember when I walked in the house she looked at me like I was some different creature from another planet, she looked at me and that she looked at her son like he did something wrong. I ignored it because it was not my place to act out in someone else house so I kept it respectful, she already made dinner and I was hungry. When my boyfriend was going to make a plate for me she grabbed the plate and said\" I don't want that negro eating my food, get her out this house\" she said it in Spanish, I was hurt when I heard this because it's crazy how so many people are racist. I understood Spanish but I never told my boyfriend I knew Spanish because I like to be nosey and hear what people were saying.\n\nWhen she said that I acted like nothing happened, my boyfriend said we can share a plate and not to be greedy or anything but I wanted my own plate but it was fine. He could tell I was upset and took me in the bathroom to talk to me, I told him that I heard what his mom said and he didn't defend me. He said that she doesn't see black people like that so it isn't normal to me and I swear I wanted to punch him in the face because why is he so dumb.\n\nBefore I stormed out the bathroom I told him that I will get an abortion if he doesn't correct his mother behavior because I'm not going to have my child around a racist grandmother to traumatize her because black people go through enough. I also threatened to breakup with him but he's acting like a baby, he's definitely a Mama's boys. Aitah?\n\n\n\n\n\nEdited: hi everyone I'm not really going to make another poster update so I'm just going to edit on the original post, I have decided that I will be getting abortion pills from planned Parenthood because I really think I'm not ready to be a single mother as if you left alone and even if I'm far away from my ex-boyfriend mother grandparents still have the authority to our kids even if you had any. And I'm not mentally ill because I thought of abortion, not everyone is pro-life not everyone approach and then it's perfectly fine but no one should ever be ashamed about it because of their choice but I understand everyone's opinions is different and every once emotions are different as well but I do appreciate all the advice that I'm getting from everyone thank you so much!. And by the way if all the pro-lifers think they can try to make me not give you abortion and try to insult me it's not going to work because that's what you guys always do you guys should have insult women for getting abortion because you don't believe in it no one cares if you don't believe in it if you don't believe in it get over it you're acting like it's your issue get over it, you guys love to throw insults when you guys don't get your way but you guys are the ones that don't even adopt kids so let women get abortions if they want to and if not stop being miserable and get a life go touch your grass.",
 "created_utc": 1701198556,
 "permalink": "/r/AITAH/comments/1863x4f/aitah_for_telling_my_boyfriend_i_will_get_an/",
 "score": 105,
 "url": "https://www.reddit.com/r/AITAH/comments/1863x4f/aitah_for_telling_my_boyfriend_i_will_get_an/",
 "comments": []
}