{
 "submission_id": "1866s0g",
 "title": "Aita for telling my friend “that’s not rape”",
 "selftext": "ETA: \n- I’m adding the TW flairs because some kind redditors message me that this post might be triggering for some survivors. \n\n- For anyone who says this is fake. I understand your suspicion, there are like a thousand Liz’s stories in Reddit. \nBut personally I think if we assume every post are fake, what is the point of logging in Reddit? \nJust give people benefit of the doubt and if you don’t like something, keep scrolling instead of message me some weird funny insults. \n\n\nI’m sorry in advance if the post is confusing and hard to understand. English isn’t my native language and I’m on phone so the format may be off. \n\nYesterday I (28F) hung out with my friends to discuss the birthday party of Emily (30F). She wanted to have the party at a nice restaurant in town so she talked about making reservation, the food and decoration..etc. \n\nWhen Emily told us about the restaurant, Chloe (28F) said: “I will never set foot in that shit place. I was raped there. Do not have your silly party there”. \nTo be honest, we were stunned and felt so … guilty. It felt like we made Chloe remember a terrible trauma. Emily apologized profusely and said she didn’t know. \n\nChloe told us that 2 years ago, when she was eating in the restaurant, a “big scary-looking man” came up up to her and asked for her social media as a way to contact her. She refused and said jokingly “I only give my phone number or my social to a guy who buy me something, like this meal for example”\nThe man made a snarky comment “So you say I can buy you? Are you a sex worker?” then walked away. \n\nAnd that …all, that’s all her story. Chloe said she felt so violated. \n\nI told Chloe : “That man was rude and mean af, no excuse for him. I understand you was traumatized by his remark but that is not rape” \n\nChloe snapped and called me “not a girl’s girl”, “an Andrew Tate’s bitch”  then she left.\n\nOur friends took my side but after the ordeal, I somehow feel like maybe I was harsh, and maybe for Chloe that was indeed rape.\n\nBut I just thought it was really not sexual abuse. It was a verbal assault, and it was bad but can we call that an extremely terrible criminal action as rape? \n\nI’m torn and I need Reddit honest opinion here. AITA?\n",
 "created_utc": 1701205729,
 "permalink": "/r/AITAH/comments/1866s0g/aita_for_telling_my_friend_thats_not_rape/",
 "score": 145,
 "url": "https://www.reddit.com/r/AITAH/comments/1866s0g/aita_for_telling_my_friend_thats_not_rape/",
 "comments": []
}