{
 "submission_id": "186764g",
 "title": "AITAH for telling my parents that I don't want to babysit my little sister while they come down to Vegas?",
 "selftext": "I (18F) am about to hit my year mark of living in Vegas with my sister (32F) and her boyfriend (32M). Yesterday my step mom(40+ I believe)who I call my mom, and my dad (52(?)) reached out to me if I wanted to come down to where they live during Christmas and New Year's, I told them no because I didn't want to deal with the flooded airports and I already visited for my sister's birthday and Halloween in October.\n\nThat one trip was awful, I slept on a bed that made me sore down to my bone, they had nearly zero food, and the whole time they practically treated me like I was there to be a babysitter not there to visit as their daughter. So I told them no, and then they moved on and brought up them planning to come down to Vegas with their 3rd grade daughter and asked if I could watch her for them. I told them no, because they were asking me to watch her in a hotel room and not my place, and that I'm no longer their free babysitter.\n\nI've always been a free babysitter for them, even when we went to a theme park I only got to go on one ride that I didn't want to go on, my dad did. Then afterwords I was forced to watch my sister go on rides that she could go on, I just wanted to go on one ride and I couldn't even do that and it ruined nearly the whole experience for me because I couldn't enjoy myself (this was when I was 16).\n\nWhen I said no and continued to tell them no my step mom still asked again with \"we would like her to have the experience\" and I told her \"no, I'm not in a position to watch your child, and even if I was I would have to talk to the other people who live here as well.\" who my father still hasn't apologized to for ruining my sister's boyfriend's birthday (I went out with them with permission from my parents and he still came and tried to crash the party and take me away early when I told him I'd be back by a certain time anyway. When I wouldn't leave with them they called the cops and my birth mom who he was and is divorced to and caused a whole s**t show that made the whole party get kicked out.)\n\nMy step mom then tried to guilt trip me with \"if watching her a time or two is such an issue I can ask my mom to watch her.\" So I told her \"That's not the issue, the issue is Vegas is NOT kid friendly, it's one of the highest s*x trafficking states in America, and with the fact she's blonde, blue eyed, and freckled she'd be extremely targeted and I'm concerned on why you're even bringing her in the first place. I still have to watch my back and how can I watch my back if I have to watch hers.\"\n\nHer reaction was \"It wouldn't be a whole day it would be maybe an hour.\" Which I knew was a lie because it's my dad, he has zero sense of time and when he says an hour he means 6. I straight up told her \"No, because she's a kid you can't go into casinos with her and that's why you're asking me but that's not my problem, I didn't decide to have the kid. Having a kid means not having all the freedoms you used to have, and that's the issue because I have no car or money, I have no way to go out and do stuff with her.\"\n\nI told her I talked to my sister and me and her came up with the idea since she doesn't want them to see where we live and since my dad still hasn't apologized for what he did for years (the birthday was not the first time he called cops for no reason and he still refuses to apologize) that they would like to sit down and have a dinner with them first, get to know them, let him apologize, and if that works then we can come and pick my sister up, bring her to my place while they go out, and then bring her back whenever they wanted. Which they said no to which I know for a fact is only because I brought up my older sister.\n\nTheir reply to that was \"well we don't want to put your little sister through all that, I'm sorry it's such an issue.\" And I haven't replied. They haven't messaged me either so I'm just wondering AITAH? I have people telling me I'm not but I'm not convinced.\n\nEDIT: Tysm everybody for the advice, I do have a tendency to try and explain myself to not feel guilty on things like this. As for the sex trafficking, I wasn't trying to use it as an excuse I was trying to bring it up as more.of something to seriously think about because it's a very serious thing. Thank you all so much for reading. ❤️",
 "created_utc": 1701206633,
 "permalink": "/r/AITAH/comments/186764g/aitah_for_telling_my_parents_that_i_dont_want_to/",
 "score": 154,
 "url": "https://www.reddit.com/r/AITAH/comments/186764g/aitah_for_telling_my_parents_that_i_dont_want_to/",
 "comments": []
}