{
 "submission_id": "186dzhc",
 "title": "AITAH for being upset about my husbands sexual fantasy?",
 "selftext": "Just to get to the point my (34f) husband (28m) were chatting and the subject about our sexual fantasies came up. I was very hesitant to tell him mine but he insisted. I told him my fantasy was to have a threesome with me and two bisexual men. Even before I met him I’ve always had this fantasy. I’ve had the opportunities to act upon them but never had the courage. My husband seemed put off but said it would never happen. He’s Muslim and though he doesn’t mind the gay community it’s not his cup of tea. I’m sure you get it. \n\nI then m asked him his fantasy, which he replied he doesn’t really have one. We left it at that. \n\nToday the subject came up again, I joked with him and said he thinks different of me because of my weird fantasy. He then says to me he does have a fantasy and it’s to film him fucking his uncles wife. I was like wow. I was really upset. I’m unsure why I feel this way. \n\nI haven’t been ignoring him but he knows I’m upset. He apologized and said he’d never bring it up again but it’s too late.  I feel like if the opportunity presented itself he’d do it since it’s someone he knows. I know it’s a fantasy but like am I wrong? I just feel put off. It’s like me having a fantasy of fucking my sisters husband. I’m sure he’d be upset. \n\nCan anyone help me out here and just change my mind? Thanks.",
 "created_utc": 1701223900,
 "permalink": "/r/AITAH/comments/186dzhc/aitah_for_being_upset_about_my_husbands_sexual/",
 "score": 61,
 "url": "https://www.reddit.com/r/AITAH/comments/186dzhc/aitah_for_being_upset_about_my_husbands_sexual/",
 "comments": [
  {
   "comment_id": "kb7vwrw",
   "message": "That's enough reddit for now.",
   "created_utc": 1701230982,
   "score": 196,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8yorg",
   "message": "I would unlink your socials from your Reddit account before posting stuff like this",
   "created_utc": 1701257540,
   "score": 143,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7k4t9",
   "message": "Ahhhh yes, as Confucius once said “thee who goes to bed with itchy asshole, wakes up with smelly finger”. Wait, I might be in the wrong sub. Best of luck to you and your husband and his future cousin/son",
   "created_utc": 1701225789,
   "score": 23,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7h64c",
   "message": "Never, ever, ever ask questions you might not want the answers to. I know he started it but now no one is happy. Including us on this post.",
   "created_utc": 1701224565,
   "score": 16,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9bnal",
   "message": "Is his uncle bisexual? Y’all might kill two birds with one stone.",
   "created_utc": 1701264881,
   "score": 104,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7utlb",
   "message": "If either of you makes it to /sluttyconfessions, will you alert us ?",
   "created_utc": 1701230463,
   "score": 131,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8ico0",
   "message": "Well this is gonna make Christmas awkward",
   "created_utc": 1701244559,
   "score": 47,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7r9b7",
   "message": "Am I the only one that thinks the husband came up with this scenario to get under her skin? I mean he was obviously not happy with her fantasy, probably way more than he said because he asked the question in the first place.  I know there's a lot of assumptions in this, but don't we all want to be part of our partner's fantasies at some level, well he can NEVER be in that fantasy...and she can't be a part of his.... both are messed up now and no one is happy.",
   "created_utc": 1701228834,
   "score": 157,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9a1em",
   "message": "Wife - I explained a general fantasy\n\nHusband - I want to fuck a specific person.",
   "created_utc": 1701264093,
   "score": 70,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb85mnw",
   "message": "Personally I think there is a world of difference between saying for instance, I'd like to have an experience with two women to see how that feels and how it works and hey honey, I really want a threesome with your sister and that hot bridesmaid, you know the third one along, brunette, from our wedding.\n\nThe former is like wow, I wonder what that experience would be like and the second is just yeah, I really want to fuck your sister and that friend... I guess yeah in a threesome so it's a 'fantasty'.\n\nHusband here wants to fuck his uncles wife, it's that simple, then he wants to film it so he can jerk to it for life... because of how much he likes her.",
   "created_utc": 1701236086,
   "score": 217,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb802px",
   "message": "Of all the fantasies he could come up with he chose the “Dig my own grave” fantasy 😂\n\nI have questions but I don’t think I want the answers. \n\n-Why is fucking his uncles wife a fantasy to him? -Does he hate his uncle and that’s a revenge fantasy? \n-Is it so he can use the video to blackmail his uncle later? \n-Does he just lust for his uncles wife? \n-Or Is that a random thought that just popped into his mind when you asked him the question?",
   "created_utc": 1701233078,
   "score": 138,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7yldz",
   "message": "Fuck that question, playing with live ammo.",
   "created_utc": 1701232312,
   "score": 174,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7so8s",
   "message": "That real specific to be honest, what did his uncle do to him?",
   "created_utc": 1701229473,
   "score": 75,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9ztwy",
   "message": "to all the people who think the OP is TA for asking her spouse about sexual fantasies... do y'all fuck like...ever?",
   "created_utc": 1701274704,
   "score": 22,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8zjp6",
   "message": "This just reminds me to never play this game with my gf",
   "created_utc": 1701258119,
   "score": 16,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8r3ba",
   "message": "Shut your fucking face Uncle-Wife fuuuucker🎶",
   "created_utc": 1701251688,
   "score": 13,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb95vjb",
   "message": "What the hell is wrong with you two? Are you masochists? You just invent things to mess  up the relationship? Why ask questions if you can’t handle a truthful answer ? You both need professional help",
   "created_utc": 1701261936,
   "score": 25,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8pskv",
   "message": "Is there any way we could build a cover around this post like the one they installed over the reactor at Chernobyl?",
   "created_utc": 1701250617,
   "score": 10,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7vgor",
   "message": "Dude wants to fuck his aunt. I think you're understandably upset that your husband wants to fuck his aunt. NTA and gl at future family reunions, I'm going to bleach my eyes now.",
   "created_utc": 1701230768,
   "score": 132,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7od9i",
   "message": "UM, no you’re NTA. \n\nThere’s a huge difference between “oh, this scenario would be hot” and “I want to fuck this specific person” \n\nNot to mention the fact that the person is HIS AUNT??? Like potentially the mother of his cousin? \n\nAnyway, that’s enough internet for today.",
   "created_utc": 1701227564,
   "score": 19,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9ap8r",
   "message": "It's less about the husband having a fantasy and more about it being so specific. OP just said her and 2 bisexual men. The husband said \"my uncle's wife\". There's a difference between fantasizing about someone random and fantasizing about someone you actually know, too.\n\nYeah. These conversations rarely go well.",
   "created_utc": 1701264420,
   "score": 7,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7o3mk",
   "message": "That's because you have a vague fantasy that involves him. He wants a certain person. That's not the same.",
   "created_utc": 1701227449,
   "score": 174,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8ybqk",
   "message": "Between this and nut-eater dude, I think I’ve had enough Reddit for a year",
   "created_utc": 1701257287,
   "score": 7,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb95crf",
   "message": "Never reveal a fantasy the other can't be a part of.\n\nThis is the unspoken rule of no kink shaming.\n\nThe other unspoken rules are no children or animals",
   "created_utc": 1701261648,
   "score": 5,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9cyza",
   "message": "ESH. You for asking a stupid question and him for answering your stupid question honestly.",
   "created_utc": 1701265505,
   "score": 5,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9fqh4",
   "message": "Nah uno reverse that shit would have said oh I dream about you filming your uncle fucking me all the time how odd.",
   "created_utc": 1701266765,
   "score": 5,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9h5ve",
   "message": "The glaring difference is your fantasy didn’t include someone you know.  His is a desire not a fantasy.",
   "created_utc": 1701267397,
   "score": 10,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7zn3j",
   "message": "Yours is a hypothetical. \n\nHis is about a real person that you both know. \n\nThat's the difference. That's why you're upset.",
   "created_utc": 1701232851,
   "score": 41,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8j1os",
   "message": "Why the fuck are you guys asking these questions if you clearly are not comfortable enough to hear the answers?",
   "created_utc": 1701245099,
   "score": 10,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb95k7i",
   "message": "This is a wild ride.\n\nYou want to be gang banged.\n\nHe wants to bang his aunt.\n\nI mean, you could ask the uncle to join in and you can pretty much compromise on the third dick and everyone would be happy I guess?",
   "created_utc": 1701261762,
   "score": 11,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9j0r1",
   "message": "I think you both discovered that you're not the type of people who can talk about these things without getting upset. Lol.",
   "created_utc": 1701268194,
   "score": 9,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7x4id",
   "message": "NTA\n\n\u0026gt; He then says to me he does have a fantasy and it’s to film him fucking his uncles wife. I was like wow. I was really upset. I’m unsure why I feel this way.\n\nBecause his is a specific person.  Yours is a general idea.  \n\nThat's the difference.",
   "created_utc": 1701231572,
   "score": 40,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8u7yz",
   "message": "Guess I'm not sure what's going on here, so I'll go with ESH\n\nBoth of you seem uncomfortable with the others fantasy. Maybe try pegging each other?",
   "created_utc": 1701254224,
   "score": 10,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8836d",
   "message": "Don't... don't ask questions you don't want the answer to. You both just asked questions you guys didn't want to know the answer to and now are upset that you guys have the answer.  \n\n\nBut why would he tell you it's about a family member, like.... wtf. At least he doesn't KNOW the guys you could have had the opportunity with. But now you have to act like everything is alright whenever you see this poor woman. Also Why do I feel like he'd totally jump at the chance if opportunity presented itself???",
   "created_utc": 1701237508,
   "score": 9,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7ppw3",
   "message": "The fact that he is Muslim may put his feelings about you with two bisexual men just about in line with your feeling about him wanting to sleep with his Aunt. Depending on how not his cup of tea gay men are. \n\nI think you should try not to overanalyze this. Just decide if you want to be with him. If the answer is yes, write it off as a fantasy and let it go. Sometimes people fantasize about inappropriate people, you can't always help being attracted. If the answer is no,  then his fantasy doesn't matter all that much because you should be looking at leaving.",
   "created_utc": 1701228149,
   "score": 42,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb87jds",
   "message": "It sounds like you love your husband and you’re in a good place in your marriage if you are talking about fantasy.  I would give him the benefit of the doubt.\n\nWhat was his tone like when he shared the details?  I feel like tone would help understand the intent of what he shared.\n\nIs your husband a good communicator?  I wonder if he is having a hard time communicating (or understanding) what he really wants.  There’s the chance that due to his religion, there is a lot of internal shame when it comes to sex. \n\nIt was very specific and him not wanting to share maybe indicates he doesn’t understand himself.\n\nCan you take an objective approach and probe more?  I’d be curious as to what about that scenario he finds appealing. \n\nWho’s filming him in this fantasy?  Could it be more about doing something he isn’t supposed and potentially getting caught. Or having an audience.\n\nIs it about having power over his uncle or taking something from another man?  Does his aunt dress or do something drastically different from you?  Maybe it isn’t about the specific person but the contrast or the peer dynamics.\n\nIt’s worth trying to understand the root of the fantasy, it would probably make both of you feel better.",
   "created_utc": 1701237177,
   "score": 4,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8qxg2",
   "message": "Yeah they are both taboo but it diverges in that his fantasy is specifically about someone you know. If you had said your fantasy was getting fucked by your cousin Steve and best friend from college it would be analogous.",
   "created_utc": 1701251553,
   "score": 4,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb8xx6f",
   "message": "A classic case of don’t ask, don’t tell.",
   "created_utc": 1701257003,
   "score": 3,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9cavs",
   "message": "Thats way too specific. Just saying.",
   "created_utc": 1701265190,
   "score": 4,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9iggo",
   "message": "So you have a cheating fantasy and so does he. You’re mad at him for the same shit you fantasize over?",
   "created_utc": 1701267950,
   "score": 3,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9jit4",
   "message": "Marriage is a compromise. I think the only solution is to have the threesome with him and his Uncle (which would make them bi) and let him have sex with his aunt (eww) while you hold the camera. I should have been a marriage counselor",
   "created_utc": 1701268408,
   "score": 4,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb9juai",
   "message": "Compromise. Arrange an orgy with 2 bisexual men and the uncle’s wife. Uncle can film it.",
   "created_utc": 1701268545,
   "score": 3,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kbaknd4",
   "message": "This is similar to when my friend told me he and his girlfriend had a conversation about each other's free pass if they had one.  She said Brad Pitt and he said the girl living across the hall...",
   "created_utc": 1701282047,
   "score": 3,
   "submission_id": "186dzhc"
  },
  {
   "comment_id": "kb7yrlj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "186dzhc"
  }
 ]
}