{
 "submission_id": "186gxso",
 "title": "AITAH? My husband recorded a video of me falling down to post it online so I haven’t spoken to him in 3 weeks.",
 "selftext": "So, I want to start by saying that English isn’t my first language so if there are any mistakes, that’s the reason why, and I also want to know if I’m overreacting. \n\n\r  \nOk, as the title says this happened 3 weeks ago, on Monday, as usual, I (29M) woke up at 6 am to go to work, I was taking a shower and everything was ok but as I stepped out of the shower I fell down, I touched the floor and it was greasy so my husband (32M)  came out of our room with a camera recording everything and laughing out loud, I wanted an explanation and he said it was just a prank, he had spread butter on the floor for me to fall down because his brilliant friends thought it was a great idea to play pranks on their spouses to post them online and “go viral”, (one of the idi\\*ts even push his pregnant wife into a pool).\n\nThus, I was speechless, I was kind of in shock I felt insecure and vulnerable, I was thinking “C’mon you´re supposed to have my back not to make fun of me” so I didn’t argue, I didn’t say anything I just left for work, he even told me (before leaving) “You might angry now but I promise I will compensate you tonight”.\n\nThroughout the day, I started analyzing the event and I found it childish, disrespectful and blatantly STUP\\*D, I mean thanks heavens, nothing terrible happened but what if I hadn’t grabbed the curtain  and my head or neck had hit on the bathtub, I could be dead and I’m not joking, a severe head injury can be life threatening, I would never risk his integrity like that, because he is my husband, I respect him and I love him, he is usually very wise and smart but this time he acted like a fcking teenager. So that day I didn’t feel like seeing my husband then I went to my dad’s  to cool down but I haven’t got home in three weeks, because I’m still angry at him (I asked my dad to go and pack my things, at first my husband didn’t want to let him in but he ended up allowing it) I haven’t even answered his calls and I’m seriously reconsidering our relationship, we’ve married for three years, he is caring and loving and had never done something as irresponsible and stup\\*d like this. \n\nHe has been bombarding my phone with apology messages and begging me to be back but I don’t know, tbh I don’t look at him the same way I did before. \n\nSo now, everyone (but my dad) is telling me that “it’s time to forgive, because he didn’t do it with the intention of hurting me and perhaps he didn’t see beyond consequences and didn’t think it could be life threatening, that I’m overreacting because it’s a just “a prank”,  but this isn’t some 6 years old child who doesn’t see beyond the prank, this guy is a doctor, he knows what a head injury could mean, So, I don’t know guys, am I really overreacting? because everyone seems to agree that I am, even my mom does.  Yeah, I know that he might not have done it hoping I would die, but it is so disrespectful and there was a change it could be life threatening. \n\n\r  \nA friend of mine recommended this space to get some unbiased opinions. \r  \n\r  \n",
 "created_utc": 1701232381,
 "permalink": "/r/AITAH/comments/186gxso/aitah_my_husband_recorded_a_video_of_me_falling/",
 "score": 242,
 "url": "https://www.reddit.com/r/AITAH/comments/186gxso/aitah_my_husband_recorded_a_video_of_me_falling/",
 "comments": []
}