{
 "submission_id": "186kx08",
 "title": "AITA for screaming at my brother that he’s the useless vegetable not my husband?",
 "selftext": "I’m sorry this is long, tldr at end\n\nMy (32F) husband ‘Keith’ (33M) got hit by a drunk driver about 10 months ago and he’s now paralyzed from the hips down. We have two daughters (5F and 2F). \n\nIt’s been really hard on him and he struggles with depression. Luckily he works at a desk job so he doesn’t have to worry about his employment, but it’s really affected him in other ways. He can’t play with our girls the way he used to. They still love him to bits but he feels guilty. He also can’t enjoy many of his old hobbies. \n\nWe got him a good therapist and he’s improving everyday with my and all our friend’s support. He’s had bad issues with his family in the past so we don’t communicate with them. He’s gotten along with my family very well up until now. \n\nI have an older brother ‘Adam’ (35M) who is also paralyzed in a wheelchair. He was driving drunk when he was 21 and crashed. He dropped out of college and now lives a very isolated life with our parents. He spends most of his time playing video games. \n\nHe does a bit of online work every now and again but is mostly unemployed. Sometimes I wish our parents would encourage him to go out more and make some new friends, but I know I’ll never fully understand what he’s going through so I don’t comment. I didn’t want to make him feel worse.\n\nIn the past few months my husband and I have been visiting my parents a few times a week for dinner. He’s feeling better now and they only live a couple blocks down the road. Plus they love to see the girls. My brother joins us only occasionally. Over the past few dinners he’s been present at he keeps making weird and rude comments. \n\nIt started about a month and a half ago when Keith made a comment about how he’s thinking of returning to our local gym to work out his arms. Adam said something about how maybe I should just buy some at-home weights for him because people will mock him in the public gym. It got awkward and my mom quickly changed the subject. \n\nAt the next dinner Keith talked about how his friends organized a little fishing trip with him at a nearby lake in a few months. Adam chuckled and said he hoped he had fun at his pity-party. I was gonna tell him how rude that was but my dad shushed me and quickly asked our daughter something. \n\nAdam’s comments have been increasing over the past few weeks and have become unbearable. We’ve even been going to their house less and less. I’ve snapped a him a few times only to get a pathetic half-assed apology. My parents keep saying Keith’s accident has brought up a lot of old feelings for Adam and he doesn’t truly mean what he says. They kept saying they’ll pull him aside one night and tell him to stop. \n\nIt all came to a head a couple days ago. We hadn’t been going over quite as often, but my older daughter had a ballet recital and we went to my parent’s house afterwards for dinner. Keith was telling her how proud he was but Adam cut in. He said that it’s a shame the handicapped seats in the auditorium were in the very front because she must’ve been embarrassed. Keith sternly asked him what he meant and he went on to talk about how he’s happy he got paralyzed young because he didn’t have to worry about embarrassing his kids by being a useless vegetable of a parent. \n\nI got furious and started to scream at Adam about what a bastard he was. Keith has been doing his best to be the greatest father he can be, do well at his job, stay social + happy with his friends and he is goddamn succeeding. Which is more than I can say for Adam. Keith’s accident was not caused by his own mistake, but he has found the strength to continue with life. I know Adam has been through a lot but it was his own stupidity that made him what he is now. He can say whatever he wants, but everyone knows that he is the useless vegetable here, not Keith. \n\nIt got dead silent. Our youngest daughter began to cry. I grabbed up the girls and everything as quick as I physically could and went home. I turned my phone off because I started to get bombarded with texts. The few that I have read are my parents tearing me up for saying such cruel things. They agree Adam was out of line but I had no right to say all those things. Apparently now he won’t eat or come out of his room.\n\nThey’ve banged on my front door a couple times but I haven’t answered. Keith hasn’t wanted to talk about it all that much and I’ve heard him cry a couple times. My daughters are confused. I don’t even know what to feel. I wish that I had just told my brother to shut up and left instead of saying all of those things. I do love Adam but I still get so mad thinking of the awful things he said about my husband. \n\nA few of my closest friends have said that even though Adam was awful he has had a really hard life since his accident. I should’ve just bit my tongue and had my parents deal with him. They suggested I apologize but then tell him how inappropriate and cruel he was. AITA? \n\nTLDR: my husband Keith got into an accident that left him paralyzed, my brother Adam is also paralyzed, he insulted Keith and made a comment about him being a useless vegetable, I snapped and said he’s a useless vegetable, not my husband, he was very hurt and now I’m wondering if I took it too far",
 "created_utc": 1701247430,
 "permalink": "/r/AITAH/comments/186kx08/aita_for_screaming_at_my_brother_that_hes_the/",
 "score": 15,
 "url": "https://www.reddit.com/r/AITAH/comments/186kx08/aita_for_screaming_at_my_brother_that_hes_the/",
 "comments": []
}