{
 "submission_id": "186os28",
 "title": "AITAH for refusing to help out my cousins financially in a dire situation?",
 "selftext": "I (32M) was asked by my grandmother (94F) during Thanksgiving to help assist my cousins financially.  \r  \n\n\nMy Husband (31M) and I are well off financially. As a same-sex couple who do not have kids, nor do we plan to have kids; and do not have many expenses besides our mortgage and cars. Everyone in our family knows this or assumes this as they all know our professions and/or where we live. \n\n\r  \nMy married cousins (33M and 29F) currently have three children; (5M, 3M and a 6month old boy). In the Summer of 2022, July 4th to be exact; we had our first family gathering since the Pandemic. My cousins had mentioned to me in a conversation that they wanted to try for a 3rd child. This is where I told them, they were ridiculous for trying for a 3rd and that he needed to get a vasectomy. Some colorful language was used, and Cousin (29F) got upset and this caused a huge family drama.\r  \n\n\nA little background on the situation. My family (OGs in particular) still practices arranged marriages. Every generation in our clan had a close family marriage as far as the family tree went back. My parents had an arranged marriage (First Cousins; both grandmothers were full blooded sisters). My cousins (the ones mentioned above) are also part of an arranged marriage done by the OGs of the family. They are second cousins; his maternal grandmother and her paternal grandfather are half siblings. His parents (my uncle and aunt were third cousins).\r  \n\n\nBack in 2018-2019 my younger sister had gotten really sick (Lupus) but we did not know at the time. This triggered a series of tests, including genetic tests done by her doctors. She was told she was a carrier of a genetic defect that usually showed up in people who were products of “inbreeding”. Obviously, she told her doctor about our parents and family. All my siblings and a few other cousins were tested for this genetic disease. Out of 11 who tested, 5 came out positive including myself and the sister who had tested previously. One of those cousins who tested with us (29F) is the one mentioned above. She is a carrier.  Both their 5M and 3M are handicapped mentally and physically; especially 5M who cannot walk. \r  \n\n\nThis outburst at the July 4th party has been an ongoing conflict within the family. Tensions have been high among myself and family members who believe I am the asshole after not apologizing after the comment I made back in the Summer 2022. But as adults, we moved on with both parties expressing their opinions on the matter.\r  \n\n\nWell as you all read, my cousins had a 3rd. Doctors say he too is mentally handicapped, but do not know to what extent yet. Cousins do not have the financial means to support their family. The husband works, and the wife stays at home full-time to take care of the kids. (They are also on Govt Assistance) They currently are being evicted from their place and can no longer afford to pay for extra help.\r  \n\n\nBefore my grandmother asked me to help them out financially; I had been going around the Thanksgiving Party telling my family (Siblings, Aunts, Uncles, Cousins, etc…) we had a planned cruise to Alaska, a Vegas trip for my Birthday and London \u0026amp; Paris for two weeks in June. \r  \n\n\nObviously, I declined to help them out; referencing my opinions back in Summer 2022 when I was asked. \r  \n\n\nSome family members are telling me I am being Petty from the family drama and for not helping them out and wasting money; when I can be helping family member who will lose their home. A comment from a few family members is “How come I am giving my Dad $1000 a month to help out with my half-brother (9M) who is Autistic; but will not extend the same help to my cousins who need it more. \r  \n\n\nAs an outside party, does it seem like I am being Spiteful/Petty? \r  \nLet me know. \r  \n",
 "created_utc": 1701262614,
 "permalink": "/r/AITAH/comments/186os28/aitah_for_refusing_to_help_out_my_cousins/",
 "score": 33,
 "url": "https://www.reddit.com/r/AITAH/comments/186os28/aitah_for_refusing_to_help_out_my_cousins/",
 "comments": []
}