{
 "submission_id": "186ovc1",
 "title": "[UPDATE] AITAH for 'outing' my wife's asexuality after she just let her friends gang up on me?",
 "selftext": "tl;dr of the original post though was during therapy wife came to accept she was asexual, didn't want to tell anyone out of embarrassment, made up sex stories about us and let her friends chew me out during a party instead of telling them off because of embarrassment of being ace, and I outed her when I said I was sick of being a punching bag because she was ashamed of her asexuality.\n\nSo I deleted the original post as it got pretty overwhelming. It was crossposted to a few other subreddits. I got a lot of hate in my DMs. It even made it to those Tiktoks where a TTS reads it with Minecraft gameplay in the background...which led to precisely where I am now. It had come across one of her friends' feeds two days ago, who sent it to her, which led to a conversation and a fairly productive few days.\n\nIn the time since, I did apologize for outing her, and she apologized to me for letting it get that far. She ended up telling all her friends, and none of them cared and were entirely supportive. She asked them to apologize to me because it was her who put me in that situation, but only one of them has, and it was a half-hearted one at that (paraphrasing but basically \"yeah, sorry, but maybe it's best if you don't come to gatherings anymore\" sort of thing). We've started back at couple's counselling too. I was happy with where things ended up after the initial conversation but we decided to go back to get everything out and hopefully find a workable way forward. \n\nA few things I wanted to address from comments everywhere:\n\n* Asexuality is real. She's not low libido. She has *no* libido and doesn't feel that urge everyone else does. She believes she never has, but talked herself into thinking it because that's what she felt she was supposed to do. I wasn't paraphrasing, misunderstanding, or putting words in her mouth. This is her description of it.\n* A handful of people said it was entirely my fault for us not having sex and my boundary was harmful to asexual people and childish, so I wanted to clarify: my wife was the one who used the phrasing of 'maintenance sex'. She has made it clear that she has no desire for sex but will do it for me occasionally if I want it. In her words, it's a task she is happy to do to keep me happy, and I'm not comfortable with that. It's more or less a favour - like if I asked her to pick up my dry cleaning. It's not selfish or childish to want a partner to actually want to have sex with you. Otherwise, it's masturbating with someone's body, which I'm not fine with. I'm fine without sex. That part was grossly overinflated in some comments. I was uncomfortable at the lying and being thrown under the bus. I value her for far more than sex anyway. There's more that defines a relationship than sex. \n* Many people pointed out how it was weird friends sit around and talk about their sex lives. I believe so to some degree (these aren't super raunchy conversations anyway) but I see no issue in close friends being open about things like this. It's not a big deal to me personally.\n* A couple people sent me resources on being a partner to someone who is asexual and I want to thank you for that. EDIT: Here's the one I found the most helpful: https://www.davewheitner.com/sexuality/resources-partners-asexuals/\n* In her defence, without me asking (since I wouldn't be comfortable telling her who and who not to be friends with) she has turned down a couple of invites to go out since, and has removed the two main instigators from social media, which is enough for me. \n* Some people were confused on the ages too, everyone is late 20s to mid 30s.\n* I'm not going to divorce her, so you can stop wasting time suggesting that.\n\nSo yeah. Boring update, I know. But everything is fine.\n\ntl;dr: Someone saw a Minecraft video with the original post. Showed my wife. Opened up further discussion. Everything worked out. Will continue working out. We've moved past it.",
 "created_utc": 1701262898,
 "permalink": "/r/AITAH/comments/186ovc1/update_aitah_for_outing_my_wifes_asexuality_after/",
 "score": 87,
 "url": "https://www.reddit.com/r/AITAH/comments/186ovc1/update_aitah_for_outing_my_wifes_asexuality_after/",
 "comments": []
}