{
 "submission_id": "186p4bi",
 "title": "My bf finally told me why he hasn’t proposed",
 "selftext": "PLEASE READ MY UPDATE BELOW before y’all comment about me 😭 \n\n\nMy bf and I have been dating for about 4 years now. We started dating when I was in college. He’s a good partner, my family and friends liked him a lot, but personality wise we do clash a lot. I am more of an extrovert type and was around the party scene a lot more than he is in college. He used to be the type as well but I guess since he’s 3 years older than me he I guess grew out of it and doesn’t want to go out anymore. I don’t even really go out a lot either but since I have a big group there are bdays every month and we like to go to festivals and concerts. So financially we’re not completely the type of 25/26 years olds who are ready to go buy a damn house. \n\nWe live with 3 of my other friends because we wanted to save as much money on rent and bills. Which to me, was not a great idea because living with too many people could be tough and just stressful in general.\n\n I have been friends with our roommates since high school and we all obviously share the same personalities and hobbies of wanting to have fun and go put. \n\n But my bf of 4 years who used to go out a lot has basically has outgrown that phase and thinking a lot more about his health, his finances, and doing better activities that’ll not involve alcohol and going out.\n I on the other hand just graduated last year and got my very first job with decent salary. Obviously I kinda want to enjoy the money I have that I didn’t have back in college. I do still save but I guess not enough and consistently. \n\nLast night we got into a fight because my friends and I are planning our festival trip which he was invited to and he got upset because he didn’t want to hear me on the phone the whole time in the car and I guess just wanted some peace and quiet as we drive home. \n\nWe got into a big argument and the marriage topic came up and his words to me was “I’m not ready to propose to you yet because I’m waiting for you to grow up.”\n\nHe’s not ready to propose to me because he feels that I’m not financially secure, have healthy habits, or think about my future enough. \n\nTo him, I’m just a 26 years old girl who’s still in high school… still wants to party and go to festivals…\n\nAITAH for feeling offended? Or should I be more understanding?\n\n\n\n\n\n//UPDATE//\nHey, I think a lot of you may have misread my post or I guess I didn’t right a proper post. \n\nI did mention that “i don’t even really go out a lot either but since I have a big group there are bdays every month and we like to go to festivals and concerts.”\n\nI guess I didn’t mention how often I go out.\n\nI USED to go out a lot. But that has changed in the past 2 years. However I have a big group of friends, and we celebrate bdays almost every month and enjoy wanting to go to festivals here and there.\n\nThe last festival I went to was in 2021. So technically it’s not like I’m this crazy party girl who goes to festival twice a year and goes clubbing every weekend.\n\nFor the most part, I go have bday dinner with friends then we go either to the bars or go home and drink. \n\nI feel as that he’s not cutting me some slack. Like I said I just graduated college last year and with a decent salary and a full time job. So even if I tried I cannot afford to marry have kids and buy a house at this point and neither is he.\n\nI would love to experience this festival which we both bought VIP tix for to go to next year. Our argument got started because he was annoyed that he had to hear my friends yap about the festival when all we were doing on the phone was plan for hotels accommodations.\n\nAs for the healthy habits part, I guess I was thinking more about wanting to have sweets all the time and complaining about it later on. But I just thought that’s like a normal thing to do. Having sugar cravings and unhealthy habits when it comes to food. It’s not like I’m super overweight either…\n\nAnd I do think about my future I guess just not at the level he’s thinking. I wasn’t expecting him to marry me now. Coz I myself is not ready for that and it would be unfair to rush him.\n\nAll I’m saying is I’m upset he thinks I’m such a party girl when I’m not. I have not set foot at a club in years and the last festival I went to was 2 years ago.\n\nTo me I don’t think it’s fair for him to call me a high schooler and not grown woman. When I did go to college and got myself a job right after LAST YEAR.",
 "created_utc": 1701263673,
 "permalink": "/r/AITAH/comments/186p4bi/my_bf_finally_told_me_why_he_hasnt_proposed/",
 "score": 195,
 "url": "https://www.reddit.com/r/AITAH/comments/186p4bi/my_bf_finally_told_me_why_he_hasnt_proposed/",
 "comments": []
}