{
 "submission_id": "186rnvf",
 "title": "AITAH for not eating my MIL cake?",
 "selftext": "I (24F) went to my MIL(50) birthday the other day and now shes mad at me. My husband was on a bussiness trip so he counldn't make it but everthing was great until cake time. I asked MIL if there was egg in the cake and she said yes. For context I'm not allergic to eggs but I have gotten a sick eating eggs and foods that have eggs in them and I have gotten stomach aches aswell. I told MIL that I think I shouldn't eat it but she got upset and said it was her 50th birthday and it was special. She continued by saying that I wasn't even allergic to eggs and she walked away. I kinda felt bad and I'm thinking of getting a allergic test. But I don't know AITAH?",
 "created_utc": 1701270704,
 "permalink": "/r/AITAH/comments/186rnvf/aitah_for_not_eating_my_mil_cake/",
 "score": 169,
 "url": "https://www.reddit.com/r/AITAH/comments/186rnvf/aitah_for_not_eating_my_mil_cake/",
 "comments": [
  {
   "comment_id": "kb9posp",
   "message": "NTA\n\nPeople who get mad because someone doesn't want to eat something are so pathetic. \n\nNext time, I wouldn't even go to her birthday. Let boyfriend go.",
   "created_utc": 1701270905,
   "score": 79,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9rfw3",
   "message": "NTA. You have a right to refuse food for any reason. However, nausea and vomiting after eating a particular food IS an allergic reaction, so please go see your doctor and get tested for an egg allergy! \n\nMy daughter is allergic to a number of foods, and her typical reaction to exposure ranges from itching and hives on her torso to nausea to vomiting depending on how much she ate.",
   "created_utc": 1701271583,
   "score": 105,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9tqnt",
   "message": "NTA. Egg intolerance, like lactose intolerance or any other food intolerance, may not be an allergy, but it's still a medical condition. If you eat foods that cause gastrointestinal distress, that can lead to a lot of other issues. If your digestive system is constantly inflamed and in distress that can cause a lot of issues. \n\n(I'm lactose intolerant and egg intolerant , so I know your pain).",
   "created_utc": 1701272459,
   "score": 75,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9rqeo",
   "message": "NTA but for her to get mad at you because you didn’t eat something to prevent you from getting sick? She’s been here for 50 years and still somehow doesn’t realize that the world doesn’t revolve around her. If it absolutely ruins her whole year, she’d deserve it.",
   "created_utc": 1701271695,
   "score": 30,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9x96o",
   "message": "NTA.\n\nPlease get tested for allergies, as something else may pop up as well!",
   "created_utc": 1701273761,
   "score": 8,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9y3ed",
   "message": "NTA. You know your body \u0026amp; how it reacts to certain foods. Stand your ground. I have never been tested for an allergy against bananas. Yet I can tell you with certainty that any kind of banana product I eat will give me a stomachache. Whether it is actual bananas, bread or dried chips. The pisser is I really like bananas. But they most definitely don't like me :\\\\",
   "created_utc": 1701274068,
   "score": 8,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbafymh",
   "message": "“My high regard for you doesn’t change just because I don’t eat your cake. I still love you just the same, no matter what I eat. But I’m a little surprised that you don’t value ME very much, since you are insisting I should eat something that will probably make me sick.”",
   "created_utc": 1701280421,
   "score": 7,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9s5uv",
   "message": "NTA\n\nHowever, I would let your husband know what happened. Let him know that you weren't trying to make her feel bad. But the fact that she claimed basically that your allergy is fake is a cause for concern. Maybe he needs to have a talk with her about it, as that attitude wasn't warranted.",
   "created_utc": 1701271857,
   "score": 14,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9vjvc",
   "message": "I’m not particularly fond of any cake. I can’t imagine why anyone would be upset about your not wanting to eat it. You shouldn’t have to get an excuse, if you say thank you but I’d prefer not to have cake there should be no conversation after that.   \nI don’t have an egg allergy but an egg adversion. I grew up on a farm and for awhile we had a15,000 chicken house. Meaning we had had to gather 12-13000 eggs a day, some of them pretty yucky.  No one else has a problem but I won’t eat an egg that looks like an egg. My fiancé knew this and somehow thought making a pasta dish where you break a raw egg over it would be appetizing. I just said no no no. Though my sister did say she knew I loved him when I made him eggs Benedict. I could cook them , not eat them",
   "created_utc": 1701273133,
   "score": 8,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb7x0g",
   "message": "I'd just take a slice and flush it down the toilet. Anything for a quiet life.",
   "created_utc": 1701290471,
   "score": 5,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbajxgm",
   "message": "Sure your MIL wasn't turning 5? \n\nNTA",
   "created_utc": 1701281792,
   "score": 6,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kb9w49o",
   "message": "Back from this woman and her controlling ways. Yu don't have to eat anything you don't want to eat, I never get these people who tantrum about such nonsense. Some day she will have real problems.",
   "created_utc": 1701273341,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba1fhf",
   "message": "NTA. Why would you intentionally make yourself sick just to please someone? Or more importantly why would that person expect you to make yourself I'll just to please them!?! Get the allergy test done, but rest assured you aren't the AH here.",
   "created_utc": 1701275287,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba2h32",
   "message": "You don't have to set yourself on fire to keep anyone else warm, ever. \n\nEggs make you sick. Don't eat them for her or anyone else that dismisses you as a feeling human being.",
   "created_utc": 1701275667,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba449l",
   "message": "\u0026gt; For context I'm not allergic to eggs but I have gotten a sick eating eggs and foods that have eggs in them and I have gotten stomach aches aswell\n\ni think you are allergic to eggs and dairy. best to see the doctor and get retested. Allergies can develop as you get older as well.\n\nNTA btw.",
   "created_utc": 1701276254,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba6g31",
   "message": "NTA.  It shouldn't matter if you don't have a confirmed medical reason (although I agree you should get tested) the fact that you don't want to eat cake should be enough.  It's never rude to decline dessert.",
   "created_utc": 1701277074,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba6jiw",
   "message": "NTA. Nobody should feel obliged to eat something they think will make them feel sick.",
   "created_utc": 1701277108,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba8ac7",
   "message": "NTA .  Allergies or no allergies, you are allowed to say no to not eating cake.",
   "created_utc": 1701277727,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba94ll",
   "message": "Such stupidity.  NTA.",
   "created_utc": 1701278025,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba9zuz",
   "message": "Of course you are! You know that allergies and food intolerances subside on her birthday!  /s in case it’s not clear. You are NTA. Tell her to suck eggs.",
   "created_utc": 1701278334,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbapo77",
   "message": "NTA. You don't have to put food in your mouth you don't wish to eat. I went to my son's wedding last month and totally forgot to get a piece of cake.",
   "created_utc": 1701283930,
   "score": 3,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba5z0e",
   "message": "NTA she could have offered and take no for answer...people don´t eat cake for many reason...and being worried due prior sensitivities is understandable",
   "created_utc": 1701276908,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaa5z0",
   "message": "NTA\n\nBeing worried about what someone else eats or doesn't eat is rude.  End of story.\n\nWe should all pay attention to our own bodies and not worry about someone else.  \n\nBesides if you don't eat the cake then there is more cake for me!!!",
   "created_utc": 1701278394,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbabwsx",
   "message": "NTA \nBut because MIL does not understand,  you just went to your doctor.  \nHi, I'm not a doctor, but I'll gladly give you a consult,  just to make it easier for you. \n\nI'm sad to say, OP, you have an egg intolerance.  \nIt's not as bad as an allergy, but you might as well watch your egg intake anyway.\n\nSo next time MIL is being nasty about, you just talked to 'your doctor' and the verdict was that you have an egg intolerance, and you're good to avoid eggs whenever you feel like it.",
   "created_utc": 1701279007,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbadfgb",
   "message": "NTA. I will never understand adults  throwing a fit when another GROWN A$$ PERSON doesn't want to eat their food. Or any person for that matter. It feels like a great depression thing that has trickled down through Gen X (and some millennials). It's food and everyone has a different preference/allergies. It's not the end of the world to not eat cake, she's just acting like a child. I would have told her to take my piece to the neighbors if she's desperate for someone to eat it 🤷🏻‍♀️",
   "created_utc": 1701279544,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaj3eh",
   "message": "It’s very possible to test negative for allergies to certain foods but still have an extreme reaction to them.",
   "created_utc": 1701281500,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbarb1k",
   "message": "NTA - Who gets upset over whether or not someone eats cake? Tell them to grow the fuck up. 50 years is a long time to be acting like a toddler.",
   "created_utc": 1701284518,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbat8if",
   "message": "Not only did should you not feel bad for not eating the cake, but also you were under no obligation to even give an explanation. NTA",
   "created_utc": 1701285213,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbavrlh",
   "message": "I'm confused. It was MIL's birthday cake and she is upset that you didn't want to eat any? WTF? NTA.",
   "created_utc": 1701286109,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbawcla",
   "message": "50 year old child.  You're NTA. You didn't eat my cake, I'm mad at you.  What is she, 12?  Tell her to get bent and grow up.",
   "created_utc": 1701286317,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb2zrc",
   "message": "Nta! No one has a right to insist what another person eats!! EVER- for whatever reason!!! That was unacceptable of her!",
   "created_utc": 1701288695,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbjc6t",
   "message": "NTA. You have a right to eat or not eat anything.",
   "created_utc": 1701294661,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbp8iv",
   "message": "You just described an intolerance. I have a wheat intolerance that nearly put me in the hospital because it causes me asthma symptoms. Take this seriously and get tested. NTA",
   "created_utc": 1701296885,
   "score": 2,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbam3y4",
   "message": "NTA, what if you just didn’t like cake?  NTA for refusing to eat anything.  But, OP, most cakes rely on eggs to make them light and fluffy.  It’s safe to assume ANY cake has egg in it unless it’s stated outright.  \n\nMIL is probably salty because you made a thing about it too. Not just that you didn’t try it.  You in essence made her feel guilty that you wouldn’t/ couldn’t try any of the cake.  That she did something wrong by not catering to your needs on her birthday.  Next time, unless it’s pointed out to you don’t say anything.  Just don’t have a piece!  If you had taken a plate and pushed it around then thrown it away no one would know any difference.  I have a friend that’s gluten free, she eats the frosting.  \n\nI have vegan kids, I can’t always cater to their needs.  I will usually have something vegan as a dessert on the side if it’s a party or something and usually they will bring it because they know what tastes the best.  \n\n“Sometimes I have problems with egg” is not anyone else’s responsibility to figure out.  You pointed out that you had an issue with the cake.  It was kinda rude honestly.  You know the majority of cakes have eggs.  You can make your own decisions without being rude about it or not.",
   "created_utc": 1701282559,
   "score": 0,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kba8jcl",
   "message": "You seem to be being dramatic about the situation. It doesn't matter if you eat cake or not. Essentially all cake has eggs or egg whites in it, if it doesn't then people go out of their way to say it has no eggs. So it would be safe to assume you don't want to eat any cake anywhere.",
   "created_utc": 1701277816,
   "score": 248,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaabcx",
   "message": "NTA. I have an intolerance to eggs too not an allergy but same as you. I can tolerate egg whites only in a small dose but any baked goods with eggs I can’t tolerate. I get nauseated and a stomach ache. Intolerance to eggs is not uncommon. You may want to also share some data on dairy and egg intolerances. Even a mild intolerance can cause major distress - bloating, stomach cramping, skin issues, headaches, fatigue etc.\n\nI don’t get why people would be upset about not eating cake. But age 50 likely premenopausal hormones.",
   "created_utc": 1701278447,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaadme",
   "message": "Mad about cake? NTA",
   "created_utc": 1701278469,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbackiz",
   "message": "NTA. Allergy tests can be really expensive in the US, especially if you don’t have good insurance. And in my experience (having had at 3 of them), for suspect foods, they generally tell you just to eliminate all sus foods for 6 weeks then add them back in one at a time. Can you do this yourself without spending several hundred bucks? Probably…..",
   "created_utc": 1701279240,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaggl4",
   "message": "oh people are so strange around food/food allergies. it's like no one believes you.  I have the same thing with egg salad.  I can't eat it.  Telling the aunties that egg salad makes you sick later, only gets them offended that you think their kitchen is dirty.  LOL.",
   "created_utc": 1701280578,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbagu61",
   "message": "NTA",
   "created_utc": 1701280711,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbah50o",
   "message": "Nta allergies can dramatically increase with each exposure. Stand your ground. Or you can be social??put a piece on your plate eat a bit of frosting and trash the rest",
   "created_utc": 1701280811,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbajp36",
   "message": "NTA. I’m not allergic to mushrooms or cauliflower but I don’t give a crap who’s birthday or whatever the occasion is I’m not eating something I don’t want to eat. No means no",
   "created_utc": 1701281712,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbako62",
   "message": "MIL cake -- man, that's a phrase",
   "created_utc": 1701282055,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaml38",
   "message": "NTA but she obviously is. Tell her that you are sorry you didn’t eat her birthday cake, but say her birthday would have been ruined if you had started vomiting at the table or in her living room. Make sure she knows that it’s ruder to vomit or even have diarrhea at parties than refuse to eat certain foods. Ask if you should come over, eat eggs and show her the results.",
   "created_utc": 1701282817,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbamypq",
   "message": "NTA - You get to choose what you eat. MIL is acting like a b\\*tch.",
   "created_utc": 1701282953,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbanzdk",
   "message": "*CaKe TiMe*! Love it.\n\nNTA.",
   "created_utc": 1701283324,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaoaqe",
   "message": "Might be too late now that the conflict has already happened, but 'It looks beautiful and I would love to take a piece for later! I want to really enjoy it and I am so full right now I just couldn't!' often works in these situations. No one can argue that you are too full. Well, I mean, they can- but they will look ridiculous.",
   "created_utc": 1701283438,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbasm9c",
   "message": "I would say get tested not to prove it to your MIL but if you have an allergy or intolerance good to confirm it. If any other health issues come up.  People are so petty, she's 50 acting 12.",
   "created_utc": 1701284987,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbasveu",
   "message": "NTA",
   "created_utc": 1701285079,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbatb50",
   "message": "I would've said no simply because I don't like cake. It's pretty pathetic to get mad or upset about something like that. \n\nIf someone offered me something with almonds, bananas, or shitake mushrooms I'd say no because I'm allergic. I wont go into anaphylaxis or die, but they all cause me discomfort when I eat them. Bananas make my mouth and throat numb, almonds make me break out in hives (especially if it's almond oil in shampoos or lotions), and shitake mushrooms give me intense stomach cramps and gas. \n\nIt has nothing to do with the person offering me these foods, and everything to do with the fact I don't like dealing with these issues. \n\nYou're NTA and your MIL needs to grow up.",
   "created_utc": 1701285239,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbatw6y",
   "message": "My mother-in-law is allergic to onions... she's not going to die, but she gets severe stomach upset.  Her son and daughter talk about her \"fake allergy\" all the time and say it's just in her head.  Nothing ruins a party faster than pooping in your pants. nta",
   "created_utc": 1701285444,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbau20k",
   "message": "NTA, make her eat something that doesn't agree with her and see how she feels, birthday or not.",
   "created_utc": 1701285501,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbauu74",
   "message": "NTA.  What a weird thing for her to be mad about.  It means more cake for her!  Maybe she thought you were criticizing her for not picking a cake without eggs?   \n\nAllergies change over people's lives.  If you've noticed a pattern of eating eggs and suffering later I would definitely suggest avoiding eggs.  You only need to confirm with a doctor if having an official diagnosis makes you feel better.",
   "created_utc": 1701285776,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaw6k5",
   "message": "NTA.\n\nYou can refuse any food or drink if you want to. As long as you're civil about it, it's not rude at all. Your MIL seems delightful. You have my sympathy.",
   "created_utc": 1701286257,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbaypjo",
   "message": "NTA. \nI routinely refuse cake, just because I don’t like sweets. \nNo thank you is a perfectly valid sentence.",
   "created_utc": 1701287152,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbazknq",
   "message": "Well NTA for not eating the cake but you are for being 24 and not finding out if you are allergic to eggs. Do you know how many things have eggs in them??? Also unless the cake is vegan then every cake has eggs in it.\n\nNext time take a piece and don’t say anything.",
   "created_utc": 1701287457,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb12hp",
   "message": "You showed up, who the hell cares if you eat the cake.",
   "created_utc": 1701287994,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb14bi",
   "message": "NTA If you don't look out for your health no one else will. But please do get tested. You might learn things that you didn't know and will be helpful going forward. Plus you can wave the doctor's note at anyone trying to guilt trip you.",
   "created_utc": 1701288012,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb1xa7",
   "message": "She’s going to still be 50 whether or not you eat the cake. \nYou don’t need ti prove anything to her. You may or may not be allergic but she doesn’t get to force food on you. \n\nMaybe you’re full, maybe you’re going gluten-free, maybe you don’t like the cake flavor, maybe esting cake is against your religion, maybe you’re on a diet, maybe you just don’t want a slice of cake. Each reason is just as valid as the other. \n\nA gracious host doesn’t force feed guests.",
   "created_utc": 1701288302,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb6c3c",
   "message": "NTA",
   "created_utc": 1701289897,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb6ibl",
   "message": "NTA\n\nIf you see a dish at your MIL’s that would usually to your knowledge contain eggs in some form or fashion don’t bother to ask - just don’t eat it.  \n\nReason I suggest this is at some point your MIL may start lying to you about what has eggs and what doesn’t.  Because after all you aren’t allergic - it just makes you sick so must all be in your head. \n\nSo save yourself the painful effects and just don’t eat it.  \n\nYou might also start making and bringing your own desserts (even meals if you catch her lying).  Poor man’s fruit cake aka eggless milkless cake, no bake cookies, shortbread cookies, etc are all great desserts with zero eggs. \n\nI’ve had ‘intestinal upsets’ from different foods so now I just avoid them.  \n\nTMI WARNING:   for anyone who thinks it’s just a bit of ‘one exit no waiting’ suffice to say nope.  What it feels like when bad is someone trying to drive a truck through your intestinal tract. And then bland foods for several days while things get back to normal.",
   "created_utc": 1701289959,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb85i6",
   "message": "OP, it sounds like you do have an allergy to eggs \u0026amp; what it contains since you keep getting sick from eating anything that has eggs in it.\n\nNTA OP for looking after your stomach problems. \n\nDiscuss this issue with your family doctor for expansive list for allergies \u0026amp; get tested.",
   "created_utc": 1701290557,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb8few",
   "message": "My MIL never eats my cake. Haha! More cake for me, I say. NTA. BTW, the answer is \"No, thank you!\"",
   "created_utc": 1701290658,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb9vyo",
   "message": "My daughter is mildly allergic to both milk and eggs (use to be bad but over time eating little by little and just growing up she can eat them just not in big amounts or just one egg item a day.)… so I say please go get an allergy test cause this sounds like her symptoms a lot. \n\nAlso NTA. People don’t want food for many reasons. I hate eating at others houses because idk how they wash their dishes, if the stove is clean, if they use cast iron, etc. there is a lot that makes it HARD for me to eat. (I believe I have an eating disorder and alot of it is just preference/trauma growing up poor)",
   "created_utc": 1701291184,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbb9zh8",
   "message": "NTA, what a weird thing to get mad about.",
   "created_utc": 1701291220,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbba90l",
   "message": "NTA. I am not allergic to beef but it really upsets my stomach so I stopped eating it. It won’t kill me but why should I, or you, get sick eating something for someone else.",
   "created_utc": 1701291316,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbamsi",
   "message": "My wife is sensitive to eggs.  But it's very mild.  She can eat cake, but not quiche.  And vaccines can be an issue as they are often prepared in an egg based serum.  So she can't have those particular vaccines.",
   "created_utc": 1701291455,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbb2ms",
   "message": "NTA. You should get tested just so you know about your own body. To hell with your MIL. She doesn't get to order or guilt you to eat something you don't want to eat. It doesn't matter if you're allergic or not, she's still being a bitch. What an awful person. Also, she's not a fucking doctor OR a psychic, so she can't just declare that you can't be allergic. \n\nYou're honestly kind of a saint. I might have slapped this bitch.",
   "created_utc": 1701291615,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbb9hg",
   "message": "Ypu ate definitely NTA but Allergic reactions can be deadly.  I strongly suggest you see an Allergist and get a full test done. Because if there isone there is a very good chance there are more. \n\nPlus, you will have something concrete that people can't argue with. An EpiPen.\n\nAnother option may be switching to Organic. It could be something in the feed.\n\nI have Multiple Chemical Sensitivities as well as allergic to Antibiotic except the very very new ones, so need to eat Organic foods, fruit, vegetables, grass fed beef, pork, range free chicken, most processed foods, (skip milk), etc., etc, because of the chemicals pesticides and artificial dyes. Much of the additives in US foods are banned in the UK and European countries, and California is getting in on the banning now, too. Because they already know they are toxic",
   "created_utc": 1701291684,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbcwpw",
   "message": "It doesn't even matter why she declined. Maybe she just doesn't want cake right now.",
   "created_utc": 1701292290,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbd7a7",
   "message": "Whether it is a true allergy or sensitivity, you are def not the AH here, but there is one.",
   "created_utc": 1701292398,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbdxf0",
   "message": "NTA. You are an individual who is allowed to make grown up choices about what is and is not right for you, at any given time. MIL sounds like a petulant pain in the ass. Sorry about that 😞",
   "created_utc": 1701292665,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbe40e",
   "message": "You are fine. Your MIL is making a mountain out of a dust speck. You were THERE to celebrate with her. Not eating the cake is like preferring water to the other drink choices offered. There's no reason to feel badly about it.\n\nYour MIL, on the other hand, sounds more than a little spoiled/entitled.",
   "created_utc": 1701292732,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbelf0",
   "message": "NTA you shouldn't have to eat any item you don't want to eat, for whatever reason.",
   "created_utc": 1701292908,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbgvq4",
   "message": "NTA. Your MIL was being ridiculous. What grown ass adult would be upset by that??",
   "created_utc": 1701293755,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbh584",
   "message": "NTA\n\nYou may have an intolerance rather than at allergy. Allergies are an immune response vs your body just not being able to break it down. Worth talking to a doctor either way. \n\nYour MIL is not ‘special’ enough to make yourself sick for. Let her be mad. You don’t owe her an apology for her irrational behavior.",
   "created_utc": 1701293852,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbhsp0",
   "message": "NTA!  Special diets are there for a very good reason. Please stick to your guns and take care of yourself. (Maybe say you had no desire to get violently sick at her house.) She was being dangerously disrespectful.",
   "created_utc": 1701294092,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbi0vr",
   "message": "\u0026gt;I have gotten a sick eating eggs and foods that have eggs in them and I have gotten stomach aches as well\n\nUh... I'm not sure what you think a food allergy looks like but this is it. You *are* allergic to eggs. Tell mil you were finally tested and it *is* an allergy, that should shut her up. Lots of food allergies just present as the food making you sick or feeling really bad, it's not all anaphylaxis.",
   "created_utc": 1701294176,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbi1n9",
   "message": "I really don’t know how people can get to the age of 50 and be so stupid. Nobody has to eat birthday cake if they don’t want it. The fact that the girlfriend even went to see her mother-in-law on her birthday should have been enough. Apparently the mother-in-law thinks very highly of herself, and God forbid if you don’t eat cake with her.",
   "created_utc": 1701294184,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbilnk",
   "message": "NTA.  People who claim you don't have a serious allergy are buttholes.",
   "created_utc": 1701294391,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbj1ve",
   "message": "I have problems with scallops and peppermint: they both instantly (ok, within 15 minutes) give me horrible headaches. They don’t even creep up, it’s more like someone whacks my head! The headaches might even be technically migraines, I don’t know. I call it an allergy because I don’t know any other word for it. And yes, the peppermint thing makes Christmas a bummer because I love peppermint!\n\nYou are definitely NTA. You shouldn’t be eating anything with egg in It! Some symptoms of egg allergies include stomach pain, nausea, vomiting, or diarrhea, which it sounds like you experience. You very well might be allergic. Even if you are, it doesn’t matter. Eggs don’t agree with you so you should avoid them!\n\nUnfortunately a lot of people disbelieve the actual presence of food allergies. They’ll slip the offending food to the sufferer “just to see”.\n\nIf you could have eaten the cake you would have. I’d eat peppermint, for sure! It’s a pain in the butt (pun intended!) to have an egg allergy, since it’s in so many recipes! \n\nMaybe you should get tested, simply because it gives you a firm backup to be able to say “I’ve tested positive for an egg allergy”. While there continue to be idiots denying allergies, most will accept it. (Saying no thank you should be respected, too, btw.)\n\nYour MIL needs to grow up.",
   "created_utc": 1701294557,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbj73w",
   "message": "NTA:   You don't have to eat anything you don't want to eat.\n\n\n\nI have reactive hypoglycemia and can't eat anything with any kind of sugar.  People get angry all the time when I refuse to eat anything I didn't prepare. Earlier in my life when I was more trusting when people called food \"sugar-free\", I'd lose consciousness and come to with EMTs surrounding me because idiots didn't realize that molasses, honey, agave, fructose, etc are all sugar.  I can experience seizures, coma and death from my medical problem, so I ignore anyone who complains that I'm not eating their food.",
   "created_utc": 1701294611,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbj77j",
   "message": "Is this about eating ass? No? I'm out.",
   "created_utc": 1701294612,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbk6o1",
   "message": "IBS here.. and there are several things I can't eat. If I do, I would be in a fetal position in a corner. NTA. \nMIL = AH",
   "created_utc": 1701294968,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbkeoq",
   "message": "NTA. If eggs make you sick, end of discussion. I can't imagine ever getting mad at someone for not eating my cake. More for me! She's weird to be upset about it. One can celebrate a person's birthday without eating cake!!! Is she controlling in other ways?\n\nThat said, do you realize that you may have  been eating lots of things containing eggs that you didn't know about and that didn't bother you? Cookies, cakes, pancakes, waffles, sweet breads (brioche, banana bread, etc.), many breakfast cereals, batter-fried foods ( like chicken nuggets), ice cream, pudding, mayonaise, some candies with nougat filling, some soups, and egg noodles (most pasta does NOT have egg),.some meatballs and sausages, most cream sauces and some soups.\nIf you can eat these things you're probably fine with cake. Your problem may be with undercooked eggs or just larger amounts if egg.",
   "created_utc": 1701295049,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbblhiv",
   "message": "why the heck does it matter if you eat her cake or not!!!!!!!!!!🙄",
   "created_utc": 1701295448,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbmtda",
   "message": "NTA. You get sick when you eat eggs. You shouldn’t have to literally make yourself sick,which she absolutely pressured you to do, in order to make your MIL feel loved. You showed up when her son couldn’t even be there. That should be enough, because honestly I wouldn’t be going to a party for my MIL without my husband.",
   "created_utc": 1701295954,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbmxnu",
   "message": "NTA for sure! Also, it sounds like you maybe ARE allergic to eggs! Please go see an allergist! ASAP!",
   "created_utc": 1701296000,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbootr",
   "message": "My gosh, why do people care so much about what other people eat? You know what? I can't stand sweet potato casserole with marshmallow topping. My MIL knows this. Does she through a childish temper tantrum over it? No. Hell, she's like \"more for me!\"\n\nBut yes, you probably should get an allergy test done, because that could be why you get sick when eating them or anything they might be in. \n\nNTA and next time just say to her \"but it will be more for you to enjoy!\"",
   "created_utc": 1701296674,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbsomo",
   "message": "NTA. She's kind of old to be acting so childish. Everyone doesn't like cake, there isn't even anything to say beyond \"No thank you\".",
   "created_utc": 1701298225,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbt0ej",
   "message": "NTA. \n\nBetter to err on the safe side, than to eat it and throw up all over her.",
   "created_utc": 1701298349,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbtaht",
   "message": "NTA I don't care who's feelings are hurt, food allergies are no joke.\n\nWhat you are describing are the same symptoms I had and had dismissed as something else, but they increased over time. I talked to my Dr. and he suggested testing in his office. New allergist fresh out of school dismissed \"my throat feels funny\" and 20min later, I had a full-on anaphylactic reaction, had to be given epi-pen and rushed by ambulance to the ER hooked up to machines. Was there a day and half where the idiots kept giving me food trays with more allergens on it. I told them to let me order my own takeaway or release me since I wasn't letting them try to kill me again. (breakfast plate was scrambled eggs and pancakes) Once they reviewed my full \"can't eat\" list and realized they couldn't \"feed\" me they signed me out.",
   "created_utc": 1701298460,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbub3m",
   "message": "Is cake some sexual inuendo?",
   "created_utc": 1701298866,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbvb3f",
   "message": "Sounds like you have allergy. But also it’s weird for anyone to tell you what to eat. NTA",
   "created_utc": 1701299271,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbvhax",
   "message": "Food abuse is rampant. Everyone just finds it normal.",
   "created_utc": 1701299342,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbwbnq",
   "message": "The way this title was worded, I thought you meant eating your MIL ass LOL",
   "created_utc": 1701299689,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbby78s",
   "message": "NTA. Doesn’t matter why you don’t want to eat something. It’s your choice. If they don’t respect that it’s their problem.",
   "created_utc": 1701300473,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbbzqly",
   "message": "NTA  .. MIL would've been pissed if you got sick at her birthday.. MIL is a AH and a piece of work",
   "created_utc": 1701301121,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbc24kb",
   "message": "Nta.",
   "created_utc": 1701302118,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbc3vaf",
   "message": "NTA GEEZ is she 12? You didn’t want an upset stomach! You were still there to celebrate. What a serious jerk she is.  Don’t stress about this and your hubs should have your back. This is so minor. Maybe just limit contact from now on.",
   "created_utc": 1701302849,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbc4rgv",
   "message": "NTA some people don’t understand food intolerances. They think it is like a light switch either on or off - allergic or not. But it’s more like a dimmer. Some people have mild reactions some have severe. I am also sensitive to eggs but it’s more like a threshold- I could have a little bit without much problem but once I have too much watch out!!!",
   "created_utc": 1701303229,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbc5hje",
   "message": "OP you may have an egg allergy. Did you ever get tested?",
   "created_utc": 1701303537,
   "score": 1,
   "submission_id": "186rnvf"
  },
  {
   "comment_id": "kbc7uxz",
   "message": "NTA. Who cares what the occasion is, your MIL doesn’t have the right to force food on you that you don’t want. Nor does she have any right to get pissy about it.",
   "created_utc": 1701304542,
   "score": 1,
   "submission_id": "186rnvf"
  }
 ]
}