{
 "submission_id": "186sosv",
 "title": "AITAH for suing my brother for stealing from me?",
 "selftext": "My brother Dan has always been a thief, couldn't leave my money anywhere he could access it or he would 100% definitely steal it. For our entire childhoods together, Dan regularly stole our father's cash and credit card as young as, like, 7 years old. He never stopped. Our parents are certainly annoyed by his stealing (when THEY are the victims of it) but ultimately, Dan is their beloved little baby who can't do anything wrong and they always give him a pass, no matter how many thousands of dollars he steals.\n\n\u0026amp;#x200B;\n\nI left home at 18 and had very minimal contact with Dan for the past 9 years. I'm 27 now and Dan (who has been living with our parents since I left home) recently showed up at my doorstep saying he's intending to move out on his own but he needs somewhere to live until he finds his own place. Reticently, I said ok, but made it very clear that I would not tolerate ANY thievery. Dan had the gall to act all shocked and offended that I would even DARE imply that his innocent self would EVER steal anything. Ok, whatever, I have security cameras.\n\n\u0026amp;#x200B;\n\nOf course, Dan robbed me blind on day 1 of him being in my house while I was at work. Came home to all my consoles and video games gone, my living room tv gone, half of my electronics gone, only reason my computer and spare tv are still there is because they were in my locked home office. Dan was gone too of course.\n\n\u0026amp;#x200B;\n\nI called the police, reported the robbery and provided them with security footage of Dan doing it. The police said it's a civil issue and they can't help me, so I contacted a lawyer, who think it's a felony and if we bring the case, my brother will be prosecuted, which could lend him in prison. I agreed to go forward with that.\n\n\u0026amp;#x200B;\n\nI called my mother after that, and I told her the truth, that I am going to sue Dan and he will most likely end up in prison, so she should communicate with him the message that if he wants attenuating circumstances, he still has time to return my tv, my ps5, etc. Mom immediately FREAKS OUT and demands that I stop the proceedings because my poor wittle innocent babee of a brother could actually go to prison!!! Could actually face CONSEQUENCES!!!! WE MUST ABSOLUTELY STOP THIS FROM HAPPENING. I told her no, the lawsuit is moving forward regardless, and it's up to Dan to decide how long his prison stay will be in the brief time between then and when he gets arrested.\n\n\u0026amp;#x200B;\n\nAn hour later, Dan is calling me, panicked, and he screams at me \"HOW DARE YOU DO THIS TO ME???!!\" He refuses to return anything, but he willingly admitted to all crimes in his tirade screaming at me, and since I have an app that records all calls, I now have even more evidence for the case. Later, our father calls, same spiel, how dare I attack my poor little brother like that? Then an uncle, a couple cousins, Dan's best friend, all come to me and all agree that I am a bad person and that Dan \"just took some stuff\" which \"is what siblings do to each other\" and that I am wealthy and I can afford all of it, while Dan is broke so really I should have just given it all to him without him needing to rob me.\n\n\u0026amp;#x200B;\n\nThat's where I'm at. AITAH?",
 "created_utc": 1701273356,
 "permalink": "/r/AITAH/comments/186sosv/aitah_for_suing_my_brother_for_stealing_from_me/",
 "score": 254,
 "url": "https://www.reddit.com/r/AITAH/comments/186sosv/aitah_for_suing_my_brother_for_stealing_from_me/",
 "comments": []
}