{
 "submission_id": "186tsgq",
 "title": "AITAH for baking biscuits even though it makes my partner angry?",
 "selftext": "So when I (F30) get stressed, I like to bake biscuits. When I was in university, it was cookies. I’ve always liked to bake when stressed out. I always eat a few too many of them, as I REALLY like them straight out of the oven. Baking helps me relax when I am overwhelmed. My fiancé (M30) gets super annoyed at me every time I suggest I am going to make biscuits. He has gone so far as to take all the boxes away and hide them after I have made a batch. He has different excuses for his anger, including “I just care that you’re getting enough nutrition” (I care about my nutrition as well, and ensure to eat balanced meals throughout the day, as well as walk our dog twice daily, so I am definitely in shape), “I’m sick of eating biscuits as a meal” (I made them to go alongside a large serving of an extravagant salad with peanuts, goat cheese, beets, carrots, chicken, mixed greens, and suggested that if he wanted more protein he could have an additional chicken breast), “I just want you to do something productive” (I both emptied the dishwasher and reloaded it this morning prior to walking the dog), among other things. This morning, I suggested I was going to make biscuits, and he got angry again. He said, “You just do whatever you want anyways. It doesn’t matter what I say, you just do whatever the fuck you want.”\n\nAITAH for baking the biscuits, even though he clearly doesn’t want me to? Money is not an issue here. He also did not grow up in a family that had to pay attention to how much money was spent on food. Whenever I confront him, he can’t quite explain why it makes him so angry. \n\nTL;DR: my fiancé gets mad at me every time I bake biscuits, despite me being in great health and having no financial insecurities",
 "created_utc": 1701276091,
 "permalink": "/r/AITAH/comments/186tsgq/aitah_for_baking_biscuits_even_though_it_makes_my/",
 "score": 153,
 "url": "https://www.reddit.com/r/AITAH/comments/186tsgq/aitah_for_baking_biscuits_even_though_it_makes_my/",
 "comments": []
}