{
 "submission_id": "186ubbi",
 "title": "AITAH for breaking up with my gf when she compared my sister to her dog.",
 "selftext": "I'm 18 M, I have a sister who is 15, she has Cerebral Palsy. She can't walk, can't properly speak and her brain function is lower. She plays with toys that make noise and whenever she crawls anywhere in the house she takes her toys with her. \n\nMy gf had come over so we could prepare for a test together. She had never met my sister before, although I have told her about my family before. I told her that I usually help my sister eat and carry her up and down the stairs etc. She said that it reminds her of her dog for whom she does the same. This really pissed me off and I told her not to compare my sister to her pet. She started saying how her pet was a part of her family. I got really loud and told her we're done, she started crying,  my mom heard us shouting and drove her back home. \n\nAfterwards my parents told me that I shouldn't have shouted, but I don't think I did anything wrong with breaking up, I probably shouldn't have shouted but frankly I don't regret it much as she deserved that.\n\nEdit :  This post is getting too many commmets, I'm just going to stop seeing. I only wrote this post because I had been angry about it the entire day previously. I know I shouldn't have shouted, but that's the only thing I regret having doing. I would have broken up with her anyway after what she said. I've heard the comparison of my sister with a dog so many times, and people saying that don't realize just how offensive it is that it made me heat up too much. Also reddit is weird,  to those saying I shouldn't have shouted I agree,  but to everyone saying that shenwas just trying to relate or how dog is comparable to a humam should know that there are times where they should keep their opinions to themselves and realize how insulting such a comparison can sound. ",
 "created_utc": 1701277368,
 "permalink": "/r/AITAH/comments/186ubbi/aitah_for_breaking_up_with_my_gf_when_she/",
 "score": 239,
 "url": "https://www.reddit.com/r/AITAH/comments/186ubbi/aitah_for_breaking_up_with_my_gf_when_she/",
 "comments": []
}