{
 "submission_id": "186vwgs",
 "title": "AITAH for telling my husband if he fights for custody of his kids I will divorce him?",
 "selftext": "I 27F am vehemently childfree, I am sterilized and have no intention of having or caring for any child. I married my husband, 33M, last year and did not know he had any children until 5 days ago. I travel for work, work for myself, and have amazing pay for very few active working hours (I am a honeymoon planner, owning my own business); we have a joint account for bills and our own separate accounts for savings and fun money.\n\nMy husband sat me down 5 days ago and told me he hadn't been completely honest with me. And revealed he has 2 children 10M and 7F. He pays regular child support, however, it dips into his fun money and he wants to be able to have fun like I am, so he said he would fight for 50/50 custody.\n\nI was furious he had lied to me and was even more angry when he told me he wanted 50/50. He works 12-16 hour shifts as a nurse and that would mean I would have to take care of the children when I'm not working or are working from home. I told him if he fights for custody, I will leave him. We have a prenup, so a divorce will be rather simple; I get 100% of my business, all of my savings and fun money, and the house, as I inherited it from my grandmother.\n\nHe called me an asshole and told me I should step up so that he can have more money in his savings and for fun. And because the kids won't be much hassle due to their ages. So AITA for telling him I will divorce him if he goes through with filing for custody?\n\nEDIT/UPDATE: Thank you all so much for helping me with this situation, I knew his lies were enough of a reason to divorce my, and I'm proud to announce, Soon To Be EX! I just didn't know if divorcing him with kids in the mix would make me an asshole, especially because he works so much. He has since vacated my house. I have spoken to my lawyer and am filing for an annulment! I can because he married me in an act of fraud. The AMA protects me as it was a fraudulent marriage. Thank you all once again!",
 "created_utc": 1701281270,
 "permalink": "/r/AITAH/comments/186vwgs/aitah_for_telling_my_husband_if_he_fights_for/",
 "score": 113,
 "url": "https://www.reddit.com/r/AITAH/comments/186vwgs/aitah_for_telling_my_husband_if_he_fights_for/",
 "comments": [
  {
   "comment_id": "kbak81b",
   "message": "NTA. That’s a pretty fucking big lie of omission. Like … weirdly so. The type of thing which should come up in the first few dates, not the first few years of marriage. You do not know the man you married at all. \n\nHe’s asking for a very drastic change to the life you guys agreed to, so you’re well within your rights to tell him to go fuck off about that bullshit.",
   "created_utc": 1701281897,
   "score": 33,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaj8kb",
   "message": "NTA. He married you under false pretenses and is now looking for a nanny / sugar momma.",
   "created_utc": 1701281551,
   "score": 101,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbak6qk",
   "message": "Wait, he lied to you about having kids, and somehow *you're* the AH according to him? Hell no. That's way too big a thing to tell you about a year after you married. He must suck as a dad since you would have known he was seeing his kids if he was actually seeing them, and now he wants them only so he can have more money to spend? What a gaping AH. Good on you for getting a prenup. Time to exercise it, and exorcise him.",
   "created_utc": 1701281884,
   "score": 173,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbakycr",
   "message": "I’d be divorcing him just over the lie itself, not to mention wanting the secret children in your lives, and his shitty reason behind it. He’s a liar, a bad/absent father, and a manipulative partner. Please divorce him.",
   "created_utc": 1701282154,
   "score": 65,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaj0e2",
   "message": "NTA - a better title would be \"Husband is a fucking liar and I am divorcing him.\"",
   "created_utc": 1701281470,
   "score": 85,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbamxcn",
   "message": "NTA. Listen, this is not only about him lying to you. This is about him wanting 50% custody of kids he hasn’t visited in 3 years, in order to have some fun money. Those are f-ed up values. You should leave him for that.",
   "created_utc": 1701282941,
   "score": 24,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbakl6z",
   "message": "NTA\n\n\"I marry a woman who openly declares that she does not want to have children, so I hide from her that I have two children, what could go wrong?\"\n\nNow is your turn: \"move on and fuck the liar!!!\"",
   "created_utc": 1701282027,
   "score": 54,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaj1rz",
   "message": "NTA at ALL. \n\nIf you wanted kids, you’d have had them already. He probably knew you didn’t want them, and wasn’t upfront about it. He could have chosen to tell you before you married him a year ago, but he didn’t. He said “I do” KNOWING he was being dishonest, and did you a disservice. Imagine what else he could be dishonest about. Leave him.\n\nEdit to add: you COULD also consider an annulment.",
   "created_utc": 1701281484,
   "score": 102,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaktii",
   "message": "NTA. You went into the marriage under the terms that it would be child free. He changed those terms by having two children he failed to disclose to you. \n\nHe also wants to change the terms of your living arrangements by having these kids that presumably, he doesn't have that good a relationship with seeing that you didn't know they existed until five days ago.\n\nFrankly, he sounds like a terrible father. Only wanting custody under the misconception that he'll have more fun money for it. Are the kids going to eat air while they're around? Wash in the river? Sit in their rooms in the dark so they don't run up any household expenses?",
   "created_utc": 1701282107,
   "score": 157,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbal1pj",
   "message": "So, you married a deadbeat dad. Now, so he can pay less childcare. He expects you to be his free childcare? And, he lied and denied the very existence of his children. Divorce him either way.",
   "created_utc": 1701282187,
   "score": 55,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbakyvb",
   "message": "NTA I'm not normally one to go straight to divorce but with a lie of that magnitude I can't see any other option.",
   "created_utc": 1701282158,
   "score": 141,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbalfeu",
   "message": "He thinks having a pair of young kids around half the time would be cheaper than child support?  Only if he's expecting you to financially contribute to their care and support.",
   "created_utc": 1701282320,
   "score": 137,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbak6jd",
   "message": "Nta. Activate your prenup. It’s time to divorce the lying husband. How did he hide his children from you for so long? Were you oblivious?",
   "created_utc": 1701281882,
   "score": 101,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbakxpw",
   "message": "You’d be an asshole to yourself if you stayed married to this liar. Dude tricked you from the beginning, it’s not like some random ex popped up with a secret kid, he actively lied to you every day that you’ve known him.",
   "created_utc": 1701282147,
   "score": 84,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbamgfg",
   "message": "He thought he had it made with you. You make good money, have plenty of free time, don't want kids. You even have a house!\n\nNTA, stick to your guns. He had this planned.",
   "created_utc": 1701282771,
   "score": 91,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbamm2g",
   "message": "NTA\n\nEven if he doesn't fill for custody you should leave\n\n1. He deliberately hide he has kids. That is not \"by the way, I discover 3 days ago that a fling I have got my child\". No he has children, he hide them from you, he hide the child support he was paying. Even if he doesn't have custody, you don't know when life will happen to the mom, and the dad will need to keep the children 100% of the time. Plus how long did you know each other before the wedding ? Even 1 year is a really long time to hide children\n2. He want 50/50 just to pay less child support ?? That is a crap reason to want custody\n3. Convenintly, he work long hours per day, so YOU will take care of his children, and HE wil be able to save money\n4. 10 and 7 yeard-old is not a no-hassle age. You will need to drive them everywhere, they are barely mature enough to do chores, or to take care of themself. No hassle age is 17 years-old, ready to go to college",
   "created_utc": 1701282827,
   "score": 143,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kban93a",
   "message": "He HID his CHILDREN!!!\n\nEwwwwwwww.\n\nNTA.\n\nWhat a damn mess. Those poor kids. He is just using them to meet his needs. Gawd…..what an AH he is.",
   "created_utc": 1701283057,
   "score": 58,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbakvr7",
   "message": "NTA at all.\n\nI'd divorce him for lying.  it's not like a small, little lie.    how long were you together before marriage?     How did you NOT know for godssake?  he had zero visitations the entire time?\n\nwhat a mess.",
   "created_utc": 1701282128,
   "score": 202,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbalr3s",
   "message": "Big red flag. He lied to you about having 2 children?? Sorry but I’d be divorcing his ass. That’s not an accidental oversight, that’s a life long lie he dished to you. Those kids are still young and will require parenting. And he’s telling you that he has kids because his child support cuts into his fun money only? That’s the reason why he’s being honest?? Holy cow",
   "created_utc": 1701282434,
   "score": 48,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaoldv",
   "message": "\u0026gt;I married my husband, 33M, last year and did not know he had any children until 5 days ago.\n\nBro..............\n\n\u0026gt;He called me an asshole and told me I should step up so that he can have more money in his savings and for fun.\n\nMm hmm...\n\nGlad you had a prenup.\n\nNTA",
   "created_utc": 1701283545,
   "score": 38,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaosn3",
   "message": "Woooooooooow.  Someone is the AH here and it ain’t you.  His kids have never been around while you were dating and married?  They didn’t come to the wedding?  Does he not see them?  No judge will give him custody.  But you will have a massive husband problem.",
   "created_utc": 1701283618,
   "score": 46,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbaoc2o",
   "message": "INFO — why are you even considering staying with a deadbeat who only wants his kids in his life so that he will have more “fun money”?",
   "created_utc": 1701283452,
   "score": 71,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbalwbi",
   "message": "Ummmm you need to divorce this asshole regardless! He hid and lied about two whole ass children for how many years… and has been completely absent from their lives this whole time… and the only reason he’s telling you now, AND trying to screw up their home life, is pure selfishness because he wants more fun money! This guy is a reprehensible human.",
   "created_utc": 1701282485,
   "score": 32,
   "submission_id": "186vwgs"
  },
  {
   "comment_id": "kbakpuc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "186vwgs"
  }
 ]
}