{
 "submission_id": "186w1gq",
 "title": "AITAH for disciplining my Autistic employee?",
 "selftext": "I know the title sounds bad, but hear me out before making any assumptions. \n\nI’ve owned and operated a small bakery since 2019. I have cried over it, worked 100 hour weeks for it. Needless to say, my business is my baby. During the pandemic, my business almost went under and I had to make some very difficult decisions to keep it afloat. Over the next two years, my bakery slowly recovered and last September, I was finally able to graduate from a home baker to having an official commercial location. Business has been doing very well this year to the point that I had to hire employees to help with the workload. While I was looking over applications, I noticed one that had a sticky note on it written by the applicant’s( we’ll call him Adam) mother. The note indicated that the applicant had high functioning autism and that was the reason for the gaps in his employment history. Keeping this in mind, nothing on the application caused me any concern and I called him in for an interview. \n\nThe interview went well enough, he did appear a little socially awkward, but he was polite and answered all my questions honestly. We talked about duties he would be comfortable with and we mutually agreed that he would fit in best as a dishwasher. In addition to washing dishes, he would be responsible for washing the floors and the walk- in refrigerator. He agreed to the terms of his employment and he actually seemed excited to start. \n\nFast forward a month. Everything was going well. The new hires had caught on to their responsibilities very quickly and I was happy with their progress. At This time, my husband decided to book a vacation for us( we’ve been married for 5 years and haven’t been away for more than a weekend trip at this point.) I talked my sister into running the bakery for the week I would be gone. She had been my OG sidekick and I felt good leaving my baby in her hands. Our vacation was incredible, I couldn’t remember the last time I wasn’t overwhelmed or worried about the business. I checked in with my sister a couple times a day and all seemed well at home. \n\nUpon my return, I arrived at the bakery early in the morning to do some paperwork before the others arrived. As I walked around the kitchen/prep area, I noticed that usual humming of the walk in fridge was absent. Upon opening the door, the fridge was definitely not working. When I mean not working, it was WARM in the fridge. I called my sister immediately as I began to check the now warm product. She told me that she was unaware of an issue, so I figured that the fridge must have died overnight. When my three little minions arrived for their shifts, I asked them if they had noticed a problem with the fridge. Two said no…. Adam said yes. When I asked him when he noticed, he said he had noticed…. 4 days prior.  My heart sunk as I realized I now had to toss everything in the fridge. The eggs, the cream, everything. \n** Side note: some of you may not think I should have. But Adam had been going in and out of the fridge to get product for prep. Opening and closing the door has allowed any of the cold air to escape and allowed the warm air to enter. Since I am serving food to other people, I was not going to take any risk of serving spoiled food.  \n\nI asked him why he didn’t tell me or my sister as this was an issue that needed to be addressed as soon as possible. He simply shrugged( he obviously wasn’t too bothered about the situation) and said he didn’t think it would be a big deal.  Upset, I sent him home for the day and told him I would need to talk to him the next day. \n\nLater that day, his mother called me and told me that he was very upset about the whole thing and I was blaming him for something anyone could have done because he’s autistic. I told her that, while he is to blame for not notifying someone when he noticed a problem, he would not be losing his job. I did also bring it up to my sister as she should have noticed there was an issue as well and she would have had to enter the fridge to do inventory. \n\nWas I too harsh on Adam?\n\nEdit: I think y’all missed the part that the issue was discussed with my sister. I do put blame on her since she was in charge. She will probably never be asked to run the bakery again. \n\nEdit #2 : since y’all keep asking about the other two employees, they don’t go in the walk in. One of Adam’s responsibilities is to bring product from the big walk in fridge to the smaller prep fridges. So the other two would not have known the fridge was warm. Also, the only reason I noticed the absence of electrical humming was because the bakery was silent. When we have fans going, music playing and other noise, we’re not hearing the fridge. \n\nEdit #3: since reading comment threads seems unpopular, I’ll clarify once again. There is a temp log. There is a thermometer. Both of which are required by law. I usually take care of the temp log. In my absence, the responsibility fell on my sister. For more details on how I dealt with her, see edit #1\n\nEdit #4: too many of you are getting butthurt over the fact that I call my employees minions. It’s a joke we have as we all dressed up as minions for Halloween this year. Stop getting offended over nothing. ",
 "created_utc": 1701281621,
 "permalink": "/r/AITAH/comments/186w1gq/aitah_for_disciplining_my_autistic_employee/",
 "score": 198,
 "url": "https://www.reddit.com/r/AITAH/comments/186w1gq/aitah_for_disciplining_my_autistic_employee/",
 "comments": [
  {
   "comment_id": "kbbre2e",
   "message": "Hi op nta \n\nBut please when dealing with adam be very direct. “If temps get to low I have to throw food away. Cooking with it could make people sick”. Maybe get him involved with taking the temps. My work we take temps three times a day and there’s a book to write the temps in. \n\nWell done with the bakery",
   "created_utc": 1701297723,
   "score": 125,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbf63f",
   "message": "NTA- he is an employe just like anyone else and therefore susceptible to criticism and appropriate punishments just like any other employee would be. \nHowever, he may not have told you about it because it was not explicitly told to him to report such issues. Some people with Autism are very black and white- my job is to do A B and C so I am going to do A B and C no more and no less.",
   "created_utc": 1701293120,
   "score": 240,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbigor",
   "message": "Lesson learned that there should be regular temperature and expiration checks of your product as a part of your kitchen crew's normal kitchen duties.",
   "created_utc": 1701294341,
   "score": 153,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbutlz",
   "message": "As an auty who has learned to function fairly well in society, but who has family that haven't,  I think you may be reading his shrug as \"I don't know/I don't care\" whereas I think it may have been \"I'm freaking out and don't know what I should say/do\"",
   "created_utc": 1701299072,
   "score": 53,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc29nb",
   "message": "Def get an alarm. I had to throw out 1000$’s of dollar in vaccines. Now I get an alert if it is too warm",
   "created_utc": 1701302178,
   "score": 13,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbamomo",
   "message": "NTA. Your employee made a mistake, and got disciplined for it.",
   "created_utc": 1701282853,
   "score": 78,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc0z9l",
   "message": "NTA.  You did not discipline Adam for anything associated with his autism, but rather a performance failure that would apply to any employee in his position.",
   "created_utc": 1701301639,
   "score": 8,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc64w7",
   "message": "I don’t think you’re an AH, but I am the parent of a teen on the spectrum. \n\nHer brain takes things very very literally. If you don’t tell her specifically to do “X,” then X doesn’t get done. She doesn’t have that intuitive knowledge that most people possess. Her mind — and a lot of autistic minds — are just very literal. \n\nTry using an “if / then” statement with him. Example: \n\n“If the fridge is not working, the food will spoil and make people sick. I need you to check the temperature regularly.”\n\nIt also helps to have written instructions in prominent positions. \n\nAutism and sensory processing disorder go hand-in-hand. My daughter has SPD as well so she takes in everything and needs help deciding what “inputs” are important.  You might need to just spell it out a little more clearly. \n\nBut once your employee understands and gets into a routine, he will be so dependable. Because that rigid mindset will help keep his brain on track. \n\nI really appreciate you giving an autistic individual a chance. And it’s very kind of you to reach out to find ways to work with him. You’ll get through these bumps.",
   "created_utc": 1701303811,
   "score": 7,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbaqeq7",
   "message": "\u0026gt; He simply shrugged( he obviously wasn’t too bothered about the situation) and said he didn’t think it would be a big deal. \n\nId be pissed as well.  It should be common knowledge that when the fridge is warm, its cause for alarm and to tell someone.  To feel unbothered and say \"its not a big deal would make me angry and doubt the employee's capabilities.\n\nYou disciplined an employee for his mistake and you did nothing wrong.  NTA",
   "created_utc": 1701284196,
   "score": 116,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbpd8e",
   "message": "Why do you not have a temperature check sheet? Our fridges and freezers have an external thermometer on a probe we record the start, midday and evening temp. This is dated and filed on a monthly sheet.\n\nWe are a small community kitchen, so that is all that is needed. For not much expense I could have had a Bluetooth or wifi setup that would send alerts to my phone. \n\nYour procedures have failed you. Punishing your staff for your lack of food safety documentation is on you",
   "created_utc": 1701296936,
   "score": 39,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbb4d46",
   "message": "NTA. If he did not state having cognitive issues while interviewing he should be held to the same standart as other employees. He noticed a significant issue and deliberately did not report it, it's not fine.",
   "created_utc": 1701289191,
   "score": 66,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbb0zpk",
   "message": "Maybe he thought it was no big deal because your sister the acting manager wasn't doing anything about it? If I notice my manager who is above me ignoring the problem I'm going to assume they are taking care of it.",
   "created_utc": 1701287967,
   "score": 46,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbouvd",
   "message": "How does his mother think he can maintain employment without ever getting feedback?",
   "created_utc": 1701296739,
   "score": 26,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbzk0c",
   "message": "For all you people saying he didn't know because he wasn't told.... I'm autistic and no one had to tell me a warm fridge means it's broken.... like autistic people still have common sense. In fact my autism actually makes me more hyper aware if the walk ins at work weren't the proper temp.... everyone trying to make excuses are just making this guy sound like he has the mental ability of an infant and it's actually really insulting.",
   "created_utc": 1701301044,
   "score": 15,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbp3bo",
   "message": "NTA.\n\nI knew the moment I saw your joking use of \"my little minions\" that it would cue the inevitable whining over your horrible lack of respect for your employees, blah blah blah.\n\nIgnore it. Anyone with sense can see it was a joke and that it doesn't apply to how you actually treat your workers.\n\nAs to disciplining your autistic employee, you were completely right to do so.\n\nIn fact, if you hadn't, you'd be doing him a disservice, because you would have had to fire him otherwise, in case it happened again. Instead, you disciplined him so now he knows he has to be more responsible.\n\nKudos to you.",
   "created_utc": 1701296829,
   "score": 12,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbum34",
   "message": "NTA. It’s really not a complicated issue. Your adult employee noticed an issue and did not report it. You didn’t fire him. His feelings are his own to deal with.",
   "created_utc": 1701298989,
   "score": 8,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbvgh9",
   "message": "NTA. His autism is a reason, not an excuse. This mistake has cost you several hundred dollars (if not thousands) in lost product, not to mention if the freezer was further damaged by not being serviced right away. You were a lot better than I’d be by sending him home and giving yourself time to calm down and evaluate the situation before taking any disciplinary action",
   "created_utc": 1701299332,
   "score": 13,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbnb5y",
   "message": "NTA-Maybe less him being autistic, more never explaining point A to point B logic of warm fridge means spoiled food that will make people sick so make sure its always cold.  \n\nMany years ago we all had training in phishing, business scams, etc. at work. The only one who didnt take this training was our receptionist. Her job didnt require it. The training they made mandatory for the technical staff she wasnt required to have so she didnt. Low and behold, the one SERIOUS incident with a scam was committed by none other than our untrained uninformed receptionist COMPLETELY low tech. \n\nSomeone called, supposedly from payroll, telling her that the database with our social security numbers had been wiped and that they needed EVERYONE's social by the end of the day or there would be no paychecks. \n\nIt would have been simple enough for someone aware of the scams to call payroll directly ask if they had called but alas not her. We only found out she had been targeted when someone found her in the file drawer copying our socials off the HR folders onto a notepad that she would later need to fax to the number the scammers provided her with. \n\nThis could have been REALLY BAD FOR HER and gotten her fired but she honestly didnt have the wherewithal mentally to put two and two together and see that it DID NOT equal five and that none of this made sense. And of course she had no idea that scammers even did this kind of thing.  She was reprimanded and they started including her in more training.  Not sure whether or not it actually helped but at least there werent any more problems arising from her being kept completely in the dark.",
   "created_utc": 1701296143,
   "score": 6,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbsiva",
   "message": "OP, I hope you read this and consider it.\n\nI am a 39F with ASD level 1, which is the mildest form autism according to the DSM-5.  \n\nI live on my own in a house I own and hold down a full-time job.  However, I am still impaired.   While most of my impairments involve interacting socially, I have additional issues that crop up as a result.\n\nSome examples (not all inclusive of symptoms or issues)\n\nI frequently forget to get my mail out of the mailbox for weeks at a time, because there's no specific mail I'm expecting. \n\nFood will literally start molding in my fridge because I forget it's there if I can't easily see it.\n\nI climbed countertops to get to higher cabinets in the kitchen until a few years ago.  Not because I didn't have a stepstool - I used it for reaching the ceiling for cleaning, changing light bulbs, etc.  It was because that's how I'd always done it since childhood, and it simply didn't occur to me that stepstools could also be used to reach cabinets.\n\nI have reminders on my phone for nearly everything,  including to do basic household chores.  I need timers when cooking because I will leave a pot boiling on the stove so long it dries and scalds the pot.\n\nI am the mildest form of autism.\n\nYour employee is \"high-functioning\", but all that means is he is not intellectually disabled. Autism comes with problems with executive function, which is a form of cognitive impairment.  That can affect things like making decisions,  problem solving, and (as seen in my example) applying solutions you've already discovered to other problems. \n\nYou have mentioned common sense multiple times. However,  please know that concept simply doesn't necessarily apply to autistic people.   The concept of common sense is based on the perceptions of neurotypical people.  The brains of autistic people are physically different,  and thus we perceive the world differently. \n\nVague statements like \"notify someone if anything is out of the ordinary\" do not work, because unless an autistic person has been specifically given a range to define \"ordinary\", they may genuinely not notice something is wrong.  Or they may bombard with continuous questions regarding every new change to determine if it is normal or not.  Specific instructions and steps work best.\n\nThe most apt analogy I can think of is this: I feel like most people were born with a user guide built in for functioning in society.   My user guide is hand written and only contains things I've encountered or learned academically.\n\nMy apologies for the wall of text.  \n\nIf you could, please tell that young man that you are not specifically angry at him. Explain exactly why the situation was a problem and tell him how he can improve in this situation.\n\nI don't blame you for being upset, which is why I'm withholding my judgment. I am admittedly biased and that's unfair.\n\nI hope your business continues to flourish.\n\nEdit for typos",
   "created_utc": 1701298163,
   "score": 12,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbngkf",
   "message": "NTA. \n\nI am autistic and my 18 year old daughter is autistic. For her, she needs to be told things like that. She’s what’s called high functioning as well and is extremely black and white. If something breaks she for a long time didn’t say anything because she didn’t understand that I didn’t always know. I had to go over with her “if you find something isn’t working like it was before, you must tell me” or even in school “if your computer isn’t connecting to the wifi you must tell your teacher” otherwise she’d just sit and stim. \n\nSo yes, discipline is okay. But you have to be black and white and explain to him that any time something doesn’t seem right to tell you/whoever is in charge. And for a bit you may be getting lots of little things that don’t matter, but eventually he’ll understand what does matter and what doesn’t, but if he’s like my daughter, he’s going to swing wildly to the other side for the first little while because it’s hard to know the difference at first.",
   "created_utc": 1701296200,
   "score": 8,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc4u1m",
   "message": "NTA- but (big but) autistics have some social and common sense quirks. Those should be minded when explaining his position and the necessary things required in the job. \n\nGo more thoroughly over his duties, make sure that he knows that you’re personally not mad at him and understand his not knowing what to do. \nExplain what things he NEEDS to do, report this, note that. \n\nAllow him to feel like not only is he a part of the team, that he is independently important to you and his work is his and that you respect when he brings things to your attention. (Have him feel that he’s working for himself and is smart enough and important enough to your company to tell you things you might miss (wrong temp). \n\nDon’t be mad at him, be disappointed sure, but he may not know his responsibilities entirely or if he’s allowed to point these things out.",
   "created_utc": 1701303259,
   "score": 3,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbav42v",
   "message": "NTA",
   "created_utc": 1701285874,
   "score": 15,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbivky",
   "message": "NTA",
   "created_utc": 1701294492,
   "score": 6,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbdiwd",
   "message": "What did you explain to Adam about what he's in charge of / responsible for. \n\n\u0026amp;#x200B;\n\nA lot of autistic people take things very literally. If you never mentioned the fridge being something that he needs to be cognizant of then  there is a chance that it never occurred to him that he has any reason to care about it.\n\n\u0026amp;#x200B;\n\nNTA, because he didn't mention his autism or ask for any concessions to be made for it, but that is something that may be important for you to know going forward. \n\n\u0026amp;#x200B;\n\nBut also, if it's not in his job description, it really isn't technically his place to worry about it. It's one of those things that a lot of people would mention, but you didn't specifically require it of him.",
   "created_utc": 1701292515,
   "score": 14,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc98pi",
   "message": "You left your sister in charge, why exactly are you blaming anyone but her?",
   "created_utc": 1701305133,
   "score": 4,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbblwjr",
   "message": "Soft YTA - OP, do you have much experience managing people? I ask because the way you speak of your employees is actually pretty degrading. At the very least, if you talk about them like they’re children (punishment, discipline, little minions) you’re probably treating them that way, too. Treat them like equal adults that you’ve hired to do a job and you might see better results and more of a sense of ownership and responsibility in the future.\n\nI’m going to preface this with Not A Lawyer, but I do have reason to be familiar with employment law.  In most places you can write the employee up in this situation, but you can’t cut his hours. You can also only really write him up if performing this sort of maintenance is part of his official job description. In an at-will state you can fire him, of course, but he’ll get unemployment.\n\nAside from all that, I feel like there should be more of a conversation here. Did you ask specifically if the employee in question spoke to your sister about? I’m wondering if he was ignored? \n\nWhere are your temperature logs (required by health inspectors in most areas)? How on earth did your sister do inventory on a walk-in without noticing that the fridge was warm? Why did you bring in your sister to run the place on your vacation when you could have trained an employee (who is more familiar with your business as it’s currently run and the people involved) to run things while you were away? I would get on training an on-site assistant ASAP.",
   "created_utc": 1701295605,
   "score": 11,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbcajtc",
   "message": "If I'm understanding the timing correctly, only A MONTH after you hired 3 new employees, you took a vacation and put your sister in charge of everything? A month? And I don't recall what kind of punishment you are handing to the autistic employee (Adam?) but THIS WAS YOUR SISTER'S RESPONSIBILITY. Full-stop. She was the manager. I don't care if \"he goes in there all the time.\" He's been there for a month and *his disability* means that remembering to tell someone about the fridge might be something he struggles with. I think you are angry with your sister, exhausted and looking to place the blame on someone easy. YTA",
   "created_utc": 1701305686,
   "score": 5,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbtlk4",
   "message": "So was there just no temperature log for like, 5 days?? What would have happened if a health inspector came while you were gone? Who's job was it to do the temperature log? I don't get it",
   "created_utc": 1701298582,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbwqga",
   "message": "NTA.   \nBut… please educate yourself on the challenges people with ASD face. Just as PoC face daily micro aggressions based on race issues, people with invisible disabilities face constant daily issues that are not visible as a result of their disability. And people with ASD face a HUGE amount of social communication assumptions and bias.   \nHe IS a good employee, but he might not have realised that he needed to tell someone because a) your sister should already have been on top of that, and b) if he’s very fixed / routine in his thinking (an ASD trait of varying challenge in individuals) he might have assumed it was not in his job role to say something. Just explain “Always come and tell a manager when there’s a problem - with machinery, with the sinks or cleaning tasks, or other people.“   \nPeople with ASD face hundreds of micro aggressions a day related to their lack of social grace - I like to think of it as though people with ASD might speak a different dialect or entirely different non verbal communication language. It’s an over simplification to do this, but a quick way to explain - just as you wouldn’t assume a person from another country might understand our idioms or may not make the same hand gestures in the same way.    \nAll young staff need guidance - even a non ASD teenager is highly likely to have said nothing. So long as you didn’t really go off at him that’s fine. Just sit down and be kind and warm again to him. Show him that he will get ‘feedback’ that is fair and reasonable, but that then it’s forgiven and you move on. You will have a loyal, happy and content employee if you can do that. And employees with ASD can be amazingly loyal and easy to manage staff!",
   "created_utc": 1701299857,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc4u9z",
   "message": "Autistic high functioning adult here- I think you were too harsh on him, but here’s why.\n\nHim shrugging does not indicate he didn’t care. In fact he’s the only one of your employees that was up front and honest with you that he did notice. I sincerely doubt your other two employees did not notice. You should also. Unless they have absolutely zero contact with the fridge.  They noticed. In fact all three should have been trained to keep an eye on the temp gauge located outside the fridge and be writing down temps on a sheet located near the door to keep track. \n\nWhen I am faced with realizing I made a big mistake and didn’t think to do something considered “normal” and common sense to neurotypical people , I tend to not have a big outward reaction because it’s on the inside. The fact his mother called to tell you how upset he was should tell you he didn’t “not care.” \n\nHe likely had a passing thought that was like “huh it doesn’t seem as cold in here today” before his brain moved onto something else. Meaning when you asked if anyone noticed a difference - of course he is going to say yes and remember that moment. It does not mean he was absolutely aware something was *wrong with the fridge* it just means once you said that/asked that he remembered briefly thinking something was different before moving on and was honest about it. \n\nI have been in this position so many times when I was younger and had so much blamed on me/was yelled at for things for “not realizing I should have alerted someone” simply for being honest I noticed a slight change but didn’t put together what that change meant.\n\nNow I am neurotic with anxiety and any sort of slight change I immediately go up my supervisors ass. She hates it. But I spent my younger years dealing with someone like you. And I adapted. By turning into an anxiety nightmare.\n\nWhat you should be focused on is why your two neurotypical employees who absolutely noticed - lied and said they didn’t. Then focus on why you were so harsh with the honest employee. \n\nYou are the asshole. big time. Do not hire autistic employees if you are unable to roll with what that means and your first reaction to their honesty is aggressive negativity. \n\nIf your other two employees were trained properly they would have noticed. The only way they could not have noticed is if they have zero interaction with that area their entire shifts for four days. They lied, and as usual the honest autistic got the brunt of it.\n\n\nA high functioning autistic employee can be an *incredible asset* to an employer who knows what they have and pays attention to the strengths and weaknesses of their employees. There is no doubt something he is incredible at doing, that you haven’t picked up on yet because you threw him on dishes and mopping and then expected him to be king of the cooler temps. Do better.\n\nUnless it was in his specific job description or explicitly told to him - he likely had a passing thought that it felt different in there before going back to focusing on HIS JOB. Not “shrugged it off and didn’t care.”\n\nThe employees who lied to your face don’t care.",
   "created_utc": 1701303261,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc9zd2",
   "message": "NTA- Treat the autistic employee and your neglectful sister the same, possibly with different verbiage and/or emphasis.  no matter what the abilities of the employee, they still have to be able to complete assigned tasks and fulfill assigned duties. Sounds like you are being a quite reasonable employer.",
   "created_utc": 1701305447,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbcb8dv",
   "message": "Being autistic is not an excuse. This smacks of his mother never teaching him that if he sees something wrong to say something, instead of leaving it and relying on her to correct or repair anything amiss at home. Source: am spectrum from a family of spectrum NTA",
   "created_utc": 1701305979,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc5u16",
   "message": "This has nothing to do with autism. NTA.",
   "created_utc": 1701303682,
   "score": 4,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc5y1q",
   "message": "You didn't train him to check equipment. This is on you, not him.",
   "created_utc": 1701303729,
   "score": 4,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc88ct",
   "message": "A soft YTA \n\nReading your comments it wasn’t actually his fault it was your sisters. Also that I Don’t Care attitude is often a mask and in my own experience and others most internally freak out especially if it’s serious.\n\nConcerning your sister though since it is her fault and she intentionally lied on the logs have her pay for new ingredients.",
   "created_utc": 1701304700,
   "score": 4,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbcwtu",
   "message": "Things that seem obvious to neurotypical people, aren’t necessarily obvious to neurodivergent people. Autistic people can be very literal so you would need to say to him to let you know if there is a problem with anything in the cafe, and be specific. You’re not an AH for being upset but it probably didn’t occur to him to mention it. My best friend is autistic and there are lots of incidences like this because things that might seem obvious, aren’t obvious to her",
   "created_utc": 1701292291,
   "score": 6,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbhfly",
   "message": "NTA - but in Adam’s defense, it may have just been part of his autism that he just didn’t say anything. My oldest is also high functioning, but if there’s something we need, even if he knows we need it, if I don’t say anything, he doesn’t even think about it. Adam could be the same way. Not making excuses, just trying to shed some light on possibly why he didn’t say anything.",
   "created_utc": 1701293959,
   "score": 3,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc66ri",
   "message": "I’m a mom to an autistic teen. (And most likely autistic as well.)\n\nThe primary description of ASD is that the person struggles to understand interpersonal interactions.\n\nAdam knew what his job was, but he may not have had any clue that he should point out the fridge wasn’t working correctly. He was following his job. He had ZERO idea that he should speak up when he noticed something odd.\n\nI know most would say “he should have spoken up” but this example -failing to fulfill an unspoken expectation that seems obvious to neurotypical people - is EXACTLY an expected reaction from an autistic person. \n\nYour reaction was cruel and ableist. Punitive punishment doesn’t improve anyone’s behavior. It only instills fear. That goes for non-disabled employees as well.\n\nIf Adam is going to stay, I recommend you reach out to local resources (ARC or your state’s dept of vocational resources) to see if there are resources on how to manage ND persons.",
   "created_utc": 1701303834,
   "score": 3,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbamhp7",
   "message": "YTA… but a soft YTA. \n\nAs someone who is neurodivergent, and his situation may be different, when we are told we are responsible for doing X, Y, Z, we stick to it. Even though it should be common sense for someone to notice and speak up when something seems out of order, if maintaining that “something” is not a responsibility of ours, we don’t put as much stock in it because it’s not on our immediate to-do list, and that’s intentional, so we can focus on what we *know* we need to do. Arguably, ensuring machinery is running properly is on the shoulders of the operator. The “minions” don’t request a fix or place an order for a new fridge. Why would they think to pay attention to its noises or temperature? \n\nThe answer might be “well, they’re around it more than anyone else”. If the situation was that bad, if the owner or operator stepped within range of the fridge at least once, they’d have realized the problem. Or should have. And if they aren’t getting close to the fridge but are “running the place”… well…. are they?\n\nShrugging his shoulders didn’t mean he didn’t care. He may have been trying to process it, or could have just felt too overwhelmed to answer on the spot. Hence, why you got the call later on regarding how upset he was. \n\nNot trying to make excuses for him, but just offer a little perspective. Plus.. the other answers your employees gave doesn’t necessarily make them honest. But he certainly was.",
   "created_utc": 1701282783,
   "score": 5,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbblirw",
   "message": "NTA.... but maybe he wasnt a good fit for the walk in fridge. Maybe hes only good for washing dishes. Thats what id do. Autosm isnt an excuse and if he keeps doing stuff like that he needs to either be in a special work program or on disability.... he cannot be coating other peoples livleyhoods.",
   "created_utc": 1701295462,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbb69t",
   "message": "YTA, your sister was in charge, she should’ve been doing her due diligence and making sure things were running smoothly, you sent a guy home for not reporting it? That’s not a good response imo, did you train him to listen or check when there isn’t a noise? Punishing someone for not having common sense might feel good but it’s not right,",
   "created_utc": 1701291651,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc5i4i",
   "message": "YTA \n\nthere’s a good chance you actually broke a law because you expected someone who was not officially food safety trained to perform that function.  You were very lucky the inspector didn’t drop by during your vacation weren’t you?\n\nY t a Because you obviously were not clear to him or TESTED and WATCHED him, performing this task every single day a couple times a day, and you’re trying to weasel out of it. YES DUH your sister didn’t do the most important thing food safety for fuck sakes  \n\nIt was really stupid to entrust that critical job to him that you usually do the first time you’re going on vacation, so blame yourself not everybody else\n\n100% CERTAIN you waved to the group and yelled “don’t  forget to check to fridge ya’ll as you were juggling your beach chair and suntan lotion bolting out the door.\n\nHow the hell would you expect some young guy to know about food temperature? Meanwhile, as I found in my pet store business, your best employees are going to be restaurant workers who want to leave that disgusting job and already know about food, safety, and how to clean and hustle.\n\nDo you know anything about autism? When you’re telling him stuff he’s gonna say OK OK OK and then forget about it.\n\nYou hired him as a DISHWASHER stop trying to make it more than it is and be cheap about paying somebody to do the right job they’re qualified for\n\nJust like one of my employees at my pet store, conveniently neglected to tell me he had dyslexia and couldn’t explain any fucking directions on the fish chemicals to my customers. His MOTHER told me.\n\nAnd you’re not wrong to discipline or layoff or fire an employee just because they’re autistic.\n\nFurthermore, never hire someone permanently put them on a probationary. Period. Especially people with disabilities.\n\nNo, if you are going to die on this hill and keep insisting  that he was fully trained then you need to fire him. You can’t have it both ways because he’s not capable of understanding that “simple” task according to you.\n\nThis really irks me because I had a deaf employee, and he cost me a lot of business because people freak out having to talk to deaf people and it really took me a lot of effort, but I still did everything right .\n\nAND I know all about the food business I worked for Giant. I also worked for two idiots in a bakery, one time who wanted to pay me cash under the table, even though they had a slicer, and the husband used to smoke, while rolling out the dough, and have all his ashes dropping into the food with the cigarette hanging out of his mouth, and they lied about the Italian cookies being homemade, which came in by mail every week.",
   "created_utc": 1701303544,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc5ncw",
   "message": "YTA your sister is to blame not Adam. Could he have said something yes but ultimately it was your sisters responsibility.",
   "created_utc": 1701303605,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc6jiv",
   "message": "Did you specifically and directly tell Adam he was responsible for notifying management if the coolers weren't working? If you did not, do not expect him to know he should do this. YTA",
   "created_utc": 1701303984,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbcass9",
   "message": "Many people with ASD have to be explicitly told what to do. They may not think outside of the box or assume responsibilities without direction. Example: I told my high functioning teen son to do the dishes. I came home and the dirty pots and pans were on the stove. I became frustrated and yelled at him for not doing the dishes and he was legitimately confused and told me, “I did the dishes. If you wanted me to wash the pots and pans you should have told me to wash them.” Oh.  Ohhhhhh…! It was then that we made a rule - when he’s asked to do the dishes he also needs to wash the pots and pans. \n\nWhen we discussed and made the rule he understood they should all be categorized as dishes.",
   "created_utc": 1701305793,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbapizz",
   "message": "Yeah YTA\n\nYou left your sister in charge, and *she* didn't notice for three days that your refrigerator wasn't running. \n\nEven if Adam is the one who procures items from the fridge, there is no way that none of the other staff noticed that everything he was bringing to them was warm. As speaking as someone with decades of chef experience, if anyone ever brought me anything that was straight from the fridge, and it was warm, I would immediately be questioning why.\n\nThis is your *sister's* responsibility, because *she* was the one who was left in charge. Not Adam. Also Autistic folks will usually follow your exact instructions to the letter, but if you never specifically told him to tell you if the fridge is ever warm, or generally seems to be malfunctioning, to inform someone, then he is extremely unlikely to realize that it is something that he did do.\n\nSo for you to act as though it's his fault, and punish him for it, is not only very much an example of misplaced blame, it's also ableist.\n\nAlso I'm going to point out that it is most likely that everyone else *was* aware of the issue, and that being Autistic, Adam was the only one who wouldn't lie to you about it. \n\nAlso on a side note for food safety. You don't just have to throw out the contents of that fridge, you have to throw away anything that was made in the past four days, and you also need to inform any clients who have purchased goods made from those ingredients in the past four days.",
   "created_utc": 1701283879,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbb7ywb",
   "message": "I don't see the point of sending him home though. I don't believe you should «discipline» any of your employee as a matter of fact. It's not your place to do so.\n\nIt's ok for you to have a conversation with him explaining to him that when he sees something happening that isn't suppose to happen, to let you know. You kind of punished him, by sending him home, over something he didn't have 100% control of. And I'm not talking about his autism here, only that the fridge stopping to work was not his fault.\n\nMaybe you should take that situation and turn it into a learning experience for everyone, including you. For example, before opening and before closing, one part of the routine should include to check on your fridges. Put a thermometer in each one (I don't understand how there are still no thermometer in your fridges) and the person opening and closing the store should make sure the temperature is the right one.\n\nThe way I see it is, he is the only one who got «punish» for something that could have been avoided by a procedure that should have been in place by you since the beginning.\n\nAgain, he should have said something, but the situation itself is not on him. It's on you and your sister.\n\nTherefore YTA.",
   "created_utc": 1701290489,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbk84c",
   "message": "YTA for having the type of mentality that compells you to refer to your employees as your \"three little minions.\" You must be a nightmare to work for.",
   "created_utc": 1701294983,
   "score": 0,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc19a6",
   "message": "Your sister fucked the dog. The puppies are hers.   \nIf the authority figure here saw nothing wrong, why should he?",
   "created_utc": 1701301755,
   "score": 2,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbb6a2i",
   "message": "YTA, how is no one responsible for doing a temp log??!?!?!? This is food service. Have you never had a health inspector come through? Not taking the ten seconds every few hours to check a thermometer and write down a temperature number is completely unacceptable and is completely on you for not making someone do that.",
   "created_utc": 1701289876,
   "score": 254,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbuq3e",
   "message": "Honestly, yes YTA.\n\nDid you train him on the importance of temp checks?\n\nWhen you open your store in the am don’t you do temp checks yourself as a daily procedure? If not you should.\n\nYou need to post an opening check list for ALL employees. This is definitely your fault and you didn’t set him up for success if you did not do any of those things.",
   "created_utc": 1701299033,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc6rsf",
   "message": "YTA. But not for disciplining an employee with ASD. It is absolutely ok that he was upset. Something bad happened and he was part of the problem. Anyone should feel bad in that circumstance. He was wrong not to have spoken up as soon as he recognized a problem. His consequence was appropriate and his reaction to it was as well. \n\nThere are several issues that led to my verdict here. In no particular order:\n\nThere are very affordable tools that monitor temperatures in real time and alert your phone immediately in the event of deviation. I know because I have one for work that sends alerts to my phone. Your willful ignorance regarding these tools is your fault. You asked your staff to care more than you care. About something you call your baby.\n\nFrom a food safety standpoint, Adam walking in and out of the fridge was not the real reason your inventory had to be destroyed. Had the walk-in fridge remained perfectly sealed for the 4 days it was dead, everything inside would have been unsafe anyway. Had you served any of it, you could be looking at the end of your business today, as well as possible life-and-death level consequences for your customers. If the business was open on days 2 or 3 of the fridge being down, there is legitimate risk there too (and probably to some extent on day 1 as well).\n\nCommercial walk-ins have lights to indicate problems as well as visible temperature displays and gauges. Employees who never enter the walk-in would still have these fail safes in their lines of sight - and so would your sister. From your story, you didn't look at these food safety tools either, or you cut corners and don't have these displays at all (beyond a single thermometer).\n\nHave you contacted your county Health Department yet? You didn't mention that you had. You likely served temperature-abused foods to the public. Keeping that hidden could literally be a criminal offense. I would advise talking with an attorney.\n\nIn the end, the buck stops with you, even during vacation. That's what business ownership is. Your snarkiness in your edits gets worse and worse. They just come off as you not owning your shit.",
   "created_utc": 1701304081,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc7nj6",
   "message": "YTA and everytime you comment about Adam costing you hundreds of dollars, your a bigger YTA. You keep placing blame on Adam because he didn't tell anybody, but that isn't what cost you.\n\nYour sister, who you left in charge, did not do the legally required temp checks, that is what lead to you having to throw out the food. By the time the dishwasher noticed the fridge was warm, it was to late to legally save the spoiled food.",
   "created_utc": 1701304455,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbkcsm",
   "message": "NTA. He cost you a lot of money. He didn't do his job properly. That's on him. His autism sounds like an excuse. Not that he doesn't have it, but that it isn't the problem.",
   "created_utc": 1701295029,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc1njr",
   "message": "YTA. Your sister was in charge, not Adam, and you said in a comment she was supposed to maintain the required temp log. If she had been doing her job she would have caught the problem three days ago.",
   "created_utc": 1701301919,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbkvwi",
   "message": "NTA. Though I don’t know that I would want to employ someone whose mom calls me.",
   "created_utc": 1701295223,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbt3c3",
   "message": "YTA! He didn’t make the connection that there was a problem. It was an honest mistake, explained by his disclosed disability. He is a good worker you are lucky to have.",
   "created_utc": 1701298382,
   "score": 0,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbxkp6",
   "message": "Yta.... simply due to not understanding HFA, in his mind, the temp wasn't an issue. It's just that simple. It's not on his radar,  nor his responsibility, not in his normal routine.\n\nYour back handed comment shows you lack of understanding and empathy for your special needs employee. Do better. You're upset,  understandably so,  don't take it out on the easy target.",
   "created_utc": 1701300209,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc2xhs",
   "message": "YTA. If it's not his responsibility to check and record the temperature of the fridge then it's not his responsibility to make sure it's working correctly. That's a management responsibility. You seem far more pissed at your employee than your sister and you shouldn't be. Your employees shouldn't have to say things like \"this fridge doesn't seem as cold as usual\" when there's literally someone taking daily temp measurements who should see the problem. You need management training honestly. You should apologize to Adam and pay him for the day you sent him home.",
   "created_utc": 1701302456,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc3hbz",
   "message": "May be unpopular but i say NAH (except for your sister). \n\nI don’t think your punishment is terribly unreasonable (though please stop calling your employees minions). But i can also see why Adam didn’t seem to phased to point out the obviously not working fridge to your sister because from the sounds of it your sister likely spent as much or more time in the fridge than Adam. As you have said many times, noticing that a fridge shouldn’t be warm is really obvious.  Its not unreasonable that Adam didn’t tell your sis something she obviously should have noticed herself. \n\nTo put it another way, if i saw my boss sloshing around in a puddle of water with wet shoes and pant legs, it may not occur to me to tell him “hey there is a puddle of water there” because it would sound like the sarcastic crap captain obvious would say.",
   "created_utc": 1701302687,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc9xdu",
   "message": "YTA \n\nYou hired an autistic employee without bothering to learn how you needed to adapt your communication. You assumed Adam knew what was expected of him if there was a problem. It sounds like you expected Adam to infer how to handle this problem. That is not a reasonable expectation for an autistic person new to the job.\n\nNot only that, but you also didn't bother to try to understand that people with autism do not typically use body language to communicate the same way a neurotypical person does. Adam's reaction in no way indicates he doesn't care. My son can't even speak when he's in a stressful situation (he's very, very smart and articulate, yet selective mutism is a thing). What you see on the outside is NOT the same as what is going on inside with autistic people. You extend Adam zero grace. \n\nHe underestimated the severity of the problem and failed to report it. Ultimately, responsibility is on you and your sister for this, and you took it out on the young adult with a disability. I am glad you calmed down, didn't fire him,  and established clearer expectations for the future, but YTA for your unkind assumptions about Adam and for blaming him for your failure.",
   "created_utc": 1701305424,
   "score": 1,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbak869",
   "message": "YTA\n\nYou are not punishing Adam for being autistic, you are punishing him for being honest. They all knew and were comfortable with lying.",
   "created_utc": 1701281898,
   "score": 245,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbamh4c",
   "message": "Which is these is the bigger issue, a dishwasher who didn't report a warm refrigerator,  or a manager who didn't either notice it or chose not to act on it? \n\nAdam admitted he noticed it days prior but he didn't understand the implications.  Your sister, and presumably the other 2 employees, were also in and out of there and you didn't even question why they didn't act on it. \n\nYTA - I don't know your motivation,  and of this had to do woth his autism, but it's certainly unfair to punish him when everyone there should have cared to prevent the food spoilage.",
   "created_utc": 1701282777,
   "score": 248,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbanuow",
   "message": "YTA. Your sister was supposed to be managing, and making sure that major systems are running is a key part of that. Even if Adam didn’t have cognitive issues, it’s still not his job, which was washing dishes and floors. And your sister knows that, because she lied to you. Either she didn’t show up at all for days, or she didn’t do what she was supposed to while she was there.",
   "created_utc": 1701283277,
   "score": 252,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbe8yx",
   "message": "[deleted]",
   "created_utc": 1701292782,
   "score": 0,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbc4wtw",
   "message": "YTA. He is autistic. You know he is. They are very literal. He didnt tell you because you never told him that was also what you needed him to do. Ie tell you if the frige wasn't working. Should it go out in the future, I bet he will tell you!",
   "created_utc": 1701303291,
   "score": 0,
   "submission_id": "186w1gq"
  },
  {
   "comment_id": "kbbdyds",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "186w1gq"
  }
 ]
}