{
 "submission_id": "186wp84",
 "title": "AITAH for not wanting my MIL to move in with us?",
 "selftext": "My husband (30y) and I (28y) have been together almost 8 years.  He has always felt guilty about his mother’s (64y) living arrangements our entire relationship. When we first started dating his mom up and moved from Arizona to California after her 35 year old daughter had a baby. She left all of her stuff in her apartment in Arizona and expected my husband to take care of it or the landlord to have the stuff removed. \n\nHis mom lived in California with her daughter until she found her mom had illegal drugs inside her home where she had a very small child. My husband’s mom was the caretaker of this said child while her daughter worked. She obviously kicked her mom out. \n\nMy husband’s mom then rented a room nearby the daughter and had a solid job in retail. She then got in a car accident where they again found this illegal substance in her blood. \n\nTwo years later, his mom randomly decides to quit her job and move back to Arizona with no housing or plans at all. Since she didn’t even contact us about coming to Arizona we did not allow her to come to our house so she decides to try to drive to Mexico (she has family there).  On her way she crashes into a tree and is stranded in a random city in southern Arizona. She expected my husband to drop everything to go help her.  She ended up staying in this small town for a while and not even 7 months ago my husband got a call from her asking him to pick her up from jail in Mexico.  She now sleeps on her brother’s family’s couch about 30 minutes away from us but she only calls when she needs something. Never even to come see us.  \n\nWith this in mind, we do not see his mother often. The last time was when we went on vacation in California with his siblings and she joined in March 2022. We also have two young children under the age of 4. My husband constantly brings up wanting to move his mom in with our family. I always say no due to the behavior she has exhibited. I do not want any of this around my kids.  My husband does not understand and says this is really important to him and how would I feel if I wanted to move my mom in but just one person was blocking it. I feel like she just uses people until she is done with them and just moves along.  I understand this is very difficult to deal with for my husband but why does he keep asking when I say no? AITAH for not allowing her to move in?  \n\nThank you so much in advance. Sorry it was so long, this is years in the making.",
 "created_utc": 1701283181,
 "permalink": "/r/AITAH/comments/186wp84/aitah_for_not_wanting_my_mil_to_move_in_with_us/",
 "score": 30,
 "url": "https://www.reddit.com/r/AITAH/comments/186wp84/aitah_for_not_wanting_my_mil_to_move_in_with_us/",
 "comments": []
}