{
 "submission_id": "186ylzw",
 "title": "My mom and sister are ruining my life in more ways than they are willing to confess",
 "selftext": "      My sister told me that she “exposed” me on Reddit and my mother has been arguing with me and calling me “entitled” and saying my college fund is “her money” and I have no right to tell her what to do with it.\n\n\n\n         I’m here to defend myself against my mother and sister and begging all of you to not give them your sympathy. My mom made a post as well, so that’s that. My mom fully believes she’s doing the right thing, but she isn’t.\n\n\n\n       To put it bluntly, my sister is a leech and my mom is an enabler. I have pointed my sister towards job opportunities, but she constantly makes excuses about how her disabilities are preventing her from working. My sister is constantly asking me and my family for money and support and I don’t give it to her. I have a job and she doesn’t: Why should I help her lazy ass? \n\n\n\n       My mom likes to fight with me and tell me I’m horrible and greedy for “turning my back on” family. My sister likes to guilt trip me about the fact she has four kids and loves accusing me of being heartless and not caring for the weak and vulnerable. However, every time I tell her to find a job and give her kids up for adoption and get birth control, my mom and sister swarm like hawks to attack me and call me all sorts of horrible names.\n\n\n\n        I worked a job for a while that paid me through a joint bank account I have with my mother. I am 17 and cannot legally have an independent bank account. One day, I notice that my work money is gone. I had about 14k saved and when I checked I only had around 300 dollars left. \n\n\n         Turns out, my mother had taken thousands of dollars out of my savings and spent it on my sister. When I confronted my mom, she screamed about how she “owned” my bank account and that it was “her” money. I told her I worked my ass off for that money and she said it was not my place to challenge her authority.\n     \n\n\n        My sister spent all that money on herself and became poor again. She always tries to tell stories of woe and misfortune to garner sympathy from our relatives and can get nasty and critical when they refuse to help her.\n\n\n\n          After my sister got evicted, my mother decided it was best to liquidate my college funds to help her. I begged her not to do that, but she told me she would do it whether I liked it or not. I don’t know much about the circumstances surrounding my sister’s eviction, but I heard she was sharing a 1bed apartment with 8 people. How in the world do you do that? Sounds like a headache to me.\n\n\n\n          Her boyfriend is also somewhat of a leech, but at least he has a job. He likes to ask for money when we take him to family gatherings. He isn’t as pushy as my sister, but like her, he also likes pulling the woe-is-me card. \n\n\n      I had thousands saved for my life and college, but my mother has continuously drained me of my finances and left me with so little and gives so much to my sister. And for what reason? \n\n\nI am livid with my mother and sister. I am incredibly angry with their actions and exhausted with their guilt tripping and excuses. I am soon going to move out and pay for everything on my own, including my shelter, food, phone, and all I have. College will be a struggle because most of my college fund is gone and my scholarships don’t cover the entire cost. \n\nBut I’ll make it and when my mom and sister see me succeed, they’ll be sorry they screwed me over. I don’t feel an ounce of sympathy towards my sister, but I do pity her children. They didn’t choose to be born to such pathetic creatures. \n\nWhen I grow up, I’m going NC for a long time. Maybe in ten years, I’ll briefly check up on them. \nIf they ask me for help, I’ll plug my ears to their requests and not give them a penny to assist them. You reap what you sow and my mother and sister will realize that very soon.",
 "created_utc": 1701288158,
 "permalink": "/r/AITAH/comments/186ylzw/my_mom_and_sister_are_ruining_my_life_in_more/",
 "score": 94,
 "url": "https://www.reddit.com/r/AITAH/comments/186ylzw/my_mom_and_sister_are_ruining_my_life_in_more/",
 "comments": []
}