{
 "submission_id": "186zeie",
 "title": "AITAH for throwing my husband under the bus?",
 "selftext": "My husband has a habit of throwing me under the bus with his mom. We make joint decisions and then I am the one that vocalizes those boundaries to his mom and takes the heat. Shes very loud and a yeller. I also enforce those boundaries because my husband is unable to tell her no. Then my husband will change his mind so she isnt upset and blame me for those decisions. This has happened over and over and over again for 20 years. I finally had to go no contact with his mom for 7 years because she got verbally abusive and just down right vicious with me and he sat there and watched it and never said a word and then defended her.    Last year his sister texted me in a group text asking me when they could plan to spread my father in laws ashes. I ignored the text and told my husband several times in marriage counseling that when it comes to his family I refuse to make any decisions and he needs to figure it out and handle it. So heres the delimma….  His sister yet again a couple weeks ago texted me in a group text asking me to plan a trip to my mother in laws house to help her get her estate in order. Mother in law was not included in the text so I wasnt sure if she even knew about this or if I was going to be the one surprising her with this. I again ignored the text and told my husband that i would not be going as i didnt want to 1-be thrown under the bus again and 2-i didnt want to be in a potentially toxic situation with no escape (plane trip and we would be staying with mother on law).  He got angry with me. I have asked him to please fix the situation he created and until he did I would not be around his mom or sister. He lies to them about me telling them lies half truths or my reactions without telling them what he did to cause those reactions. Basically I am just done with the toxicity. So yesterday after he got angry with me and left I decided to take matters into my own hands and sent a group text to my husband his mom and his sister stating that I will not be making any decisions regarding their family or staying in a potentially toxic situation due to their son/brother throwing me under the bus and that i felt like his behavior ruined my relationship with them and that i had nothing against them. That I had asked my husband to tell them the truth and he just ignored it and was now mad at me because I was upholding my boundaries and that I wouldnt be involved. Hubby was driving so took him a few hours to see this text stream but both comments from his mom and sister were positive but he is so angry he isnt speaking to me. He said I put our marriage in jeopardy and that I am angry and bitter. I am not I just felt like they needed to know my boundry and why so they would quit asking me to do things that make me feel uncomfortable. I asked him to fix the situation and deal with it but he ignored it as usual and then just expected me to forgive and forget and then he does the exact same thing over and over again. Im exhausted and want off this hamster wheel.  So AITAH for outing my husband and throwing him under the bus for a change?",
 "created_utc": 1701290253,
 "permalink": "/r/AITAH/comments/186zeie/aitah_for_throwing_my_husband_under_the_bus/",
 "score": 76,
 "url": "https://www.reddit.com/r/AITAH/comments/186zeie/aitah_for_throwing_my_husband_under_the_bus/",
 "comments": [
  {
   "comment_id": "kbb8phu",
   "message": "Nta but how have you put up with this for so long?",
   "created_utc": 1701290760,
   "score": 239,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbdu0e",
   "message": "You don't have an in-law problem you have a husband problem. You should have told his family straight years ago, it would have saved you years of in-law related stress if you spoke out then instead of him just keep throwing you under that bus.",
   "created_utc": 1701292630,
   "score": 46,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbb8ntj",
   "message": "NTA\nYour husband needs to grow up. My guess is that his mom did literally everything for him before you got married and he expected you to do the exact same thing. \nHe’s the one that has created the problem, not you.",
   "created_utc": 1701290743,
   "score": 110,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbclfb",
   "message": "NTA\n\nAfter two decades of being deliberately misrepresented by your husband to his family, you had every right to clarify the reality of the situation. \n\nWhat he has been doing is actually a form of gaslighting, wherein one party will deliberately misrepresent themselves in a scenario, and then implicate someone else to take responsibility for a decision they were complicit in. \n\nThe reality is that he is the one who's been jeopardizing your marriage for two decades by lying to his family, and allowing you to shoulder the blame for mutual decisions, by making it out as though you are controlling, and domineering. This way he gets to not only avoid culpability, by painting you as the sole source of the decision, but also get sympathy for having to put up with his \"controlling wife\". \n\nThough I honestly wouldn't expect this behaviour to change. So if you can't tolerate it any more, then you're either going to have to out him to his family every single time he dies this, or leave him. As he's not going to stop a pattern he's maintained for twenty years.",
   "created_utc": 1701292176,
   "score": 101,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbcjki",
   "message": "NTA\n\nNo, HE put your marriage in jeopardy.\n\nI'm appalled that you would continue to put up with this.",
   "created_utc": 1701292156,
   "score": 47,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbb8iaa",
   "message": "NTA, you’re just hard reinforcing the boundaries he’s been ignoring for ages. He’s responsible for what happens next.",
   "created_utc": 1701290687,
   "score": 21,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbjgoy",
   "message": "NTA\n\nHe put the marriage in jeopardy, and honestly I would have left seven years ago. \n\nHe's created this problem, and for him to threaten the marriage because he's being held accountable is such a tool move.",
   "created_utc": 1701294707,
   "score": 20,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbjrpw",
   "message": "I think it's funny that you put the marriage in jeopardy when you were done being his proverbial punching bag.    \nNTA",
   "created_utc": 1701294817,
   "score": 17,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbqmfl",
   "message": "NTA.  You might be T A to yourself for putting up with his bullshit for so long.\n\nOf course he's mad - you told them exactly WHO HE IS and he doesn't like it revealed that he has LIED TO THEM for years.  These are HIS CONSEQUENCES FOR HIS OWN ACTIONS.\n\nI would be happy he isn't talking to me and just go around whistling and being happy.  He can sulk and throw a fit all he wants.\n\nAlso, keep your boundary of him dealing with his own family.  Good for you!",
   "created_utc": 1701297425,
   "score": 11,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbiqqg",
   "message": "Why it took you so long to do this?",
   "created_utc": 1701294442,
   "score": 11,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbkjmh",
   "message": "NTA, you weren't the one who put your marriage in jeopardy that was your spouse that did that.  I don't think you are angry and bitter, he's pissed off because you called him out on his bad behaviors so now he has to live with the consequences instead of using you as a meat shield.",
   "created_utc": 1701295097,
   "score": 8,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbwr6j",
   "message": "YOU put your marriage in jeopardy?!!! He lies, and manipulates and makes his family hate and abuse you and YOU put your marriage in jeopardy?!?! Why the hell are you still there??? He literally sets you up to be crapped on, and this is only the first time you clued everyone in?? He would have gotten one, ONE warning from me, after that he would be called out on his actions in front of his family EVERY. DAMN. TIME. And if the marriage ended, that would be because HE put the marriage in jeopardy. Good grief, I’m so angry at your husband I’m practically frothing at the mouth. I can’t even tell my husband about it because he doesn’t Reddit and after the one I told him about yesterday he offered to go beat them up if it would make me feel better. I just can’t maintain proper Reddit Rage when he does that.",
   "created_utc": 1701299866,
   "score": 7,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbdldt",
   "message": "Sometimes the direct hard truth is the only way. The second time my SO threw me under would be the last time. Serious question, did his balls ever drop?",
   "created_utc": 1701292541,
   "score": 7,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbll1y",
   "message": "Why are you still married to someone so emotionally immature?",
   "created_utc": 1701295486,
   "score": 6,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbpqj9",
   "message": "NTA. Just divorce the man-child already. He doesn't seem to care about you at all. Not defending you to his mother, saying that YOU are the one putting the marriage in jeopardy...\n\nDo any men out there actually love their wives?",
   "created_utc": 1701297080,
   "score": 6,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbt6dh",
   "message": "*YOU* put your marriage jeopardy? LOL! \n\nHe really had no clue, does he?\n\nOf course NTA.",
   "created_utc": 1701298416,
   "score": 6,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbv20i",
   "message": "NTA He’s just upset that he can no longer use you as a scapegoat.",
   "created_utc": 1701299167,
   "score": 6,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbxwon",
   "message": "YOU put the marriage in jeopardy? Girl, divorce him. He’s a sack of human trash.",
   "created_utc": 1701300350,
   "score": 6,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbborvz",
   "message": "NTA. Sounds like he can’t handle conflict or honesty and is now mad that he no longer has a scapegoat",
   "created_utc": 1701296707,
   "score": 4,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbyhvz",
   "message": "NTA. Love that you put the marriage in jeopardy by calling him out one time, but the last 20 years of him throwing you under the bus didn’t cause any issues in your marriage at all. \n\nBtw, i would absolutely not stand for this. Your husband would rather be married to his mommy, so I’d leave him to it. YUCK YUCK YUCK. I literally cannot stand momma’s boys.",
   "created_utc": 1701300599,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc0bwy",
   "message": "NTA. It's way past time for an ultimatum. He's either married to you or his mother. He needs to pick his side and stay on it.",
   "created_utc": 1701301367,
   "score": 4,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc0yb9",
   "message": "Girl\n\nHE is the one who put the marriage in jeopardy when he didn’t put you first \n\nNTA",
   "created_utc": 1701301628,
   "score": 4,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbwo0a",
   "message": "He put your marriage in jeopardy and doesn't care.\n\nRun him over with the bus OP",
   "created_utc": 1701299828,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc3f3j",
   "message": "not one incy bincy bit...husband now knows what his lack of action feels like...well played",
   "created_utc": 1701302661,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc4jhs",
   "message": "I would tell husband I’m glad you finally see our marriage is in jeopardy because I’ve felt that way for years with him continually letting me be abused and not standing up for me.. \n\nSo he can do as he wishes because you’re done being his scapegoat.. he can always pack and go home to mommy.. \n\nNTA.. husband totally is Ahole and your biggest problem.. maybe show him this post.. let internet strangers give him piece of their minds..",
   "created_utc": 1701303135,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc69xn",
   "message": "The most toxic relationship here is between you and your husband. It sounds like he's straight up gas lighting you, and he knows it, and he's making no effort to change. And to be honest, as bad as his behaviors are and as consistent as they've been for 20 years, it sounds like it's time to hit eject on that whole marriage.",
   "created_utc": 1701303871,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc6w31",
   "message": "NTA. The mother-in-law seems like... a lot, but when your husband throws you under the bus, his mom sees it as you preventing him from doing something he wants, not a boundary. The problem is your husband.",
   "created_utc": 1701304132,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc70bh",
   "message": "You didn't put your marriage in jeopardy,  he did.  He has been,  for years,  and every time he ignored your stated boundaries,  he endangered the trust and communication of the marriage. He ignored the fact that you setting those boundaries was an attempt to fight FOR the marriage.  They were the lines you needed held in order to remain in this relationship.  He vilified you to avoid having to mature in certain areas of his life,  then gets confused when you are tired of being his whipping boy? \n\nThis isn't you starting a fight.  This is the consequences of his refusal to take accountability,  despite the many times you have graciously offered him paths to do it and save face.  Now he has no more face to save,  and he can either pull up his big kid pants and start behaving like a partner,  or he can deflect the blame yet again and blame you for his problems.  If it's the second,  I would strongly suggest looking into what you need in your life that makes you happy,  outside of the marriage.  I would also take text messages you have of your discussions with him,  and compare what he's told you to what he's told the family.  It will put them in a position where they will be aware of his lying behavior,  and he'll find it much harder to fib his way through challenges.",
   "created_utc": 1701304182,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc850k",
   "message": "So he doesn’t like the same treatment that he gives you. Got it.",
   "created_utc": 1701304660,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcbzek",
   "message": "He gaslights you, treats you like garbage for having boundaries, and acts like a baby. He won't change",
   "created_utc": 1701306305,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcc0mt",
   "message": "NTA but he is a terrible husband",
   "created_utc": 1701306320,
   "score": 3,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbo367",
   "message": "Nta. He’s a dick for doing what he’s done to you. A partnership is exactly what it says. Partners. Not one person doing everything while the other backs out and acts like nothing happened.",
   "created_utc": 1701296440,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbr3sq",
   "message": "NTA You have strength and patience to endure this for 20 years. You should have put an end to this years years ago. The first time he did it, you can warning him to ensure there isn't a second time. And if it is happen a second time, you get up from under that bus and turn it over on his ass.",
   "created_utc": 1701297612,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbsnh8",
   "message": "NTA.\n\nI don't know how you can bear to be with a man like that.",
   "created_utc": 1701298213,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbt162",
   "message": "100% NTA. He's a child. I can't believe you have stayed with him thru all of this. Good for you.",
   "created_utc": 1701298358,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbt5bn",
   "message": "NTA. He has stayed out of trouble with them by making you seem like the bad guy. He has stayed out of trouble with you by agreeing to your boundaries and saying they’re impossible. \n\nFor some reason, if everyone doesn’t get along he’s happy. \n\nYou don’t have to live like this, and shouldn’t. Put your foot down (as you just did), or walk away. Whatever you decide to do to move forward, just don’t give him the reigns because he keeps steering the horse into the ditch. \n\nGood luck!",
   "created_utc": 1701298403,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbug8g",
   "message": "Why are you still married to this coward?",
   "created_utc": 1701298922,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbvtm5",
   "message": "NTA",
   "created_utc": 1701299481,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbwv99",
   "message": "NTA. He deserves all of what’s coming to him.",
   "created_utc": 1701299913,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc204s",
   "message": "Totally NTA. It sounds like your husband is feeding this negativity as if he is getting something out of it. So when uou have made a concerted effort extricate yourself, he's gone off on one. I would ask your self what he's getting out of keeping you and your in laws apart. And maybe some one on one counselling because this is a very toxic situation that could use some professional advice.",
   "created_utc": 1701302066,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc286o",
   "message": "Nta.\nHe put your marriage in jeopardy, period.\nYour in-laws aren't really even the problem. Your husband is.",
   "created_utc": 1701302161,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc2gfw",
   "message": "Nta update us when you divorce.",
   "created_utc": 1701302257,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc31zk",
   "message": "Nope. NTA. I'd be out of that relationship a long time ago, though. So, ...",
   "created_utc": 1701302510,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc3opl",
   "message": "NTA. He's a hypocrite and a coward. He wears the skin of a man, but lacks character. He makes decisions, but then hides behind your skirt when it comes to standing behind his conviction, so he can play \"good son\". He's useless and a snake in the grass.",
   "created_utc": 1701302773,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc42pt",
   "message": "You are NOT TAH.   The truth is always the best policy and you have brought the truth into the light of day.  If your husband is angry, remind him that this is exactly how he has treated you for the past twenty years years.  You’ve set the boundaries now hold the line.",
   "created_utc": 1701302938,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc4b5u",
   "message": "NTA. \n\nYour husband sounds emotionally abusive.",
   "created_utc": 1701303037,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc4oaw",
   "message": "YOU didn't put your marriage in jeopardy.  He did.  OP - this man does not care enough about you to keep this from happening over and over again. For TWENTY fucking years.  Why would you stay with someone who values his mother and his relationship with her more than he does his relationship with you?  He does NOT choose you OP - he never will.  But he will expect you to help take care of his asshole mom when no one else will I bet.",
   "created_utc": 1701303192,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5ny1",
   "message": "Your husband spent 20 years putting the marriage in jeopardy while you patiently waited for his testicles to descend (to no avail). You're NTA, but he's a spineless lump.",
   "created_utc": 1701303612,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5q1b",
   "message": "So, the marriage counselor didn’t pick up on this family dynamic your husband has cultivated? That he’s not had your back or supported you with his family? That he’s told lies, half-truths and has misrepresented you to them for YEARS? Who else has he done this with? Does he speak positively (or feel positively) about you at all? \n  It sounds like this relationship is broken beyond repair. Talk to the counselor about all of this (ALL of this!) and see what they say but based on the story you’ve told here, this isn’t going to get better - it’s been going on for years and he’s unlikely to do anything but become more contemptuous and disdainful of you. Nothing kills love faster.",
   "created_utc": 1701303637,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5uju",
   "message": "You don't have an in-law problem. You have a drawing of boundaries with your husband problem. Or just a husband problem in general. \n\nIf he's not willing to back you up and support you and take ownership of his role in any of this I don't know why you're still married to him 20 years later. \n\nPartnerships are an us against the problem a situation. We work together to make those things happen and we stand by one another when necessary.",
   "created_utc": 1701303688,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5wtn",
   "message": "How have you not divorced him yet?",
   "created_utc": 1701303715,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc6u1n",
   "message": "NTA Divorce him for the above reasons.",
   "created_utc": 1701304108,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc7cxg",
   "message": "NTA but u have a major husband problem y have u put up with this shit for so long? Marriage counselling and setting boundaries with him? He seems to have been doing this for years and u just put up with it, that’s y he hasn’t  changed. Y would he, there are no consequences to his actions. You have spent years allowing yourself to be treated like a doormat, he isn’t going to change because you let him do this. It’s time to stop this bs once and for all. Either hubby attends therapy and starts having ur back or he can go. Ur MIL and SIL are not the issue her u and hubby are. You really need to open ur eyes to the real problems here.",
   "created_utc": 1701304331,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc80se",
   "message": "Ugh - you ARE angry and bitter. Who wouldn't be? \n\nI think you did the right thing. NTA",
   "created_utc": 1701304610,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc87wv",
   "message": "NTA.\nIt's far past time for him to grow up and be a man and speak to his mother and his siblings like an adult I'm sure that they love him very very much and I'm sure that he feels the same way He shouldn't be so afraid to talk to them. He doesn't seem to have any problem saying what he thinks to you after all...  I was glad to hear that you're in marriage counseling and I'm sure your counselor would agree with your actions. You did the right thing This way you're also speaking to his mother and his sister's like an adult as you should The only way to get your boundaries respected is to let them be known.",
   "created_utc": 1701304694,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc8gvp",
   "message": "I'll never understand you pick me bitches. Staying married to toxic mama's boys just to say you have someone. YTA for staying with him",
   "created_utc": 1701304802,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc8jlv",
   "message": "Why have you put up with his crap  for so long?",
   "created_utc": 1701304834,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc9idq",
   "message": "NTA. The truth shall set you free! And would it be so bad if you were free of him?",
   "created_utc": 1701305247,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcax27",
   "message": "NTA…not for a second! He should be man enough to stand up for YOU! But he doesn’t. I have no idea how you’ve to deal with this for 20 years! Obviously marriage counseling isn’t working for him because he’s not listening to you at all and continues to be toxic himself.",
   "created_utc": 1701305843,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbccf72",
   "message": "YOU put the marriage in jeopardy?? YOU?  That man has some balls!",
   "created_utc": 1701306496,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbccrnn",
   "message": "The in-laws aren’t half as big of a problem as your hubs.",
   "created_utc": 1701306645,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbce1pc",
   "message": "Your husband is the one who has been putting your relationship in jeopardy for 20 years. He does not respect you enough to stand up for you. He didn't respect himself enough to be a supportive partner, probably because of his mom's behavior. Is your husband actually engaged during counseling sessions?",
   "created_utc": 1701307196,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcefg2",
   "message": "NTA but my goodness your marriage sounds exhausting.",
   "created_utc": 1701307360,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbo7ax",
   "message": "It sounds like you have a defective husband.  Upgrade to a better model.  NTA",
   "created_utc": 1701296486,
   "score": 2,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbdpcf",
   "message": "PARAGRAPHS.",
   "created_utc": 1701292581,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbmwzx",
   "message": "When u put up with something like this for 20 years it's kind of ur fault. U really let something bad build up and up and up.\n\nNext time don't wait 20 years wait 20 minutes",
   "created_utc": 1701295993,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbb8rvr",
   "message": "Kinda YTA but he has it coming. He wants you to hangout with someone who yells at you. Which is completely unacceptable. His family was either a) causing the situation or b) complacent with it, so that was unacceptable on their part. The one part where things get murky is blaming them for ruining your relationship with your husband. Nah, only two people can do that you or him. Assuming the situation is the way you laid it out he's fucking up the relationship. So your group chat was probably lashing out about the wrong things and not a good way to communicate. I wouldn't particularly feel bad about it though cuz they were assholes too.\n\nEdit: I misread the story, revised to NTA.",
   "created_utc": 1701290784,
   "score": 252,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbmnu3",
   "message": "Not reading all that without paragraphs.",
   "created_utc": 1701295895,
   "score": 255,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbxpci",
   "message": "NTA - but would you and your husband PLEASE go to marriage counseling? This is ridiculous, that you are put in a position of being a punching bag when you are trying your damnedest to stay out of their business.  If the marriage is in jeopardy, it's because he has a spine weaker than a jellyfish when it comes to his mommy.",
   "created_utc": 1701300264,
   "score": 0,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5jzc",
   "message": "This is my posting ID for the AITAH posts where I know before I post, I am going to get voted down because there are \"toxic\" elements in the story, and toxic people validating you.   \nYTA.   \nYou are one of those toxic women who corner their partners into agreeing with \"boundaries\" that usually involve their mothers. This is why we end up with estrangements that go on for years, and women like you who fling around the grandkids and use them as weapons. You ruin entire families on a life time basis then go to places like this to get validation for your abuse.   \nYOU are tired of the toxicity? No. YOU are the toxicity.   \nEssentially your husband is putting up a lot of resistance because he doesn't want to do what you are harassing him into. He's not throwing you under the bus. He's telling the truth of what is happening. It's not what he wants, its what you want.   \nI dont agree with you MIL losing her crap over it, but  by your own words, you inflict this BS on everyone around you on a regular basis.   \nGet therapy for your NPD.  \nYOU are the asshole. Best of luck to your husband, he will need it.",
   "created_utc": 1701303565,
   "score": 0,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbalpf",
   "message": "ESH. The inflammatory text was unnecessary. You could have simply replied to your SIL saying that it’s more appropriate for your husband to do estate and funeral planning with his mother. By repeatedly ignoring your SIL and then sending a message criticizing your husband, you’re doing the very thing you are accusing your husband of doing.",
   "created_utc": 1701291444,
   "score": 243,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbaz6a",
   "message": "NTA.",
   "created_utc": 1701291580,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbpxm9",
   "message": "Solution = get a divorce!!!",
   "created_utc": 1701297157,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbq9jy",
   "message": "NTA but how much longer do you intend to deal with your husband behaving this way?",
   "created_utc": 1701297287,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbt8gm",
   "message": "NTA. Therapy doesn't seem to be working...",
   "created_utc": 1701298438,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbtnp5",
   "message": "Honestly, he has been screwing them over, too.  Screwing you over more, of course, but he is betraying his mother and sister's trust, too.\n\nNTA",
   "created_utc": 1701298606,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbvgj9",
   "message": "NTA but honestly, why the heck he you dealt with it for so long.",
   "created_utc": 1701299333,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbvj95",
   "message": "NTA, but I don’t know why you kept doing this for 20 years. I would have been done with him long ago.",
   "created_utc": 1701299365,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbw2l5",
   "message": "Yeah... NTA... He sounds useless when it comes to family stuff. Has the therapist not chimed in regarding him handling HIS responsibilities?",
   "created_utc": 1701299585,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbw9s8",
   "message": "It sounds like you need to throw the gauntlet down and demand an end to all this. Either he shapes up very quickly or you are going to ship out!",
   "created_utc": 1701299667,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbbyvl0",
   "message": "Your husband is the situation. NTA",
   "created_utc": 1701300760,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc2p5y",
   "message": "\u0026gt; Im exhausted and want off this hamster wheel.\n\nLife is short.  Is this really the life you want to have lived when you look back? Constant stress and lack of support from your partner? \n\nNTA",
   "created_utc": 1701302360,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc2x1r",
   "message": "NTA for outing your husband.\n\nGentle YTA to yourself for sitting in his cowardice for 20 years. I'm proud of you for standing up.",
   "created_utc": 1701302451,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc303i",
   "message": "Nta and he threw your marriage away years ago with his horrifically manipulative ways of putting you AND his mother/sister against each other so that he always gets his own way and comes off as the victim to literally everybody. The way that they responded positively to you after you made it clear that he does this in the group chat really stood out to me as supporting this theory actually. I think if you really went through everything that he has done with them that you would be very pleasantly surprised by their reaction to it. Good luck op.",
   "created_utc": 1701302488,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc43kp",
   "message": "NTA. very smart move, though, kudos.",
   "created_utc": 1701302948,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc4rq2",
   "message": "NTA. Speaking from experience....it's hard. My mother is your mother in law and for years I was your husband. Honestly not sure what ended up making me see it but he is blind to what she is doing and it's partially his fault and partially not. Not defending him because what he is doing and has done was wrong but I was there. It's hard to break the cycle and that is what needs to be done. I wish I could get the earliest years of my marriage back but I am a completely different man now and continue to do the right thing for my wife. Sorry you are in this situation.",
   "created_utc": 1701303232,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5d10",
   "message": "Nta. Your problem isn’t w mil, sil or anyone other than your husband. Sounds like he goes out of his way to make you the bad guy in every situation. I don’t know why you have allowed it even once, let\nAlone to continue this long. Sounds like he enjoys keeping everyone separate (my step used to do so she didn’t get caught lying). He is actively stirring the pot, causing issues \u0026amp; then you are supposed to suck it up? I would call him out every time",
   "created_utc": 1701303483,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5e3k",
   "message": "NTA but dayum! Walk away",
   "created_utc": 1701303496,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5hsy",
   "message": "NTA\n\nI can't see why anyone would want to stay married to that level of toxicity and lack of loyalty. \n\nGood luck. 🌹",
   "created_utc": 1701303540,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc5n0h",
   "message": "I mean, you've known for 20+ years that your husband is a passive aggressive, lying AH so if anyone ruined the marriage, it was him.\n\nNTA",
   "created_utc": 1701303601,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc639s",
   "message": "Your husband is obviously a coward who is unable to face his mother and tell her the truth. A simply stupid momma’s boy. By the way he already ruined your marriage years ago by being the guy with no cojones! Your wife is your partner and your mother is the woman who raised you not your partner in life.\nHe needs to grow some or better off alone that next to a coward who is so afraid that he will always make you out to be the bad guy.",
   "created_utc": 1701303791,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc64n9",
   "message": "NTA. You've been living this for 20 years, that's a lot.",
   "created_utc": 1701303808,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc6ish",
   "message": "Nta, and what you did to him and what he has repeatedly done to you are vastly different. He has lies to them and basically made you a villian to make his life more convenient.  You told them the truth. Why do you even put up with this",
   "created_utc": 1701303976,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc7ob0",
   "message": "NTA. I’ve set up my own hill to die on and am just waiting for the deadline. My husband is a severe asthmatic and needs to do paperwork to get next years health insurance. I’m refuse to do it and have to hound him for the information to enter or dig it out of his rathole of a filing system. He’s going to kill himself because he’s lazy.",
   "created_utc": 1701304463,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbc88t2",
   "message": "Why are you in a group chat with these people? You obviously do not get any satisfaction from their company. Ignore their existence. You cannot make another adult do what you want them to do. Just accept his limitations in this area, stop thinking or talking about them and move swiftly along. Your marriage counsellor is not doing their job.",
   "created_utc": 1701304705,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcaa88",
   "message": "You have wasted a long time on this man and this situation.He's deliberately put you in harms way and abused your trust.\n\nI would have allowed that to happen only the one time.Only because I would have left him immediately after that.\n\nSince you seem to have more reasons for staying than leaving I think you need to see a therapist for couples counselling.\n\nNTA",
   "created_utc": 1701305574,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcag25",
   "message": "Why are you even with him?",
   "created_utc": 1701305642,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcaibl",
   "message": "NTA, but WHY are you married to this person?",
   "created_utc": 1701305668,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcan8o",
   "message": "NTA, he's a coward.",
   "created_utc": 1701305728,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcarza",
   "message": "Not an ahole, but you have enabled this child for 20+ years, and to tolerate it even another week actually would force you to be TA for the rest of your life. If you plan on staying with him, you're going to have to be the heavy because he is absolutely not going to do it. He's proven it over and over and over again. That you continue to have to \"insert boundaries\" is actually a reflection on you at this point. Either end things or learn to live with it.",
   "created_utc": 1701305783,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcb9y0",
   "message": "Nta",
   "created_utc": 1701305998,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcbcvu",
   "message": "NTA! you reap what you sew. He sewed discontent so now that is what he is reaping.",
   "created_utc": 1701306035,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbccewt",
   "message": "When he goes to his family home, that's when you can  gather documents, and  find an apartment ( or is house on your name?  ) .   and just either move or get him started on his move out.",
   "created_utc": 1701306493,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbccgo5",
   "message": "How have you not divorced him yet",
   "created_utc": 1701306514,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbccyl1",
   "message": "Is he this non-confrontational with everyone or just family? I'm non-confrontational to a serious fault. It's bad. Though I would never blame anyone else for my choices. Im sorry he does that to you. I can't help being so non confrontational it leads to me not sticking up for myself very often. I can't help it and when I do it feels like I'm the a even if I know I'm not. I'm not trying to give him excuses. But it sounds like he has a problem. I know for me it had to do with my childhood. Your nta but I would strongly recommend individual therapy for him, marriage counseling if you stay, and family therapy for him and them should they be willing. God the 1st time I told my MIL she had no idea what she was talking about, so she needed to stop. I was terrified 😨 thankfully it was only by phone. I felt so guilty, very justified, relieved, and proud of myself. She doesn't talk to me anymore other than group chat, but I prefer it this way. I'm glad you were able to stand up for yourself it'd a long time coming be happy even if he isn't.",
   "created_utc": 1701306727,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcd7a8",
   "message": "Why are you still married to this man?",
   "created_utc": 1701306832,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcdauk",
   "message": "NTA, but he's repeatedly shown you for two whole decades that he has no intention of changing.\n\nIt may be time to consider leaving.",
   "created_utc": 1701306875,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcdwny",
   "message": "NTA I’ve noticed that you went to therapy. You also didn’t mention divorce. It’s very difficult being the only one trying to grow your marriage. I find that to be true for many married people. We are not perfect people. Saying that, you absolutely did the right thing. He has been very disrespectful of you and your thoughts on the subject. Divorce is not always the answer. This is a big deal, and I hope you would continue to go to therapy. There must have been strong feelings toward each other at some point. That can happen again. Good for you for making him have some personal responsibility.",
   "created_utc": 1701307136,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbce4ga",
   "message": "Your marriage has always been in jeopardy for the past 20 years. The question would be, are you planning on staying and taking the abuse for the next 20 years?",
   "created_utc": 1701307229,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbce63o",
   "message": "No you aren't. Sounds like a toxic relationship",
   "created_utc": 1701307248,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbce8xf",
   "message": "Oh you married a mama’s boy.  \n\nGood luck!",
   "created_utc": 1701307283,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcesqs",
   "message": "Your husband is an asshole when he throws you under the bus.  You are an asshole when you do it to him.  It doesn’t matter what the circumstances are, you don’t intentionally hurt someone your in a committed relationship with.  You should apologize and discuss the issues your having as a couple or it’s not gonna be a good life.",
   "created_utc": 1701307520,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbceyus",
   "message": "Nta- big hugs!!! You have a JustNoSO \u0026amp; JustNoMIL",
   "created_utc": 1701307593,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcf1p1",
   "message": "You're in marriage counseling. I think this hamster wheel is about to fall off. NTA. Good on you for clearing things up. The MIL is an AH too because unless there's an extreme situation, she has no right to yell at anyone or her mean like a child. Bring all of this up in counseling.",
   "created_utc": 1701307628,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcf7we",
   "message": "I do wonder why the heck you waited 20 years to set things straight with your in-laws. Also, you mentioned marriage counseling, sounds like it’s not working. Maybe because hubby doesn’t want to change things OR the counselor isn’t very good at their job. \nI’d suggest you get some private counseling to help you determine whether or not you truly want to continue in such a toxic relationship anymore.",
   "created_utc": 1701307701,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcf8so",
   "message": "NTA, but the real question is, WHY ARE YOU STILL IN THIS TOXIC MARRIAGE? The definition of insanity if doing the same thing over and over again and expecting a different result. Your husband sounds like a coward who has stood by while his mother abused you. What BS is that?! Girl, get OUT. Nothing is going to change.",
   "created_utc": 1701307711,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcfi9y",
   "message": "your husband is awful, sorry you put up with this for so long",
   "created_utc": 1701307822,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcfkxy",
   "message": "NTA but this marriage is over",
   "created_utc": 1701307853,
   "score": 1,
   "submission_id": "186zeie"
  },
  {
   "comment_id": "kbcfoef",
   "message": "My friend, you are not TA. I feel terrible for you. After 20 years, he still thinks of them as more family than you. He even pulled out all of the female stereotypes (angry, bitter, etc.) in order to belittle you. \n\nWhich was more harmful, does he think? Humiliating you for 20 years, or you sending honest messages to your own MIL?",
   "created_utc": 1701307893,
   "score": 1,
   "submission_id": "186zeie"
  }
 ]
}