{
 "submission_id": "186z1kk",
 "title": "AITA for giving my niece a “gift”?",
 "selftext": "\r  \nI (26F) have a sister (37F), she has 4 kids, including her oldest, her 13 year old daughter. I saw them all on Thanksgiving.\r  \n\r  \nMy 13 y/o niece is always getting in trouble at school for bullying in the form of “jokes”, she has made fun of other girl’s looks, making fun of LGBT students. My sister and her husband defend her as “the class clown” and says her teachers just don’t like her.\r  \n\r  \nI’m a teacher in a neighboring district, and I teach 7th and 8th grade. One of my 8th graders is also a “class clown”, the difference is he’s actually funny. He’s a popular and on the baseball team, I’ll admit sometimes his jokes get the class off topic, but if he ever becomes too much of a distraction, I and other teachers will threaten to email his coach and he’ll tune it down. He also, on occasion has made jokes about trans issues and racism, the difference is he makes them about transphobes and racists. This has included making jokes towards students who are bigots, including going after his own twin brother for being transphobic, which his parents weren’t happy about, as they aided with the transphobe.   His jokes are very memorable and sometimes I’ll even write them down after class is done because they’re good zingers.\r  \n\r  \nAfter constantly hearing my sister complaining about how her daughter’s school just punishes her for “being a class clown”, I decided to write some of these down and give them to my niece.\r  \n\r  \nI asked one of my friends who teaches elementary for a blank copy of a little book that her students use when they make their own poetry books.\r  \n\r  \nI wrote down the jokes and then on the cover put “jokes from an actual class clown”. \r  \n\r  \nAfter we ate on Thanksgiving l, I told my niece I had something for her. I gave her the book and she got mad at me, saying I was being a bad aunt. My sister also got mad at me, saying that I was being petty and that I was “siding with a bad school district and teachers”. She asked me to apologize to my niece but I refused. She’s now telling me I’m acting like a toddler. AITA?",
 "created_utc": 1701289327,
 "permalink": "/r/AITAH/comments/186z1kk/aita_for_giving_my_niece_a_gift/",
 "score": 213,
 "url": "https://www.reddit.com/r/AITAH/comments/186z1kk/aita_for_giving_my_niece_a_gift/",
 "comments": []
}