{
 "submission_id": "1872aea",
 "title": "AITAH for being upset because my wife didn't tell me that her parents were cousins?",
 "selftext": "I (M31) and my wife (F29) have been married for 4 years and have a 3-year-old son. Recently, we visited her brother, who lives in another city, and he showed me their family tree. That's when I discovered that her parents were first cousins. I was shocked and asked my wife later if that was true. She confirmed it and said it wasn't a secret, but it wasn't something she liked to discuss.\n\nI was very upset that she hadn't told me this before. I feel like she withheld important information about her family. I worry about our son potentially having a genetic problem because of this.\n\nShe says I'm overreacting. She says her parents love each other, and there's nothing wrong with their relationship. This statement also caught me off guard. I don't know what to think. I still love my wife, but I can't forget what I discovered and what she said. She tells me to get over it and move on. AITAH?",
 "created_utc": 1701297634,
 "permalink": "/r/AITAH/comments/1872aea/aitah_for_being_upset_because_my_wife_didnt_tell/",
 "score": 123,
 "url": "https://www.reddit.com/r/AITAH/comments/1872aea/aitah_for_being_upset_because_my_wife_didnt_tell/",
 "comments": [
  {
   "comment_id": "kbcl2nn",
   "message": "I’m a genetic counselor - when closely related people have a child, THEIR offspring (ie your wife) are at an increased risk for autosomal recessive conditions. As long as you and your wife are not related to each other, your offspring are not at any increased genetic risk.",
   "created_utc": 1701310146,
   "score": 94,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbd1nkp",
   "message": "I came home to my roommates, drawing all over a massive whiteboard and yelling at each other.  I was interested and asked what I had missed.  Roommate A was going to a wedding this weekend and wanted to bang this chick he knew from his family.  Roommate B was trying to help him figure out if he was related to said chick and if he could bang her.  I walk out of the room to do some stuff. After the commotion settled down, I asked roommate B what was decided.  He shows me this convoluted picture and says the chick is his first cousin.... I'm confused why it took over an hour and a large drawing to figure this out, but apparently, roommate A went to bed angry.",
   "created_utc": 1701317551,
   "score": 161,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbc76lv",
   "message": "INFO: what do you want to change here?",
   "created_utc": 1701304257,
   "score": 112,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbbvto7",
   "message": "While it’s correct that cousin marriages can result in genetic problems, it’s generally an issue with significant inbreeding. Till recently, inter-family marriages were the norm rather than the exception around the world. To avoid genetic issues, you need some external genes (kinda like a herd of cows!). Are your wife’s grandparents also cousins? Otherwise, your kids are likely fine (plus they got your genes as well). \n\nShe probably did not talk about it as it’s currently culturally not acceptable in certain countries (while ok in others and in about 18 US states as well)",
   "created_utc": 1701299482,
   "score": 95,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbbzns2",
   "message": "NTA: however, marrying your first cousin is legal in a lot of states as long as they aren't double first cousins. For those who don't know what a double first cousins are...it is the offspring produced when a set of siblings marry another set of siblings. The offspring are genetically close to being siblings.",
   "created_utc": 1701301088,
   "score": 119,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcgsdd",
   "message": "Look man, you already have a kid. Probably best to box that info up and forget about it. NTA GL",
   "created_utc": 1701308361,
   "score": 61,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcocio",
   "message": "First cousins share 12 % of their DNA. One set of first cousins isn’t going to do anything to genetics. It wasn’t uncommon a couple hundred years ago.",
   "created_utc": 1701311526,
   "score": 140,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcz0qb",
   "message": "A coworker of mine said her grandparents were first cousins.....she said very common in Italy when people lived in small towns and ran out of people to date that weren't related.",
   "created_utc": 1701316260,
   "score": 22,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbbxazf",
   "message": "You are NTA, you can ask a physician if you are concerned but it’s true if your wife is health all should be fine. \n\nThe relationship is normalized for her, and probably within her extended family as well. She now’s it’s not socially acceptable but it’s not anything she can change or has any control over. \n\nAsk yourself Does her parent’s actions that took place before she was born affect your relationship with her?",
   "created_utc": 1701300095,
   "score": 89,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbbv01m",
   "message": "I mean NTA but at this point like can you understand why she doesn’t tell people? Also, I think she somewhat has to feel okay with their relationship because what’s the alternative you want her to say? She’s an abomination? I feel it’s easier for her to just go down that route. \n\nI’d be more upset about the lie but I’d also probably have some compassion. What’s she going to do? I knew a girl from school whose parents were cousins and when it got out…man the bullying was awful. I’d bury it deep too.",
   "created_utc": 1701299145,
   "score": 77,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcllnl",
   "message": "If your son has a genetic disorder because of your wife’s parents then 1: you already know by this time most likely. And 2: the entire human race prolly would’ve gone extinct already if that was what all it took.",
   "created_utc": 1701310369,
   "score": 38,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcaf64",
   "message": "NAH but you are overreacting. There will be nothing wrong with your son because of it. Due to so much inbreeding over multiple generations causing a plethora of issues, the campaign against it went hard on inducing fear of inbreeding altogether. First cousins whose prior family aren't also inbreeding don't cause anymore risk of these issues than 2 people from families who've lived in the same small town for a few generations. \n\nNow, if your wife had also married a first cousin, the risks to their children would increase. And, if those children also married first cousins, then you're likely to start seeing some flippers.",
   "created_utc": 1701305632,
   "score": 1,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcnkwb",
   "message": "There is essentially no increased risk for your son. While inbreeding can cause genetic issues, it’s the amount of repetition and proximity of relation that determines the risk. Your son has a single pair of first cousins for one set of grandparents so is his risk is negligible. Even your wife’s risk was not substantial enough for many places to prohibit her parents’ marriage. Marriages like your in laws were incredibly common throughout history without problems, as opposed to royal families in which close inbreeding happened within the same few family’s for many generations resulting in debilitating genetic conditions.\n\nWhile I can understand you feeling like your wife hid something important from you, she’s the one who had to grow up knowing that if people found out about her parents, she’d suffer for it. She said it wasn’t a secret, and that’s true, given she didn’t try to hide it from you, but she does have a lifetime of good reasons not to want to talk about this.",
   "created_utc": 1701311205,
   "score": 64,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbbthcm",
   "message": "INFO what is the genetic concern at this point? I thought it mostly effected the immediate children.",
   "created_utc": 1701298535,
   "score": 179,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcyyek",
   "message": "The entirety of the population in the state of Alabama would have 3 eyeballs if you had anything real to worry about.",
   "created_utc": 1701316231,
   "score": 27,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbd52v4",
   "message": "My great-grandparents were first cousins. They lived in different countries, met until they were in their early twenties, fell in love. I get that it is weird, but no one in our family had/has any severe health or genetic issues. They had four kids, all of them lived well past 80, one over 90. Next two generations are perfectly healthy. I am no expert, but I can share how it has been in my family.",
   "created_utc": 1701319316,
   "score": 12,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbclk7w",
   "message": "It's not something that she can control, so I see why she wouldn't bring it up. I do think you're overreacting, because it could also be a cause of shame for her -- flipping out on her won't help anything now.  \n\nAs far as genetics, her family tree would have to be more of \"ladder\" with siblings marrying each other and fathers/daughters or uncles/nieces etc for it to affect her kids.\n\nIt has historically been common for wealthy and powerful families to marry inter-family to keep it all centralized. It takes generations of extreme inbreeding for it to negatively affect the offspring.",
   "created_utc": 1701310353,
   "score": 51,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcokdo",
   "message": "NAH. This seems like something she might possibly be embarrassed by or it legitimately just didn’t come up. \n\nUnless her family has been inbreeding for generations your son should be fine. One isolated incident of cousins marrying isn’t enough to cause issues. It’s when it happens several generations in a row that it becomes a problem.",
   "created_utc": 1701311618,
   "score": 29,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcvcr5",
   "message": "NAH the risk of birth defects for kids of first cousins is pretty small, the issue becomes more prominent when you have those children continue to marry cousins. Like with hemophilia and the British royal family. But marriage between first cousins isn’t even illegal in Europe or Canada. I don’t blame you for being taken aback but I also don’t blame your wife either - remember that if anyone it would have been her with the birth defect not your child.",
   "created_utc": 1701314543,
   "score": 9,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbd2tov",
   "message": "But your child isn’t at higher risk because of it",
   "created_utc": 1701318142,
   "score": 10,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbdz3zr",
   "message": "\u0026gt;. I worry about our son potentially having a genetic problem because of this.\n\nYou also could just google if this is actually a possibility. YTA",
   "created_utc": 1701340819,
   "score": 16,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbdzdyi",
   "message": "I’m a genetic counselor - when closely related people have a child, THEIR offspring (ie your wife) are at an increased risk for autosomal recessive conditions. As long as you and your wife are not related to each other, your offspring are not at any increased genetic risk.",
   "created_utc": 1701341040,
   "score": 16,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcscrx",
   "message": "Don’t worry about genetic problems. There was a post on here a few weeks ago where a genetic counselor responded. They said it actually takes several generations of first cousins marrying before genetic problems happen. They used Queen Victoria and her family as an example. After all the inter-marrying, in her family, the only issue was hemophilia. So don’t stress about this. My paternal great grand parents were first cousins. There were no genetic issues passed down. They were from the same tiny village in Germany, before they immigrated to the US in 1914. Coming from that tiny village, there were probably lots of family members marrying each other.",
   "created_utc": 1701313220,
   "score": 8,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbdc7iy",
   "message": "So my great grandfather got married, had a bunch of kids, abducted his oldest daughter, married her with a different last name and had a bunch more kids. My grandfather’s older brothers and sisters were also his aunts and uncles. Weird, gross stuff happens in families sometimes.\n\nNAH. You’re allowed to be upset. But it isn’t a big deal because she can’t control who her parents are, and because there’s no risk to your children (unless you’re also first cousins?).",
   "created_utc": 1701323396,
   "score": 7,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbdjx5w",
   "message": "Sweet home Alabama,  not the asshole also your wife really isn't either, it is embarrassing knowing your family tree is like a telephone pole",
   "created_utc": 1701328602,
   "score": 8,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbd9s34",
   "message": "It’s actually not uncommon in some cultures for their to be marriages and arranged marriages between cousins. Is it possible that she is not upset or concerned because, not only is it all she has ever known and her family, but it is more common in the community she was raised in?",
   "created_utc": 1701321939,
   "score": 6,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbdyh48",
   "message": "I think you are overreacting. It's not like it's your wife's fault or that there's anything she can do about it. There's also nothing you can do. You are both not genetically related so your son will be fine. Just let it go.",
   "created_utc": 1701340319,
   "score": 8,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbe93l8",
   "message": "Yes, you're overreacting.  Vastly.  Science has long shown that first cousins have no more risk of producing offspring with genetic anomalies than couples who aren't related.",
   "created_utc": 1701347632,
   "score": 6,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbeg29y",
   "message": "The offspring of first cousin couples have a [4-6% risk](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3419292/) of autosomal recessive genetic disorders, compared to 3% of the general population. \n\nThat's not a huge increase. For context, it's comparable to the risk among children born to mums over 40. \n\nWould you also be angry if your wife hadn't mentioned that her mum was 42 when she was born? \n\nThe risk to her is minimal; your offspring won't have any elevated genetic risk. So I don't think this is even a case of lying by omission or withholding information - it was such a non-issue it just didn't occur to her to mention it.",
   "created_utc": 1701351248,
   "score": 7,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbfwttn",
   "message": "in AP biology i learned that first cousins are not genetically similar enough to have inbreeding problems.  first cousins are essentially as genetically dissimilar as any two random people.",
   "created_utc": 1701371423,
   "score": 9,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcktwm",
   "message": "NTA, get your son started in banjo classes early though and take advantage of the situation",
   "created_utc": 1701310043,
   "score": 50,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbdzetd",
   "message": "Genetic diversity is not going to be affected by a first cousins relationship, it is a consequence of generations of inter family blood lines. Many parts of the world, relationships between first degree cousins are not even considered incest and that might not be something that your wife can control anyhow. You blame her for not anticipating your feelings about something that might not be as important to her or her family as it is for you.",
   "created_utc": 1701341059,
   "score": 8,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbepzrp",
   "message": "YTA\n\nYou somehow know that inbreeding can lead to defects but also somehow dont know that outcrossing even once pretty much negates the risk, unless your family has the same defective gene.\n\nShe probably didn't tell you because it didn't seem that important. Cousins also are not as at risk as sibling inbreeding. Usually it takes a few generations of repeated inbreeding for issues to arrive. Its also weird to me that you would throw your love for your wife away over uninformed fears for your sons health. Particularly when he's already been born and clearly doesn't have an immediately obvious defect.",
   "created_utc": 1701355628,
   "score": 6,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbfr6hn",
   "message": "Yes yta. Because you don't know shit and are acting out anyway.\n\nBrush up on recessive genes and the basics before judging your wife.",
   "created_utc": 1701369384,
   "score": 7,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbft8nt",
   "message": "As someone with a degree in Genetics, if one parent has an inbreeding coefficient of \u0026gt;0, and you do an outcross (not related), the offspring will have an inbreeding coefficient of 0.\n\nOr, unless you are related to your wife, your kid is not inbred.\n\nInhale, exhale, your kid is fine.",
   "created_utc": 1701370132,
   "score": 6,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcdlg2",
   "message": "You and your wife are unrelated, correct?\n\nThen your children will be completely unaffected by any inbreeding on your wife's side of the family. The only person in your family whose health might be affected is your wife and her siblings.\n\nNearly all the commercial corn in the US is produced from hybrid seed whose immediate progenitors were severely inbred. The hybrid generation (like your children) are not themselves inbred and can be very healthy. Same principles apply between humans and corn lol.\n\nSource; Some would say that i'm WAY over-educated ;-)",
   "created_utc": 1701307003,
   "score": 39,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbg2wad",
   "message": "Unless you're related to tour wife as well, it won't affect your kids. YTA for not knowing biology",
   "created_utc": 1701373625,
   "score": 5,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbg3yur",
   "message": "YTA.  You're overreacting.  Get over it and move on.",
   "created_utc": 1701374010,
   "score": 4,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbge053",
   "message": "Cousin relationships are taboo because of the increased risk of genetic diseases being passed down to offspring. \n\nSince your wife has no genetic issue, then there's no issue with the relationship.",
   "created_utc": 1701377655,
   "score": 5,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbczesc",
   "message": "Bro, nearly all of civilisation was ruled for thousands and thousands of years by cousins who married cousins for *generations*. Your kid will be fine.",
   "created_utc": 1701316447,
   "score": 13,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbd1vzi",
   "message": "Your reaction totally justifies why she doesn’t talk about it. The person that’s supposed to always be on her side just came and asked a group of strangers how he should react. You’re NTA for being upset (gut reaction), but let it go dude. There’s really nothing more to be gained. Also, don’t tell your kids.",
   "created_utc": 1701317669,
   "score": 14,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcnuxa",
   "message": "Your reaction is exactly why she doesn't discuss this information with people. You justified her reason for not telling you.\n\nThe way I see it is this is about her parents, not her. She doesn't need to tell you about her parents secrets, regardless of what they are. I understand this is shocking information to learn but there was no reason to be upset since this is clearly a sensitive subject. For that reason alone I'm going to say YTA",
   "created_utc": 1701311323,
   "score": 38,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbconb1",
   "message": "YTA. Why do you care? Your wife is obviously healthy and it has little bearing on your child.",
   "created_utc": 1701311652,
   "score": 27,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbctgn2",
   "message": "you: freaking out about something that has no direct impact on your life while questioning why she never told you \n\nalso you: WHY WOULDNT YOU TELL ME THIS YOU FREAK YOUR FAMILY IS SICK!!!!!\n\nKinda makes it easy for us to see why she doesnt like to tell people. Youre definitely overreacting, its not like she can change it now.",
   "created_utc": 1701313696,
   "score": 36,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbce73h",
   "message": "Jeff Foxworthy said \"If your family tree doesn't fork, you might be a redneck\".",
   "created_utc": 1701307260,
   "score": 13,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcrpk0",
   "message": "NTA, I get it, but it's also not what you're working it up in your mind to be. First of all,  if your child were to have problems, you would have seen it by now. The risk was higher with their children. Your child is their grandchild.\n\n Second, it's legal in many states because it's not that much riskier. \n\nThird, it's only within the last few generations that marrying your cousin was considered at oddity. It was not at all uncommon, and many people have something similar in their family tree if you go up high enough.",
   "created_utc": 1701312943,
   "score": 8,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbd57sp",
   "message": "YTA for being dumb enough to think that this will have any likelihood of affecting your kids.",
   "created_utc": 1701319389,
   "score": 9,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbe6ry4",
   "message": "Your child is fine.  You're being dramatic.",
   "created_utc": 1701346261,
   "score": 6,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbe0vko",
   "message": "There are several different types of genetic disorders.  The understanding of genetic diseases is evolving all the time. \n\nSome require only one mutated gene, and that's that, genetic disease happens. Others require two, one inherited from mom, and one from dad. Others are found in the X-chromosome, and can manifest differently in men and women who inherited the mutation. A select few diseases will manifest differently (and are even recognized as distinct syndromes, with markedly different symptoms) depending if the mutated gene was provided by the mother or the father, but is is the same gene, found on the same location inside the same chromosome... Even more rare diseases require multiple mutated genes to be present (not just one, or a pair of matching mutated genes) for the disease to happen. A handful of diseases are transmitted through mitochondrial DNA, which means it can (usually) just be inherited through the maternal line. I am not even touching on genetic conditions caused by  whole extra/missing chromosomes, or large pieces of them. And there are a few more possibilities I am forgetting just now, I am sure. \n\nNow,  The concern with cousins having children together is the type of diseases that require two faulty copies of the same gene. This requires for the two parents to be descended from one single ancestor who passed on a mutated gene to both, and requires for this two parents to pass on this mutation to their child. Their chances of having a kid with that genetic disorder is 25%. They have a 50% chance of producing a baby carrying the gene (but most likely, being a healthy carrier) and a 25% chance of having a healthy kid. This doesn't require generations of inbreeding ( but generations of inbreeding may increase the chances).\n\nI concede that you didn't know of these subtleties, and of course you are allowed to have your feelings, but now that you know, you do not have to worry about chances of any children you may have with your wife being in danger of passing on a genetic disorder to your child because her parents are cousins.",
   "created_utc": 1701342198,
   "score": 5,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbee86j",
   "message": "YATH but that isn't totally on you, it's the area you were brought up in drumming into your head that it is bad. Cousin marriages are actually allowed in many parts of the world and the reaction it has in the US these days is purely due to one guy. Governor George Nixon Biggs. Before that, it wasn't a problem. You can go read up\n\n[https://en.wikipedia.org/wiki/Cousin\\_marriage\\_law\\_in\\_the\\_United\\_States](https://en.wikipedia.org/wiki/Cousin_marriage_law_in_the_United_States)\n\nOnce you do, you'll realize that the values you were taught were not \"natural\" but were forced upon you by a politician out to convert everyone to his beliefs. That should help you get over it.",
   "created_utc": 1701350364,
   "score": 3,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbeik37",
   "message": "Learning the family tree is bamboo isn't great \n\nBut nothing to do, and since you're not related no harm",
   "created_utc": 1701352408,
   "score": 4,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbeng1q",
   "message": "Homie before your cry about this a very simple google search tells you that your kid has no increased chances of genetic disfunction. You need to get over it and move on because the information doesnt effect you unless you wanna throw a fit about it.",
   "created_utc": 1701354557,
   "score": 2,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbeolfz",
   "message": "How is all this any of your business?",
   "created_utc": 1701355045,
   "score": 6,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kber8li",
   "message": "One generation of kissing cousins is not going to create a line of Hapsburgs. You're way over reacting.",
   "created_utc": 1701356137,
   "score": 4,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbeub3y",
   "message": "That's.... Not how that works. It's not gonna be your kids at risk. Half your genetics, half hers, no overlap as long as she doesn't have any problems.",
   "created_utc": 1701357359,
   "score": 3,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbezq7t",
   "message": "YTA, get over it and move on.",
   "created_utc": 1701359425,
   "score": 3,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbf1wlz",
   "message": "You are overreacting.\n\nFirst cousins are actually fairly genetically distinct, especially if each cousin's outside parent came from a different genetic lineage, enough so that the odds of any genetic issues within the first generation are extremely slim.\n\nYou would be shocked if you knew how many small towns in the US are just full of people that are directly related to one another and don't even know it.",
   "created_utc": 1701360236,
   "score": 3,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbfa5ng",
   "message": "YTA\n\nAs long as you and your wife are not related your future child will be fine.\n\nRegarding her parents... eh its weird but I will treat that as a weird in law thing that you learn to ignore.",
   "created_utc": 1701363263,
   "score": 5,
   "submission_id": "1872aea"
  },
  {
   "comment_id": "kbcnxel",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1872aea"
  }
 ]
}