{
 "submission_id": "187bzhy",
 "title": "AITAH for breaking up with my girlfriend over a comment she made?",
 "selftext": " (originally posted in AITA, but was removed because it involved a relationship.)\n\nMy girlfriend stayed the night last night, and at around 2 am, my son (13) woke me up, telling me he had sleep paralysis. He looked absolutely terrified and was breathing really heavily. Since I wasn’t sure she’d be comfortable with a teenager in the bed, I decided to go back to his room. \n\nHe flat out refused to go back, but after convincing her, agreed as long as he didn’t have to face the closet. I decided to stay the night in his room when I felt how bad he was shaking. He apologized profusely in the morning and wouldn’t stop, no matter how many times I told him not to be. \n\nTonight, as we were getting ready for bed, my girlfriend said something along the lines of how she hoped he wouldn’t steal me again. I awkwardly laughed before asking her what she said; she told me she felt disrespected as she was a guest in the house. We had a small back-and-forth argument, where she told me he’s not a baby. I told her how fucking terrifying sleep paralysis can be and that at least I went to his room instead, so she didn’t have to share a bed with a half-naked teenager. I told her to get out when she told me that I should’ve just sat with him until he fell asleep, then came back to bed. \t\n\nShe threatened it was over if I made her leave, so I replied, \"Okay.” She left, only taking her phone, so I packed the rest in a box and put it on the front porch, hiding it to make sure it wasn’t stolen. \n\nShe called me probably about thirty minutes ago, apologizing in tears and how she didn’t wanna be alone. I told her she disrespected me and my child, and that was unforgivable. She cried harder and begged, saying she didn’t want to be lonely. I hung up. \n\nI’ve been trying to fall asleep since, but I’m starting to feel bad. I’m not sure if it’s just my conscience, as it’s easy to make me feel bad, or she’s just manipulating me, but anything to do with my son is a line you don’t cross. AITA?",
 "created_utc": 1701325891,
 "permalink": "/r/AITAH/comments/187bzhy/aitah_for_breaking_up_with_my_girlfriend_over_a/",
 "score": 70,
 "url": "https://www.reddit.com/r/AITAH/comments/187bzhy/aitah_for_breaking_up_with_my_girlfriend_over_a/",
 "comments": []
}