{
 "submission_id": "187bc1b",
 "title": "WIBTAH for thinking about calling off my engagement because my fiancé lied to his family about us having kids?",
 "selftext": "My fiancé (23) and I (22) plan to get married next year. Despite having a set date, there are still many things to organize, but I'm considering postponing or even canceling the wedding. For additional context, when we started our relationship, I told him that I had always been certain I didn't want to have children. In my country, which is not the United States, a woman wanting to undergo surgery faces many obstacles, and in most cases, doctors refuse to perform the procedure. This is aside from the complications women experience, unlike men who undergo vasectomies.\n\nWhen I told him about not wanting children, he mentioned he wasn't considering them either. However, when I asked about vasectomy, he admitted hesitating in case he changed his mind. Understanding his perspective, we dropped the topic. We continued dating for three more years, and during a vacation four months ago, he proposed on the beach. We decided to marry on our first-date anniversary. I revisited the child topic, anticipating marital pressures, and he confirmed our shared stance. We shared the news with my parents, who congratulated us joyfully.\n\nThe issue arose when we visited his parents. He's the youngest with two older brothers and one older sister, all married with children. During the dinner we had to celebrate our visit, we announced our engagement, and everyone congratulated us. Most conversations revolved around wedding preparations, the venue, the guest list, and so on. In that moment, his sister asked us how many children we were planning to have (keep in mind that my fiancé had asked me in the past to avoid stating outright that we wouldn't have children in front of his parents, knowing it could lead to arguments). I recalled his request but wasn't sure how to respond this time. We typically said we weren't certain about the topic yet, but I didn't want to lie. Considering the significant step we were taking, I felt we needed to be honest to prevent future issues. My fiancé stepped in and mentioned we would have only one child. His father and one of his brothers started teasing him for wanting just one, suggesting we should aim for at least three like the rest, so we could experience the joy of a large family like everyone else. He laughed along with them, making jokes about wanting more if I didn't make it difficult for him.\n\nAt first, I planned to discuss it with him after dinner, but after the last comment, I left my plate, stood up, and asked him to join me in the backyard. It took him a moment, but he followed, avoiding direct eye contact, and commented that my sudden departure was a bit rude. When I questioned him about what he had said, he gave evasive responses, reiterating the desire to avoid arguments. I insisted that we should be truthful now to prevent future problems, but he resisted. I told him I wouldn't go along with the lie. As I was about to leave, he revealed he had changed his mind about having children, wanting several. He had been thinking about it for months before proposing. I reminded him of our previous conversation, and he admitted he hoped to convince me after marriage.\n\nI told him I wouldn't change my mind, and out of nowhere, he started insulting me, calling me a stupid, arrogant, and selfish person for wanting to deprive him of the \"best experience in the world.\" I didn't expect him to treat me that way, so instead of responding, I went back to his family and revealed the whole truth, stating that I would never change my mind. I then packed my bags and left. Now I'm at a hotel, and after talking to my family, who told me they had crossed a line, I decided I needed to vent.\n\nI was always upfront with him about my desires and asked for honesty. Not only did he lie, but he also insulted me when he realized he couldn't manipulate me. That's why I'm considering canceling everything and ending the relationship.\nWIBTAH?",
 "created_utc": 1701323700,
 "permalink": "/r/AITAH/comments/187bc1b/wibtah_for_thinking_about_calling_off_my/",
 "score": 168,
 "url": "https://www.reddit.com/r/AITAH/comments/187bc1b/wibtah_for_thinking_about_calling_off_my/",
 "comments": []
}