{
 "submission_id": "187b3q4",
 "title": "My Girlfriend's (F32) parents are blaming me (M28) for her suicide and I've started to feel like maybe its my fault.",
 "selftext": "Trigger warning: Suicide\n\nI'm in a really bad frame of mind right now and everything in my head just feels like a haze but I'd try my best to explain what happened.\n\nI met my girlfriend a few years after I finished med school. I didn't know many people in the locality back then as I had just shifted. So I joined a gardening group on the weekends which she was a part of. We came from very different backgrounds but we hit off almost instantly. However, it took over a year of being friends before we decided to be together. Just one random evening when we were sipping coffee at my place, she just looked dead in my eyes and said, \"I think I love you\". I've repeated that moment in my head every night and it still makes me cry.\n\nThe first few months were the best time of my life. We were both shy people individually, but together, we were just wild. We went to karaoke bars and long road trips on weekends to unknown towns. We lived in motels and drunk under the stars. We went rock climbing (which none of us had done before and got so exhausted in the first half an hour). Every month we'd save up money to go to a new fancy restaurant and try a new cuisine. I thought we'd travel the world someday. We had a list of places we'd go, experiences we'd share. On our first anniversary, I made her a catalogue of all our photos with tiny sticky notes about the moment they were taken, along with a wonderful set of plants. They are still in our balcony. She took so much care of them. \n\nThe problem began when I asked her about her parents. She was really loved by my family and had spent a couple holidays together too, so naturally I wanted to meet her folks. She was really hesitant about the topic so I didn't push much. I would have never brought it up if I thought they weren't on good terms but she talked to her mother almost every day so I didn't expect an issue.\n\nOne day, she randomly said that we were spending thanks giving at her parent's place. It was an odd timing to mention it that but I was okay with that. My mother always told me to never go empty handed at people's place so I bought something small for her younger sister (16) and some sweets. When we went, the atmosphere was really tense. Nobody really spoke much to me. They just looked at me as if I was some modern art piece they were trying to decode. Still, I went about the evening as I planned, tryna strike a convo or something. In the middle of the dinner, her mother took her aside and said, \"It's all fun right now but the second you have kids, he's going to pack his bags and leave.\" I heard it because the house was really silent. Then, her father literally told me on my face, \"Are your people really okay with this?\" I asked him what he meant and he awkwardly said, \"You know about you marrying a white girl?\"\n\nI don't remember much else of the evening but when we were in the car, my girlfriend blew up at me. I knew her anger came because she was stressed and upset so I let her calm down naturally. The next morning she said, she didn't want to go to work as she was feeling really tired. I don't know why but maybe because i was still hurt, I told her its okay and left myself. When I came home she was no more. I don't want to go in the details of it but it was bad. I thought that I'd take her to the hospital and she'd recover and then, I'd hold her so tight and shoo off all her demons. They said she was dead on arrival.\n\nMy world has fallen apart since then. I think the last straw was her funeral. Her entire family didn't even look at me. They let her colleagues and even her exes (all white guys) speak but I had to ask thrice before they let me say my last goodbyes. Only her sister even came up to me and said sorry and poor girl was herself such a mess. During the speech, her mother said, \"My daughter didn't kill herself. She was murdered by this cruel world\" and glared at me.\n\nI think I might have caused this. Maybe I should have stayed back that day. Maybe I should have asked her about her past, her traumas, her pains and seeked therapy instead of just enjoying shallow little things. I should have thought more. I don't know. The kitchen knife looks really tempting sometimes but I have a wonderfully supportive family and the thought of my nieces and nephews makes me stop. I'm trying to get stuff back together but the guilt won't let me.\n\nTLDR: Girlfriend's parents were really racist to me on thanksgiving and the next day my girlfriend killed herself. So, they all think it's my fault.",
 "created_utc": 1701322914,
 "permalink": "/r/AITAH/comments/187b3q4/my_girlfriends_f32_parents_are_blaming_me_m28_for/",
 "score": 225,
 "url": "https://www.reddit.com/r/AITAH/comments/187b3q4/my_girlfriends_f32_parents_are_blaming_me_m28_for/",
 "comments": []
}