{
 "submission_id": "187gds0",
 "title": "AITAH for telling my friend she should have seen her husband and her friend's affair coming?",
 "selftext": "Background: I (35f) was friends with Julia (35f) and Alex (34f). We have been friends since college but our tiny group expanded from 3 to 7. This story is about Julia and Alex. 2 year ago, we all came to know that Alex was having an affair with a married man. Her excuse was that he was unhappy that is why he is seeking outside validation. I advised her to stop it and this is not healthy because he will not leave his wife. She didn't listen. Rather accused me of being a bad friend. All of my friends were against it but to them it was \"not my monkey, not my circus\". So, I contacted the wife and told her everything. I knew who the wife was because the married man once introduced us. And everyone in my friend group turned against me. Especially Julia because she thinks I betrayed my friends.\n\nShe stopped talking to me because if I can betray a close friend of mine then I can betray her as well. Alex was heartbroken because the married man decided he wanted to work on his marriage so he broke things off with Alex. Julia was with Alex and I was shunned from our group.\n\nWhat happened now: Few weeks ago, I got a call from Julia. She was crying and telling me that Alex betrayed her. She has been having an affair with her husband. And that she is heartbroken because she has supported her and this is how she repays her. Even our friend group is divided. I was angry at that moment. I mean she ignored me for 2 years. Bad mouthed me. Said that I was wrong. I literally warned her that Alex was toxic. So I told her that she should have expected this from Alex. I mean did she really think she will show loyalty towards you when she already did something immoral before? I knew the moment she made excuses of having an affair with a married man, her morals were compromised. I am not religious but I do have minimum respect towards other people and their feelings. And suffice to say I am not surprised she went after her husband.\n\nI do think I went too far. Because some of my other friends said I was too harsh on her. Even if what I said was the truth I should have been more sensitive because she is going through a divorce. I do sympathize with Julia but I also feel like as friends sometimes we need to tell them the harsh truth. I know I said all of this when I was angry. But a part of me says she needed to hear that. Was I wrong?",
 "created_utc": 1701343640,
 "permalink": "/r/AITAH/comments/187gds0/aitah_for_telling_my_friend_she_should_have_seen/",
 "score": 148,
 "url": "https://www.reddit.com/r/AITAH/comments/187gds0/aitah_for_telling_my_friend_she_should_have_seen/",
 "comments": []
}