{
 "submission_id": "187g4mc",
 "title": "AITAH for believing my daughter over a “grown man”?",
 "selftext": "I don’t know if i watch too many crime shows or if I’m just paranoid so I’ve come here to ask. Last week I made chicken gnocchi soup. When it was almost done I started helping my daughter with a school project. She got us both a bowl and a few seconds later my bf  runs into the room with a bowl and tells me to eat the bowl he has. I told him it was all the same and he insisted that he wanted mine because it had more chicken. Thinking back now I don’t know how he would know that considering my daughter dished it out. My daughter took the bowl he gave me and said she would eat it. He yanked it out of hand and said “no it’s for mom”. \n\n\nI took the bowl and he went to the living room. I continued doing my daughter's project and told her not to eat the soup. 20ish minutes later I walked into the kitchen to pour the soups out and he was still eating his. He asked why we didn’t eat any and I said the cat got into it while we were waiting for it to cool down. He screamed “WHAT!? Was it your bowl !?! Cats can’t eat that!?”. I told him it was only a lick but he has been stressed out watching the cat like a hawk, obsessive even. His reaction was very weird. \n\n\n*These \"accidents\" all happened before the soup incident over the span of 6 months. It wasn't one after another in a short period of time.* Since then my emergency money has gone missing. I keep money hidden just in case. I lost my older sister because she wasn’t able to escape a dangerous situation and I literally swore on her grave I would never be in that position. After the soup incident I went to get my money and it was gone. It was hidden and I changed the location every few months. I asked my daughter if maybe she found it and that if she took it I wouldn’t be mad because I knew she couldn’t have spent it. She said no. A few hours later she tells me she forgot but the other day her and my bf got pulled over and she saw my pink wallet in his glove box. I did not tell her which wallet it was in or that it was in a wallet. \n\n\nI decided to ask him if he found it by accident. He asked me why I was hiding a large amount of money, “you know you could never leave me” and laughed. (He has never said anything like that before).  I told him it was for my daughters Christmas. He said no he didn’t find the money but could use his credit card for gifts. I didn’t tell him about my daughter seeing my wallet in his car. Now here are a few other things that have happened in the past few months that seemed random at the time but now they don’t. \n\n\nI have a severe allergy to latex. One day we were about to have sex and I glanced at the mirror we have by our bed and saw the condom wrapper was a different color. I stopped him because it wasn’t latex free and he said it was a mistake and just an older one he had. We have been dating for over 2 years and he knows how serious my allergy is. My epipen that I keep in my room is missing and I didn’t realize it. **I didn't realize it was missing until I was searching for my money.**\n\n\nAnother odd thing is one day he was following me down the stairs while I was carrying laundry and he kicked the back of my leg and I fell. He said he slipped but the stairs are wood and he was wearing his steel toe boots. At the time I thought it was an accident. \n\n\nAm I overthinking this? My anxiety has been at an all time high. Do I watch too much true crime? Here is why I think I might be the asshole. We have a good relationship. He loves my daughter like she is his. We split all shared bills and we both pull our own weight around the apartment. We don’t fight. He has never so much as raised his voice at me. We are paycheck to paycheck but bills are paid. \n\n\n I thought about going to my moms house for a few days and asking him when I get there when I’m safe about the money but I don’t have money to do that now. She is on a fixed income and can't help. I feel stupid for being scared. Last night I decided to check his car for my wallet and he caught me. I asked him for my money back and he tried playing dumb. I told him my daughter saw it there. He told me she was lying. I told him I never told her about the money or what wallet. He said he was a grown man and kids lie all the time. I asked him once more for my money and he said “I’m not giving you money to leave me”. I waited until he was in the shower to grab my cat and my daughter and we left. \n\n\n\nI can’t take my cat with us to a shelter and the DV shelters are full. I was able to get us a night at a cheap motel. This exact situation is why I had money saved. I did everything right and now I’m screwed. I feel like I just blew up my entire life.\n\n*Yes I'm using a burner account and reading all the comments that I can.*",
 "created_utc": 1701342650,
 "permalink": "/r/AITAH/comments/187g4mc/aitah_for_believing_my_daughter_over_a_grown_man/",
 "score": 46,
 "url": "https://www.reddit.com/r/AITAH/comments/187g4mc/aitah_for_believing_my_daughter_over_a_grown_man/",
 "comments": [
  {
   "comment_id": "kbe4cw1",
   "message": "I would not be at all surprised if he took out a life insurance policy on you.",
   "created_utc": 1701344704,
   "score": 125,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe2rnu",
   "message": "RUN IMMEDIATELY",
   "created_utc": 1701343597,
   "score": 61,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe8k6d",
   "message": "NTA \nThe fact alone that he says things like 'I'm not giving you money to you can leave me' and 'you'll never be able to leave me' is enough to not feel safe with him.\nNot feeling safe is like the biggest reason to leave someone. The latex incident is just another flag, the soup incident would be grounds for a heated discussion that I wouldn't let up untill you get to the bottom of it. \n\nLeave, don't look back. \nIf you do still have the card, and he ok'd buying presents, buy a present, return it for cash?\nBut I would just be done with him, and not give him any possible reason to come after you and your daughter. \n\nFind a shelter. Stay with your mom, and be independent ASAP. She doesn't have to pay for anything, but just give you a safe place to sleep.\nMaybe she knows someone else where you can crash untill you get your plan together?\n\nIf you have a job, please do your best to keep it. Find something more suitable in the long run, if possible. \n\nHow much money did he steal from you?",
   "created_utc": 1701347319,
   "score": 122,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe6itp",
   "message": "NTA but file a police report. He stole your money. It may just be your word against his but a written trail of his mess will help you get a restraining order.",
   "created_utc": 1701346102,
   "score": 103,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe4v23",
   "message": "NTA and oh god run away. I mean, the red flags are so obvious here it almost seems made up, like a telenovela script. If this is real, run away from that murderer you live with.",
   "created_utc": 1701345039,
   "score": 72,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe7sh5",
   "message": "Once is an anomaly, twice is a coincidence, three times is a pattern. Document EVERYTHING. Get your money and your papers and valuables to someone you trust and  get yourself and your daughter out safely. You are not being paranoid and you need to trust your instincts.",
   "created_utc": 1701346874,
   "score": 188,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe50kp",
   "message": "N.T.A.\nYou were smart to trust your gut and run, safe men are not concerned whether you have money to leave them. This almost sounds like he has a special interest in your daughter and is playing the part of the perfect boyfriend so that you do not start expressing your concerns/misgivings about him to your mom/family who could block his adoption process of your daughter after your \"accidental\" passing. He is actively and flippantly risking your life, often in the most sneaky/backhanded ways (hiding the epipen and emergency fund, hoping you wouldnt notice until it was too late) and showing a considerable lack of concern for your own wellbeing. (If my boyfriend had kicked me down the stairs he wouldve either scrambled to catch me or flown down those damn stairs to make sure i was okay)\n\nPlease take the time tonight to write out in bullet points every questionable event/close call you can remember (including the ones listed above) with approximate dates so you\na) have a retrospect timeline to share with any counsellors/therapists/other professionals who may be helping you navigate the aftermath of this\nb) can see for yourself the list of reasons why youll never go back and stop questioning your decision \n\nStay safe momma ❤️ you did the right thing and your sister would be proud of you",
   "created_utc": 1701345139,
   "score": 39,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe6im2",
   "message": "Can you call local vets? Many veterinary clinics support the purple leash project, which is a charity that aims to increase the number of shelters that take pets. In some states, veterinarians are also mandated reporters for certain circumstances, so I would double-check your state and make sure you are in a safe situation. You can call around vet offices and see if any will take your cat in for boarding at a reduced rate. \n\nHere is a list of pet friendly shelters. \n\nhttps://saftprogram.org/pet-friendly-domestic-violence-shelters/\n\nI hope your situation improves and you can get to friends/family/somewhere safe.",
   "created_utc": 1701346098,
   "score": 132,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe3cw9",
   "message": "You’re not paranoid. He’s trying to hurt you. How much money did he take? If he’s offered his credit card for you to go shopping, go straight to an ATM and take the money you lost out of his card. Use that to get away.",
   "created_utc": 1701344015,
   "score": 28,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe3gmo",
   "message": "I'm 100% sure he has been trying to kill you. A 100%",
   "created_utc": 1701344085,
   "score": 105,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe8h5o",
   "message": "How about you file a complaint against him for stealing your money and also mention the attempts of killing you. Tell the police you don't feel safe around him and want him out of the house. Is the house yours or you rent it? Whose name is it on the lease in case it's rented? You can get him evicted and have a restraining order against him. Stay safe and don't go back to your place alone. He won't let you leave if you go back.",
   "created_utc": 1701347271,
   "score": 98,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe3ixs",
   "message": "RUN! This man sounds like he is trying to kill you! Get you and your daughter away from him immediately. Borrow enough money to get to your Moms or wherever. You promised on your sisters grave you would never allow yourself to be put in this situation. You are there, you need to keep your promise and RUN, fast.",
   "created_utc": 1701344129,
   "score": 172,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbecpo4",
   "message": "NTA\n\nHe said, \"I’m not giving you money to leave me\". That sounds like he admitted to taking the money so you can't leave.\n\nAs for having a secret money stash try to get another bank account, and use your mom's address. That way if you meet someone else and they're like this guy they can't steal the money.",
   "created_utc": 1701349596,
   "score": 81,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe6jva",
   "message": "You’re not paranoid. True crime is real crime because men legit kill women everyday. You’re not the only one in danger. Your daughter is too. Protect yourself and your daughter. \n\nAs a single mother, you and her are more of a target for abusive men, unfortunately. If my husband ever died or something happened between us, I’d never date a man again. No way in hell knowing the statistics. \n\nI’m sorry you’re going through this. It’s hard.",
   "created_utc": 1701346119,
   "score": 19,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe8zr9",
   "message": "Yo I hope this ain't real because you just kinda threw out the right details that basically says what it is. \n\nHe's trying to kill you\n\nNah I'm for real if it is exactly as you've said he is trying to kill you. For whatever reason, no matter how short or farsighted, that man wants you to suffer. Some people like watching others suffer, it's a fucked up thing. Emergency money is gone, attempting poisoning, the soup deal (could a been just enough of something to put you down for a while) the quotes you quoted. \n\nLike I said, this is either fake or very real. Fake because the perfect details. Real because if you're asking and this is what your brain is telling you, then you already have all the dots you just don't want to connect them. For real show a family member you trust this exact post like it's from a stranger and see what they say",
   "created_utc": 1701347572,
   "score": 136,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbehuke",
   "message": "NTA\n\nAnd there's tons of advice already on getting to safety, but here's a reminder I didn't see so far:\n\nLock down your and your daughter's credit. Your mom's too if you had her SS# anywhere accessible. And check the history and report anything suspicious. He took your money, and your epi pen, its not a stretch to think he took your credit too.",
   "created_utc": 1701352084,
   "score": 65,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbejwdx",
   "message": "I’ve been lied to by grown men FAR more often than I’ve been lied to by children.",
   "created_utc": 1701353018,
   "score": 58,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbea63n",
   "message": "he probably poisoned the soup, stole your money so youd be his prisoner, tried to kill you with anaphalxsis and kicked you down the stairs also trying to kill you, excuses in court for your impending murder would read, \"your young daughter cooked the food so it was an accident\", \"he borrowed your money and had every intention to give it back but you died\", \"latex allergy death was an honest mistake and an accident and he never touched your epipen and no one can prove otherwise\" as for kicking you down the stairs \"you fell and no way to prove otherwise\" pretty easy to plant some kids toys on the stairs and say you fell on that,\nassuming this is real, run for the hills and dont look back, no contact, just dissapear before he makes you dissapear",
   "created_utc": 1701348233,
   "score": 107,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeayty",
   "message": "You didn't blow up your life, you saved your life.",
   "created_utc": 1701348668,
   "score": 46,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe9s5p",
   "message": "He probably has watched his share of crime shows also. He is educated. You may be screwed in the moment but  you are alive. \n\nQ: The number one indicator of whether or not an abuser will hurt/kill the partner??? \n\nA: Ask the women what she feels in her heart. If she senses danger, she is mostly right.",
   "created_utc": 1701348019,
   "score": 78,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbef9yc",
   "message": "get out!\n\n1. money gone\n2. allergy to latex\n3. him kicking you\n4. Soup\n\ni feel he has cameras in the room because if you change spots every month how he went looking for it?\n\nInfor: how has he been acting around your daughter? i feel like he put in sleeping pills in there and maybe rape your daughter while you are asleep and you cant say anything since you fell asleep.",
   "created_utc": 1701350872,
   "score": 72,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe9o28",
   "message": "NTA you need to go to the domestic abuse shelter and ask for an escort to get all your stuff back. With someone else there he will be forced to play nice or he will break and get arrested. Get your important info and see if you can find your money, although by now it is probably deposited in his bank account.",
   "created_utc": 1701347955,
   "score": 31,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe6iwx",
   "message": "Ummm. Leave now !!! You are not overreacting he’s up to something",
   "created_utc": 1701346103,
   "score": 27,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbehw5u",
   "message": "NTA but you should  have put the money in a separate bank and bank account in only your name. In the future do that. I would tell everyone in your life about all the accidents/incidents that have been happening. I would post to Social media about the stair incident and say \"Do You think my ex is trying to kill me?\" This way if something happens to you, The police know who to look for. \n\n\u0026amp;#x200B;\n\nCheck this [article to see if you can figure out if he took out a life insurance policy on you](https://www.guardianlife.com/how-to-find-a-policy).  \n\n\n I would contact the police and report the theft.",
   "created_utc": 1701352105,
   "score": 29,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeapsp",
   "message": "The fact you are doubting yourself is terrifying on it's own. Please just do anything you can to get away from him.",
   "created_utc": 1701348534,
   "score": 23,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe7rd4",
   "message": "NTA. Is there any way to find out if there are any life insurrance on your name, you really should do that! This is actually freaking me out as this is exactly my worst fear and now I fear for you. Go to the police open a record and tell everything in case you need it later. Good luck to you, never look back.",
   "created_utc": 1701346856,
   "score": 16,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeasj6",
   "message": "[https://www.thehotline.org/](https://www.thehotline.org/) The National Domestic Violence Hotline offers free confidential support. You can call, text, or chat with them through their website. They have resources about identifying abuse, making a safety plan, and connecting people with local resources.",
   "created_utc": 1701348575,
   "score": 17,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe7at9",
   "message": "Girl how many red flags are you going to ignore before he actually tries kills you and will most likely almost succeed  before you leave him what we are trying to tell  you IS LEAVE HIM NOW",
   "created_utc": 1701346584,
   "score": 70,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbec46k",
   "message": "Call the police, and a lawyer.\n\nYou could be able to keep your home and he leave, get a restraining order etc. Or just stay gone if the lawyer and cops say that’s that.\n\nNever put yourself in harms way, when in doubt play it safe. You did the right thing.\n\nMy Dad always said kids don’t lie. Unless it’s to keep themself out of trouble over a broken vase or something dumb, my family doesn’t buy into this kids lie BS. It’s worked for us.\n\nIn my life alone I know two women shot dead by a bf. It happens irl, not just Netflix.",
   "created_utc": 1701349284,
   "score": 14,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbed2gn",
   "message": "NTA I don't even watch those shows and it sounds like he out to get you. \n\nFile a police report for the stolen money and I think you can file for stolen RX meds, then take that to pharmacy for replacement on emergency/theft basis. If not, ask pharmacy for \"vacation supply\" it's available for meds once a year since they know people travel extended periods of time and can't renew meds on schedule. Be safe.",
   "created_utc": 1701349778,
   "score": 15,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbedjvy",
   "message": "He’s trying to kill you and stage it as an accident, OP.\n\nI’m glad you’re out of there, you absolutely need to file a a police report and ask them to check his search histories. And report the money theft. Tell them he may have set up a new life insurance policy on you.\n\nCheck with animal shelters, they can assist with finding a foster situation for your cat so you and your daughter can go to a women’s shelter.\n\nIf you have the ability to do so, get a new phone because he may have installed tracking software on your current phone. Check your car and bags/clothing for air tags, etc. Try to make sure there’s no way for him to track you.\n\nYour mother may be on a fixed income, but is there anyone else who might me able to lend a hand to help you get away? Be safe, OP.",
   "created_utc": 1701350024,
   "score": 13,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe8j78",
   "message": "Always trust your gut. Write down every detail and go to the police dept. You don’t have proof but you can file a report and request a restraining order. You may be able to charge him with theft based on your daughter’s testimony. Let him know you’ve done so. If he is after insurance money, which it sounds like, that will stop him. Don’t respond to him but record and save every message. NTA",
   "created_utc": 1701347304,
   "score": 13,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe9atr",
   "message": "I've been thinking about this and and perhaps he also has life insurance on you? Although I know you said you all live pay check to pay check, but I wonder..",
   "created_utc": 1701347746,
   "score": 10,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeiax0",
   "message": "“I’m not giving you money to leave me.” He already answered your question. He took the money, lied about it, and tried to blame your daughter.\n\nThat alone is enough to break up with him.\n\nEverything else does indeed sound like he might intend you harm. You’re a mother. This isn’t about you. Your senses are on high alert that this man intends you harm. Leave.\n\n1. Can kitty stay with your mother?\n2. Find an emergency place to stay for a couple of weeks. Do you have any friends or other relatives you could stay with? If not, do you have anyone who could take your cat for a few weeks while you stay at a shelter?\n3. File a police report about the stolen money\n4. Have a police officer meet you at your place to protect you while you pack up the rest of your things, and also have the cop make him open the glove box to see if your wallet is still there\n5. Go to the shelter to get information on all services and benefits available to you\n6. Get a new epipen. If you find the one your bf took, don’t use it. He might have tampered with it. Don’t eat any food from the house and get new toothpaste.\n\nWhat the heck had he put in that soup?\n\nDo not under any circumstances go back to him. He might say anything and then once he has you back he might hurt you.",
   "created_utc": 1701352292,
   "score": 26,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbebmjh",
   "message": "NTA tbh I think your daughter saved your life",
   "created_utc": 1701349025,
   "score": 12,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe6ybe",
   "message": "NTA. Run and do not go back, ever. That name is trying to get rid of you. Keep your wits about you.. and remember the promise you made",
   "created_utc": 1701346371,
   "score": 11,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbebxt5",
   "message": "Holy hell why is this man still around you in your child.\n\nWhatever it takes get you and your child and definitely your cat the hell away from him.\n\nYou know the money didn't go missing You know the money was stolen.\n\nYou know these things weren't accidents you know something bad is going on here.\n\nIf you wait any longer you will have run out of road.\n\nFix this today get help from relatives friends anybody you can and do whatever it takes to fix it but my God fix it if you want to stay alive.  It is not worth taking the risk after what you've described the risk is much higher than you seem to realise.\n\nPlease update us once you your daughter and cat are somewhere safe away from him.",
   "created_utc": 1701349190,
   "score": 10,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe3bac",
   "message": "“My boyfriend is trying to murder me, AITAH?”  Come the fuck on.  If this is real, you are lucky to be alive. \n\nNTA, definitely the DumbA**",
   "created_utc": 1701343984,
   "score": 69,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe62on",
   "message": "Use his credit card to withdraw money from an ATM and run. Write down all the instances you think he was trying to harm you, and odd things like your purse in his car. And go to your mums. It’s not worth staying and risking your life. Think of your daughter. Maybe talk to a lawyer or the police for advice. Good luck!",
   "created_utc": 1701345823,
   "score": 29,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbe967e",
   "message": "Yikes, the police won't take it seriously because lack of evidence, but please just go make a statement anyway. Having a paper trail will help you in case things escalate. Also let him know you did that, because he might have a life insurance policy on you and if you've made this statement at a police station that would become problematic if he tries to cash it. The police may not care, but life insurance companies will.",
   "created_utc": 1701347673,
   "score": 20,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeeshy",
   "message": "I watch a lot of true crime too... For this exact reason. All of the odd but \"random\" things you mentioned, don't really seem that random anymore now that you've laid it all out. Something is going on and I would be absolutely cautious. Better to be paranoid and be wrong than to not trust your gut and be wrong and pay the consequences.",
   "created_utc": 1701350639,
   "score": 11,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbebghh",
   "message": "Girl you do not have a good relationship. That man is trying to seriously harm you, he's stealing from you, lying to you.\nPlease go to your mums, don't stay there.",
   "created_utc": 1701348934,
   "score": 10,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeeywl",
   "message": "I’m so sorry this is happening! For my own mental health, I’m going to label this as “a creative writing exercise” because it’s terrifying.\n\nIn a good relationship, you should be able to be honest about having “get away” money just in case things go bad. I know my husband would support me if I wanted a stashed away amount. He would also do everything possible for me to never need it. \n\nHe has said in the past that”if I start acting like my father, leave me. If you start feeling trapped, and talking about it doesn’t help, leave me. If you ever feel unsafe around me, leave me.” The same is implied for him, I know if something drastic happened and my personality changed, MY OWN PARENTS would help him get out. \n\nIn the future, please know that having to HIDE THE EXISTENCE of your emergency $$ is a red flag all on its own. A supportive partner will understand and respect your fear and precautions. Someone who thinks you will never need to leave them will always allow you the means to do so.",
   "created_utc": 1701350725,
   "score": 9,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbefgtp",
   "message": "From what you wrote it sounds like your sister died/was killed in a domestic violence incident.  So Regardless of your mom being on a fixed income, I would bet money that she would still offer you help and place to stay.  \n\nStop worrying about inconveniencing others and focus on saving your life and protecting your daughters welfare!!!\n\nNTA",
   "created_utc": 1701350964,
   "score": 9,
   "submission_id": "187g4mc"
  },
  {
   "comment_id": "kbeojht",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "187g4mc"
  }
 ]
}