{
 "submission_id": "187h61z",
 "title": "AITA for feeling destroyed my mother stole and damaged my wedding dress",
 "selftext": "AITA for feeling destroyed my mother stole and damaged my wedding dress \n\n\nI was 16 F and my parents kicked me out. I had grabbed a few bags and left to live with my best friend 16 M and his parents at the time.\n\n Previously to be being kicked out i was given my grandmother's weeding dress which I wanted to wear as my own one day.\n\nOnce I was kicked out my mother and sister raided my room for what they wanted before i came back to collect the rest of my things, I did notice this at the time but didn't have the mental energy to fight about it. The wedding dress was one of those items  taken from me in 2021. She used the excuse that the ppl I was staying with left their house unlocked and she didn't want it stolen or damaged so she was going to get it cleaned and boxed, and she stated \"you shouldn't have it, it's a family heirloom\".\n\nToday I got it back, after 2 years of fighting my mother. The threat of police and courts caused her too finally fold  she doesn't want legal trouble as it would make her perfect image crumble infront of her. I had to go to my grandmother to get a recording of her stating it was mine. Keep in mind my grandmother is 92 and has bad memory, yet she remembered that 2 years ago she gave it to me and remembers the entire day in detail.  So anyway after all of that which I've left so so much out, I open the box and it's ruined.  There is thousands of dollars worth of damage. She handed me the box with the dress after going on a rant about how she spoke to grandma and anyone in the family who wants to use it should be allowed as that's what grandma gave it to me for was to be it's keeper and lend it out when wanted, FALSE, in the recording I ask \" what did you do with your wedding dress it's okay if you don't remember\" she says \" what do you mean, I gave it to you\" . I told my grandmother 'I will be wearing this as MY wedding dress\" and she states \" I wish to see it on you again one day\" as she most likely won't live to see the day I'm married. No where in the conversation does she mention the fact I must lend it out to others infact she affirms its mine and mine alone.  \n\nI have told my sister of AFTER I've worn the dress at MY wedding I might lend it to her.\n\nThis dress drama started because she wanted to clean and keep the dress from being damaged or stolen only to steal the dress form me clean it and damage it beyond belief.\n\n My whole family including my partner believe I'm being over dramatic in how angry and betrayed I feel.  However I feel  I have full right to be angry as she stole and damaged MY dress, then tried to turn it into some kind of communal wedding dress after it has specifically been given to ME. I called her and she sounded like she was trying not to laugh saying \" well that is the risk you take when getting an old wedding dress dry cleaned\" .\n\n I believe it's 100% her responsibility to fix so I will be demanding she gets it repaired at her cost.\n\nI'm so tired of being invalided but I need to know AITA",
 "created_utc": 1701346528,
 "permalink": "/r/AITAH/comments/187h61z/aita_for_feeling_destroyed_my_mother_stole_and/",
 "score": 233,
 "url": "https://www.reddit.com/r/AITAH/comments/187h61z/aita_for_feeling_destroyed_my_mother_stole_and/",
 "comments": []
}