{
 "submission_id": "187j4nt",
 "title": "WIBTAH for telling my mom to either pay me a large chunk of money or get out of my life permanently?",
 "selftext": "Throwaway account since everyone knows my main. \n\n\nI (F32) have resented my mom for my entire life. I am the youngest of 3. My dad moved out when I was 12 and died 7 years later. My mom moved out to live with her new boyfriend (now husband) when I was 15. She bought groceries occasionally for the house and paid the mortgage and everything, but I was living on my own. I got a job to help support myself but it was minimum wage/after school hours and weekends only. By this point, both my older sisters were in college and working and didn’t do much to intervene other than occasionally tell her that she needed to move back home and raise me. \n\n\nShe was shocked when I started being a bitch to her and put me in therapy thinking that would somehow solve it? I eventually got into college…I had to steal her tax returns and w-2s to fill out the fafsa by myself since she refused to give it to me and they don’t let you opt out of providing parent info unless you’re a certain age, married, or have children you support. I paid the first semester after financial aid with money I have left from my jobs and moved across the country…where I almost immediately got pregnant. \n\n\nBetween being pregnant and my untreated ADHD killing any chance I had of succeeding, I moved back, got a job, and have been struggling ever since. \n\n\nMy husband and I now have 2 kids, one on the way, stable jobs, and own a house. But everything is still hard. We’ve relied on credit cards at times, and we don’t have much in the way of savings.\n\n\nOver the last 15 years, she provided immeasurable financial support to my oldest sister. Some of the stuff includes:\n\n\n- 4 cars since she was a junior in highschool til now \n\n- paid her student loans for the last 10ish years\n\n-bankruptcy costs $?\n\n-divorce lawyer 5k\n\n-weight loss surgery 8k\n\n-skin removal surgery 10k\n\n-condo 169k\n\n-half of childcare/daycare costs for twins for 4 years ($?)\n\n- half ex-wife’s alcohol rehab because the insurance covered one was sketchy or something (7k)\n\n- new appliances (front load washer/dryer, dishwasher)\n\n-wedding $?\n\n-misc monthly expenses for 13 years\n\n-probably more I don’t know about or forgot\n\n\n\nOur relationship has been civil. I’ve brought my kids to her house on weekends to visit and she acts like she didn’t take the first life boat out and leave me behind to drown. She tries to hug me and makes jokes like “oh was that painful??”when I don’t reciprocate. \n\n\nBetween the hormones of being pregnant, having a huge number of unexpected expenses I can barely pay for, and my sister trying to tell me our mother feels guilty for everything, I’m absolutely at my emotional breaking point and am close to flat out saying “cut me a check for 100k or don’t try to contact me ever again.” My oldest sister doesn’t give a shit about anything but my middle sister thinks I need to forgive and forget and move on and that it would hurt my mom too much because of how guilty she already feels. \n\nSo WIBTAH?",
 "created_utc": 1701352670,
 "permalink": "/r/AITAH/comments/187j4nt/wibtah_for_telling_my_mom_to_either_pay_me_a/",
 "score": 195,
 "url": "https://www.reddit.com/r/AITAH/comments/187j4nt/wibtah_for_telling_my_mom_to_either_pay_me_a/",
 "comments": [
  {
   "comment_id": "kbeolbm",
   "message": "Just cut her amd the rest out they are pos that basically abandoned u fuck them should have reported her when u were young tell a social worker come to the house show your alone",
   "created_utc": 1701355044,
   "score": 116,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbemp7o",
   "message": "Might as well. \n\nAnd if she pays up (she won't of course, I expect you realise that, I assume this is more about sending a message), cut her off anyway. \n\nNTA",
   "created_utc": 1701354242,
   "score": 105,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbeyf4o",
   "message": "Don’t take a penny. Live your life and never ever speak to her again.",
   "created_utc": 1701358936,
   "score": 78,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf3uso",
   "message": "While I don’t think you’re an AH at all. You can’t really be demanding money, either cut her out of your life or don’t.",
   "created_utc": 1701360959,
   "score": 44,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf44l1",
   "message": "Want to cut her out of your life? Forget the money. \n\nWant to overcome crippling resentment. Go to therapy with your mother and tell her everything that has hurt you in a safe setting. \n\nYour resentment is affecting your life, and the life of your family.",
   "created_utc": 1701361062,
   "score": 36,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgfy4g",
   "message": "I didn’t read every single comment, but OP, you definitely had it crazy tough… no doubt, but…\n\n\nDid you ever say, “ Hey mom, you have given sis, like, four cars, a condo, tuition, etc.   and I feel like Ive been raising myself since I was 15… you know what?  Do you think maybe I could get some help like that?… I have $23,412.23 in credit card debt… it would move a mountain off my chest to get out from under that. What do you say? Does that sound reasonable?”\n\nI just really get where there is ZERO communication here. And everyone is shouting to go NC… I do not get it.",
   "created_utc": 1701378352,
   "score": 27,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfz9e9",
   "message": "I get the resentment. But the money problems and pregnancy are on you. You were an adult then. \n\nNTA but the 100k thing isn’t going to happen.",
   "created_utc": 1701372305,
   "score": 36,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbeke4l",
   "message": "Do not take any money from her,  this will put her in a position to manipulate you.   She will always have something on you to hold over your head.   You do not have to be relatives with someone you would not ever be friends with so stop trying.",
   "created_utc": 1701353236,
   "score": 44,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf552t",
   "message": "Your mom does NOT feel guilty. If she really understood what she did, she wouldn’t gaslight you now. \n\nYou can ask for money, but I seriously doubt you will get it. Go NC with your mother and your sisters. None of them have a clue what your life was like.",
   "created_utc": 1701361432,
   "score": 27,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbejg99",
   "message": "100k is quite cheap compared to what your sister got. Absolutely tell her that and go no contact until she pays up. NTA",
   "created_utc": 1701352813,
   "score": 49,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgfm8g",
   "message": "I feel badly that you have had to struggle since your were a kid with a disinterested mom, but why are you adding another child to your household when you’re struggling to support the two you already have? \n\nAt some point, you need to quit blaming your mom for your circumstances and start taking accountability for the poor choices you’ve made as an adult.",
   "created_utc": 1701378236,
   "score": 5,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf8az2",
   "message": "Two things going on here\n\nNTA for cutting her out of your life, that's your right \n\nBut YWBTA for the extortion..... Basically threatening to cut her off from her grandkids if she doesn't pay you money.....",
   "created_utc": 1701362591,
   "score": 20,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfcrxk",
   "message": "I don’t understand why you’ve been in contact with her at all. She’s dragging you down, cut her and your sister off for good.",
   "created_utc": 1701364222,
   "score": 11,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgbaaw",
   "message": "why not just ASK for SOME money like a couple grand to get you by.  Say nothing about cutting off if no money appears. JUST ASK FOR SOME. I do . I pay it back. then I ask again.",
   "created_utc": 1701376678,
   "score": 6,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfo7yq",
   "message": "I wouldn't demand money. I would just cut contact.",
   "created_utc": 1701368329,
   "score": 4,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbguabc",
   "message": "And stop having kids if you can’t afford them! Cut your mom off\nI think you are an AH for having more kids than you can afford!",
   "created_utc": 1701383760,
   "score": 4,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf1f33",
   "message": "I wouldn’t take money from her unless it was life or death as a matter of pride. If you want to go no contact, do it. But YWBTA if you give her that kind of ultimatum. I hope you want to be better than her.",
   "created_utc": 1701360052,
   "score": 7,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbek2cv",
   "message": "NTA. Wow, your mom is a piece of work! You’re more patient than I would be. Tell her your terms and stil to them. Good luck",
   "created_utc": 1701353092,
   "score": 13,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg2cq8",
   "message": "Hey, not for nothing, but if you don't have money, don't have more kids. LIke that's a pretty easy maths problem to solve.\n\nSure your mother was an asshole, abandoned you and apparently favours your sisters. If you ask for money she might give you some she might not. You might simply never have asked for money while your sister's have. Maybe just ask for some money to help, maybe she's been willing this entire time I don't know. If you demand 100k or be cut off chances are you'll be cut off.\n\nBut her helping or not isn't relevant to your particular financial situation. Be more responsible over your own life.\n\nESH in general but YTA for considering extorting your mother first before you know, talking to her like an adult and also an asshole for having more kids you can't afford. Also going to college and immediately getting pregnant and blaming that and ADHD for failing when you can treat ADHD and you didn't have to get or stay pregnant, those are your own decisions and you're pretty quickly dismissing responsibility for them.",
   "created_utc": 1701373426,
   "score": 9,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgptr7",
   "message": "So it is your moms fault you got prego and have ADHD? If money is such an issue maybe stop having kids.  It is not a parents job to support adult kids. If my kids told me to give them money or they would never talk to me again I would tell them not to let the door hit them in the ass on the way out. Grow up, take responsibilty for yourself.",
   "created_utc": 1701382059,
   "score": 6,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg9yv4",
   "message": "YTA.\n\nRead a book on reproduction and birth control. Your mom isn't the one cranking out kids she can't afford.",
   "created_utc": 1701376198,
   "score": 8,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfxy6k",
   "message": "NTA, but id just skip that part and just stop talking to her, id rather not feel petty.   \n\n\ni too have a mom who basically was only my mother when she was single. she switched teams any time she found a new man. sometimes id be taken with other times id just get the grocery deliveries while basically moved into the guys house with a suitcase. lot of resentment towards my mother, dont really consider her a person anymore shes just kinda a hollow shell that gets programmed by whatever dude is currently in her life.  i dont even know who she is as a person really. feel like ive just seen a bunch of different masks.",
   "created_utc": 1701371830,
   "score": 3,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg39fy",
   "message": "If she is feeling so guilty, why hasn’t she been supporting you without you asking already? It’s all lies. I would say go for it and cut her off completely when she says no.",
   "created_utc": 1701373755,
   "score": 3,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh44ay",
   "message": "Just do the normal thing and make regular posts about the challenges of being a good mom when you had a shitty one. “Remembering how my mom chose her boyfriend over me and abandon me while I was still in high school - #ShitMomsAreForever #SheHasGuiltBecauseSheWasTerrible” and ignore her.",
   "created_utc": 1701387725,
   "score": 3,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgnr5r",
   "message": "I’m surprised by these responses, yes YTA. Your mom sounds awful and I’m sorry you went through that and I’m sorry she continues to not be there for you. That said, you shouldn’t be pregnant when you can’t afford your existing kids. You got pregnant and left school by your own choice. All of those things had nothing to do with your mom. You are angry and bitter and blaming her. I get why, but it’s probably past time to own those choices that you made. Your childhood was tough, your relationship with your mom is tough. Your adulthood and your financial struggles are issues you created and worsen with your choices. Cut off your mom if you like, do not engage in extortion, especially with your kids as your bargaining chip. That’s pretty gross.\n\nEdit: and before anyone says I don’t get how rough it is, I was a homeless teen. Would’ve loved having someone pay the mortgage and let me stay in the house. Believe me, I get it. I don’t speak to my mom, I recommend it.",
   "created_utc": 1701381292,
   "score": 5,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbffyco",
   "message": "ESH. Why are you still having kids you can’t afford? It sounds like you went right down your mom’s path. How did taking care of yourself at 15 result in you being so irresponsible now?\n\nYour mom sucks that’s true. But now you want her money for your mistakes. If you demand money, you have to deal with her. Your choice.",
   "created_utc": 1701365368,
   "score": 12,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf1s27",
   "message": "YWBTAH.\n\nIt is horribly unfair, but you are not entitled to her money.\n\nThat being said, it doesn't sound like she and your sisters are positive influences in your life at all.   It doesn't sound like there is a future in any of the relationships.   Why do you keep comparing your life to theirs?    \n\nYour mother chose to favor one child over.   That is unfair, but life isn't fair.   Since it sounds like they don't bring anything good to your life, I would agree with you that you should probably cut contact with all of them.   \n\nUnfortunately, what she does with her money is still her business and you don't have any claim to it.",
   "created_utc": 1701360189,
   "score": 9,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfhnen",
   "message": "Why are you having more kids if you are already at the breaking point? \n\nESH\n\nShe shouldn't have abandoned you as a teenager and you should not have been having babies before you were done with college. \n\nNow that they are here, she doesn't owe you a damn thing as they were your choice.  \n\nFeel free to cut her off if it would make you feel better, but it isn't going to make that kid you are gestating any less expensive.",
   "created_utc": 1701365975,
   "score": 11,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfa96j",
   "message": "Are you serious? \n\nMaybe stop having fucking kids???? Live in your means???? Ya, your mom sucks, so do a lot of moms.  But ain't nobody yelling give me 100k or that's it!!!! The entitlement! I also had 0 help from my parents, I paid for everything on my own and I'm damn proud of that. \n\nJfc",
   "created_utc": 1701363298,
   "score": 13,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh3ybe",
   "message": "ESH and YWBTAH.\n\nNo amount of money is going to resolve your mother’s absence when you were young. It sounds like you just want to “hit her where it hurts” - in the wallet - as revenge. It won’t make you feel better.\n\nYou’re a full grown adult with a husband. It’s up to you \u0026amp; your husband to navigate your financial situation. Talk to a financial advisor. Act like the grown up you never had and make a serious plan. \n\nYour sister is right - you need to accept what happened to you and either try to actively resolve those feelings with your mother either in individual or family therapy, go no or low contact, or risk passing on generational trauma to your own kids because you’ve been so hung up on what she did to you that you can’t solve your current day financial problems. \n\nUnless your mother is WEALTHY with cold, hard cash then she is likely racking up tons of debt that your sisters will end up having to pay back after she dies. If this is the case, consider it a blessing that she hasn’t provided you with money.",
   "created_utc": 1701387657,
   "score": 2,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf8khw",
   "message": "YTA.  Have you asked for support like a normal adult?  You're not entitled to any of your mom's money.  While it is unfair that your oldest sister has received so much support, it doesn't give you the right to make such a crass demand.  If you want to go no-contact or low-contact with your mother, go right ahead.  Just don't try to turn it into some kind of shakedown for money.",
   "created_utc": 1701362687,
   "score": 10,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfabg3",
   "message": "ESH",
   "created_utc": 1701363321,
   "score": 3,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfjnch",
   "message": "Yeah, you would. You'd be saying that this is all the relationship means to you - a financial transaction.\n\nIf that's REALLY the case, be honest with yourself. It's time to simply cut her off and forget she exists. That way there's not that constant pain of the reminder of how she's hurt you.\n\nIf you actually DO want more than that from her, it's time to face up to that. Do what you can to communicate all the years of hurt in a straightforward way and explain just exactly what you are thinking and feeling. You can share your post here with her as a starting point.\n\nThat WILL hurt. It will be painful for both of you. Hopefully it can lead to a much more honest and straightforward relationship from now on. It might not though.\n\nYou might also consider seeing a therapist to help with all the accumulated hurt. They can help you sort through what you really need and want and go for it in a healthy way.",
   "created_utc": 1701366686,
   "score": 2,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfx21e",
   "message": "NTA. Do it. But stick to your word. I’d have cut her off years ago.",
   "created_utc": 1701371506,
   "score": 2,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgw0rp",
   "message": "Your mom was an AH years ago for leaving and I get the resentment, but the rest of that story is all your choices.",
   "created_utc": 1701384445,
   "score": 2,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbf4xcz",
   "message": "Nope\n\n\nNo reason to care if you hurt her or not. She knows she hurts you. She just doesn't care. I refuse to believe parents who treat their children differently to this extent don't know what they are doing. \n\nIf you feel you need more equality in order to continue your relationship with her, then by all means, demand it. Doesn't sound like you'll be missing out on much if she says no. You might be better.",
   "created_utc": 1701361352,
   "score": 2,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfigsx",
   "message": "YTA. Stop having kids you can't afford.",
   "created_utc": 1701366267,
   "score": 7,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfi628",
   "message": "NTA   Next time she asks, \"Oh, was that painful?\" Tell her, \"Yes, when I was 15 and could have used one you chose not to be there to give them. No reason to do so now.\"  If she wants forgiveness, tell her when she starts treating you the same as your sisters. Then let her figure it out like she left you to figure it out.",
   "created_utc": 1701366161,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgbkm3",
   "message": "Get some money out of it.\nWhy not? If she can give them so much money, she can spend money on her youngest.\nParents should stop having a golden child.\n\nNTA",
   "created_utc": 1701376784,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbggtbo",
   "message": "NTA take her money then cut her off anyway",
   "created_utc": 1701378658,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgmz3w",
   "message": "YTA for trying to extort money from her. She sounds awful so just cut her out of your life.",
   "created_utc": 1701381008,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh2abq",
   "message": "Don’t expect a mother when you view her as a bank.",
   "created_utc": 1701386965,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbemijc",
   "message": "An adult demanding money from their parents?  yeah, YWBTA",
   "created_utc": 1701354162,
   "score": 0,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfvcbw",
   "message": "Yta",
   "created_utc": 1701370885,
   "score": 0,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbfx7em",
   "message": "NTA. What she did to you was abusive and neglectful. I don't know why you'd even give her a chance to be in your life since she abandoned you as a minor child.\n\nCut her off. Give the ultimatum if you want, and if she does cough up, take it and cut her off anyway. Compensation for years of neglect, and now guilting and gaslighting.",
   "created_utc": 1701371561,
   "score": 0,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbelqq0",
   "message": "You only want money and I doubt seriously that you’ll get any. It wouldn’t matter how much your mother gave you or what she did, you’d still treat her like garbage because you feel entitled to, and no doubt you’re upset and probably envious of how your sisters were treated. I’d suggest finding a good local therapist and getting help that way and coming to terms with your emotions about your family. I won’t say YTA but…there is a fine line.  Take responsibility for your own life and actions.",
   "created_utc": 1701353829,
   "score": 247,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbftgyx",
   "message": "So you want your mom to buy you? Will it all be forgiven if she pays up? \n\nYTA for demanding money for access.\nNTA for cutting her off altogether.  \n\nHow about you just ask your mom for help?",
   "created_utc": 1701370213,
   "score": 0,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgw3hr",
   "message": "NTA - Maybe ask your mother to pay for childcare for 4 years and pay for you to go back to college? Might help turn your life around if you can get a decent paying job after a education.",
   "created_utc": 1701384476,
   "score": 0,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg54nb",
   "message": "Nope\n\nNo matter how guilty she feels, that won't solve anything, it won't erase the years of abuse and neglect inflicted on you, your sister doesn't understand anything that's why she's on her side that's why it's so easy for her to give the line of forgive and forget, because she was not the one who was there and she didn't give a damn about being there either.\nHer feeling of guilt doesn't erase everything she did to you, her guilt doesn't help you at all and neither does her attitude, so no, but I don't recommend asking for the money, just cuther out of your life.",
   "created_utc": 1701374435,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg5ksl",
   "message": "Ask her this:   \n\"*Do you think* **OLDER SISTER** *will ever be around you when you are weak, broke, and on you way to assisted living? Because what you are to her, is a checkbook. No more, no less. A mother in name, but not in heart, and you now this, you trained her to be like this. Every. step. on. the. way. You have never ever said no to her.* \"  \n\n\nAnd that's just about it.   \nBe prepared for going NC, and to deal with that fallout. r/JUSTNOFAMILY can help you find tools and resources for getting into help groups, and for seeing that you are not alone.   \n\n\nNTA and good luck OP. Hope your coming baby is healthy, happy, and sleeps as they should!",
   "created_utc": 1701374601,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg5z3d",
   "message": "Im shocked you take your children to visit the woman who abandoned you",
   "created_utc": 1701374747,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg662i",
   "message": "The way you say you have resented your mom for your entire life and then share about your dad moving out and dying 7 years later, it almost sounds like you blame your mom for that.",
   "created_utc": 1701374818,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg7g8u",
   "message": "NTA. But I wouldn’t be kind to this person for $1,000,000 let alone $100K.",
   "created_utc": 1701375287,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg7jal",
   "message": "Have you asked her for help with specific things?",
   "created_utc": 1701375319,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg7pya",
   "message": "Just so you know, OP, telling someone to cut you a huge check never works, unless you precede it by going over exactly why you deserve that much money.  You have to give the reasons before the request, because if you just ask for the money flat out, they'll be so startled they won't listen to the justification that comes afterwards.",
   "created_utc": 1701375386,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg7zt0",
   "message": "You would be an asshole is a situation that sounds rife with them, however you'd be a righteous asshole. Get what you can, and ghost them all. I think it's a great option. I doubt you'll actually get anything, but worth being an asshole in this case! You just be an asshole getting rid of a big piece of shit, Good Luck!",
   "created_utc": 1701375486,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg965s",
   "message": "NTA. Your sisters either don't give ashit or saying just to move on because they don't living that life you live when your mother abandoned you at that age, while they got allllll the help from her. I know your anger. Nothing best than stay nc with them",
   "created_utc": 1701375910,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg9hpy",
   "message": "Just ask her why she has done shit all to help you financially even if she never was there in person when she must have know you are still struggling 17 years later while she was your eldest sister's ATM. If you don't like the answer (and monthly support offer) then tell her this will have been your last visit.  \n\nNTA But your approach is just intentionally hurtful and would give you the fake moral highground  to go NC.",
   "created_utc": 1701376027,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbg9tbk",
   "message": "NTA.Go NC with your family.",
   "created_utc": 1701376143,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgb7i9",
   "message": "Why sell your soul? If she gives you the money and you accept it you are pretty much required to treat her as if she had been a good mom to you. Is that really what you want?",
   "created_utc": 1701376650,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgdu0j",
   "message": "None of this makes sense.",
   "created_utc": 1701377594,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbghvi8",
   "message": "Eh…. 100k is a lot is your mom big daddy warbucks?..\nJust tell her you guys are struggling and could use some help in the range of 15k or so you won’t be able to pay it back but it’ll help tremendously…",
   "created_utc": 1701379130,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgn6pp",
   "message": "NTA-Forgiveness is overrated. This is a can of worms you dont want to open. Continue with your life without the extra chaos she brings.",
   "created_utc": 1701381084,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgnelk",
   "message": "NTA",
   "created_utc": 1701381164,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgojn6",
   "message": "You can’t demand money from anyone. It isn’t yours and it simply doesn’t work that way. Either you want her in your life or you don’t; that’s the real decision.",
   "created_utc": 1701381581,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgoquk",
   "message": "NTA, but may I suggest heading to r/raisedbyborderlines?  They're incredibly helpful over there.",
   "created_utc": 1701381654,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgqhgu",
   "message": "Nope. You would not be the asshole.",
   "created_utc": 1701382308,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgqwy6",
   "message": "NTA, but money isn't going to make you feel better. You have two options:\n\nDistance yourself and work on severing any emotional ties to her, figure your life out and do your best while going to therapy. \n\nTry and develop a relationship, calmly communicate to her that you need help, bring up the points of helping your sister and slowly move from there (but also take therapy). \n\n\nYou demanding a large sum of money isn't going to do anything, she's not going to give it to you and you're not going to feel better if you got anything if it's coming as a demand. The truth is everything past 18 years old coming from a parent is extra help, and can't be demanded. \n\n\nGood luck, from a fellow mommy issues girl",
   "created_utc": 1701382468,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgsw0v",
   "message": "Ask for the money and if no, possibly you could go to court for back child support. I don’t know, I just know friends who never got child support, the child can then take them to court for it. I don’t know if that’s an option where you are. I hope you find your peace and enjoy your babies.",
   "created_utc": 1701383221,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgt02b",
   "message": "Why are you even in contact with her still?",
   "created_utc": 1701383265,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgvg0s",
   "message": "Yta for letting such a monster near your children. Go NC for their sake if not your own.",
   "created_utc": 1701384218,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgy5zc",
   "message": "First, she committed severe child neglect leaving you on your own until you graduated high school. I would simply cut contact with your mother.\n\nNow for the unpopular part of my opinion: beyond graduating high school, your mother doesn't owe you anything. Was it severely crappy of her to pay all these expenses on your sister's behalf and not help you out? Yes. For this reason, you have zero right to ask her for $100k.",
   "created_utc": 1701385304,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgypu3",
   "message": "She abandoned you and basically left you for dead. She doesn't deserve to be in your life. You've been through hell, and it's because of her. If you don't want her in your life, cut her out. It's your choice",
   "created_utc": 1701385522,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgyula",
   "message": "It's interesting you know the range of dollar amounts for these individual handouts to your sister. Was that your sister who told you how much she got, or mother bragging to you about it? Why would either of them think that was info. you needed? \n\nLook, if you start in on getting cash, shell hold it over your head forever. You do not exist on the same terms your sister does with her.\n\n100k will not solve this. Nothing will solve a crappy childhood \u0026amp; ongoing crappy mother except healing yourself. Money isn't going to do that healing. \n\nYour own family's $$ state is not solely on you. Husband needs to step up. I hope you cease subjecting yourself to sis \u0026amp; womb donor, that you understand you're their little punching bag project. There's a lot of situations out here like yours, so the trick is to move on. Living as well as you can is the best revenge. You deserved better, you didn't get it, so do your best to create that for yourself in the present going forward. Good luck",
   "created_utc": 1701385573,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgzd4d",
   "message": "Take every penny AND cut her out.",
   "created_utc": 1701385780,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbgzn4j",
   "message": "She SHOULD feel guilty, I hope it pains her because it’s what she deserves. \n\nGive her the ultimatum, you’d be better off without her in your life any way, or maybe you’ll get the money, sounds like a win-win for you no matter what her decision is.",
   "created_utc": 1701385891,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh08d2",
   "message": "Take the money and still cut her out. F*ck that noise and neglect.",
   "created_utc": 1701386126,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh39fk",
   "message": "Just tell your mother that because she has never supported you like your sister when you were and are in need you have decided that it is best for your mental health to have no further contact with her.\nYou now understand after years of neglect and abuse that she never wanted you. Wish her well for the future.",
   "created_utc": 1701387371,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh3dls",
   "message": "ESH\n\nYour mom is garbage, your sister delusional and definitely pulling the ladder up behind her in regard to support she’s gotten compared to yours, but you also made the choices that got you where you are. Your kids are your financial burden, the situation you’re in money wise is due to poor decisions. \n\nI think it’s tacky to basically say pay me this you owe me, like she does owe you for a lot of your emotional trauma and for being an absolute dumpster fire mom but no one owes you shit for getting pregnant twice when you couldn’t afford it. \n\n It your shitty family out but your anger and rage isn’t totally placed where it should be.",
   "created_utc": 1701387418,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbh8irv",
   "message": "Hug.\n\nNTAH, not even little bit. She abandoned you, and now she wants to be back in your life. What has she done to deserve a relationship with you?\n\nYou don't need her; you've already proven that. Close that door and nail it shut. Asking her for money won't change the past, but it would give her a connection to you. Only you know if it would be worth it.",
   "created_utc": 1701389570,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbha9xl",
   "message": "ESH - your mother is not a good one based on all you say so she sucks.  In spite of the sibling favouritism, you are wrong to demand money for continued presence in your life so you suck also.  This whole family dynamic is shit!",
   "created_utc": 1701390300,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhb3v9",
   "message": "Let us know how it goes",
   "created_utc": 1701390652,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhbgvx",
   "message": "NTA\n\nMoney buys her the right to say how you spend it. Your ‘mother’ is basically an estranged aunt. If this was a distant aunt, would you waste time or energy on this?\n\nGo NC. She played favorites so you’re under no obligation to have anything to do with her.",
   "created_utc": 1701390804,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhbh5u",
   "message": "Does she have the money to give? And have you ever asked her for help? What do you really want from her other than money? Do you want her to acknowledge how she treated you and apologize? Do you feel like she owes you money because she's helped your older sister out?what is their relationship like?",
   "created_utc": 1701390808,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhccpk",
   "message": "NTA - The mother absolutely does not feel guilty about literally anything. To the mother, she will think all OP cares about is money but to OP there is a very clear case of favoritism, because let's face it, this is absolutely favoritism. If she felt sorry about anything, she would have shown it in her actions. She doesn't support the OP, because she does not genuinely care. At best, she just doesn't like being called out on the consequences of her choices. \n\nIf anything, OP is being the ahole to THEMSELVES and their family by allowing this toxicity in their lives at all. If you see a sign that says \"Danger, Poison\", you don't go hangin around the funny purple smoke do ya? So why would you allow cancer in your life either? The only thing OP should be doing, is focusing on what is good for themselves and their family. If anything it sounds like these relatives are only ADDING to the stress and difficulties of their day to day life. Which is something i can imagine they DON'T need. Whose life is so rosy and cheery that they would raise their hands and say \"Yes Please!\" if someone was handing out, ADDITIONAL stress? I can't imagine anyone, not likely anyone in reddit either.",
   "created_utc": 1701391175,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhd8n7",
   "message": "She owes you nothing! She gave you nothing and she is nothing! Cut her out of your life!\n\nLearn that you have never been the problem, she has, and you're carrying all that hate for her and it's eating you alive! Stop! Nothing you do or say is ever going to change anything. What happened, did and it was terrible for you as a child to be treated as if you were nothing, again, that's on her, you were everything, she just failed you because she is a failure as a mother!\n\nYou getting pregnant, that's on you. Not her. You chose to be a mother so here you are, now struggling with two children, that still is not her fault.\n\nYou've chosen to blame her for all of your problems but each of us is responsible for all of our actions even when those actions are a reaction to our upbringing, or lack thereof!\n\nIt is easier to blame our parents for not being there for us, for treating us badly, that is normal but sooner or later you have to stop blaming and take responsibility for your own actions and faults.\n\nWould you have turned out differently had she been different, sure, but that's not how your life was so you need to stop dwelling on it and find away to move past it.\n\nI'm sorry you had a bad childhood. I'm sorry your mom was a horrible mom. I'm sorry that you're having trouble making ends meet but that's on you and your husband and no one else.\n\nYour mother owes you nothing. It is her right to give what she has to whomever she wants, she decided not to help you for her own reasons, but don't take on that shit, her reasons are only valid to her! Just because she didn't want to help you has nothing to do with you, and everything to do with her!\n\nBe better than her, the best revenge is living well and you can do that, it's just going to take a lot of work!   \n\n\nNO, you do not have to forgive your mother, if you can't, you can't, if or when you can, you'll know it! Someone saying, just forgive her is stupid!",
   "created_utc": 1701391544,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhdzmj",
   "message": "I'm sorry to say you will never have worth to your mother, truly I'm sorry. \n\nI don't have the same story but i know how it feels to have no worth in a family. I am low contact with 2 siblings and no contact at all with the rest. In fact I moved from the Uk to NZ which is the furthest place I could be to them. \n\nIt was the best decision I made. I built my own self-worth and I am content with who I am. That would never had happened if I had stayed with the constant reminder I had no worth and I stopped wanting to please them to let me belong (it never pleased them). \n\nI think I understand that the ultimatum was a purely emotional one as I feel you wanted to know you had the same worth in your mothers eye as your siblings. \n\nIt would never had worked as you know clearly she will never love you. Guilt is not love its Just guilt because she can no longer ignore what she did and her mind won't stop the memory of what she did. \n\nYou were abused she abused you by leaving you behind and not even making sure someone was looking out for you. I think she would have only paid the mortgage as if she had not the authorities would have become involved. \n\nMy mum once told me she would give me away, but social services would have taken the others away as well and she would lose money with reduced benefit. I see your mother in the same vein as mine. \n\nGo no contact and live your life, you will never go from surviving to thriving if you have anything to do with them. You do not have to forgive or forget; you were abused and do not need to give your mother an inch. \n\nGoing no contact was the best decision I ever made.",
   "created_utc": 1701391858,
   "score": 1,
   "submission_id": "187j4nt"
  },
  {
   "comment_id": "kbhie7c",
   "message": "NTA, if she feels so guilty why hasn’t she made amends with you? Abandoning your child is not something you get to just quietly ask forgiveness for.",
   "created_utc": 1701393686,
   "score": 1,
   "submission_id": "187j4nt"
  }
 ]
}