{
 "submission_id": "187ljmn",
 "title": "UPDATE - AITA for refusing to be my friend's alibi so he can cheat on his GF?",
 "selftext": "**First Post** [**Here**](https://www.reddit.com/r/AITAH/comments/185vzh5/aita_for_refusing_to_be_my_friends_alibi_so_he/)\n\nI’ll start this update by saying Jen found out last night.\n\nLike Matt predicted, she came over to our house Tuesday evening. I saw her pretty quickly since I was also coming back from buying some food. She asked me if I knew where Matt was, and I said I didn’t know (because I genuinely didn’t know at the time). She mentioned how he wasn’t responding to her texts and that she was worried about him, and I felt pretty bad hearing that.\n\nKyle who were inside, came out at this point and said that Matt was in his anatomy lab and then reassured her that he’d contact her once he was finished. She didn’t seem entirely satisfied with that answer but thanked us anyway and left. Once she was gone, Kyle told me that Matt was actually on a date with Cindy.\n\nSince Matt sometimes brings Cindy over, he’ll text the house group chat before they come over to ensure that Jen isn’t around. He did this on Tuesday night, and Kyle did alert him that Jen had stopped by looking for him, so he stayed over with Cindy on Tuesday night.\n\nWednesday evening, only Omar and I are home. Kyle was with his own GF, and Robert had an exam. Around 7 pm, we got a text on the group chat from Matt saying he plans on bringing Cindy over around 8:30, and he asked if Jen came by.\n\nI told him that I hadn’t seen her, and things went on as usual. I’ll add that Omar has refused to respond to these specific text messages from Matt, so there was an expectation on me to clarify if Jen was here or not.\n\nA little after 8 pm, Jen comes by with one of her friends (Carlie F21). They asked us where Matt was since Jen hadn’t been seeing him a lot lately. Before I could even say anything, Omar told them to come back after 8:30, and Matt should be home. They left, and I did argue with Omar about his decision to tell them to come back since it was inevitably going to cause drama, but he didn’t care.\n\nI did text Matt and told him about Jen potentially returning, but since he was driving, he didn’t read the message. At this stage, I gave up trying to contact Matt and went up to my room.\n\nA little after 8:30, Matt walked in with Cindy, and not that long afterward, Jen and Carlie returned (Omar let them in). Long story short, there was a lot of Jen yelling and Matt lying and apologizing. I didn’t bother coming down since I could hear it all from my room. After about 10 min of this, Jen and Carlie left.\n\nMatt sent Cindy home after this and was pretty pissed at what happened. I reminded him that I sent text messages (which he now saw), and Omar played dumb, acting like he didn’t see Matt’s message about him asking if Jen was home but confirmed to him that he told Jen to come back after the first time she came because “He didn’t think Matt was dumb enough to go out with Cindy two nights back to back.” Robert and Kyle came home after this point and I filled them in with what happened.\n\nThere was definitely some tension in the house this morning as Matt thinks this all could have been avoided had Omar been more helpful. He also partially blames Cindy for wanting to come over so often. Overall, Matt doesn’t really seem to care that Jen found out and broke things off with him. He said that he’ll try apologizing one more time (as he does prefer Jen to Cindy) and if she doesn’t accept, he’ll leave things as they are.\n\nAs for Cindy, Matt has already told Kyle, Robert, and me this morning that he plans on ending things with her after the December exam season. He says that he wants to be single again by New Year’s so he can have a fresh start. Kyle and Robert think this is pretty hilarious considering how much trouble he got into to be with her.\n\nThings have ended more smoothly then I thought and I have made it abundantly to Matt to keep me out of his relationship woes.\n\nI have also asked Carlie how Jen was holding up this morning as we share a class together. As expected Jen was very upset about the entire ordeal and she and her friends consider everyone at our house aside from Omar to be complicit and awful.\n\n**Quick Update** \\- Kyle texted the group chat, his GF knows and she isn't happy.",
 "created_utc": 1701359070,
 "permalink": "/r/AITAH/comments/187ljmn/update_aita_for_refusing_to_be_my_friends_alibi/",
 "score": 179,
 "url": "https://www.reddit.com/r/AITAH/comments/187ljmn/update_aita_for_refusing_to_be_my_friends_alibi/",
 "comments": []
}