{
 "submission_id": "187lpsj",
 "title": "AITA for thinking my daughters birthday should be more important than my sister's wedding anniversary?",
 "selftext": "My sister got married last year the day before my daughter's 3rd birthday. It was a small courthouse ceremony on a day that was special for them. It was not a problem and I'm happy for them. The problem with this lands more on my mom. She now has Thanksgiving, her husband's birthday, my daughter's birthday, and my sister's anniversary all in the same week.  My mom usually makes an effort to take my son for a night around his birthday in June, but when I asked about her taking my daughter back in September, she said that she doesn't do that. I didn't say anything else about it since I know this time of year was busy for her . But I noticed in October my mom took my nephew for the night on his birthday. Now it's almost the weekend of my daughter's birthday and instead of having my daughter spend the night,  she's taking my niece for my sister's anniversary. Do I have the right to be mad for my daughter? I'm a child of divorce, and my views on marriage are skewed, so am I just not seeing how important an anniversary is?\n\nUpdate: After getting to talk it out and seeing the different answers, I have realized a couple of things. My issue is with obvious favoritism with my son that does need to be addressed with my mom. She would do anything to spend time with my son but not the others. My sister is just getting her time. Blaming my sister's anniversary was just me pointing blame at someone else instead of facing the problem .  I appreciate all your comments, good and bad, I needed the different views. The positive NTA comments gave me too much credit. My mom does a lot for my kids. \nSome comments are asking when my mom started doing birthdays with my son and it reminded me she would spend the whole day with me and my son for his birthdays because I was a single mom and she was there when dad wasn't. I'm still with my daughter's dad, so my daughter's 4th birthday is going to be a lot different from my son's, and I need to stop comparing them. ",
 "created_utc": 1701359512,
 "permalink": "/r/AITAH/comments/187lpsj/aita_for_thinking_my_daughters_birthday_should_be/",
 "score": 244,
 "url": "https://www.reddit.com/r/AITAH/comments/187lpsj/aita_for_thinking_my_daughters_birthday_should_be/",
 "comments": []
}