{
 "submission_id": "187pkin",
 "title": "AITAH for Not Letting My Husband Use My Office Closet?",
 "selftext": "My husband and I have lived in our house for over 10 years now. It's a 4 bedroom, 2 bath house. 1 bedroom is ours for sleeping and such, 1 bedroom is my son's, 1 bedroom is my husbands office and 1 bedroom is my office. Both my husband and I work from home.\n\nMy husband comes into my office this morning to chat like usual and looks in my closet and says, you really need to get rid of that (referencing a ferret cage - my 2 ferrets passed away this year and I haven't had a chance or the heart to get rid of it yet) so we can store stuff from the house in there.\n\nMy response was, no - this is my office and I'll use the closet for whatever I want, just like he uses his office closet however he wants. He then proceeded to argue with me about how the closet is not part of the office and that \"we\" should have a say in what goes in the closets. I said, that works for our shared bedroom and any other closets throughout the house. But in my office, it's my space so I should be able to be the sole decision maker of what I want to store in my office, including the closet as it IS part of the room.\n\nI told him I don't tell him how or what to store in his closet, so I would expect him to do the same for me and my office. He is adamant that \"I'm wrong\" and that we should be using MY closet for household storage. I'm pissed because this man uses up far more space in our house for storing \"his stuff\" (clothes, clutter that he doesn't want to get rid of, throw away, etc.) than I do and I am always respectful of his space and don't try to tell him what to do with it.\n\nHe's says that I have every right to tell him what to do with the closet in his office - but I know that is not true because he has always just done what he wants in his office closet and never asked me if I was \"ok with that\" because I thought he understood that I don't care what he does with HIS own space - he is now using his office closet for his clothes (which I never asked him to do) and he said he did that so I had more room for my clothes in our shared bedroom closet. But I didn't need more room in the closet for my stuff. Before using his office closet for his clothes he used it for his gardening projects, like a greenhouse.\n\nBut now he keeps bugging me to clean out my office closet so he can put \"household stuff in there\" that HE wants to. And I've told him flat out, no - this is my room and I should be able to do what I want and store what I want in the closet. He's adamant that the closet isn't part of my office and the closet is a \"household closet\" just like his office closet is and that he should have a say in what goes in my closet. I'm pretty adamant about this and told him he can store whatever \"household\" stuff he wanted to store in my closet in his\n\nAITAH?\n\n\\*\\*UPDATE #1\\*\\*\n\nOh man, not sure why I'm sharing all this, but I started this thread so I better see it through.\n\nHubby came to my office just a little bit ago (he was in a bit of a rush as he had to leave to go work) and says: \"I'm not the enemy. I'm just trying to help you.\" He was like: \"I'm just trying to help you get rid of the cage which you're not going to use anymore and just finally be done and move on.\" And I was like, \"wait, that is NOT how you approached this subject earlier. You were adamant about getting it cleaned out so \"we\" could use the storage space.\" And now he's like: I'm just trying to help you, I don't care if the closet stays empty or you store it with your stuff, I'm just trying to help you get rid of the ferret cage.\" (I'm not getting more ferrets and I do plan to either donate the cage to shelter where he adopted the ferrets from or sell it - but again - on my own timeline).\n\nHe then went on to tell me that anything he tries to \"tell me to do\" I just always have to push back, say no just because he's telling me I should do something and that I get stubborn and refuse to do it, just because he's telling me to do something - which in and of itself feels like a backhanded manipulative way to try to get someone to do something.\n\nA bit more arguing and he had to leave. I'm just so frustrated.  ",
 "created_utc": 1701369312,
 "permalink": "/r/AITAH/comments/187pkin/aitah_for_not_letting_my_husband_use_my_office/",
 "score": 209,
 "url": "https://www.reddit.com/r/AITAH/comments/187pkin/aitah_for_not_letting_my_husband_use_my_office/",
 "comments": [
  {
   "comment_id": "kbftsmy",
   "message": "NTA but your husband’s behavior is very strange. I would even go as far as he wants to put his stuff in there so he can walk in any time he wants to get stuff from the closet and not respect your privacy. \n\nEither that or he is a hoarder with a problem and needs therapy. Probably needs therapy both ways.",
   "created_utc": 1701370329,
   "score": 198,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfsyk6",
   "message": "You are going to come home with your closet emptied and all his stuff in there. Sounds like he doesn't respect your own space, which is very important in a relationship.",
   "created_utc": 1701370031,
   "score": 99,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfsttj",
   "message": "I think you're NTAH. If he has complete control over what's in his office space closet, so do you. Your husband sounds like he has a hoarding problem. I would just make it clear that you are not on board and that if your ferret cages are disposed without your express say so, you'll consider all his belongings as fair game to give away as well.",
   "created_utc": 1701369982,
   "score": 29,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfwm2a",
   "message": "NTA. Tell him you're relocating your ferret habitats to his office closet, and also setting up a home gym in his office which is for everyone to use.",
   "created_utc": 1701371344,
   "score": 59,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfso17",
   "message": "NTA, your husband needs to stay in his own office. But if he absolutely insists on using the closet in your office for household storage, I would do the same with his. Unfortunately, that means all his crap will be all over the rest of the house.",
   "created_utc": 1701369923,
   "score": 56,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfum26",
   "message": "You’ve been clear that your closet is not his business. You no longer have to engage with him about this. If he starts going on about your closet, say “I’ve told you no, that’s it”. If he persists, end the conversation by walking away or putting on headphones if he’s in your office.",
   "created_utc": 1701370623,
   "score": 36,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfz4hn",
   "message": "I don’t really know who to assign. Hear me out. \n\nWe’re talking about a closet. You have every right to be sentimental about the cage, and process that in your own time. Your husband should be empathetic to that. \n\nI don’t know how this argument came to be the size it did, but it almost sounds like there are bigger issues going on, and it’s just coming out as an argument about a closet. \n\nThe house belongs to both of you. Certainly you can both have input on anything going on inside of it. It sounds more like you’re feeling like he has too much control, or isn’t being attentive to your emotional needs. Obviously I don’t know any more than what you’ve posted, but it seems like all of this is a much bigger issue than the closet in question.",
   "created_utc": 1701372254,
   "score": 23,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfssgu",
   "message": "NTAH - Lock your office door at all times.",
   "created_utc": 1701369968,
   "score": 19,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg278g",
   "message": "How is it possible that the closet in *your* office is the *only* storage in the entire house where the\nhousehold stuff can go? That there is literally *no* other place, at all... at *all*, at all? I find that extremely hard to believe.   \nNTA.",
   "created_utc": 1701373371,
   "score": 18,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg3wi7",
   "message": "I’m betting the “household stuff” will turn out to be his stuff.",
   "created_utc": 1701373986,
   "score": 17,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg0kwv",
   "message": "Your husband is being ridiculous!\n\nThe closet is accessed through the office so putting things in there that would cause disturbance to your working is non-negotiable (like anything he’ll want to come get on his terms)\n\nYou should both have space.  If he needs more storage he can but a wardrobe and put it in his office",
   "created_utc": 1701372787,
   "score": 11,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg2xnn",
   "message": "He is totally going to empty your closet sometime when you aren't home and fill it up with crap.\n\nI suggest you both tell, *email and text* him that that had better not ever happen.  That way he can't deny and pretend you said it was okay through some twisted logic.  \n\nAnd if he does do, it take all of his crap out of the closet and the rest of the clutter he has throughout the house and cram it all in his room to deal with.",
   "created_utc": 1701373639,
   "score": 9,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbftpow",
   "message": "I would ask if you could keep the ferret cages in his closet.  Then when he says yes, get more ferret cages and ferrets for your office, subsequently asking him when he is going to get his ferrets.",
   "created_utc": 1701370300,
   "score": 4,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgkptb",
   "message": "A bedroom closet belongs to the bedroom where the closet door is located.  If you change that bedroom to an office, the closet is an office closet.  My husband and I also have bedrooms we transitioned to office space and those are the rules we use.  \n\nIf he needs more \"household\" storage, he needs to look at any available attic, basement, shed, storage facility, or dumpster.\n\nNTA",
   "created_utc": 1701380173,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgm4em",
   "message": "NTA\n\nWhy is this so important to him? why does it need to be done NOW? \n\nWhy not take a look around the house at some of his junk that he hasn't touched in forever and recommend cleaning some of it out. When he doesn't want to because it's his stuff, point out the hypocrisy.",
   "created_utc": 1701380691,
   "score": 5,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgrjw5",
   "message": "NTA.  He is running out of room for his hoard and wants to take over your space.  If you do want to take the ferret cage out-maybe toss out the husband and get ferrets instead (just kinda kidding!)",
   "created_utc": 1701382711,
   "score": 5,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgrlgn",
   "message": "I'd put your out of season clothes/stuff you don't wear often in your office closet. Fill it up with shorts, bathing suits, formal clothes, etc. \n\nThat way you're using it, and he can't fill it up with his crap.",
   "created_utc": 1701382727,
   "score": 4,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfse4i",
   "message": "NTA. He has his closet you have yours. Honestly I might be petty and start piling junk in his closet since that's what he wants to do to yours, buuuut that's definitely not the mature thing to do. The responsible thing is to just be adamant and say no, my closet is mine, yours is yours and reinforce that's the way it is.",
   "created_utc": 1701369823,
   "score": 6,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg04r4",
   "message": "Lmao if he puts anything in your closet simply remove it and place it in (or in front of if it doesn’t fit) his closet.\n\n\nThen say what? Are they not all household closets? Do I not get a say?\n\nLol, but seriously NTA idk how to explain this to someone who so obviously refuses to see logic because all they are concerned about is hoarding space. \n\n\nMaybe ask what he actually wants to store and then tell him where he should actually store said things. Tell him you’re happy to give back half the bedroom closet he vacated for no reason",
   "created_utc": 1701372623,
   "score": 8,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg2h0c",
   "message": "Tell him you want to store the ferret cage in the household closet in his office. NTA",
   "created_utc": 1701373469,
   "score": 6,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg3f1s",
   "message": "NTA. I'd deal with the cage and fill it with stuff of your choice",
   "created_utc": 1701373811,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgkzm9",
   "message": "Has he got hoarding tendencies? He’s run out of his own space and doesn’t want to admit it so comes up with some bullshit about your closet being a household closet when what he means is, “I want to clutter up your closet”. NTA.",
   "created_utc": 1701380273,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgq8mw",
   "message": "You just need to pay a visit to his office and start criticising the state of his closet.\n\nBe careful because you will come home one time to find the closet filled with HIS clutter.",
   "created_utc": 1701382216,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfspwe",
   "message": "Not the asshole. Do you plan to use the cage again? Why not put the cage to use and get more fur babies. If not then try converting it into some sort of decoration for the office that could be multi purpose and sentimental.",
   "created_utc": 1701369943,
   "score": 8,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbge1zo",
   "message": "Girl, your hubby is slowly sliding BOTH of you in to a hoarder situation - running out of storage space is a big deal.  Taking over OTHER folks storage space is a BIGGER deal - it means he’s run out of other places to put ‘stuff’.  Guess where is next?\n\nFirst, stand your ground.  Second, either put a lock on your office door, or, if he does anything to your closet, take it out and dump it in HIS room (then get a lock).  Third, head over to the ‘hoarders subreddits for advice.\n\nYou need to do something NOW before it gets worse.  You may think this is an overreaction, but think about where all his crap is going to go over the next decades, if he can’t get rid of anything TODAY.  Think of it like having a persistent, annoying twinge - probably isn’t anything bad, but better to find out NOW, just in case.  Because I think this is about more than your closet.",
   "created_utc": 1701377674,
   "score": 5,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg3fj0",
   "message": "NTA. To say the closet isn't part of the room is ludicrous. You're going to come home and find he's emptied it of the things you have in there and filled it with his crap though. You could preempt that by going into any actual shared closets to go over what's in there, and work out how much is your stuff, how much is his and how much is stuff no longer needed.",
   "created_utc": 1701373816,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg6pof",
   "message": "Did he not like the ferrets? I’ll never get more, but they were such a source of joy for me. \n\nIs he thinking you’ll get more?\nNTA.",
   "created_utc": 1701375016,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg8qjb",
   "message": "NTA why does he want your closet when he has his own",
   "created_utc": 1701375755,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgbrnf",
   "message": "I feel like we need more information before making a ruling.",
   "created_utc": 1701376855,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgc53z",
   "message": "He needs to check the clear description from the IRS of “home office” which doesn’t include s ferret cage or any other household goods.  His motivation to be up in your space is very mysterious to me.  He needs to back off.   Good luck. Nta",
   "created_utc": 1701376989,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgdl91",
   "message": "If you have the house blueprints, be petty and highlight the closet IN the room, and ask him where he thinks the closet is, the SKY?",
   "created_utc": 1701377507,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgflia",
   "message": "Firstly, I wanted to say: I'm sorry to hear about your ferrets. As someone who's had ferrets and lost them over the years, I feel your sorrow and attachment to what remains. It's disheartening having someone tell you that you need to get rid of something that holds memories for you. Also, depending on the cage, they're not cheap. Your post didn't include whether or not you were undecided on future ferrets or not which is where my thoughts went to. \n\nMoving onto the argument itself, in my opinion, no, you aren't the asshole. It can be difficult to divide up space with people. I bought a very small home. It's in my name and I'm not married. However, I've been with my significant other for 18 years now and I do my best to not make her feel like she isn't considered or is unwelcome. My home is a small, two bedroom house with a detached garage. We have no children, work zero intent to have them. The spare room was made into my office (I'm a contractor and actually use it as an office -- but also a gaming space). In turn, I surrendered the entire master bedroom closet to her. Yes, my office has a tiny closet that I use for a few things. I understand that a closet isn't equal to a small room, which is why I generally give her free reign over the master bedroom (huge TV, gaming consoles, comfortable bed that she prefers over using the couch / living room). \n\nEveryone's living arrangements are different, I know. However, there's always a happy place to settle. From the sounds of it, you've been more than open to giving him his space and you deserve your space, too! \n\nYou're not an asshole for wanting something for yourself. Relationships are give and take. It's OK for you to get to take every now and again.",
   "created_utc": 1701378228,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgldou",
   "message": "Just tell him, fine, you can have it. Then go remove everything from his closet and put your cage in there.  **Bam!** Problem solved.",
   "created_utc": 1701380417,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgll27",
   "message": "NTA and WTF? My Work from home wife has her office and I 100% respect her space. I mean her closet is full of storage items like travel suitcases and other stuff but I'm not going to dictate what she does with it.  As far as I'm concerned that whole room is her space. (She keeps her books and other personal things in there too.)",
   "created_utc": 1701380492,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbglnmo",
   "message": "Repurpose the ferret cage somehow to hold office supplies or something “office” related until you get around to doing something about it. \n\nOr\n\nGet a couple of stuffed ferrets and put them in the cage.\n\nSeriously, your husband is well on his way to hoarder behavior. He wants to clear out your closet to make room for more “stuff”. Instead of arguing about the closet, you should be looking at the overall issue.\n\nNTA",
   "created_utc": 1701380519,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbglpm5",
   "message": "Time to move all your summer clothes, coats, and fancy dresses into his office closet. Don't forget the vacuum, extra pots and pans, etc. What's good for the goose...\n\nSometimes, they need to visualize their stupidity.",
   "created_utc": 1701380539,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgmunb",
   "message": "NTA",
   "created_utc": 1701380963,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgnum2",
   "message": "No is a complete sentence. \n\nAs is no,  NTA.",
   "created_utc": 1701381326,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgo6v5",
   "message": "NTA. I'm sorry you lost your pets recently. That's horrible.\n\nFirstly, he's totally insensitive asking you to throw out the cages. Secondly your office is your office. Me and partner have our own studies and we do not dictate what happens in that room. Only thing I have to prompt on is whether he's been hoarding glasses up there (he has a tendency to do this). \n\nIf his issue is storage space then you would both need to discuss the storage space in shared areas and decide what can be cleared out.",
   "created_utc": 1701381451,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgpbtt",
   "message": "Is he always a controlling asshole or is this new?",
   "created_utc": 1701381874,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgpbv4",
   "message": "NTA this is super weird though",
   "created_utc": 1701381874,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgscxm",
   "message": "Nta",
   "created_utc": 1701383017,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgt73h",
   "message": "He sounds like a hoarder who wants your space. You are NTA. Hold your ground.",
   "created_utc": 1701383338,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgtmsa",
   "message": "Nope, nope, nope.  Yet another AH dude who thinks what's yours is his, including space in the house.  Put a lock on that door.",
   "created_utc": 1701383506,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgus6q",
   "message": "A simple solution would be to take everything in your office closet and to put it into his office closet.\n\nNTA",
   "created_utc": 1701383954,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbguu9h",
   "message": "#YardSale\n\n#JunkRemoval\n\nLock ur closet if this continues. Otherwise he may disrespect you \u0026amp; empty ur closet. Reiterate it’s a nonnegotiable. And point out him not letting go of taking over ur office closet is disrespectful.",
   "created_utc": 1701383976,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgyb0c",
   "message": "Arguing for the sake of arguing is usually not really a guy thing. Maybe he wants to turn his closet into a greenhouse again but not get rid of excess clothes. He's clearly not telling his real motive.",
   "created_utc": 1701385359,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh56au",
   "message": "He’s gaslighting you. He wants to get rid of your ferret cage not because he cares about you and your grief but because he wants to put stuff in there. Set boundaries. Or better yet, put a lock in your office door and closet door. Your husband sounds like a hoarder.",
   "created_utc": 1701388166,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhau7s",
   "message": "NTA. \n\nIf *\"OUR\"* stuff becomes *my* sole responsibility to store or manage, it finds itself on the curb when I'm sick of dealing with it.  I do not tolerate arguments on this topic. If they wanted a different outcome, they should have participated in managing *OUR* household items.",
   "created_utc": 1701390538,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg543n",
   "message": "Put the ferret cage in his office closet.\n\nIs he always so demanding and overbearing, because his insistence seems odd.",
   "created_utc": 1701374430,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg635e",
   "message": "NTA, your husband is heading into.hoarder territory and looking for more space. Keep your boundaries because it is an attrition by inches with people like him.",
   "created_utc": 1701374788,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg7iz9",
   "message": "NTA\n\nNice lock on your office door and a middle finger if he brings it up when you are outside your office.  \n\nHe can do what he likes in his room but I would set fire to anything he tried to store in mine after being told no repeatedly.",
   "created_utc": 1701375315,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgg1n3",
   "message": "Seriously?! Doesn’t he have anything better to complain about. Holy crap on a cracker! Tell him when he clears out his closet you’ll clear out yours. This argument is absolutely ridiculous. Send him back to his office if he can’t find anything better to complain about! How childish! NTA",
   "created_utc": 1701378386,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgofkr",
   "message": "NTA  and not wrong, but your husband is. I got the impression that he is early in his development of a hoarded house while reading your post. Maybe that’s not it, but it seems to be something nefarious because his insistence upon this particular topic is strange.  The insistence is strange.  \n\nThen I looked at the comments. I think you might have a budding hoarder \u0026amp; all the fun that brings. I’m sorry, time for therapy.",
   "created_utc": 1701381539,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfvr23",
   "message": "NTA, but your Husband is…",
   "created_utc": 1701371033,
   "score": 3,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg7mbv",
   "message": "NTA, install lock on your office door. Man-baby husband will probably retaliate and do same ( but who cares?), you’ll still have your space/privacy.\n\nI think there is a bigger issue or several here.\n\nYour wish to keep your office, yours.\nHis wish to make your office space his.\nHis not being respectful of your space.\n\nSuggest you take your husband to marital therapy and find out what’s really going on underneath this battle for space.",
   "created_utc": 1701375349,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg97qg",
   "message": "You are battling a hoarder! Is the garage and/or basement already full?\n\nDemand that he tidy, cull for donation or recycling, and organize his existing possessions to make room in his area/s for the stuff he wants you to store in yours.\n\nStay strong before you end up walking a narrow path between teetering piles of his crap in your home!",
   "created_utc": 1701375926,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgb8nd",
   "message": "This escalated a bit oddly. Though of course, I wasn’t there. \n\nIt seemed to me he was commenting more on the idea of your not needing the ferret cage specifically, and then it immediately went to “this is my closet, you don’t get to tell me what to do with it.”\n\nand then he reacted to that territorial declaration, and now he won’t back down. \n\nHe’s the asshole, definitely, and you are right—you should be able to control that closet. \n\nBut I’m curious why you went from “you don’t need that cage anymore” to “don’t tell me what to put in my closet.” There’s something there. \n\nThis whole situation would make me start demanding some marriage counseling or some other sort of deep dive into the dynamics here. \n\nNTA",
   "created_utc": 1701376661,
   "score": 2,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgddls",
   "message": "He’s being petty waning his own way.. he will clean it out one day while you are out so be prepared.. I would move his clothes and put cage in his closet once it does it.. or put a lock on your office door. \n\nHe’s ridiculous saying closet isn’t part of your office..\n\nNTA",
   "created_utc": 1701377432,
   "score": 0,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgjgrp",
   "message": "Put a lock on your door.\nNTAH",
   "created_utc": 1701379713,
   "score": 0,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgjpzj",
   "message": "NTA. He’s looking for another cubbyhole to jam full of HIS junk and you know it. \n\nI tend to accumulate a LOT of stuff, but I’ve never tried to take over my HUSBAND’S closet! lol!",
   "created_utc": 1701379808,
   "score": 0,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgm5di",
   "message": "ESH because this was just a stupid argument.",
   "created_utc": 1701380701,
   "score": 255,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbfx5si",
   "message": "NTA. I guess he didn't like the ferrets and is afraid OP will adopt more.",
   "created_utc": 1701371545,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg3sji",
   "message": "NTA. Threaten to divorce him and see if this is a hill he’s willing to die on.",
   "created_utc": 1701373946,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg7spa",
   "message": "NTA. Lock your closet and office—I know it feels extreme but I sense the conversation/argument was a curtesy and he will take over your space without your blessing.",
   "created_utc": 1701375414,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg7zf8",
   "message": "NTA, but um. Get a lock for your office.",
   "created_utc": 1701375482,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbg8e7j",
   "message": "Just put a lock on the closet \n\nTell him since he doesn’t understand no is no you have to take drastic measures because he isn’t going to wait for long til he empties your closet yoursf",
   "created_utc": 1701375631,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgawi5",
   "message": "He is going to empty that closet, be prepared to pull everything in his office. Don’t even have a discussion with him, nor everything back when he moves the stuff in.",
   "created_utc": 1701376535,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgb0ps",
   "message": "Something else going on. There is a reason he fancies using that space.",
   "created_utc": 1701376578,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgbrys",
   "message": "NTA\n\nThis is full of it, and controlling and very very domineering and nasty \n\nHe needs to back off and stay backed off and he needs not to need any warnings over that either \n\nHe stops this now, and he never starts it up again \n\nIf closets in the house need to generally be cleaned out their joint closets and it’s a joint project. Yeah that’s OK to agree on so long as you both jointly agree on it. \n\nHe has no business in your closet. What an ass\n\ninstall a lock on your office door and then install a second lock on the closet door and make sure the two locks are different",
   "created_utc": 1701376858,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgck1z",
   "message": "NTA. If office closets are “fair game” then he needs to empty out his office closet. But he won’t agree to that. Just install a deadbolt on your office door or you’ll come home to the closet empty and full of HIS stuff.",
   "created_utc": 1701377139,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgjyeg",
   "message": "This is such and oddly specific powerstruggle.  Is it about him not wanting you to get more ferrets?",
   "created_utc": 1701379895,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgk24w",
   "message": "He sounds like a controlling freak.",
   "created_utc": 1701379933,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgkeq8",
   "message": "Go put a bunch of crap in his closet and see how he reacts.",
   "created_utc": 1701380061,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgkni5",
   "message": "NTA. Your office, your closet. This wouldn't be an issue if he didn't run out of room to but his shit.  It's the only reason why he cares. Tell him if he wants room to put his junk to clean and organize his own closet. Plus what if you want to get another ferret or some other animal that works with that cage? That or tell him to build a shed for his overflowing hoarding problem and leave your space alone.",
   "created_utc": 1701380149,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgl7q0",
   "message": "NTA Tell him to store his household crap up his ass. Your office ur closet, get a lock on the door and tell him to mind his business. This is a bizarre argument but seen as he is adamant that u should share ur closet and they r all communal use the opportunity to get rid of all his crap, also go get some more ferrets, go to a shelter or rescue for them, can’t get rid of ferret cage then lol.",
   "created_utc": 1701380356,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgpt52",
   "message": "Not many mature adults in this thread..  a lot of single Karen's it looks like.",
   "created_utc": 1701382053,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgvjzb",
   "message": "NTA.  Put a lock on your closet.",
   "created_utc": 1701384261,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbgzyn1",
   "message": "These people saying he’s a hoarder have no clue what an actual hoarder is…A hoarder would have never moved their own clothes out of the bedroom. Reddit loves to take words and make them meaningless.",
   "created_utc": 1701386019,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh0icc",
   "message": "Nope. He’s wrong. Period. Non negotiable. What, is he bored and looking for trouble?",
   "created_utc": 1701386238,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh1mtm",
   "message": "I push back when people try to order me around, too.  Even my husband of nearly 30 years.  Even worse if they’re trying to make changes to my space that I don’t want or need.\n\nAlso: your grief is valid, and you should be allowed to move through it at your own pace.  NTA, OP",
   "created_utc": 1701386695,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh3qwx",
   "message": "First he was bossy. Now he’s being manipulative. \n\nFuck both of those things. Your office. Your space\n\nNTA but he sure is.",
   "created_utc": 1701387572,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh3v87",
   "message": "NTA but you have an SO issue or DH issue because he sees your office closet as a place to store more crap of his.  I would get a key lock for the closet and I would get a lock for your office.  With him it's about the ME not the WE",
   "created_utc": 1701387622,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh46ul",
   "message": "Your edit kind of proved his final point. He says that no matter what he tells you you shut him down and then you went and shit him down, lol.",
   "created_utc": 1701387755,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh6k6a",
   "message": "This is so fucking small\n\nYta grow up",
   "created_utc": 1701388747,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh6rx7",
   "message": "He needs more room for his stuff. No.",
   "created_utc": 1701388837,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh70yh",
   "message": "Your husband has hoarding tendencies. He says it's ok for you to say what goes in the closets or doesn't? Then tell him all the junk needs to be thrown away that he refuses to get rid of. Then he wouldn't need your space at all.",
   "created_utc": 1701388945,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh7wux",
   "message": "He should stop telling you to do things, then. What makes him the arbiter of what you should and shouldn't have? Has he always been like this?",
   "created_utc": 1701389313,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh868r",
   "message": "NTA. If he’s always trying to dictate what you do with your space and your stuff then yes, it is natural that you would get defensive about it. He’s just looking at it wrong. What is actually happening is he is being presumptuous, and pushy, and you are responding to that.",
   "created_utc": 1701389424,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbh9rau",
   "message": "I would ask, very earnestly in demeanor, what is going on with him. He picked a fight over your office closet, and then came back later to pick another fight about you saying \"no\" to him, and he pointed out the arguement that he started over your office closet as the first example of why it's a problem with You - because....apparently you shouldn't....tell him no (??) when he decides to tell you what to do. What's going on in his world that he suddenly feels he should have parental authority over you?\n\nHas he always felt that he should be able to order you about like a child? Is this a new behavior?\n\nNTA",
   "created_utc": 1701390084,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbha38b",
   "message": "NTA - and I am the same way. Don't TELL me to do something, it won't happen.",
   "created_utc": 1701390222,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbha95h",
   "message": "This is just silly",
   "created_utc": 1701390292,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbha97i",
   "message": "When someone starts a fight about stupid things, and keeps going….usually means it about something else a little bit more serious entirely!!! I don’t know I’m getting that vibe!!",
   "created_utc": 1701390292,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhaozx",
   "message": "NTA. If he has to walk through your office to access the closet, then it’s your space, not his. Putting household junk in there just gives him an excuse to bother you at work. Tell him no and stick to it.",
   "created_utc": 1701390476,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhccq3",
   "message": "probably going to get a lot of down votes for this, but agree to take the cages out if he agrees to let you decide what goes in his office closet.  if he agrees, make him toss all his clutter, and store the cages there...",
   "created_utc": 1701391175,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhclwf",
   "message": "My spouse is a bit of a hoarder and I have had to be very firm in guarding specific spaces that are for my use only, or communal use. Sometimes I say no, sometimes if I find she has stashed something there, I ask her to remove it, and sometimes I toss it on the hall floor. She might get annoyed but I let her deal with that.",
   "created_utc": 1701391282,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhedcp",
   "message": "NTA. What a weird interaction. I'd assume this is about something else. It drives me batty when anyone says I \"always\" do something. Only siths deal in absolutes.",
   "created_utc": 1701392016,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbheuf9",
   "message": "Put your clothes in there.",
   "created_utc": 1701392213,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhfgxq",
   "message": "NTA but I don’t think this argument is about closet space, hoarding or ferret cages but hard to tell his underlying issue. Is he just trying to get some attention? Do you spend a lot of time in your office? Maybe he is using the closet as an excuse to come in your space and interact with you?",
   "created_utc": 1701392471,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhhddv",
   "message": "How about you go in his office room and start clearing out the closet? Then he'll have a space to put new crap. I'm sure he'll get all bitchy about it, but it's what he wants.",
   "created_utc": 1701393265,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhil8v",
   "message": "NTA at all. Your how has your husband made it this far through life with absolutely zero social skills?\nTell him it's your stash of sailboat fuel and tell him to clean his closet out if he needs more room.",
   "created_utc": 1701393768,
   "score": 1,
   "submission_id": "187pkin"
  },
  {
   "comment_id": "kbhj6f1",
   "message": "My husband doesn't tell me to do shit unless I ask for his opinion. Otherwise it's a discussion. If he tried I'd laugh in his face and fight him tooth and nail too. Grief is weird, he shouldn't force you to get over it faster than you're ready to, that will lead to resentment. (Edit: NTA)",
   "created_utc": 1701394010,
   "score": 1,
   "submission_id": "187pkin"
  }
 ]
}