{
 "submission_id": "187rn5q",
 "title": "My Sister Called me a whore in front of all our family and friends. Update",
 "selftext": "Hey Everyone, Thank you to all who commented and offered advice and judgments on my previous post. I've read all the comments and it helped me to look at my situation from a different perspective. Firstly After my Sister's rant, she called my mom and apologized to her. My mom told me she called her and I could see my mom had forgiven her.\n\nMy sister did not say anything, a week passed after that and she came and told me she was sorry, her words were 'It's been a week already forgive me\" I refused to say anything about it she acted like everything was over and tried to engage me in conversation like everything was normal and when I still refuse to respond she would say things like \"Oh mom look she is still upset I've already apologized\" \n\nMy parents have forgiven my sister so I find myself in a situation where my sister comes over to our house, does laundry, gets food, and whatever like nothing happened at all. My mom jokes around with her and expects me to interact normally. I told my dad that I would never forgive my sister but he says since we're sisters I should just let everything go. \n\nDuring this past week I've also spoken to my cousin and apologized to my cousin I admitted that I was wrong and promised that I would stay away from her boyfriend and would never say anything or act inappropriately toward him. All of my family members live close together so we often have family gatherings I have run into my cousin's boyfriend quite a few times, During one of those run-ins he said I looked beautiful I didn't bother to respond and just walked away. Later in the night he caught me alone and told me he would \"bang\" me one day. \n\nI told my cousin exactly what he said, I don't know what happened between them but it's been three days since he made those comments and they are still together.\n\nFor my \"Friend\" I mentioned in the original post I confronted her about the things she said and her response was unexpected. I'm not going into detail but weirdly, my friend blames me for the state her life is in. We have been friends for years and my friend and I have always been competitive be liked to compare grades in school my friend has always been smarter than I am but in the last year of high school, I achieved first place in the grade. We also said we wanted to apply to uni together, but I ended up applying on my own online. My friend ended up not sending an application because she was waiting for me. I have persuaded her to apply for uni again. She has but has been rejected twice. The reason is that she applies to departments and courses that she has no qualifications for, like a drama/theater major even though she has never taken such classes in high school.\n\n Fast forward my friend is unemployed and a heavy drinker and often smokes marijuana, and her reputation with boys is not the best. I was flabbergasted and of course, told her that her life is the course of her own decisions, and ironically I found out she once offered to give my cousin BF a sexual favor ( not sure if it's true I just thought it would be funny if it was).\n\nI don't want to make this too long so I'll just mention I refuse to talk to my sister and my parents and other family think I'm unreasonable, my mom said my sister was just speaking out for what she thought was right.\n\nAnother thing is that my niece of tens sleeps over at my house, since the arguments she has not come to sleep over, when her mom visits and takes her home she cries and begs me to let her sleep here, she once shouted \"Please help me I don't want to go\" I spoke out and said she has a reason she cries to stay here every time her mom brings her over.\n\nMy sister called me crazy and to mind my own business, I've mentioned this to my mom and she asked my sister about it, my sister said her boyfriend does not want my niece to stay at our house.\n\nI've considered calling the police but I'm so afraid because my sister's boyfriend is involved with gangs (I know I can do it anonymously but isn't this just my word against theirs, I have no evidence about anything) and I'm just afraid my family will hate me as they feel strongly that any problem can just be talked through",
 "created_utc": 1701374582,
 "permalink": "/r/AITAH/comments/187rn5q/my_sister_called_me_a_whore_in_front_of_all_our/",
 "score": 19,
 "url": "https://www.reddit.com/r/AITAH/comments/187rn5q/my_sister_called_me_a_whore_in_front_of_all_our/",
 "comments": []
}