{
 "submission_id": "187rx94",
 "title": "AITAH for holding my husband to task when he threatened to get rid of the family pet?",
 "selftext": "Long time lurker, first time poster. Here's the rundown of the situation:\n\nMy son and I were interested in getting a cat a year after our elderly cat passed away. My son has been battling depression and the hope was that a cat would be a comfort for him. My husband hates taking care of pets and we had a written agreement that I would not ask him to do any chores related to the cat.  We have had the new cat now for 3 months - he is a real joy - and my son and I make sure to do all the feeding, litter cleaning, nail clipping, etc. I am not to even ask my husband to turn on a light switch if the cat is on my lap and I can't get up to do so myself.\n\nWhile I was at the office earlier this week, the cat knocked over a plant in the kitchen. My husband works from home and it was 9:45 am. He texted me a photo of the plant with dirt spilling over the counter and all over the kitchen floor.He did not text me any details about what he did next. I was in back to back meetings so other than reacting to the text so he knew I saw it, I moved on. \n\nFast forward to 8 pm. Husband picks me up from subway station after a work dinner I attended. We come home and the plant mess is still all over the kitchen. I am tired and frankly frustrated that he didn't even at least let me know that he left it there and stepped over the dirt multiple times all day while making his lunch and dinner. So in the moment of frustration and fatigue, being unpleasantly surprised, I called him an asshole. And then I got the broom to clean up.\n\nAt this point my husband told me that he was going to return our cat to the adoption agency because I called him an asshole. He went so far as to look up where the cat shelter is located. I told him my reaction was half because I couldn't believe he left the mess, but half because he could have at least said to me via text: \"Hey, I'm leaving this for you to clean up when you get home\". I feel like his lack of communication was a big part of why I was so upset when I got home. While we have the agreement, he also hates a dirty kitchen and so logically might have considered that I would not expect it to still be sitting there 10 odd hours later and at least give me a heads up that I might want to grab the broom when I get home. \n\nThe \"contract\" we have does not say that he can return the cat at his leisure. I feel like his immediate leap to threatening to get rid of our family pet was out of line for the situation - he was looking up the cat shelter location as I was literally sweeping up the mess. He never had to lift a finger to clean it up.  He was just hurt that I called him an asshole, but removing the cat because I called him a name in a moment of frustration seems like a drastic escalation. AITAH?",
 "created_utc": 1701375297,
 "permalink": "/r/AITAH/comments/187rx94/aitah_for_holding_my_husband_to_task_when_he/",
 "score": 10,
 "url": "https://www.reddit.com/r/AITAH/comments/187rx94/aitah_for_holding_my_husband_to_task_when_he/",
 "comments": []
}