{
 "submission_id": "187sbvw",
 "title": "AITAH for saying my grieving family's plan is bad?",
 "selftext": "My cousin recently died in the last few weeks. We were the same age, went to the same school growing up, etc., but he was by far my least favorite cousin. I admit I am very biased, which is why I am posting here.\n\nThe issue is he was a father. He did not have custody, did not attempt to work out official visitation rights, and did not pay child support. The mother of his child is not some random woman; she is a very nice old friend of his who he dated for some time, and they broke up sometime within the first year of their child's life. The mother is, according to her social media presence, very well put together: got her degree, has a nice job, bought a house, has a supportive family. His child is clearly safe, happy, and loved, and has not been around my cousin or our family in about 3 years (since they were around 2 years old).\n\nMy cousin claimed the mother didn't let him see the child, but I have serious doubts. He had a girlfriend of a few years who he told this to, and the girlfriend and child never met. This girlfriend bought flowers for the funeral and put them in the child's name, has made posts alongside my aunt and grandmother (cousin's mom and grandmother) about how this child was the love of his life and he missed her, etc. But again, he made no attempts at visitation rights *and* admitted to not paying child support. And my family made no attempts to change this issue either, or push him to seek custody in any capacity.\n\nNow that he's gone, his mother and grandmother are obsessed with holding on to anything left of him. Which means they suddenly have a severe interest in this child. Our state has grandparent rights--meaning my aunt can sue to have visitation with the child. She doesn't want to politely ask the mother, she wants to go straight to suing because she believes the mother will reject whatever my aunt asks for. I'm struggling with this morally; on one hand, I don't want to judge a clearly grieving woman who just lost her 24 year old son, and on the other hand, I think suing for rights to a child you don't have any relationship with to be wildly inappropriate. \n\nMy grandmother was speaking to me about what the plan is (we all live near each other and she has been very, very adamant about visiting everyone since my cousin died) and I said that I think her and my aunt need to dial back and let themselves process instead of jumping straight to forcing a relationship with a child. I felt bad saying this because the situation is delicate--but again, I really don't think suing your son's ex because suddenly their child is \"all you have left\" of your son is a great idea. I think it's putting a lot of pressure on a kid and they had years to force their son to give them a relationship with this kid. My grandmother is convinced I'm cold-hearted now and is saying I'm jealous of the attention my cousin is getting from being dead--which is...ridiculous because I'd much rather be alive than have a ton of RIP Facebook posts written about me. She asked don't I care about this kid, they're all that's left of my cousin, does this mean I don't miss him, etc.? She's very upset with me and thinks I want to \"sabotage\" their plans now, which I think is very dramatic and maybe impossible.\n\nI'm feeling bad about not approaching this situation with more tact, but AITAH for saying my family needs to calm down?",
 "created_utc": 1701376300,
 "permalink": "/r/AITAH/comments/187sbvw/aitah_for_saying_my_grieving_familys_plan_is_bad/",
 "score": 13,
 "url": "https://www.reddit.com/r/AITAH/comments/187sbvw/aitah_for_saying_my_grieving_familys_plan_is_bad/",
 "comments": []
}