{
 "submission_id": "187vb0h",
 "title": "AITAH for refusing to take my toddler to his paternal grandparents house for Christmas?",
 "selftext": "Throwaway account. \n\nSo for some background context, I (29f) use to live 2 hours away from my hometown with my ex. Our relationship became financially abusive after he convinced me to become a stay at home mom when our son (16 months) was born. When I caught him cheating on me when my son was 10 months old (had been going on since the beginning of my pregnancy) I told him I no longer wanted to be with him and absolutely needed to get a job and start making my own money. I ask if we could remain roommates and I find a job with opposite hours from him, He said absolutely not if I didn’t want to be with him then get out. I ask if I could have some time to get a job and get back on my feet first, he said no. So I had no choice but to move back to my hometown and stay with family until I’m back on my feet. Since moving out he sees our son about every 4-6 weeks for a couple of hours and sends $200 a fortnight for him, that’s about the extent of his involvement. My ex is not on our son’s birth certificate and has no custody or parental rights.\nUsually when he visits I meet him in a city that’s much closer to him, although one time we met halfway and he’s come to a city that’s 30 minutes from me twice. Not long after I moved I took my son to his grandparents house which is 3+ hours away and traffic was awful near their house like it always is because of the construction that’s been going on forever. It was a disaster and his grandma said she was tired and ready for us to leave in less than two hours.\n\n\n\nNow the situation at hand, my ex called me and ask me to bring our son to his grandparents house again on December 23rd for Christmas. I told him absolutely not traffic is already horrendous on a normal weekend and I don’t even want to imagine it on the Saturday before Christmas, and I don’t want to have to strap my active young toddler in a car seat for what would most likely turn out to be a 4 our trip with that traffic where he would cry and scream most of the way. Especially when none of them have young children it’s literally 4 adults (my ex, his mom, his grandma and her live in boyfriend). The 23rd is also the day of my parents annual Christmas party which they knew very well.\n\n\n I told him I was willing to compromise and if they wanted me to come to his grandparents house it would have to be after Christmas, but I was more than happy to meet them at my ex’s apartment (2 hours from me, about an hour from his grandparents) sometime the week before Christmas, or they could all come to my parents party on the 23rd. He didn’t like any of those ideas and said he’d just tell his family they don’t get to see our son at Christmas and how messed up it was. He says his apartment is too small for everyone, but I use to live there with him and my family, which is much larger than his, would come visit us there. Then he said his pawpaw (grandmas boyfriend) can’t ride in a car because he has a heart condition but he won’t tell me what the condition is and last time we went there he drove himself to the store and stuff. He also use to come to our apartment when I lived with my ex. \n\n\nNow he’s demanding I bring him next weekend but I’m already scheduled to work and I really don’t want to anyways for all the reasons I’ve listed above. His mom and grandma are pissed. My ex said his grandma is so upset and crying (when is she not tho) and that his mom bought our son presents she wanted to give him and they’re saying I’m a cruel and heartless person. I felt like I was doing what’s best for my son and they could come here and see him for once but now everyone is saying all these things about me and acting like I’ve committed a crime, so AITAH?",
 "created_utc": 1701383675,
 "permalink": "/r/AITAH/comments/187vb0h/aitah_for_refusing_to_take_my_toddler_to_his/",
 "score": 129,
 "url": "https://www.reddit.com/r/AITAH/comments/187vb0h/aitah_for_refusing_to_take_my_toddler_to_his/",
 "comments": [
  {
   "comment_id": "kbgvfih",
   "message": "NTA. I feel like you're compromising WAYY too much. He has no parental rights, isn't really involved in the child's live, you drive more miles so HE can see the child and now you don't want to for valid reasons and he and his family attack you? Sorry, no, red flag. \nIf they want to see the child, they can come to your hometown. If the grandparents are to old to drive themselves, your ex can drive them. You are the legal guardian, you decide the circumstances regarding YOUR CHILD. Maybe no one told you yet so I will, you are way too nice, which isn't a bad thing in general, but in this case, it's time to draw clear boundaries.",
   "created_utc": 1701384212,
   "score": 221,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh0bx5",
   "message": "NTA but girl STOP.\n\nYou need to unsubscribe from all this nonsense right NOW. Tell them from now on ex is responsible for picking up child to see HIS family. Stop making excuses and enabling bad behavior. You are partly to blame for the entitlement. Inform everyone your decision and ex’s newfound responsibility towards your son and you will no longer be a doormat for them. You are willing to meet halfway at the most. Halfway to your ex’s and THAT IS IT. STOP CONTACTING ME. if you want a relationship with my son, ask the ex.",
   "created_utc": 1701386166,
   "score": 98,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh2d3u",
   "message": "10000% NTA. You need to start protecting yourself more from these people, especially your toxic ex. You have been more than fair with your comprises but he wants it his way or no way. We'll no way then, you are the child's mother and you care for him 24/7. \nNo need to explain yourself either,  he's sounds likes an abusive, manipulating SOB!",
   "created_utc": 1701386998,
   "score": 26,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbgwpog",
   "message": "NTA\n\nYou already offered multiple options/compromises to let them met your son, if they refuse to make any effort it's on them.\n\nI may sound harsh but clearly their excuses are not right or clearly lies...",
   "created_utc": 1701384723,
   "score": 17,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh2w93",
   "message": "Talk to his mom directly about the invitation to your parents house. She might have been given bad information from your ex. That might clear up the problem all together. If it doesn’t offer to do New Year’s Eve with them. If no one is willing to compromise then they lock themselves out of negotiations. But seriously, when he starts acting like a child, you should default to only dealing with adults and if his mom has been good/not problematic for you, then you should work out her seeing the kid with her. NTA",
   "created_utc": 1701387221,
   "score": 15,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbgy5m9",
   "message": "NTA. You have them plenty of alternatives and they declined them all. It’s not your responsibility to bring your son to them. Especially with as little as your ex contributes.",
   "created_utc": 1701385300,
   "score": 7,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbgyds0",
   "message": "NTA, you suggested many alternatives, and he cannot even come up with 1 that will work for both of you. You are always going to be the bad guy in their story, but you know the truth, so let them gab away. He's lying to get his way, so he deserves no consideration that compromises your child's comfort and your work.",
   "created_utc": 1701385390,
   "score": 6,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh5514",
   "message": "NTA he needs to come get his child. You need a formal agreement thru the courts. Dna all of it. He wants to be in his kids life then go thru the courts. Beyond me why y’all think this half assed agreements are better for your kid in anyway.",
   "created_utc": 1701388152,
   "score": 6,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh6wju",
   "message": "Christmas joke (NSFW) A 17 year old male walks into a drug store. He says \"I've been invited to Christmas dinner at my new girlfriend's house. Afterwards I hope there is a chance I get lucky, you know what I mean\"\n\nClerk: \"How about condoms then? They could come in handy. Here's a pack.\" The young man after paying walks to the door, stops, smiles, comes back: \"you know what, the mom is also smoking hot, I think I'll take another pack, just in case I get extra lucky.\"\n\nChristmas eve comes around, the boy sits at the dinner table and doesn't say a word. After a while his girlfriend says: \"if I had known you were so quiet, I wouldn't have invited you.\" the young man replies \"if you had told me your dad works at a drug store, I wouldn't have come.\"",
   "created_utc": 1701388893,
   "score": 5,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbha3ic",
   "message": "Nta but you really need a lawyer not reddit. Get everything custody wise locked down. All discussion about visitation, child support and the child's wants needs etc should be done through a parenting app only.",
   "created_utc": 1701390225,
   "score": 4,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh93pt",
   "message": "NTA - Sperm donor can go thru the court, prove paternity and pay child support and possible visitation. Stop enabling the deadbeat.",
   "created_utc": 1701389812,
   "score": 3,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhhris",
   "message": "Let’s see. He’s a liar, cheater, pays no child support. Won’t drive to you. He can get fucked.",
   "created_utc": 1701393427,
   "score": 4,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh7tv9",
   "message": "NTA… it isn’t your responsibility to always be the one running to them. They can blame your Ahole of an ex for making you move so far away. Shows how he cares about his son. And for him to think $200 a month is enough support for his son is ridiculous.. that doesn’t even cover half of daycare..\n\nI’ve had several heart attacks and have taken many solo long trips.. don’t let them fool you..",
   "created_utc": 1701389279,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhatgh",
   "message": "NTA\n\nHe’s making unreasonable requests then blaming you when you don’t meet them. If you like his family and think your son would get something out of those relationships, stop going through your POS ex. I fully believe he did not tell his family all of the options you gave him. Just the one that was the least effort for him.",
   "created_utc": 1701390529,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhdgkj",
   "message": "You said it yourself: he has no rights to this kid. He sends $200!!!!! per month.\n\nIf the grandparents want to see the kid, they have to come to you.",
   "created_utc": 1701391635,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhdiq0",
   "message": "NTA....He might try to convince you to let him pick LO up and take him to his grandparents house and he will bring him back. If he does DO NOT AGREE TO THIS!!!! You've stated you have nothing set up through the courts. If he takes LO anywhere and decides not to bring him back, there will not be anything immediate that you can do. You would have to take him to court to get LO back. For your and LO's sake and safety, you really need to get everything through the courts. Child support and hopefully supervised visits since it's so long in between him seeing LO. He might be consistent with giving you money every month but his visits with LO are far from it.",
   "created_utc": 1701391661,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbheqyc",
   "message": "NTA $200/month doesn't buy him the right to make demands. He can dri e the grandparents to your house for a visit of several hours and then thwy can leave. No need for a toddler to be condi ed in a career because his father is a betraying jerk. Let him do the work",
   "created_utc": 1701392173,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhg6jb",
   "message": "NTA\n\nDrop the rope. You are not required to deliver your child like a pizza. If any of these people want a relationship with your child. They can make the effort and come to you.",
   "created_utc": 1701392770,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhgk4x",
   "message": "NTA enjoy your Christmas with your son\n\n\u0026gt;My ex is not on our son’s birth certificate and has no custody or parental rights.\n\nSo, you owe him and his family nothing. At all.",
   "created_utc": 1701392929,
   "score": 2,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhitw0",
   "message": "Oh my goodness. He sure does know how to get you to do everything for him. If he’s interested in seeing his child, he needs to get partial custody. Then he will need to pick him up, take care of him, and bring him back. You are not his servant. You do not need cater to him and you need more child support.",
   "created_utc": 1701393867,
   "score": 3,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhfeea",
   "message": "Listen, you are letting him continue to abuse you.  At this point, he has no rights at all.  You need to tell him he can come pick up the child when he wants to see him.  You need to stop driving at all.  I would send his family a text--a group text--telling them these are the days they can come/send someone to pic up the child for the holidays.  All they need to do is make arrangements ONE FULL WEEK in advance.  If you really are ok with them visiting you at your family's Christmas (and I don't think you should), you could offer that.  Tell them that until his parental rights are established, and you have a formal custody and visitation agreement, you aren't going to do any more.  He needs to step up to the plate and do that.  But beware:  if he does, you will have to share the child more.  If he doesn't, you won't be eligible for child support either.",
   "created_utc": 1701392441,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh69s4",
   "message": "NTA\n\nFor $200 a week and occasional visits, he should always come to you. As a grandma, you would be welcome at my home any time. And if you invited me to your shindig I would be there.",
   "created_utc": 1701388624,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbh6kyi",
   "message": "NTA, if they want to see the kid, they know where you live. They have to accommodate your schedule.",
   "created_utc": 1701388755,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhahmx",
   "message": "You really should reconsider amending birth certificate, once DNA has confirmed your ex is the father. Your ex would most likely be ordered to pay more than 200/ month. And, your son would be entitled to ex's SS, if he died while son is a minor.",
   "created_utc": 1701390390,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhb257",
   "message": "NTA.  Grandparents don't want to see your child, the whole gruesome coven just wants to exert power over you.\n\nDrop the rope.  He's not worth the $200 fee.",
   "created_utc": 1701390631,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhbl2j",
   "message": "I know of no heart condition that would prevent travel, except for people who get blood clots, they can still travel, they’re just told that they need to get out of the car every hour or so, and walk around for 10 or 15 minutes. Other than that there are people that need to elevate their legs, but for shorter car rides, they can just get up and walk around and it’s about the same. NTA, I think you’re being manipulated and gaslighted honestly asked to see a note from the doctor about the heart trouble, it’s especially suspicious, since he won’t even tell you what the diagnosis is.",
   "created_utc": 1701390854,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhbo0d",
   "message": "NTA. Just stop all the driving back and forth. HE kicked you out with NO money and no options but to move home. If he wants to see his son, he can drive to see him.",
   "created_utc": 1701390889,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhbptt",
   "message": "NTA.",
   "created_utc": 1701390909,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhcukz",
   "message": "NTA but if he is the dad I'd be weary of him now getting a paternity test and get partial visitation.\n\nHe doesn't have to be in the birth certificate to have parental rights.",
   "created_utc": 1701391383,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhd6jj",
   "message": "NTA. However 200 a month for his child is bs, take him to court and get what the baby deserves!",
   "created_utc": 1701391519,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhdc6d",
   "message": "NTA\n\nStop facilitating this relationship you are only stressing yourself and he is a danger around your son. Protect your baby.",
   "created_utc": 1701391584,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhdy65",
   "message": "NTA but stop. If he or them want to see your child, they can cone to you. Do not do anything for him or his family.",
   "created_utc": 1701391842,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhe0r9",
   "message": "NTA. You’re bending too far backwards for a man who won’t step up and be a father to his child! If he wants his family to see his son, then HE can make the arrangements to come get him, take him to visit and then bring him home!! He barely pays child support and expects you to bend over backwards compromising for his benefit! \n\nStop being a doormat and hold his ass accountable as a father!!",
   "created_utc": 1701391871,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhepar",
   "message": "NTA, your using that measly $200 up in time and gas",
   "created_utc": 1701392154,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhf1r1",
   "message": "Why is he making demands when he has absolutely no parental rights? He can make the drive to you to see his child. Your still bending over backwards for him and his family.",
   "created_utc": 1701392295,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhg7d5",
   "message": "NTA. Ok, that is just a shit family. Keep your son safe and forget about them. If your son wants contact with them when he is older, let him. But for now, keep your son safe and stop being a doormat.",
   "created_utc": 1701392780,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhguw6",
   "message": "Have you spoken with his mom and grandma directly? I bet you he hasn't truly explained why you can't make it and how if they want to see him it'll have to he a different day",
   "created_utc": 1701393053,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhh22x",
   "message": "Why ion the name of the fuck are you compromising so much?  \nMOTHER! Love thyself!",
   "created_utc": 1701393133,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhhia6",
   "message": "''He didn’t like any of those ideas and said he’d just tell his family they don’t get to see our son at Christmas and how messed up it was''   \n\n\nSoooo what about him cheating, is that messed up? Probably not as messed up as calling his grandmother's boyfriend ''pawpaw'' what a family of weirdos NTA",
   "created_utc": 1701393320,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhhp8j",
   "message": "NTA.  He has no rights, isn’t seeing the child \u0026amp; sure isn’t paying a reasonable amount of support.    \nIf you want to be fair - text his mom \u0026amp; say they are welcome to visit you on X day between y \u0026amp; z at your house.    \nIf no say ok, if yes buy some cookies \u0026amp; don’t leave them alone with the child",
   "created_utc": 1701393400,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhivz6",
   "message": "NTA….. stand your ground",
   "created_utc": 1701393890,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhixd3",
   "message": "As a divorced single mom myself, 100% NTA and fuck him. If he wants to start these kind of bs demands and continue to emotionally abuse you, then tell him to fuck off. If he's not on the birth certificate then most likely YOU HAVE FULL LEGAL CUSTODY. If you can get by without the $200/month  he gives, then cut all contact. You don't owe him jack shit. I wish my ex wasn't legally entitled to be in my son's life but that's own issues not yours. You have to protect your baby AND do what's best for you and your emotional well-being. Cut this asshole out of your lives like the cancerous tumor that he is",
   "created_utc": 1701393906,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhj9p5",
   "message": "Nta. \nHe is not even on the birth certificate. \nIf he wants he can visit at your city and your place. Stop giving them ammunition to go after crazy stuff in the future.",
   "created_utc": 1701394048,
   "score": 1,
   "submission_id": "187vb0h"
  },
  {
   "comment_id": "kbhk7sl",
   "message": "NTA. \nHe’s guilting you for sure. You aren’t in the wrong. You also provided multiple other options. He so wanted to make you the bad guy from the drop.",
   "created_utc": 1701394433,
   "score": 1,
   "submission_id": "187vb0h"
  }
 ]
}