{
 "submission_id": "187x8d0",
 "title": "AITA for making my husband drive himself to the ER?",
 "selftext": "When my son and I returned from school pick-up today, my husband \"Zach\" greeted us, grimacing. He was clearly in some pain and explained that he was sitting at his desk working, turned to the side to get something, and felt a painful twinge. I asked him to consider calling the chiropractor or doctor ASAP. He shuffled upstairs and said he'd think about it. I made dinner and tended to kid. He came downstairs again and asked me to help him put on some pain relief cream and I did. Zach started pacing the floor, wondering aloud if it was something more than a tweaked muscle, maybe a kidney. Here's where I started to become a possible AH. I told him his kidney was much higher than where he was having pain. I pressed on his kidney and he said he had no pain. He still insisted it might be his kidney. I took a deep breath and explained \"Are you blinded with pain? Do you have the chills? If you feel like you cannot sit, or stand, or move, and urgently need medical help? Bc that's a kidney issue. I would know. I've have multiple kidney infections and kidney stones.\" Zach \"No...\" I sat down to eat (I had offered to get him a bowl earlier and bring it to the bedroom, so he could put up his feet and eat but he declined that). He started getting his own dinner, but yiped in pain. Then he looked at me and said \"Ok I need to go to the doctor but I need your help.\" And something in me changed. I stared at him blankly. I said no. \"Why?\" Because when I've had kidney issues, I've driven myself because he was too busy to help me/didn't take me seriously. He argued that once, he did take me but I told him it was only after I was in so much pain and explaining I need to go to the doctor, can you help me -- that I got to a point I couldn't move and had to be carried. I told him \"Fine. I'll take you but when you get pain meds, can I complain when you need to open the pill bottles in the morning that you are being so loud, are you trying to wake me??\" Because yup, that's how he reacted the morning after he drove me the one time to the doctor. And that's just kidney issues. I have a number of stories of me being terribly sick or in pain and taking care of seeking medical help myself bc he just could not understand my urgency. I've bawled and screamed to him about how scared I am that one day I will be too ill or injured to help myself and he will not help me, that in this specific way, my trust is broken. That I am very angry, and the anger comes from fear, and it's something I can't seem to let go. He's apologized sincerely, many times BUT something will happen and the cycle begins again. We are in a healthy relationship otherwise (hand over heart. We've been married for 10 years and I am too old for any bullsh\\*\\*. Well except for this.). So he left for the ER himself. AITAH for my reaction? For making him drive himself to the ER? (Please don't tell me we need a divorce. No we do not. All people have strange hangups and serious flaws.)",
 "created_utc": 1701388602,
 "permalink": "/r/AITAH/comments/187x8d0/aita_for_making_my_husband_drive_himself_to_the_er/",
 "score": 16,
 "url": "https://www.reddit.com/r/AITAH/comments/187x8d0/aita_for_making_my_husband_drive_himself_to_the_er/",
 "comments": []
}