{
 "submission_id": "1882gtd",
 "title": "AITAH for threatening to call the police on my BIL after he threatened to kick me out of the shower?",
 "selftext": "I (22F) live with my parents atm. I have two siblings (33F, 25M). My sister got married last year to her husband (33M). Although I haven’t wronged him in any way, he cannot stand me at all. Literally from the moment we met he could barely contain his hatred. Don’t ask me why, I don’t get it either but I suppose some people just dislike you for no reason. \n\nAt the start my parents would ask my sister about his strange behaviour towards me but she insisted that he doesn’t mistreat me. Ever since then the subject matter does not get brought up. \n\n(Btw he intentionally excludes me from everything. Gifts, vacation, fancy dinners. He spoils my family and I never get included)\n\nAnyway I had a couple job interviews lined up in my sister’s town and she offered me to stay at their house a couple nights instead of travelling back and forth. After I spent the first night with them I went to take a shower in the morning. \n\nSuddenly there was loud banging on the door and her husband asking me what I’m doing. I told him that I’m showering and would be finished soon. He kept banging on the door and yelling that I should get my stuff and leave. That I’m awfully entitled and bratty and show his home no respect. \n\nI was pretty shaken and didn’t know what to do. He said that I’m “disgusting” and shouldn’t be using his bathroom bc  “god knows” where I’ve been (?). Btw they have multiple bathrooms and at first I thought he was mad I used his one. But he didn’t want me to shower in any of the bathrooms. \n\nAfter I left the bathroom, dripping wet and shaken, I threatened to call the police on him because of his threatening behaviour. He started yelling even more and I called my sister crying (she was at work). She came home and managed to calm the situation. \n\nHowever now she thinks that threatening to call the police on her husband was a step too far. She said that I’m silly for even thinking he would cause me any harm. Even my parents agree that I shouldn’t have done that. I explained multiple times that I truly felt scared of him in that moment and panicked. \n\nAm I the asshole in this situation. Any advice is welcome",
 "created_utc": 1701403454,
 "permalink": "/r/AITAH/comments/1882gtd/aitah_for_threatening_to_call_the_police_on_my/",
 "score": 41,
 "url": "https://www.reddit.com/r/AITAH/comments/1882gtd/aitah_for_threatening_to_call_the_police_on_my/",
 "comments": [
  {
   "comment_id": "kbicdd5",
   "message": "Does your family seriously think you’re lying and he’s a saint? Start recording these incidents and shove it in their faces. Get to the bottom of this cuz he’s giving serial killer vibes.",
   "created_utc": 1701406457,
   "score": 128,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbidpbd",
   "message": "Get a hotel room and do not return to your sister’s house. Stay as far away from BIL as possible. For your safety, avoid or leave situations where you are alone with him. If you cannot leave the situation, start recording. This man is not right. Also, how the hell is your family so clueless about his behavior? Especially when he deliberately excludes you? And wtf is wrong with your sister?",
   "created_utc": 1701407160,
   "score": 43,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbi88tg",
   "message": "NTA if you genuinely fear for your safety calling the police is the right move.  You were an invited guest and you weren't doing anything wrong, sounds like your sister's husband is just a right jack ass though and he obviously waited till your sister wasn't around.",
   "created_utc": 1701404477,
   "score": 212,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbibqdm",
   "message": "What did your sister say to him? It's kind of shitty that she allows him to treat you like that.",
   "created_utc": 1701406133,
   "score": 4,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbigra5",
   "message": "Ask your Sister why he's acting like that.",
   "created_utc": 1701408853,
   "score": 123,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbidv3n",
   "message": "NTA but he is. Watch yourself around him and try not to be alone near him. I am worried for your safety when he’s around, and stay safe.",
   "created_utc": 1701407246,
   "score": 110,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj02m2",
   "message": "1) he is attracted to you\n2) he is conditioning your family to believe that you generally “over react”\n3) he is setting a precedent in your family that “you dont like” him.\n\nyou need to cut contact with your sister and stay far the fuck away from her husband.\n\nNTA",
   "created_utc": 1701422921,
   "score": 109,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbior5l",
   "message": "*(Btw he intentionally excludes me from everything. Gifts, vacation, fancy dinners. He spoils my family and I never get included)*\n\n\u0026amp;#x200B;\n\nDoes the rest of your family go on these vacations and to restaurants without you? If so they're AHs",
   "created_utc": 1701413983,
   "score": 186,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbia0zl",
   "message": "He has a thing for you. Very repressed it seems",
   "created_utc": 1701405311,
   "score": 17,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiieip",
   "message": "...\n\nWtf.\n\nNta but what is wrong with your family?\n\nWhy does your sister immediately blame YOU for HER husband flipping out? Can he not manage his OWN emotions...? You have to \"be sweet\" or he can't maintain himself?\n\nAnd you're not the one who started it. He flipped out over you showering.\n\nHis comments have \"dirty little sl\u0026amp;t\" vibes which is freaking scary. \n\nI agree with whoever said he's into you..\n\nHe wants you. He's angry he can't have you. He's icing you out and TRYING to keep distance because he's a Neanderthal who knows he has no self control so he's scared he's going to take what he wants (read between the lines).\n\nStay away from this man and your sister who excuses abusive behavior.\n\nTerrifying. Truly.\n\nOh. And file a report with the police. Fuck them.",
   "created_utc": 1701409817,
   "score": 117,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiqs61",
   "message": "He is working his way up to do violence on you in the future. He’s trying to train your sister to believe that you provoked the behavior when he does it. You may have to cut contact with your sister just to avoid him. Don’t ignore what your gut tells you. He is a danger to you.",
   "created_utc": 1701415461,
   "score": 110,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbicway",
   "message": "Your parents noticed so now he actively hides his behavior from your sister and parents. I would not ever be alone with him and if it is unavoidable, make sure you record everything.",
   "created_utc": 1701406734,
   "score": 105,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbim753",
   "message": "NTA\n\nAnd, sister is still saying he is not 'mistreating you'? Well, physically he is not (yet!).  \nBut verbally ..\n\nLeave, low contact with sister - and if you really want to drive home the point - tell parents that if BIL will be there - you will not - due to him behaving in such a way you thought you might need to call the cops on him as you felt so unsafe.  And that sister downplays this (beeps) actions.",
   "created_utc": 1701412237,
   "score": 31,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbisifu",
   "message": "To be blunt, OP, I think he purposefully did this while you were 1) alone without your family there and 2) naked, in a vulnerable position so you’d have no choice than to deal with him. I think he gets off on intimidating / controlling you. At the very least he feels entitled to doing so, but he also seems so centered on it that it comes across as a game for him. \n\nTo be real, it probably isn’t limited to you; he has likely done this to other young women in the past. He doesn’t do it to your sister (that we know of) because he either has some warped seeing her as his property therefore she’s a respected extension of himself, or because your family clearly has her back so she isn’t seen as isolated and therefore not an easy target. But you are the youngest, and you’re a woman, and he sees how little the others listen to you—prime target to bully or worse. Classic misogynistic abuser shit.\n\nI don’t think you’re being dramatic at all. This man takes enjoyment from or the very least feels entitled to degradation of you, and I bet if we could dig deep enough, there’d be a long history of people he did this to—classmates, cousins, situationships, etc. \n\nI also tbh second what people are saying about him potentially finding you attractive and having some warped resentment due to it. \n\nI genuinely do worry it could escalate into violence. I say this not to scare you but to highlight patterns in him I’ve seen in others in my own experiences. Any time a man has tried to force his way into a moment known damn near universally as private—showers, bathroom time, being in the room while I was sleeping alone, wanting to be in my apartment unannounced— he has wanted intimate access in seriously inappropriate ways. I truly feel this applies here with your situation. \n\nPlease get away from this guy, please don’t stay over there any longer, and absolutely double down on calling the cops if need be. And get some pepper spray fr. Your sister is either being heavily manipulated or is entirely dick whipped, and I am concerned she will continue to blame you even if he does something more drastic. Unfortunately you probably can’t trust her while she is doing her dance over believing the best in him, and that’s important to keep in mind while you find ways to protect yourself.",
   "created_utc": 1701416772,
   "score": 33,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbifdae",
   "message": "FYI: if you're feeling in danger, don't threaten to call the police... just do it. Because if it's a real threat, you just gave them an opportunity to prevent your call for help. NTA.",
   "created_utc": 1701408071,
   "score": 108,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbio5zi",
   "message": "So I’m pretty sure he wants to have sex with you. He is treating you badly so that when he asks for sex you give in so that he will treat you better. He is also isolating you from your family so that if you tell them, they won’t help you or trust you. I’ve known men who treat the younger sisters of the women they married like this, and it’s almost always because they eventually want to sexually assault them and get away with it. \n\nThe shower thing was an escalation. The next time he will walk in to see you naked and justify it using this last time when he asked you to get out and he will say “she didn’t so I had to walk in.” After that, it’ll be your bedroom. He is pushing you into a corner and crossing boundaries. \n\nRun. Your family is being bought and they will sell you into sexual slavery with him to continue the lifestyle and nice dinners. Don’t trust them and don’t trust your sister. \n\nFind a friend, a shelter etc. Run.",
   "created_utc": 1701413575,
   "score": 153,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbim3fk",
   "message": "You need to record any interaction you have with him (don't let him see you doing this) and replay it for your family so they can see how he treats you! NTA",
   "created_utc": 1701412167,
   "score": 24,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbirfdw",
   "message": "I cannot stress how much you are NTA.\n\nYou were a guest in your sister's house being insulted and threatened by someone (her 33 year old husband, who is a decade older than you) with a concerning history of actively malicious (at worse) and cruel (at best) behaviour towards you, at a moment you were very vulnerable, when you were alone with him in a home that isn't yours.\n\nI think it's perfectly reasonable you were legitimately afraid for your safety in that moment. I only hope that if you ever have to make a threat like that again, you have the means to follow it up quickly.\n\nPlease try to keep yourself far, far away from your BIL if you can, and avoid situations where you are alone with him. I have no idea what his intentions are, but he's proven himself to be obsessive and threatening, and that's never a good thing.\n\nI'm so sorry your family would just outright dismiss your concerns in a moment when you were genuinely afraid, rather than ask themselves why you should *ever* experience a situation in your sister and BIL's home that made you feel this way. This hardly sounds like the first time he's pulled something wildly inappropriate, and I get the feeling this is going to escalate as long as your family continues to enable it. I would recommend that at the very least, you keep your phone close at hand around him at all times, and set your voice recorder or video camera to a hot-key (if it has those) to record him in the act should he continue to behave this way around you. Good luck and stay safe OP.",
   "created_utc": 1701415947,
   "score": 19,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbijyr3",
   "message": "\"where youve been\" says it all\n\nThis man wants to fuck you. And in his head its your fault. Otherwise why was being naked SUCH a stimulant.\n\nPlease explain this to your sister, as his method of coping has now gone from avoidance to aggression.\n\nNTA",
   "created_utc": 1701410779,
   "score": 124,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj2ufy",
   "message": "\u0026gt;After I left the bathroom, dripping wet and shaken, I threatened to call the police on him because of his threatening behaviour. He started yelling even more and I called my sister crying (she was at work). She came home and managed to calm the situation.  \nHowever now she thinks that threatening to call the police on her husband was a step too far. She said that I’m silly for even thinking he would cause me any harm. Even my parents agree that I shouldn’t have done that. I explained multiple times that I truly felt scared of him in that moment and panicked.\n\nWell, it's pointless asking your sister, since the point for her husband was obviously having to get her to come home from work and disrupt her day and blame you.\n\nBut ask your parents, every time they say you \"overreacted\" how they feel you should behave to a 33-year-old man yelling verbal abuse at you for showering in the morning. Point out to them you were naked, alone, away from home, and a man over ten years your senior was banging on the door and shouting at you for being \"disgusting\" because you are taking a morning shower and \"god knows where you'e been\". Ask how your parents feel you should have protected yourself from a verbally abusive and threatening adult man who is literally threatening to throw you out of the place you're staying before a job interview, because you are taking a shower and he thinks you are \"disgusting\". Ask them if they agree wth him that you are too \"disgusting\" to be allowed to shower: if they agree with him that you deserve only verbal abuse for showering before a job interview.  Ask them if they really think his behaviour was rational and sensible and you ought just to have accepted it; left the shower and the house as soon as he ordered you to.  Ask them why they think this is perfectly valid behaviour from your brother-in-law to you as an invited guest.   \n\n\nYou did not overreact. This sounds terrifying.   \n\n\nNTA.",
   "created_utc": 1701425238,
   "score": 18,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbignqw",
   "message": "I think sister knows the reason or maybe she said something to her husband sister is sus",
   "created_utc": 1701408798,
   "score": 34,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbihigc",
   "message": "NTA. So sorry you experienced this. Avoid him like the plague. You should not feel obliged to “make nice.” Tell everyone you don’t feel safe near him. Your family is gaslighting you. Stick to your guns. Don’t be argumentative but be firm. Good luck!",
   "created_utc": 1701409288,
   "score": 35,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiugku",
   "message": "God knows where you've been? No one in your family had anything to say about that? They're just going to let that remark slide? Your sister not believing you were 21 when you started to date? Your sister says, \"He doesn't think about you at all.\" An odd ass reply to why does he hate me.\n\n Listen, your sister doesn't love you. She's just as weird as her freak husband. And your family is weak sauce for picking money over your feelings and safety.  Ugh, I don't want to go off the deep end. But ole nutso sounds loaded and you sound young, beautiful,  and most importantly...groomable. Keep your distance, don't even worry about the \"whys\", just keep your distance. If your family wants to pry, tell them to let your ass be \"dramatic\" by yourself, please. I don't want to think they'd gorilla-pimp you out, but from the little info I'm getting...🥶",
   "created_utc": 1701418284,
   "score": 15,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbip3lx",
   "message": "NTA at all. Is your family siding with him because he has money? You mentioned fancy dinners and vacations. This saddens me for your sake. I have no helpful advice other than to reiterate what others have said. Keep your distance, don’t engage with him, if you ever find yourself alone with him put your phone on record, and most importantly, make sure you’re positioning yourself to be able to be financially independent and not having to live with a family who’d rather go on paid vacations and get expensive gifts than stand up for their daughter.",
   "created_utc": 1701414232,
   "score": 14,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbixnmy",
   "message": "NTA. So he has loved bombed the family and manipulated them into thinking he's the greatest guy ever. \nThe short answer is don't ever put yourself in the vicinity of this AH again. \nYour sister is an equal culprit in the situation.",
   "created_utc": 1701420894,
   "score": 17,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbihacf",
   "message": "NTA\n\nAlso, your entire family is sh**.\n\nHe continues to treat you terribly bc they let him.",
   "created_utc": 1701409155,
   "score": 42,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj241a",
   "message": "Is there any way you can start filming his behaviour?  Even an audio recording might help. Get several examples before sharing with your family.\n\nAnd stay safe.",
   "created_utc": 1701424633,
   "score": 14,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbimcd6",
   "message": "NTA at this point, I would go as low contact as possible with my sister and even the rest of my family. If they're happy to disclude and gaslight you because he \"spoils\" them - fuck 'em. They're lucky you only thought about calling the police and didn't just do it. I'm sorry you're being treated this way.",
   "created_utc": 1701412335,
   "score": 11,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiqchg",
   "message": "Time to start recording his behaviour. He sounds unhinged",
   "created_utc": 1701415141,
   "score": 11,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiuhoe",
   "message": "Your parents are failing you. You’re NTA but you need to stay away from him. The comments here about him wanting you sexually are 100% true.",
   "created_utc": 1701418307,
   "score": 11,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj1lfh",
   "message": "OP immediately leave her place and move to a hotel. Send a group text recounting the entire incident to your parents and sister as proof that her husband did this to you. Write exactly how unsafe you felt for this man to stand outside the bathroom door and threaten you.\n\nBlock your sister and her husband so they can’t personally contact you anymore. Something is going on here and this has to be beyond just hate. He is trying to intimidate you and specifically target you for some reason.",
   "created_utc": 1701424198,
   "score": 11,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbimp27",
   "message": "Update me please",
   "created_utc": 1701412570,
   "score": 9,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiwkpl",
   "message": "NTA\n\nAnd it sounds like you should take some steps back from your \"family\" since they very clearly do not care for your well being.\n\nYou are under no obligation to stay in contact with people, just because you happen to share blood relations.",
   "created_utc": 1701419993,
   "score": 7,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiwky5",
   "message": "Sounds like a bad Lifetime movie. Stay away from him at all costs. Something is not right about him.",
   "created_utc": 1701419999,
   "score": 9,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbitwnz",
   "message": "NTA, but what in the world is wrong with this man. He's 11 years older than you but acting like he's 11. \n\nHe belongs in an asylum because that's crazy behavior towards someone who has never done anything to you. \n\nDo you think he could actually have a crush on you and is dealing with it by hating on you?? Completely bizarre behavior.",
   "created_utc": 1701417851,
   "score": 8,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiv70s",
   "message": "NTA, though it sounds like there's something else going on here. That sort of singling out is dangerous, and I'd be worried about him around any family member of mine that he excluded or acted that way to. \n\nHope you're in a safe situation now.",
   "created_utc": 1701418866,
   "score": 8,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj00cg",
   "message": "NTA- You shouldn’t have threatened to call the police, you should have called them, and let him explain his behavior to the cops.",
   "created_utc": 1701422867,
   "score": 9,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj13s4",
   "message": "Please start recording interactions with him.  He’s conditioning everyone to not believe or to downplay the violence he’s showing towards you.  I’m not sure how he’s getting everyone to ignore how he’s isolating you but this is very very serious.  Your sister may be throwing you to the wolf she married bc she’s afraid of being the one he targets.  I can not imagine the mental hoops your parents are going through to not protect you. Please, you are in serious danger from this man.  Be very very protective of yourself and start documenting everything with dates and sample dialogue",
   "created_utc": 1701423789,
   "score": 9,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiilfv",
   "message": "IMO your sister probably bitched about you or something. Or he is into you.",
   "created_utc": 1701409932,
   "score": 23,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbimjso",
   "message": "Holy shit NTA. Wtf is wrong with your sister and her husband???? What is going on in her day to day that she is able to twist the situation in her own mind to be acceptable? I’m worried for her.",
   "created_utc": 1701412473,
   "score": 7,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbisiti",
   "message": "NTA you were genuinely in fear.",
   "created_utc": 1701416780,
   "score": 7,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbiuc5v",
   "message": "You did nothing wrong, and in all honesty I would avoid this guy at all costs in the future. And if that means going no contact with your sister, it’s unfortunate but clearly this man is fucked in the head and you do not need this in your life. The next time he comes near you set your phone to record",
   "created_utc": 1701418184,
   "score": 6,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbivizm",
   "message": "NTA. Stay away from him at all costs and let your sis know. You did nothing wrong.",
   "created_utc": 1701419132,
   "score": 7,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj1ay2",
   "message": "OP stay far away from that guy,  just keep tabs on your sister from a distance.",
   "created_utc": 1701423957,
   "score": 7,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj3kuf",
   "message": "You are in no way the AH. It seems like he is into you and mad at himself for “picking the wrong sister”. It feels like he is trying to make it out to be your fault for his feelings and in turn wants to make you feel bad about yourself by excluding you. Also the comment “where you’ve been” while you were in the shower is insinuating that he thinks about you in a sexual way. Your sister seems to see this in him and is in denial about it and why she is not supporting you. I’m sorry this is happening to you but please keep yourself safe and try to talk to your parents and brother again about the situation and how uncomfortable you are to be around him.",
   "created_utc": 1701425842,
   "score": 7,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbjejrk",
   "message": "That's disgusting and abusive. He is either singling you out, or attempting to isolate your sister from the family with you as the guinea pig.\n\nEither way, not acceptable. You need to not be where he is: do not attend any event that he will be attending, and make it clear to your family and your sister why that is. Make it clear that them prioritising his feelings over your literal fear of physical harm represents them choosing him over you, that you cannot allow their bad behaviour to put your safety at risk.\n\nYou need to set *very* firm boundaries here. Your fear for your safety was very well founded.\n\nAnd you need to move out of your parents' place as soon as possible, because they do not prioritise your safety and, I assume, will not bar this man from entering their property. \n\nDo not be alone with this man, anywhere, ever again.",
   "created_utc": 1701433533,
   "score": 8,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbjhzxg",
   "message": "NTA - in what family can an outsider come in and treat one of the family members like this? That dude would be excluded by my family so fast",
   "created_utc": 1701435451,
   "score": 5,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbigj3g",
   "message": "Nta.\n\nYou were in a vulnerable state, and you had a man screaming at you. Stay away from him, I doubt your family will listen to you if there are any other circumstances.",
   "created_utc": 1701408725,
   "score": 17,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbigviu",
   "message": "NTA but wtf is your sister doing with this mean ah?? What did she say about his verbal abuse of you and the horrible things he was saying? I wish you had him recorded! He sounds awful. I would definitely not ever stay there again!",
   "created_utc": 1701408920,
   "score": 18,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbihf94",
   "message": "It seems like he’s othering/dehumanizing you. Not that you need convincing after this, but stay far away from him.",
   "created_utc": 1701409236,
   "score": 17,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbj8l6q",
   "message": "It wasn't about the shower. This has already escalated into abuse. Do not go to your sister's house anymore. Do not attend family functions at which this man is present. Tell everyone why: you fear for your safety. If they don't like it, they can go ahead and miss your presence.",
   "created_utc": 1701429673,
   "score": 6,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbib9rn",
   "message": "I feel like there is a lot of missing info here.",
   "created_utc": 1701405902,
   "score": 29,
   "submission_id": "1882gtd"
  },
  {
   "comment_id": "kbje4t6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1882gtd"
  }
 ]
}