{
 "submission_id": "1887ir2",
 "title": "My SIL (41) is enraged her new boyfriend couldn't come to the wedding-dinner, AITA?",
 "selftext": "Throwaway, because... well obviously. Sorry for the long read.\n\nI (31f) recently married my husband (33m). After 2,5 years of dating. We had a small courthouse ceremony with just our 2 best friends as witnesses. It was lovely, personal and sweet. \n\nWe had informed his family we would be doing it like that beforehand, and that we'd celebrate together by ways of a dinner, which we'd obviously be paying. Although his mother (my now MIL) was disappointed she did understand the why.\n\nMy husband is from a big family with a lot of nieces, nephews, cousins, aunts and uncles. People who he rarely ever sees or speaks to, people who I haven't even met. I, on the other hand, have cut ties with all my family living in the same country and have lost contact with most who live in another continent. My chosen family are my closest friends, and I'm happier \u0026amp; healthier that way.\n\nThe problem starts almost directly after the wedding: my husband created a grouptext (which he forgot to add me to...) to invite everyone (his father and his stepmom, his mother and his stepdad, and both his older sisters - twins) to the dinner. Everyone was excited and in a celebratory mood. When all of a sudden one of his sisters (41f) just mentions she'd be taking her boyfriend (of a few weeks/months at that time) along.\n\nMy husband didn't really mind it that much, although he found it weird she didn't just ask (we haven't met him, and we're the ones paying) to bring him to the dinner. He just wanted to call her out on her ways when we'd get to the restaurant. That didn't seem like a good idea to me. I did mind; this was our dinner to celebrate with his direct family, for them. Not for her to introduce her new boyfriend officially into the fold.\n\nIt'd be different if we'd met him before; but ever since she's been dating him she hasn't been in contact much. Which is fine; new love is exciting and blindly infatuating at times. Secondly, I don't do well with new people, and going out to dinner is anxiety-inducing enough for me.\n\nAfter some back-and-forth with my husband I decided to text my SIL asking her to accept \u0026amp; respect our wishes to keep it small and that we'd love to meet her boyfriend soon some other time. My text was kind and courteous, but clear in it's message.\n\nAfter hours, I finally got a response (mind you this is the day after our marriage) stating that if he (her bf) couldn't come, she wouldn't be coming either. That she didn't understand why she'd have to ask to bring her boyfriend, and that this would be the perfect opportunity to introduce ourselves (disagree). Following it up by saying I should not contact her again, because she wouldn't respond, and that she didn't understand why I'd even message her to begin with, because she was talking to her brother. And that he (her brother, my husband) could contact her whenever he'd \"got his mind back\" (implying he'd lost it).\n\nThis message had me seething and crying at the same time. I found it to be extremely disrespectful and completely out of character for her. It wasn't exactly the \"welcome to the family\" I'd hoped for. Nevertheless I did respect her request not to message her again, so my husband texted her instead, privately.\n\nShe wasn't much kinder to him, and after some back-and-forth he said he'd call her (his sister) tomorrow (the day of the dinner) because the text-conversation wasn't getting anywhere and just escalating.\n\nSo the day of the dinner arrives, and he calls her; she doesn't pick up. He calls her again, no response. At this point he's just sad and disappointed she won't be there to celebrate. Something that should've been a celebration turned a bit sour. \n\nWe continue with our plans, and shortly explain the situation to his family there. No details, just that there's been a disagreement. They're all befuddled, but we enjoy our dinner anyways.\n\nWe learned later that his sister hadn't come to his bachelor's party for the same reason; her boyfriend not being invited. His family is now aware of the situation and how she responded to it, it all seems so childish and entitled... very uncalled for.\n\nIt's now almost 4 months later, and there's been no contact between my husband and his sister. Not because he hasn't tried, but because she doesn't answer. I've encouraged him to send her texts or call, but he doesn't know what's best. Again, this response was very out of character for her. He's at the point he's willing to \"set her up\" (coincifdentally dropping by when she's at their mother's place) to be able to talk to her in person.\n\nI'm unsure what the right course of action is here. I've expressed that I'd like an apology from her in due time, but his family doesn't expect me to get one from her. I don't feel comfortable letting someone talk to me like that without consequences (I haven't cut ties with my toxic family to just roll into the next one). But at this point I just want him to have his sister back... so AITA?",
 "created_utc": 1701421746,
 "permalink": "/r/AITAH/comments/1887ir2/my_sil_41_is_enraged_her_new_boyfriend_couldnt/",
 "score": 154,
 "url": "https://www.reddit.com/r/AITAH/comments/1887ir2/my_sil_41_is_enraged_her_new_boyfriend_couldnt/",
 "comments": []
}