{
 "submission_id": "1888jik",
 "title": "AITAH for not being at my ex wife side when she died?",
 "selftext": "Two years ago my, 32 at the time,then wife, 32 at the time, was diagnosed with stage 3 leukemia , Her prognosis was not very clear and she could have gone either way.fortunately insurance and both of us having well paying jobs allowed us to afford her care. \n\nAbout a month into her treatment she dropped the ball on me that she wants a divorce. Her explanation was that she was happy but because we got married so young, we were both 22, she feels like she missed out on a lot in life and wanted to experience it with what little time she may have left.  I was in shock at her want to divorce, I offered couples therapy which she denied because she said that there is nothing wrong with us, something I believed myself to be true. I tried to give her some distance and we separated because I held off on the actual divorce for a year, the last month before the divorce was almost completely no contact. I called her one day and told her I am bringing the paperwork back to her, signed. In person at her house, I gave her the papers and told her that I would take her back, no questions, not worries, and I would be with her through the rest of this if she wanted, but if I left that day then I wouldn't come back. After a short conversation I left and not long after the divorce was finalized. \n\nI spent time letting go and moving on, I didnt date anyone else, I dont think she did either but I didnt care if she did. About 10 months after the divorce her friend reached out to me. She told me that my ex never responded to treatment and was in the hospital just waiting for the end. She cried a lot and was scared about dying. She never asked to see me or mentioned me, at least when this friend was around but she was over heard saying at one point that she made a mistake and she may have been referring to our divorce. The friend said I should see her and try to give her some comfort but I refused. \n\nSince the diagnosis I had to try and come to terms with her dying, with her wanting to leave me, with being apart from her, and then finally losing her. I know she was struggling but I was too, it was painful for the only person I loved to push me away and tell me there is nothing I can do for her. I know seeing her would just bring all the pain back, likely for us both, and she made the choice to let me go. She died a month after her friend talked to me. \n\nMy decision was not vindictive or meant to be a punishment, but it was selfish because I didnt want to let her break my heart again whether she wanted to see me or not. I didn't go the the funeral, that decision was not to be selfish but because I didn't want attention to be taken from her, nor did I want to talk about the divorce at that event. I have visited her grave to say my final goodbye privately and her parents have reached out and let me know that they harbor not ill-will towards me. I have not had contact with her family or non-mutual friends since.\n\nAITAH for not going to see my ex on her deathbed?",
 "created_utc": 1701425975,
 "permalink": "/r/AITAH/comments/1888jik/aitah_for_not_being_at_my_ex_wife_side_when_she/",
 "score": 87,
 "url": "https://www.reddit.com/r/AITAH/comments/1888jik/aitah_for_not_being_at_my_ex_wife_side_when_she/",
 "comments": []
}