{
 "submission_id": "188cf17",
 "title": "AITAH for telling a guy I can no longer continue to go on dates with him as he lied about having a child.",
 "selftext": "I (20F) went on a good few dates with a guy (25M). Everything was going well, and they guy was really nice at first. \nAfter a couple dates I asked him if he had any children as I saw a tattoo with a child’s name on it. \nI asked him if it was his child and he told me it was his nephew and I thought it was cute he had the child’s name tattooed. \n\nAfter a few more dates, I started to question a few things, why the child’s name had his last name and not the fathers, why there’s was a car seat in his car for a child and how he couldn’t do anything on the weekends. \nAfter my suspicions, I asked him again and he told me that he previously lied and that it was his child, and that he didn’t want to tell me. \nI don’t mind if someone has a child, it means there is more people to love. But I couldn’t carry on because he lied about it being his nephew. \n\nSo Reddit AITAH?\n\nEdit: I have had a few comments about how I know it was a child’s name… at first everytime we went out and whenever he would come over, he was wearing long sleeved tees, hoodies, jackets wtc so I never saw it… when it was summer time ge started wearing t-shirts and that’s when I saw the tattoo… I asked thinking it was a grandparent, parent, lost love one, pet, maybe even this “nephew” he lied about…. He told me it was his nephews name, and with me saying it had the same last name I also asked about that and he said “my nephew has his dads last name… I just got it for him with the family name” which I thought was cute - just to clarify that \n\nAlso, I never said that there was a problem with him having a child, again I didn’t mind him having a child… that’s not the issue, the issue was we were dating/ talking \u0026amp; getting closer for a while… and he still continued to tell me it was his nephew abs when he finally did I told him I knew and that he shouldn’t of lied to me \u0026amp; that I don’t think I can carry on talking to him as he lied.\n\nLastly, I am 20 and I do want my own children someday… that doesn’t mean I wasn’t accepting of his child, so lastly, we were talking about children and he told me he didn’t want any… and that’s when I started to pull away a bit, but he told me he didn’t want any, lied about his child being his nephew and then told me he never wanted any, when he already had a child he didn’t tell me about. \n\nEdit 2: another comment I’ve been getting a couple times is saying how they wouldn’t say on the first few dates but we had been going on dates/ getting close to being in a relationship… this was going on for about 8-9 months and I had asked him loads as things were not adding up, also the fact he said his mum wanted to meet me but he didn’t want me to - maybe because he thought I would find out, so I would if understood if it was the first few days but 8-9 months when you’re about to get into a relationship is not something that I can take lightly, I hope people understand. \n\nHope the update helps. ",
 "created_utc": 1701438881,
 "permalink": "/r/AITAH/comments/188cf17/aitah_for_telling_a_guy_i_can_no_longer_continue/",
 "score": 95,
 "url": "https://www.reddit.com/r/AITAH/comments/188cf17/aitah_for_telling_a_guy_i_can_no_longer_continue/",
 "comments": [
  {
   "comment_id": "kbjpp03",
   "message": "I didn't read anything but the title. That said enough - no, you are not the AH for cutting ties w a dude that lied about having A FREAKING CHILD. \n\nBiggest red flag on quite a few levels. move on, sister.",
   "created_utc": 1701439226,
   "score": 11,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjqyit",
   "message": "NTA\n\nHe lied about something big. What else would he lie about in the future?",
   "created_utc": 1701439794,
   "score": 21,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjrgxb",
   "message": "NTA- if he can lie about his child he can lie about anything. I'd have walked away too.",
   "created_utc": 1701440017,
   "score": 73,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjpvw0",
   "message": "NTA - they lied, you had every right to leave.",
   "created_utc": 1701439313,
   "score": 206,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjqhn7",
   "message": "NTA. You don’t need any reason for not dating someone if it feels like something is off",
   "created_utc": 1701439585,
   "score": 110,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjt00k",
   "message": "NTA. This was a major red flag and you did the absolute right thing.",
   "created_utc": 1701440678,
   "score": 36,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjvbr6",
   "message": "[deleted]",
   "created_utc": 1701441665,
   "score": 46,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjt11g",
   "message": "Don't need to read it. NTA. He lied.",
   "created_utc": 1701440690,
   "score": 19,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjydpw",
   "message": "NTA and you had me “lied about having a child.” \n\nWonder if he’s lying about being single, too? Good for you for seeing that red flag 🚩 and ending it. No way are you the AH! It’s kind of nice to see a post where the OP did something wise and wants to be sure, as opposed to someone who posts about the lying cheat who wasted years of the life.",
   "created_utc": 1701442922,
   "score": 17,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjt4qq",
   "message": "100% NTA.  That’s major information to hide and a deal breaker for many.",
   "created_utc": 1701440734,
   "score": 13,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjwe86",
   "message": "NTA. I read a post the other day where the husband (they'd been married over a year) had lied about being childfree and actually had two kids from a previous relationship! Worse, he was mad he had to pay child support and that OP had more \"fun money,\" so his brilliant idea was to sue for 50% child custody so no more child support. Oh, and he forgot to mention, he works 16-hour days, so he expected OP to be the one picking up the childcare for him.\n\nOP was the badass I wish I had been in my first marriage: She owns her own business, had a prenup, and inherited her house. She got to keep everything, and Mr. \"you have more fun money than me it's not fair, wah\" was told she wanted a divorce. Now of course he's kicking up a fuss calling her selfish...\n\nSo, yeah. If he had said, \"Yes, I have a child, but I'm not comfortable introducing him to anyone unless we're serious,\" that would be one thing. But to lie about something so easily explainable as well as disproven? That's a no from me, hon. A healthy relationship is built on trust! You guys are in what I call the \"honeymoon phase\" of the relationship, the \"I need to make a good impression\" stage (so this is likely where he'll be more encouraged to be on his best behavior). And he's already lying about BIG things? Things that would impact your lives together if you were to become a couple?\n\nPart of me gets it; you do have to be careful what information you put out there. But on a *dating app,* something where you're asking people to come join your actual life and they'll see up close and personal for themselves? Make *that* make sense...\n\nHonestly, it makes me think two things:\n\n1) Tell me I can't trust you without telling me I can't trust you and\n\n2) Tell me you're not very smart, either.",
   "created_utc": 1701442115,
   "score": 11,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjqvfc",
   "message": "NTA - even if his intentions were innocent and he didn't want to risk scaring you away, that's a weird thing to lie about.  If someone is proud enough to have their child tattooed onto their arm, but not proud enough to talk about them when asked, it feels like he hasn't figured out what kind of man he wants to be yet and worse yet what kind of father he wants to be to his own child.",
   "created_utc": 1701439756,
   "score": 15,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjx6b5",
   "message": "NTA - and honestly, at 20, while I love your perspective, you shouldn't be considering dating people with kids. The whole \"I'm going to lie about my tattoo for my kid is absurd.\" \n\nOr even 25 year olds who want to date people 80% of their age. That's just on the cusp of a reasonable age gap. \n\nIf you were 21 and he was 25 or 26 it's a different story, but 20 to 25 has too many red flags about it.",
   "created_utc": 1701442431,
   "score": 14,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjus36",
   "message": "Huge red flags on two levels  \n1. As a parent, your kid should be the center of your universe.  Acting like you don't have one because it interferes with your dating shows questionable values  \n\n\n2. This is obviously a huge thing, and he casually lied about it.  BIG red flag.  Casual, convenient dishonesty is a huge issue  \n\n\nThis guy seems like he has no character, dumping him doesn't make you and AH, it makes you smart  \n\n\nNTA",
   "created_utc": 1701441436,
   "score": 6,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjqsbf",
   "message": "No",
   "created_utc": 1701439717,
   "score": 7,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjva5m",
   "message": "NTA. There was no reason for him to lie about his own child, and you are rightfully upset that he did in the first place",
   "created_utc": 1701441646,
   "score": 7,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjypm1",
   "message": "NTA. The lying would be enough to end it for me.",
   "created_utc": 1701443058,
   "score": 7,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk27ph",
   "message": "NTA\n\nHe was willing to boot his own child aside just so he could get in your pants. He literally prioritized his dick over his *baby.* Anyone who can't understand why that's break-up worthy is psychotic.",
   "created_utc": 1701444438,
   "score": 6,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjsggq",
   "message": "Don't need to read the post - NTA. You have every right not to want a child in your life, let alone one that isn't yours. He might be upset because he probably feels the same way, trapped with a child he didn't want. Or frustrated no woman he pursues shares the want for kids with him. Forget that AH.",
   "created_utc": 1701440447,
   "score": 20,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk1x1g",
   "message": "NTA. It's not about the fact he has a child, it's about the fact he lied, and about something huge at that. Children are important things to discuss when dating, because not everyone wants kids, theirs or others. That's something you *have* to be honest about, or the whole relationship is built on false pretenses. You wouldn't be TA even if you'd stopped things because he had a child, rather than the fact he lied, because not everyone wants to date a parent. \n\nThe main thing here, though, is that he lied about something huge. If he can lie about having a child, what else is he lying about? His age? The fact he's actually married? Having caught him in such a huge lie, there's no way I can see for you to trust him enough to continue a relationship with him.",
   "created_utc": 1701444323,
   "score": 4,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbki2z2",
   "message": "A 25-year-old man lied to a woman who can’t even drink about being a father. Don’t waste any more time on this deadbeat.",
   "created_utc": 1701450381,
   "score": 4,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjxzv6",
   "message": "If you do decide to leave,  please make it very clear you are leaving because of the lie, not the child, and you would have welcomed the child happily,  if not for his lies.\n\nWe don't like enforcement of stereotypes here, nor do we want to give this guy the \"out\" of blaming his child for his being dumped.",
   "created_utc": 1701442765,
   "score": 11,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjvahe",
   "message": "NTA. Didnt need to read it either. This is creepy AF.  I have a baby and even I know this is wrong. You get to decide whether or not you want kids in your life and he clearly wanted to hook you in before telling you. RUN.",
   "created_utc": 1701441650,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjvgtb",
   "message": "NTA but if that was his nephew, it wouldn’t be weird if they had the same last name or that he had a car seat because people do spend time with their nieces/nephews",
   "created_utc": 1701441723,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjvsye",
   "message": "NTA\n\nIf asked, he should have been honest. Some folks don’t bring up their children as they could be sussing out the person still. But you directly asked, and he directly lied about something pretty important.",
   "created_utc": 1701441866,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjx5ce",
   "message": "NTA. Any lie early in a relationship is a deal breaker.",
   "created_utc": 1701442420,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjxlqh",
   "message": "NTA. Why do you even question yourself and ask here? Who thinks it’s ok to be lied to about something so big? And you need exactly 0 reasons to stop dating anyone really!",
   "created_utc": 1701442605,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk2n8v",
   "message": "Makes me wonder if he was even single. NTA",
   "created_utc": 1701444606,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk3kog",
   "message": "So it wouldn't have been a dealbreaker but he was afraid it might have been, so he lied about it?\n\nIronic.  In his attempt to cover up something that he thought might have kept you from dating you, but wouldn't have actually done so, he did something that will keep you from dating him.  Because, while having a kid isn't a problem for everybody, lying about critically important things about yourself in order to look more attractive to a potential partner should be a problem for everybody.\n\nYeah, he is a self-sabotaging fool, and you are NTA",
   "created_utc": 1701444964,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk49uu",
   "message": "That is something you should always tell the truth about. You should never be ashamed of your child and if you tell someone and they aren't cool with it then awesome, you saved yourself some time that would have been wasted otherwise. To me that would be more than a white lie and send up some red flags.",
   "created_utc": 1701445233,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkab9c",
   "message": "He probably lied about his age too. Add a solid 10 years to his declared age.\nNTA",
   "created_utc": 1701447518,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkcxmr",
   "message": "NTA - and I would bet this is the least of the lies. Could be married, etc. This is such a big lie.\n\nI won’t get into the whole mess here, but once after discussing marriage with me a longtime boyfriend disappeared. I found him years later in the news, with his wife and kids (from while we were together - even though I stayed at what I thought was his place many times), heading to prison.",
   "created_utc": 1701448492,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkzyy5",
   "message": "Drop him.\n\nOnce a liar, always a liar.",
   "created_utc": 1701456920,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl17jl",
   "message": "Liars can always lie. And if they think the truth will show them in anything other than a good light, they will. Good call OP.",
   "created_utc": 1701457387,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl25jh",
   "message": "NTA. \n\nHe lied about having a CHILD. If he will lie about that... he will lie about anything.",
   "created_utc": 1701457746,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl29yc",
   "message": "I'm not sure, what would motivate you to lie about your kid, like that. I mean if u said that you hated children and he was just trying to get a piece, I could see it. Other than that, it just seems so stupid to do.",
   "created_utc": 1701457793,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblos0n",
   "message": "When someone shows you who they are, believe them the first time. \n\nSuccessful relationships require two things: trust and respect. He has shown you he has neither.",
   "created_utc": 1701466359,
   "score": 3,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjyii8",
   "message": "he lied...\n\nNTA",
   "created_utc": 1701442976,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbjyyan",
   "message": "NTA! That is a huge breach of trust and a MASSIVE red flag. If he can lie about that, what else will he lie about?",
   "created_utc": 1701443155,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk0cv8",
   "message": "Did he give a reason for the lie.. he isn’t very bright leaving carseat in the car for you to see.. \n\nNTA.. but dang why would he lie.. doesn’t make sense to me..",
   "created_utc": 1701443713,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk19xu",
   "message": "If he lies about having a child, he will lie about anything and everything. Dodge this bullet before it digs its way into you.",
   "created_utc": 1701444074,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk222o",
   "message": "You’re the side piece",
   "created_utc": 1701444377,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk2z3d",
   "message": "I’ve been in a similar situation. He lied about his age as well. People seldom about just one thing, usually it’s a pattern.",
   "created_utc": 1701444734,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk3xky",
   "message": "Nta",
   "created_utc": 1701445101,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk57pb",
   "message": "Wait, how do you know some random tattooed name is from a child?",
   "created_utc": 1701445595,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk5woc",
   "message": "NTA. But having been in his situation I sort of understand the impulse to not disclose. However, when he was asked directly and lied that was too much and not acceptable.",
   "created_utc": 1701445860,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk68es",
   "message": "NTA for telling a guy you can no longer continue to date him **for ANY reason.**\n\nLying is a good reason.\n\nLying about having a child is a very good reason.",
   "created_utc": 1701445983,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk6hcy",
   "message": "NTA. That's not so much a red flag as a burning red military flare.",
   "created_utc": 1701446076,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk6ubj",
   "message": "NTA - He lied to you.  End of relationship.  \n\n\nthat's the kind of thing that is important on a first date.  Or pre date.  \n\n\nMajor red flag if he is willing to lie up front.",
   "created_utc": 1701446213,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk83yv",
   "message": "NTA. Just lying to people when you start dating is already enough to not want to continue.",
   "created_utc": 1701446693,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk8ch7",
   "message": "You’re NTA. Never heard of putting a child’s last name on a tattoo before, seems strange",
   "created_utc": 1701446781,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbka8tg",
   "message": "Hey OP - I’ve never understood people that lie about their children, I mean it’s going to come out eventually it’s an entire human being??? \n\nRegardless of that he’s a liar, no it’s perfectly appropriate, acceptable and astute to break up with him. I mean why waste your time with a liar especially one who really seemed to put absolutely no effort into the lie, he had a car seat for goodness sake, what did he think? That you were an idiot? So not only is he a liar, but a bad one at that… \n\nNo OP. Well done..dump this dude NTA",
   "created_utc": 1701447493,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbka9i4",
   "message": "NTA.\n\nPerson who lies about whether (or not) he/she has children is bad news. \n\nSeparate ways is a good way to start this festive season.",
   "created_utc": 1701447500,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkb469",
   "message": "I wouldn't be surprised if he lied about still being in a relationship with the mother of the child.",
   "created_utc": 1701447816,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkchx0",
   "message": "Not the asshole. You have every right to stop dating the guy for lying.",
   "created_utc": 1701448328,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkd2eo",
   "message": "NTA. This isn’t even a lie of omission. He outright lied to you when asked. I’m not saying he’s been lying about other things but this is a major and speaks to the idea that he avoids uncomfortable truths.",
   "created_utc": 1701448540,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkdlft",
   "message": "Hi there, you are smart to end things. If he's going to lie in the beginning of a relationship, he will lie throughout the relationship. It's not about him having a child, it's about him lying about having a child. That is a huge red flag and you are smart to end things.",
   "created_utc": 1701448736,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkeq22",
   "message": "NTA but yikes is he! He was trying to hide an entire child! Which automatically makes him a piece of trash. No self respecting father who try to hide that he is a parent",
   "created_utc": 1701449154,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkestb",
   "message": "NTA\n\nI've heard scenarios like this from various ends of the extreme. I remember one where the dude was six months in when he found out completely by accident, and the woman copped an attitude about him not being \"man enough\" after the fact and that her identity was \"more than just that of a mother.\" The fact is that each individual in each scenario knew what they were doing, and why. They lied or omitted because they knew dating an individual and dating a parent are two completely different scenarios.\n\nFrankly a willingness to lie or omit that you have kids in your life is a redflag for more than one reason. Like, if you wound up with this dude more seriously you'd probably find he's a shit father because he'd prioritize dating and inveigling someone in his life over acknowledging his kids as an important part of his life. You'd either find yourself in an unhealthy situation with kids who aren't too hot on you and watching their father mistreat them for it, or be expected to step in as a parent for an inattentive one.",
   "created_utc": 1701449182,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbki1br",
   "message": "I think the guys the asshole, who would lie about their child??\n\nDon't date him because he lies. Not because he has a kid.",
   "created_utc": 1701450365,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbki7bn",
   "message": "NTA - You don't lie about having a child with someone you are dating. The lying part should be a deal breaker.",
   "created_utc": 1701450425,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkj79t",
   "message": "Nta. \" I have a kid\" is something you say on the first date because it's a deal breaker for a lot of people, and lying should always be.",
   "created_utc": 1701450794,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkjdft",
   "message": "NTA. If he's willing to hide something of this level in order to get what he wants, he's not going to stop there. Not partner material. Put him in the rear view.",
   "created_utc": 1701450857,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkvmax",
   "message": "Why is this even a question?  Of course you're NTA.  You can tell anyone for any reason that you don't want to be with them.  This case, you have a particularly good reason.",
   "created_utc": 1701455311,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkyiv3",
   "message": "Kick him to the farthest curb, anyone who lies about their children is not a good person, imagine denying your own blood bcos you want to impress a stranger you met a few days ago🙄",
   "created_utc": 1701456385,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkyjmb",
   "message": "NTA\n\nPeople that hide having children are the bain of the childfree community. They should be dropped immediately if they lie about having kids. Not Acceptable Behavior at all. \n\nIf you have a multi decade financial and/or emotional commitment in progress, you need to fess up about it. Doesn't matter if it is a kid or 100k in student loans, it is a significant liability that needs to be disclosed to people considering tying their life to yours.",
   "created_utc": 1701456393,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkyw6s",
   "message": "NTA, thats a pretty big thing to HIDE from you.",
   "created_utc": 1701456522,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl2kz5",
   "message": "NTA  \nNo, lies are an instant bounce. And this one is particularly egregious as it's a child. What kind of jerk lies about not having a kid and this goes for a mother or father?",
   "created_utc": 1701457912,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl3cz6",
   "message": "Wait til you find out about his wife!",
   "created_utc": 1701458209,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl3dkx",
   "message": "NTA.\n\nHe lied to you about something big and important, repeatedly. There is probably nothing that he won't lie about.",
   "created_utc": 1701458216,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl3i40",
   "message": "NTA. Why would he lie? If I was single and had kids, I wouldn't want to date anyone that might bit be comfortable around children",
   "created_utc": 1701458264,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl3n55",
   "message": "NTA. He lied. Whether or not someone having kids is a dealbreaker. He decided to flat out lie about it.",
   "created_utc": 1701458315,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl45ab",
   "message": "Definitely NTA! \n\nSimilar thing happened to me! I went out with a guy, and I noticed he had a tattoo of a bird with something written on it, on the nape of his neck, but I didn't have my glasses on, so I couldn't tell what it said. And I dien't want to ask, I have a very personal tattoo, which I don't like discussing with other people. \n\nWe went on a few more dates, and he asked if I would be his gf. I agreed and told my friends, and when my friend went to check him out on fb and ig, she noticed a pics of a child. She clicked on the profile, and it showed a woman around our age, with 3 year old little girl, bunch of photos with this guy too, so she dug a bit deeper. \n\nTurns out they were dating, broke up, and she found out she was pregnant, decided to keep the kid and he had her on some weekends. I was absolutely heartbroken. I didn't mind that he has a child, we all have a past, but I hated the fact that he didn't tell me, and even from the perspective of that little girl, he was hiding her like something bad! \n\nI don't want my own kids, I want to adopt them, which was something we spoke about and he agreed to it, and I love children, I've worked with them since I was 15, so he must have known that I would be delighted to help him raise her. \n\nI ended it right that day. And never looked back.",
   "created_utc": 1701458505,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl4ilv",
   "message": "You are not the asshole. Lying about a kid is a pretty big deal.",
   "created_utc": 1701458643,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl4s9i",
   "message": "idk who made you believe that it is not ok to say that you don't want to date a single dad (just 25 and already a single parent? red flag number one, if you ask me).\nnot wanting to date people with children should be a valid reason to not pursue a relationship, especially if you yourself are just 20.\n\nthe fact that he lied about not having children is just another red flag. pls end that relationship asap, op.",
   "created_utc": 1701458747,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl57rk",
   "message": "Nope. He LIED, doesn't matter why. Starting any relationship off with lies is a big red flag.",
   "created_utc": 1701458914,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl5jdo",
   "message": "NTA what else is he lying about. Liars can’t be trusted. Then he tells you he doesn’t want kids. I wonder is he married? Can’t do anything on the weekends. Most non custodial father it’s every other weekend and he keeps the car seat in the car??? You’re right to cut your losses and kick him to the curb.",
   "created_utc": 1701459038,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl6gj3",
   "message": "NTA. As a parent, when I date, I am super open about being a parent. If someone doesn't want to date people with kids, I don't want to waste time. Being lied to about children is an absolute deal breaker.\n\nSeriously, if the kid thing isn't for you, no harm, no foul, let's clear the runway before the next flight comes in. It's the LYING.",
   "created_utc": 1701459382,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl6ysc",
   "message": "Why date a liar?",
   "created_utc": 1701459574,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl70at",
   "message": "NTA, and it's clear that it's not the child you're uncomfortable with, it's the lying. Dude definitely created a completely false narrative.",
   "created_utc": 1701459590,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl8a0d",
   "message": "Ya the lie would be a dealbreaker for me too. If you're willing to lie about something as big as kids, what else are you gonna lie about? You dodged a bullet. NTA",
   "created_utc": 1701460064,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl8c8a",
   "message": "Why would you waste any more time on this liar?   Here's wasting everyone's time by lying about this important thing",
   "created_utc": 1701460087,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl8ztl",
   "message": "You could break up with him because his toenails are weird and you wouldn’t be the asshole.  You don’t need any reason at all to break up with anyone ever.  You are never required to be in any romantic relationship at all.",
   "created_utc": 1701460332,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl97tp",
   "message": "Same with someone lying about not being a mother. This is a red flag. Move on.",
   "created_utc": 1701460414,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl9gcw",
   "message": "It’s surely very off putting.\n\nI dated a police officer lied he got a daughter from a failed marriage. He told me he was never married no kids. \n\nI dumped him immediately. \n\nIt means these people easily can lie about things .. the behaviour just came out naturally of them, not a good sign.",
   "created_utc": 1701460503,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblaku8",
   "message": "Anyone lying on a dating site about anything is instant reason to bail.",
   "created_utc": 1701460926,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblalkh",
   "message": "NTA no matter what.  Nobody is an asshole for discontinuing a relationship for any reason they might have.  This is a pretty big deal, but if you didn't like his job, or just weren't as attracted or just wanted to be single; all those are valid reasons.",
   "created_utc": 1701460933,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblanbr",
   "message": "NTA- you’re too young to take care of someone else’s kid. Enjoy life and find someone without kids.",
   "created_utc": 1701460951,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblber1",
   "message": "While lying to a significant other is never okay, there are some lies that are forgivable, and some that aren’t. Lying about having children is always unforgivable.",
   "created_utc": 1701461244,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbld9i6",
   "message": "Lying right out of the gate is a red flag. Lying about not having a child makes him an a\\*\\*hole. Who denies their child like that? Nice fathering there, buddy! He should be proud of that, not try to hide it.\n\nYou are NTA...For no other reason than him lying. Oh what a tangled web we weave, eh?",
   "created_utc": 1701461954,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblo24h",
   "message": "NTA! Don’t let anyone else give you a hard time about breaking up with him. If this dude can’t be honest with the girls he dates then he shouldn’t be in a relationship.",
   "created_utc": 1701466079,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblpdhu",
   "message": "Blatantly lying about something important is a really bad sign.",
   "created_utc": 1701466588,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblqhxo",
   "message": "single fathers are meant for single mothers, that simple. enjoy your life with someone you can actually build a world with without the complications of an ex and another womans child.",
   "created_utc": 1701467021,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbm2o97",
   "message": "NTA, anyone who denies their child cant be trusted. If he cant put his child first you most certainly wont be valued.",
   "created_utc": 1701471955,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbm4tb1",
   "message": "That title is a red flag in itself 🤯 NTA",
   "created_utc": 1701472873,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbm6iti",
   "message": "Makes you wonder what else he is lying about...",
   "created_utc": 1701473627,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbm6jg1",
   "message": "NTAH. If he'll lie about his own child, what won't he lie about?",
   "created_utc": 1701473634,
   "score": 2,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk0pw2",
   "message": "He probably lied so he could sleep with you.  And it sounds like he succeeded.",
   "created_utc": 1701443857,
   "score": 0,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkvhyn",
   "message": "He may suck at communication when it comes to things like that. He was hesitent to tell you for the fear of you not being interested if he had a kid. Had things progressed he would have told you, he just didnt wanna deal with the potential drama early, it may all be new to him and he is afraid, all kinds of fear going through his head. He found you, got comfortable enough to tell you and ya crushed him for it. He is gonna be hurting because of this, not just a little.  \n\nJust something to consider.\n\nHe may be an ass for protecting that pary of his life, but its pretty brutal to use that as a reason to end it with him.\n\nNot an asshole, just inconsiderate.",
   "created_utc": 1701455267,
   "score": 0,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl2g67",
   "message": "You shouldn’t lie when asked, but I get that he feels he doesn’t get a fair shot being a single dad.",
   "created_utc": 1701457860,
   "score": 253,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbk338c",
   "message": "I get why he lied. He's pretty young and probably had too many dates ruined when the woman found out yes he has a kid. \n\nBut no you're not the asshole.",
   "created_utc": 1701444779,
   "score": 247,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbmbrcl",
   "message": "Yes, you'd be a form of AH, because you're trying to make it about him lying rather than your own requirement that he not have a child. Yeah, he lied, but this is about your relationship requirement. You're trying to just put the focus on him rather than being honest that you are rejecting him because he doesn't meet your requirement. It's okay to have requirements, but this isn't honest.",
   "created_utc": 1701475948,
   "score": 255,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbl111l",
   "message": "Hard to say, maybe having a child would put you off and that's why he lied",
   "created_utc": 1701457319,
   "score": 252,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kblw4y4",
   "message": "Reading the update, I have to say no one is the AH. Put yourself in his shoes. You're dating someone, hopefully, with long-term in mind. You would want to feel that person out to determine if you would want this person to be a potential role model for a child. \n\nNOW WITH THAT SAID, if this is the only reason for breaking things off, then you need to go back and talk things out first. Otherwise, YTA, for not hearing the WHY he thought it best to lie about a child. There's always a reason to behaviors, and he's most likely been turned down because he was upfront that he had a kid.",
   "created_utc": 1701469239,
   "score": 251,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkl469",
   "message": "This is gonna be controversial (because it isn't a snap moral judgement framed in absolute terms and stacked to the rafters with opprobrium) but have you considered asking him *why* he didn't tell you? If a woman didn't tell me she had a child for the first few dates I'd assume it was that she had some privacy or safe-guarding concerns, and I'd ask her straight up why she didn't tell me.",
   "created_utc": 1701451493,
   "score": 251,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkzfx6",
   "message": "Meh.  Is he a good dude?  Did he make you happy?  I was a single dad (now very happily married) and I can under stand him wanting to hold off on talking about his kid.   I strongly disagree with the way he handled it but if he is a great guy and you had good chemistry, I’d give him more chances.   Finding people that you really connect with is very rare.  If he was just an “ok” connection.  Move on.",
   "created_utc": 1701456724,
   "score": 250,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkvj8t",
   "message": "He may suck at communication when it comes to things like that. He was hesitent to tell you for the fear of you not being interested if he had a kid. Had things progressed he would have told you, he just didnt wanna deal with the potential drama early, it may all be new to him and he is afraid, all kinds of fear going through his head. He found you, got comfortable enough to tell you and ya crushed him for it. He is gonna be hurting because of this, not just a little.  \n\nJust something to consider.\n\nHe may be an ass for protecting that pary of his life, but its pretty brutal to use that as a reason to end it with him.\n\nNot an asshole, just inconsiderate.",
   "created_utc": 1701455280,
   "score": 249,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkvr23",
   "message": "doesn't matter - had sex?",
   "created_utc": 1701455359,
   "score": 250,
   "submission_id": "188cf17"
  },
  {
   "comment_id": "kbkx0fh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "188cf17"
  }
 ]
}