{
 "submission_id": "188d7b7",
 "title": "UPDATE: AITAH for kicking my sister out for trying to break me up with my boyfriend because she likes him?",
 "selftext": "A lot has happened since i posted so it will be quite long.\n\nSo in my previous post of AITAH i asked whether or not i was the asshole or not and i've got some new things to update ya'll on.\n\nTurns out a few of you guys were right and she gave most of the family a made up story. She told the rest of the family (except my parents since they knew the real story from the start) and her friends that when she moved in i was a complete jerk. I made her do all the chores, cook everyday, yelled at her all the time and tried to make her feel insecure about herself, but she didn't because girlboss\" and what not. She also said how my boyfriend was not happy in his relationship with me and basically made me look like some demon who came out from Satan's bootyhole. I was able to slap some sense into a few of the more 'open-minded' people with the help of my boyfriend to give them the real story. Most of them didn't even apologise and just stopped bothering me.\n\nI was able to get in contact with one of my sister's friends to ask about my sister's reason of the whole breakup thing. Turns out the reason my sister and her ex broke up was because she was supposed to take care of her ex's dog but instead sold the dog because she didn't wanna take care of it while he was away. She wasn't even sad that they broke up, she was upset because she wasn't allowed to keep the house and all the stuff inside that wasn't even hers. I don't know why she even thought that she'd be allowed to keep it after selling the guy's dog.\n\nThe texts from my family did calm down from a few, but my parents and sister continue spamming me with trash talk. It got to a point that the day after i made the first post, i got a threat letter of my sister. Saying how i MUST break up with my boyfriend or else she'll destroy my reputation and everything i have and also decided to be petty and write how she'll stab me. Unfortunately for her, when the letter came in i was out grocery shopping, but my boyfriend was home with his family who was over for dinner, and angering a family of 2 parents who have 9 kids (5 adults and 4 teenagers) is not 'a pretty sight' as my boyfriend described it.\n\nMy boyfriend's mother called my mother and started asking about the letter my sister sent. My mother denied it and said that my sister didn't do anything of that sort. My boyfriend's mother wanted to say more but my mother hanged up on her. After we cooked and had dinner, my boyfriend's father suggested that they'd stay over incase my parents or sister tried to disturb us again. My boyfriend and i agreed to this and we set up a few spare rooms for them since we do have a pretty big house. I did call the police for the threat letter and they said they'd look into it. After that we simply went to bed.\n\nThe next day we did hear loud banging on the front door, with my sister screaming to be let in. One of my boyfriend's brothers opened the door and she, my mom and dad walked right in and demanded of me to talk to them alone, but my boyfriend's parents cut them off and tried telling them that my sister is out of line and they needed to respect that they crossed many boundaries. Both my parents and my boyfriend's parents then got into a heated arguments. And what did my sister do? She tried to get closer to my boyfriend while the argument was accuring. My boyfriend then started shouting at her, calling her a psychopath and that she's annoying. My parents then started yelling at my boyfriend that it's no big deal and that's just how girls act around their crush. I did get fed up and told my parents and sister that they need to leave before i call the police.\n\nThey refused and my mom seriously said \"You should be a good brother and make your sister happy. Let her go on one date with your boyfriend and we'll leave. How else will they know if they click or not? You're basically ruining your sister's lovelife by being so selfish\". My boyfriend and his siblings all immediately shut her up and torn her up for saying such stuff. My sister then started crying and tried to go to my boyfriend for a hug. One of my boyfriend's sisters slapped her and said how she should be ashamed of herself for trying to get to a gay taken man. My sister seemed to have lost it and tried to lunge at me while screaming how much she hates me. She shoved me onto the ground and grabbed a kinfe from her pocket and stabbed me. It was obviously she tried to go for my throat but instead went to my shoulder. My boyfriend yanked her off me and he and his siblings started to gang up on her. My boyfriend's mother helped me up and treated the stab wound with whatever we had as it was bleeding quite a lot and pretty deep and she's a nurse. My boyfriend's father called the police. My parents tried to take my sister and leave, but my boyfriend and his siblings kept them in place until the police arrived.\n\nOnce the police got there, my parents and sister got arrested and i got sent to the hospital because the bleeding wouldn't stop. I got a few stitches on my shoulder now and it's a bit difficult to move with my left arm. When my sister got questioned by the police, her smartass kept shouting threats and that she meant to slice my throat, not my shoulder(wtf). For some reason she also kept crying out my boyfriend's name, as if he's gonna defend her or help her. My sister got sent to jail and my parents got a restraining order. But due to their actions, my little brother(8) got taken out of their house and put into my care. Three of my boyfriend's siblings are currently staying over, because they think my parents might come back and try to take my little brother away or hurt me.\n\nFor two days it has been peaceful. Maybe some other family members will come by or my sister's friends will try something, but right now i'm safe. My boyfriend, his sister and my little brother are currently hanging out playing some video games, he's planning on taking my brother to a zoo since my little brother loves animals and never went to one. I'll update if anything else will happen.",
 "created_utc": 1701440926,
 "permalink": "/r/AITAH/comments/188d7b7/update_aitah_for_kicking_my_sister_out_for_trying/",
 "score": 21,
 "url": "https://www.reddit.com/r/AITAH/comments/188d7b7/update_aitah_for_kicking_my_sister_out_for_trying/",
 "comments": []
}