{
 "submission_id": "188edy4",
 "title": "Aita for telling my friend that she can't take my husband as her plus one to her formal holiday company party",
 "selftext": "My husband I met a couple through my husband's work a couple years back and the 4 of us became close. I felt it was all pretty much even feelings all around until my husband and I moved then suddenly the wife (we will call her Carol) and my husband starting getting close. They moved where we are at after six months and their friendship was on a whole other level to the point where I began to have concerns about her.\n\nTo name a few they talk and text nearly everyday, they have gone on many outings alone together, and she is giving him gifts basically any chance that she can. As much as I would love to give more details it would take too long to name everything that made me think that she was interested in him the biggest one being my gut feeling.\n\nIt doesn't help that carol is not very happy in her marriage which she talks to my husband about frequently. Little does she know that my husband tells me everything that she tells him and requests I don't let her know which I am fine with.\n\nMy husband got carol a job but soon after that he switched to another company. The company my husband used to work and the one Carol works at now is having a Christmas party. Her plus one was going to be her husband but he got COVID and is unable to join her. Bc it is formal and catered - him not showing up would cost them $100 to cover the fee for his dinner.\n\nSo she texted my husband asking him if he would like to go with her. My husband told her he would check with me bc he thought it would sound like that was a date to me.\n\nAnd he was right. I told him I wasn't comfortable with that and he seemed bummed that he wouldn't get to see old co workers but I mentioned the last time we went to an event for his old company he didn't recognize a single person bc the company was so big to which he agreed. But he still seemed off which upset me because I thought he wanted to go and wasn't seeing how it would effect me. \n\nA few months back I actually sat down with carol and told her how I was feeling about concerns i had and she told me if something was bothering me to just tell her and she would try to be more careful next time. \n\nSo I did. I sent her a text explaining why that made me feel uncomfortable and even suggested she take a mutual friend of ours that I was certain would be happy to go with her so they could avoid paying the fee.\n\nTurns out my husband seemed off bc he was nervous about having to break the news to her so he was glad to see that I contacted her directly about it. My husband came home and we talked more about it and he showed me their text messages.\n\nShe told him the manager at the company told her that she should bring my husband after finding out her husband couldn't be there since he would \"know everyone\". After he sent the message explaining he wanted to check with me before giving her an answer if he would go she replied with \"dang, it's a work function\"\n\nSo I was pissed about that the most. It was the first time she had belittled my potential feelings and that was really when I felt like she did not care about how I would feel. She has seen my message and has yet to reply which I think is very unlike her. So aita?\n\nNote: she has yet to respond but had plenty of time to text my husband to \"help her\" find a dress to wear to the party.",
 "created_utc": 1701443908,
 "permalink": "/r/AITAH/comments/188edy4/aita_for_telling_my_friend_that_she_cant_take_my/",
 "score": 156,
 "url": "https://www.reddit.com/r/AITAH/comments/188edy4/aita_for_telling_my_friend_that_she_cant_take_my/",
 "comments": []
}