{
 "submission_id": "188gvet",
 "title": "AITAH for refusing to let my grandmother stay with me",
 "selftext": "So I (24M) recently told my family \"no the buck she's not\" when they prompted the idea of my grandmother coming to stay with my family.\nFor context\nI am married to my wife (31F) and have 2 kid (6M, 2F) and we currently live out of state from my family due to my occupation. My wife is a stay at home mom. I was told recently that due to work I will be leaving for a few months in spring of next year and won't be back until 2024. While I'm gone my mother (46F) has offered to come live with my wife to help take care of the kids (she currently lives with my sister (28F) since my dad passed away) and up until about yesterday that was the plan.\nHowever recently my grandmother (63F) has also started living with them and while on the phone with my family yesterday the idea of my grandmother also coming with my mom was prompted to which I had my response.\nNow me and my grandmother have a very estranged relationship to say the least. To put it simple for a part of my life I lived with my grandmother and Tia for a few years and they are the source of a lot of trauma for me. They emotionally, physically and mentally abused me for all those years of my child hood. (They also abused my sister and brother (20M) as well). So my resentment towards her has never really healed. My sister allowed to let my grandmother live with her because my Tios and Tias (mothers siblings) no longer want her living with them for how she treats them and their kids. My sister rules for living with her are 1. She never gets to be alone with the kids 2. If she even yells at one of the kids she's out and 3. She will never raise a hand to the kids. But when my mom comes to stay with my family while I'm gone my sister doesn't want my grandmother there and said she will come with my mom. Now my wife is totally on my side of this as I've told her all my traumas and feelings and doesn't even want my grandmother around our kids. (If she wasn't living with my mom and sister we'd be no contact) my sister is saying it not fair that she'd have to put up with my nana while my mom is here with my family and that I need to get over it because she was abused to and she forgave her but I refuse to even let my nana visit. \n\nMy brother is staying out of it cause he is also estranged from my grandmother and my mother knows that I am serious about not letting my grandmother come. But my sister is the most adamant that my grandmother NEEDS to come so it's fair.\n\nSo AITAH for saying \"no the buck she's not\" when prompted that my nana could come stay with my family?\n\nEDIT: so just some clarification my mom is coming to help my wife is the plan currently and it was only a stated idea of my grandmother coming as well. My mother AND grandma coming is not a package deal. It was only a suggested idea that I very firmly and promptly refused\n\nAlso my son is technically my stepson. My wife and I met when I was 21 almost 22 so I've been the only father figure in his life and by all means he is my son. \n\nEDIT 2: OMG HUGE TYPO CAUSING CONFUSION in the paragraph about my brother staying out of it it's supposed to say \"and my mother knows\" not brother",
 "created_utc": 1701450310,
 "permalink": "/r/AITAH/comments/188gvet/aitah_for_refusing_to_let_my_grandmother_stay/",
 "score": 103,
 "url": "https://www.reddit.com/r/AITAH/comments/188gvet/aitah_for_refusing_to_let_my_grandmother_stay/",
 "comments": []
}