{
 "submission_id": "188h3jb",
 "title": "AITAH for breaking up with my GF because of her ex who's her friend?",
 "selftext": "So my ex gf is friends with her ex, let's call him Mike. We dated for about 8 months.\n\nMike and my ex gf dated for about 2 years, and have been friends for like 6.\n\nThey broke up due to being incompatible as a couple.\n\nNow here's why I broke up with her.\n\nMike took every opportunity to show me up. Basically, he showed off how close he was with my ex. And how much better he knew her than me. \n\nFor example, one time he ran into us while we were having a date. We said hi, but he joined up, dude pulled up a chair and started talking about their relationship. How amazing their dates together were.\n\nThe straw that broke the camels back, was when we were all hanging out with her friends.\n\nI mentioned wanting to travel to this city with my ex, Mike came in and said to my gf \"Hey, remember when we traveled to Europe?\" My gf said \"yeah\"\n\nMike then said, while looking at me \"Well, hardly traveled, we stayed in the hotel for hours and hours\"\n\nMy gf just laughed.\n\nI told my gf that I was feeling uncomfortable with how Mike was being, and asked her if she could tell him to  stop, or if at least she'd be OK with me asking him.\n\nShe asked me why?\n\nI told her I don't like that Mike shoves his previous relationship with her on my face.\n\nShe got defensive and said that Mike is her friend, and if I'm too immature to accept that girls can be friends with their ex's then I should just leave.\n\nSo I did.",
 "created_utc": 1701450893,
 "permalink": "/r/AITAH/comments/188h3jb/aitah_for_breaking_up_with_my_gf_because_of_her/",
 "score": 208,
 "url": "https://www.reddit.com/r/AITAH/comments/188h3jb/aitah_for_breaking_up_with_my_gf_because_of_her/",
 "comments": [
  {
   "comment_id": "kbkli8u",
   "message": "Good move. Mike is a full on douchebag who clearly wants to get back together with her, and your gf (now ex) has zero respect for you or your feelings. \n\nI'm kind of wondering if this is some little fantasy they are playing together to get off on, and you just happen to be the schmuck being used here.",
   "created_utc": 1701451634,
   "score": 224,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbkngnb",
   "message": "NTA pulling up a chair to discuss their amazing dates? I'd of walked out are you fucking kidding me.",
   "created_utc": 1701452345,
   "score": 75,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbklhm5",
   "message": "NTA.  First of all, you can't be an asshole for making a choice.  It's your choice to keep seeing her, if you don't want to that's enough of a reason, period.\n\nBut also WTF, Mike inserting himself into her dates is something NO ONE would ever tolerate.  He's acting like an ass, but so is she.  Until she learns to set boundaries, she's never really going to have any other relationships besides the one she has with him.",
   "created_utc": 1701451627,
   "score": 66,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbkmnu5",
   "message": "NTA. Good on you.",
   "created_utc": 1701452056,
   "score": 17,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbkpvga",
   "message": "Yea you made the right call getting out of that relationship. Sucks that you probably opened up a spot for him but honestly there’s a good chance that he was filling that spot already before you left. They both sound like insufferable assholes. I have no problem with male friends, I wouldn’t date someone who wouldn’t leave their ex behind unless they share a kid (the kid doesn’t need to suffer). But this goes so far beyond the pale. They are clearly having an emotional affair and like I said I would put money that it’s physical too.",
   "created_utc": 1701453210,
   "score": 18,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbl9k6k",
   "message": "NTA. You saved yourself a ton of trouble here.",
   "created_utc": 1701460542,
   "score": 17,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblq9zs",
   "message": "Mike probably doesn't want her, but doesn't want her to be with anyone else. \n\n\u0026gt;\"Well, hardly traveled, we stayed in the hotel for hours and hours\"\n\n\"Couldn't've been that good if you two broke up\"   \n\n\nNTA",
   "created_utc": 1701466937,
   "score": 16,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbktzew",
   "message": "Two words - Good decision.",
   "created_utc": 1701454714,
   "score": 17,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm05k0",
   "message": "I firmly believe that when someone says “just leave” you should.",
   "created_utc": 1701470895,
   "score": 9,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbkruwj",
   "message": "NTA, Move along. There are lots of nice people out there, no reason to waste time on these two.",
   "created_utc": 1701453929,
   "score": 7,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbll728",
   "message": "Good move, OP. Keep away from that bullshit drama.",
   "created_utc": 1701464973,
   "score": 8,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbkrzap",
   "message": "NTA.  You dodged a bullet, and you should be more confident about the decision you made!",
   "created_utc": 1701453974,
   "score": 5,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm8zpz",
   "message": "\"So I did.\"\n\nSlow clap.gif",
   "created_utc": 1701474713,
   "score": 4,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbllt80",
   "message": "I love it when people who constantly push or break our clearly stated boundaries blame us for having boundaries at all. It’s so healthy for a relationship.\n\nWhy am I also 100% sure she’d have a conniption if one of OP’s exes hung around talking about all the great sex they’d had and all the fun times they had while dating with her sitting right there next to OP?",
   "created_utc": 1701465210,
   "score": 7,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbl478d",
   "message": "You gotta leave bro, if she doesn’t have the backbone to back you up on how you feel and letting mike walk over your feelings then i’m sorry to say that she might either still have feelings for him or is seeing him on the side and cheating on you. You need to just break up with her. Still being friends with an ex is a huge 🚩",
   "created_utc": 1701458525,
   "score": 6,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblon5g",
   "message": "Good for you! \n\nThat is massive disrespect, aided and abetted by her refusal to see the problem. If anything you were more accommodating than you should have been. \n\nBe annoyed for a bit, then realise life is too short to be shackled to someone that wont back you up because they enjoy extra validation.",
   "created_utc": 1701466307,
   "score": 3,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblp65h",
   "message": "NTA. It’s one thing if he was making those comments and your girlfriend stood up for you or, better yet, just agreed with you and stopped being involved with him. But the way that she lets it happen and DEFENDS HIM for this behavior is such a red flag. People can be friends with exes but this behavior goes past the acceptable threshold and she’s definitely aware of that. I’m glad you were able to get out of that and I hope you’re okay.",
   "created_utc": 1701466510,
   "score": 3,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblv7we",
   "message": "NTA - If they were so great together, why did they break up? Man, I commend you for your self-love and self-respect for getting rid of two obnoxious people. I feel sorry for any man or woman who unknowingly might find themselves in your situation as long as those scumbags continue with this sick game.",
   "created_utc": 1701468872,
   "score": 3,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblvhxo",
   "message": "NTA. Mike is a douche, and your gf is unwilling to defend you either because she's truly oblivious, or she doesn't care enough about your feelings. You're more patient than me.",
   "created_utc": 1701468983,
   "score": 3,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblyo4u",
   "message": "NTA \n\nThis is concerning behavior from both of them. You are better off being far away from whatever mess they are creating for themselves.\n\nI hope you find a happy relationship soon!",
   "created_utc": 1701470280,
   "score": 3,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbltotm",
   "message": "NTA. GF sucks for letting her ex get away with this with no regard for your feelings or the relationship. Dump her.",
   "created_utc": 1701468263,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblv7w0",
   "message": "Whatttt?? Nooo.  This is Hella disrespectful, and not once has she asked him to back off and keep his fucking mouth shut? Nahhh, fuck that. You don't need that shit, you deserve better.",
   "created_utc": 1701468872,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblxmep",
   "message": "Your ex was weird and disrespectful, NTA and good job leaving both the toxic losers to stew in that mess they made",
   "created_utc": 1701469849,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblzhwb",
   "message": "Good for you!! She still has feelings for the guy and is waiting for the right time to get back with him. Meanwhile she was using you as a placeholder. \n\nI'm wishing you the best!",
   "created_utc": 1701470622,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm04dq",
   "message": "Good for you!\nF*** that sh**. If you're not important enough for her to defend you to a Dbag like Mike, you deserve better! Be at peace my friend.\n\nNTA",
   "created_utc": 1701470881,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm1r8i",
   "message": "NTA. Time to break up. He attitude is completely inconsiderate of you. If shoe were on the other foot, she would NOT take the same behavior and be pissed that you were even still friends!",
   "created_utc": 1701471566,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm7q44",
   "message": "NTA Mike is a DOUCHHHEEEEEEE",
   "created_utc": 1701474154,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmav43",
   "message": "How would she feel if it was your ex making those statements and you blew it off?\n\nNTA\n\nDon't stay in a relationship you are not comfortable in.",
   "created_utc": 1701475546,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmd5cg",
   "message": "Yes! Good job buddy and don’t let that trash back in your life ever again. The fact that she thought his comments were acceptable says tons about her character. Good job now go find yourself a woman who will love you and treat you like she loves you. His comments were disgusting.",
   "created_utc": 1701476564,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbme6vs",
   "message": "NTA I've been friends with my ex for 5 years after we dated for around 2, and I would NEVER treat his gf this way. Likewise he would never allow me to even if I was so inclined. Your ex is trash, Mike is trash, you deserve better.",
   "created_utc": 1701477034,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmhca6",
   "message": "Your gf is a big AH, let’s not even talk about Mike, those are some pretty obvious boundaries, you ran from an unhealthy relationship where you weren’t respected at all. NTA",
   "created_utc": 1701478455,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbln57a",
   "message": "NTA. I'm actually best friends with one of my exes(dated 2 years, although now broken up for the last 16 years). After a while of being broken up, it was weird to think we ever dated. He's like family to me. And while we've occasionally talked about silly and weird shit that happened while we were together(like visiting his friend in NYC, and getting woken up in the middle of the night by his friend's roommate masturbating LOUDLY), it wasn't out of nostalgia for the relationship. \n\nTbh your ex and her ex just sound like they still want to be together if they're acting like that.",
   "created_utc": 1701465723,
   "score": 3,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblyxje",
   "message": "Cool fake story broh",
   "created_utc": 1701470388,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm8xsv",
   "message": "Your the asshole for not popping him in the mouth.   Sometimes shit has to be dealt with like that.",
   "created_utc": 1701474690,
   "score": 2,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmcinh",
   "message": "Glad you left, yeah girls can be friends w exes or whatever she wants to define It as, I wouldn't call it friends, you saved yourself humiliation there, screw that I'd never stand for that, girls will play a game In their new sense of confidence but all men know, if she's punking you like that......... it's a green light, if she's hot good luck.. you don't need that, go set up a roster.... you can get several girls on your lap before you should be a soft body putting up w that, that's cuck ish.",
   "created_utc": 1701476288,
   "score": 0,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmeo3v",
   "message": "Well since you broke up with her why do you ask if you're the asshole? You definitely were very insecure in this relationship and have self esteem issues. If I'd had been in the same situation I would have shut him up at the first hint of the behavior you describe by simply saying \"well you're the ex and I am the one dating her so  however great \"insert what he mentionned\" I guess we are doing even greater. Thanks man for the dress rehearsal not we are at the premiere and are doing absolutely fabulous!\"",
   "created_utc": 1701477250,
   "score": 0,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbltsc3",
   "message": "Good for you. Some woman want to be pursued and her SO \"fight for her honor\" crap.\n\nLet her play her silly games. \n\nNTA.",
   "created_utc": 1701468301,
   "score": 0,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm2wv7",
   "message": "So she dumped you because she likes to hold her ex's on strings and you are asking if you are an AH?",
   "created_utc": 1701472055,
   "score": 0,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmd24v",
   "message": "Sad.... you, especially if you cared about her, needed/need to give her a cool off period, she doesn't know what she has and shel probably come crawling if you cut her off right..",
   "created_utc": 1701476525,
   "score": 0,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbm4rgb",
   "message": "Nta\n\nI wanna say esh simply cause she didn't deserve to be broken up because her ex was the one being a douche, BUT im gonna go with nta because the pot (your ex) called the kettle (you) black (immature) when it wouldn't even acknowledge your feelings. Part of maturity is being emotionally intelligent, part of emotional intelligence is being able to acknowledge other people's feelings, and she couldn't even acknowledge that what he (her ex) was doing was making you uncomfortable without insulting you. Disrespectful women get dumped.",
   "created_utc": 1701472852,
   "score": 255,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmbyfd",
   "message": "No you're good, exes aren't friends",
   "created_utc": 1701476036,
   "score": 255,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblt4xm",
   "message": "NTA - I came in here expecting you to like not be able to let it go but man Mike is a real dick keeping her around and running off people she dates by being a dick.",
   "created_utc": 1701468046,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblx8ea",
   "message": "Dammmnnnn!!! You are definitely not the asshole for walking away. She called you immature for not wanting to listen to her ex elude about their former sex life is crazy to me. Reminiscing about trips and the good times they had right in your face , the disrespect ! Her not even taking your feelings into consideration is cause for termination. You did the right thing Sir!",
   "created_utc": 1701469688,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kblxjls",
   "message": "Good call , I don’t believe in any contact with exes ( except kids together ) . The fact he was acting that way shows he still was interested. If you fight and she runs to him ( what could possibly happen) next time let that know at the beginning of seeing anyone",
   "created_utc": 1701469817,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbma6xt",
   "message": "NTA- Mike And She is TAH. She should have cut him off when he went down hotel lane. If there such good buds she should have taken him aside and said never again with that shit. Clearly he’s not her friend. I’d bet she’s the one that broke it off and friend zoned his ass. Good all bouncing.",
   "created_utc": 1701475243,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmapjs",
   "message": "For the second time today, I’m reading a post from someone with a spine who is strong enough to make the right move. Love it. \n\nOf course you’re NTA and good for you! 🥇 \u0026lt;—have an award!",
   "created_utc": 1701475476,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmcmsg",
   "message": "NTA. Been in a similar situation myself, but she was always the one talking about how great her ex was. Pretty much everything Mike said to you about their relationship, my ex told me about her relationship with her ex. Almost immediately after we broke up, she went to her ex and told him she wanted to get back together. Just don’t even bother if your partner has that kind of relationship with their ex.",
   "created_utc": 1701476338,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmdbjy",
   "message": "Good move",
   "created_utc": 1701476641,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmdg73",
   "message": "I'm a woman that is friends with my ex's and I support your decision.  Mike crossed the line and she needed to put him in his place but didn't.  You don't deserve that.  Yes people can be friends with ex's but friends don't make those sexual innuendos and disrespect the new partner like that.  He isn't a friend, he is trying to have his cake and eat it too.  I imagine he would tap that of he could, not a friend.  She also likes the attention or else she would tell him to stop.  They don't have a clean break.  You made the right choice.",
   "created_utc": 1701476699,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmfmlu",
   "message": "NTA. Let's say her and Mike are only friends, if Mike is doing this when she's with you he's doing it with every guy she dates. She will always be alone because nobody would put up with that. It's one thing to be friends with your ex. It's a completely different thing to have the relationship shoved down your throat in that way.",
   "created_utc": 1701477681,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmg4l6",
   "message": "She for the streets. Way to cut that bih off.",
   "created_utc": 1701477908,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmgshs",
   "message": "NTA. I’m proud of you for ending things.",
   "created_utc": 1701478206,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmh294",
   "message": "Nta and she and him are red flags",
   "created_utc": 1701478329,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmhi7t",
   "message": "NTA . 💯 \nAnything goes until you married or engaged .",
   "created_utc": 1701478530,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmhlan",
   "message": "YOU ARE NOT THE A-HOLE! and im sorry 😭",
   "created_utc": 1701478570,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmi0xw",
   "message": "NTA\nI'm a Generation X person, and this is my viewpoint of why you did the correct action. \n\nI have a 20 great female friends which are also drinking buddies and shopping buddies. Some of the relationships go back 16 to 18 years. None of these women have I ever slept with.or anything sexual.\n\nI have had issues with their boyfriends in the past, but when they have found out that I have friendships with other women, for longer times, they no longer have issues. They just think that it's weird but acceptable. Besides when these women ask me to help them shop for gifts for their man, I'm always getting the right type of gifts: Gerber knife, DeWalt equipment, proper pirelli tires, masculine men things and they know that I picked it out for them.\n\nThe ones who have attempted to make it into something huge, are the ones that don't have any confidence in themselves. Again, to be clear, I have never kissed, petted, done anything sexual with my friends. \n\nNow my friends have shown up on my dates, just to gossip later, but they never did anything more than a kiss me on the cheek, and introduced herself as one of my friends. \n\nIf an ex-girlfriend of mine, had  shown up at the bar, while I was having a date, and if they would have attempted to join the conversation, I would have immediately told them to leave. The reason is simple, I am there, I am going to pay attention to the girl I am with, and I'm not about to open myself a can of problems by even dealing with an ex. Besides I'm trying to build a bridge, a potential long-term relationship, I don't want to set it up on fire. Bad enough I got the gossip group, and that would make a woman nervous, but I wouldn't dare, make my date feel secondary to any of the past women of my life.\n\nDon't forget you dump or get dumped by an ex. There is a good reason why you did it, or there is a good reason why it was done. Never repeat the same mistake twice. \n\nThat woman who let her ex-boyfriend, sit at your table, completely presented herself as someone that was willing to betray your trust. I can assure you, that if you were still dating that woman today, one of your companions would have photographed her making out with that guy who you dislike. And then you would have had to worry about potentially having an STD or something else because \"she got drunk, screwed up, and now wants to be forgiven\". \n\nUnless you have a consensual exclusive relationship where you have multiple partners just for sex, you cannot forgive when a person says they screwed up. People need to be held accountable and you did a fantastic job. \n\nI really can't be more happy for you, because you executed on your gut instinct, and a priorities of saying I want someone that will trust me and that I can trust. Obviously, she tried and failed to guilt you into something where you would be submissive to her wanting more people looking at her or that other guy. \n\nI hope many men, and many women, read your post, and behave appropriately in similar situations.",
   "created_utc": 1701478769,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmiklq",
   "message": "Instead of an AITAH post this definitely should have been on one of the rant posts or WTF posts.  Mike is a total douche and I would have told the penile discharge to GTFO each and every time he brought up their past relationship.\n\nOh you went to Europe and didn't get out of bed, STFU and get out of here Mike. \n\nOh you conveniently saw us on a date...Bullshit Mikey, pay the bill ass hat, I'm leaving.",
   "created_utc": 1701479019,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmilkr",
   "message": "Dude, the moment a woman responds to your concerns with a comment about \"maturity\", understand you are with a gross manipulator and leave. Burn all bridges, never look back.",
   "created_utc": 1701479032,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmjf8m",
   "message": "It sounds like Mike relishes breaking boundaries and your ex is clueless about boundaries too. It’s a good reason to remove yourself from the situation. \n\nAll the best!",
   "created_utc": 1701479409,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmjlce",
   "message": "NTA- Why are you hanging out with Mike so much? I remained close to an ex who I knew for at least 5 years before dating and he would never be such a dick. Your gf needed to shut him down the first time he acted that way.",
   "created_utc": 1701479485,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmkwbq",
   "message": "You let Mike win.",
   "created_utc": 1701480078,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmlkkh",
   "message": "You have to do what's good for you. Your happiness is important.",
   "created_utc": 1701480390,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmll6q",
   "message": "*clapping hard*\n\nYou did the right thing for yourself! 100%. She was disrespecting you by allowing “Mike” to pull this crap in front of you and be disrespectful toward you. She liked it. She liked that it made you feel less than and made her feel cherished by two men.  She’s old news now—be thankful. You deserve better and you obviously know your worth. Good for you!",
   "created_utc": 1701480398,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmlzxg",
   "message": "Nta.",
   "created_utc": 1701480585,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmmdqb",
   "message": "NTA you handled that better than I would have. Getting out of there was a good move.",
   "created_utc": 1701480760,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmmfew",
   "message": "Nobody should be friends with their ex like this and she's disrespecting your relationship by letting him disrespect it. Good riddance.",
   "created_utc": 1701480781,
   "score": 1,
   "submission_id": "188h3jb"
  },
  {
   "comment_id": "kbmmkip",
   "message": "I (34f) am friends with all of my ex's. Literally all of them but when the relationship ends, they are hard friend zoned. You are not allowed to cross an inappropriate boundary, ESPECIALLY if either of us are in new relationships. I will not tolerate insecurities being pushed on me based on a S.O. ability to deal with my friendships, however your girlfriend let him cross boundaries way too often. That is not friendsship, that is inappropriate and sounds like Mike is still pining for something more. So NTA",
   "created_utc": 1701480845,
   "score": 1,
   "submission_id": "188h3jb"
  }
 ]
}