{
 "submission_id": "188ik6k",
 "title": "AITAH for divorcing my wife after she changed her mind about having children",
 "selftext": "I know how that sounds but I just feel like I I’m losing my mind . \n\nBefore and after marriage we’ve talked about and planned our future down to the very city we’d live  in  and kids were always apart of it. \n\nWell aroundSeptember   I brought up when she’d want to start trying for a kid  and she got really cold and told me she didn’t want any .\n\n\nAt first I thought she may have gotten some health news and when I told her that we could adopt if the idea of pregnancy wasn’t for her anymore .  She kind of snapped on me and said she wasn’t trying to have this conversation at the time . \n\nA few days after this I sat her down and asked what made her change her mind and she got really frustrated with me thatd I’d even ask and pretty much said she doesn’t need to explain her self to me\n\n\nSince those two conversations it  was so strange . She kept  trying to just move on and act as if those convos didn’t happen . \n\nSo I straight up told her we have  to actually talk about it because the shit was bizarre . \n\nShe told me I’m not gonna make her talk about anything . \n\n\nSo the last couple of months have basically been her frustrated that I won’t let this go . \n\n\nThe kids thing is a big part of it but if I just knew what was going on Id feel better. \n\nSo I brought up divorce and she told me that I’m trying to strong arm her into child birth.",
 "created_utc": 1701454617,
 "permalink": "/r/AITAH/comments/188ik6k/aitah_for_divorcing_my_wife_after_she_changed_her/",
 "score": 251,
 "url": "https://www.reddit.com/r/AITAH/comments/188ik6k/aitah_for_divorcing_my_wife_after_she_changed_her/",
 "comments": [
  {
   "comment_id": "kbkvmdu",
   "message": "NTA. Her refusing to even discuss it is the problem.",
   "created_utc": 1701455312,
   "score": 61,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkx1z5",
   "message": "At this point, divorce is the only solution. If she relents and agrees to have a baby, she'll resent you and the baby. Just make your plans and file for divorce and hope it goes smoothly.",
   "created_utc": 1701455839,
   "score": 121,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkxxc0",
   "message": "You're not trying to strong arm anyone. You're trying to have a healthy conversation about something that you believed the two of you were on the same page about, and she changed her mind.    \nJust get the divorce and move on.   \nShe doesn't want kids and having kids with her would be a huge fucking mistake.     \nNTA",
   "created_utc": 1701456163,
   "score": 203,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkw8b5",
   "message": "Nta sounds like she said whatever she had to say to get married",
   "created_utc": 1701455536,
   "score": 215,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkxpza",
   "message": "NTA but move forward with the divorce.",
   "created_utc": 1701456087,
   "score": 107,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkuk6y",
   "message": "I mean, having kids is a biggie. Some would say the biggest biggie. If you're not aligned, I don't know how you move forward honestly. I'd explore counselling just to know you've given it the old college try, but if she's completely unwilling, she's leaving you with no options if kids are a non-negotiable for you. Take the time to explore what your life would look like with and without kids and with and without her and then make your decision. NTA",
   "created_utc": 1701454923,
   "score": 225,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkzi84",
   "message": "NTA. She lied too you. She never wanted kids; she just wanted to be married. You should divorce because y’all are not compatible and want different things out of life. Oh that strong arm comment is gaslighting. Don’t let her gaslight you.",
   "created_utc": 1701456748,
   "score": 54,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5zh8",
   "message": "\"So I brought up divorce and she told me that I'm trying to strong arm her into child birth.\"\n\nResponse: \"I'm not trying to force you into childbirth; I said adoption was fine if you don't want to give birth. Actually, I have asked you several times to have a conversation about this like an adult, and you've basically told me 'You can't make me.' When we got together, we talked about our future plans and goals, and children were always a part of that conversation; at no point did you tell me you do not want children until I brought up starting our family a couple of months ago, and you have refused to talk about it since. If you actually don't want kids, knew you didn't want kids, whether from the beginning or for a while now and didn't tell me, knowing that I want kids, then our whole relationship has been built on a lie and we are incompatible. Trust is hugely important in a healthy relationship, and you've basically been lying to me, for, however long you knew you didn't want kids. Me asking for a divorce is not trying to 'force' you into anything; it's me leaving because *you lied* and *we're incompatible.* I'm going to leave to find someone I am compatible with, that has the same goals and morals, and you can find the same, but it's obviously not each other.\"\n\nNTA.",
   "created_utc": 1701459206,
   "score": 119,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkv4cp",
   "message": "NTA. It's the sort of thing you need to be on the same page about before getting married, and you had discussed it and thought you were.",
   "created_utc": 1701455127,
   "score": 99,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkxzgc",
   "message": "NTA.\n\nFirst, having kids is something that for a lot of people is a major life goal and since it's not like you can do it without her involvement if you stay together. Without knowing more details I'm not quite ready to accuse of her a bait-and-switch, but it seems suspicious.\n\nSecond, short of possibly some past trauma, her outright refusal to talk to you and telling you that you can't make her talk about it is, in itself, justification for at least considering divorce. \n\nCommunication is key in any relationship. It's especially important when trying to work through major issues. I don't see where she is leaving you much choice except divorce.",
   "created_utc": 1701456185,
   "score": 31,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkztgd",
   "message": "I'd quietly explain you're not strong arming her but if she's serious then for you it's a deal breaker and why waste any more time with someone who doesn't want children.",
   "created_utc": 1701456863,
   "score": 23,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl151d",
   "message": "NTA at all.\n\nI mean, divorce would be the smart idea, even if she was responsive to discussing the issue like an adult, and, dare i say... life partner.\n\nIt's been my limited experience that when Someone doesn't want to have kids in the relationship any longer, it's about the relationship.   I've a couple of lifelong friends who have EX spouses that went to baby city with someone else, as soon as they could do so without looking obvious.      unpleasant food for thought.",
   "created_utc": 1701457360,
   "score": 24,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl605w",
   "message": "She won’t even talk about it? Even after a couple months?? Yeah that’s unacceptable. You aren’t trying to strong arm her. You had a plan together. She changed hers and didn’t tell you and refused to talk about it. She can absolutely change her plan but it’s incredibly disrespectful for her to think you should give up yours with no explanation. If you want kids and she changed her mind she needs to be honest and give you the option of having a kidless life with her or moving on. She is being incredibly selfish and dismissive.",
   "created_utc": 1701459214,
   "score": 16,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkya3l",
   "message": "No, you’re NTA. You discussed this together and married on the basis of longterm compatibility and aligned life goals. At this point, just go through with the divorce. You gave her the opportunity to discuss this and she refused you a dozen times over. If she has a kid with you now, the resentment she’ll hold towards both you and the child won’t make for a happy or healthy home for anyone. That postpartum period is no joke even for people who are totally on board and both want a child. The communication is already dead. Sorry you’re going through this.",
   "created_utc": 1701456295,
   "score": 14,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkx48t",
   "message": "Not the asshole. You went into the marriage believing she wanted kids. She changed her mind. This is called a bait and switch. She has every right to change her mind about kids, but you have every right to change your mind about staying married.",
   "created_utc": 1701455863,
   "score": 58,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl71rx",
   "message": "“I want children, you do not want children, we are no longer compatible, I’m not going to ask you to change your mind but I will move on from this relationship and here are the divorce papers”\n\nMove out and move on. She is trying to strong arm you in staying without kids. She made clear what she wants, accept it at face value and move out and divorce her.",
   "created_utc": 1701459606,
   "score": 10,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl58jl",
   "message": "Either she's cheating on you and doesn't want to get tied down with a kid or she tricked you into marrying her fully well knowing she never intended to have kids. Either way, time for you to find an attorney, file for divorce and start making alternate plans. \n\nNTA.\n\nOh, and don't let her know that you are getting an attorney. Let that be as big of a surprise to her as her lies and manipulation are to you.",
   "created_utc": 1701458922,
   "score": 20,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl0l01",
   "message": "NTA. Never have a child with a spouse that doesn’t want one. Best to divorce if she won’t even have the conversation.",
   "created_utc": 1701457151,
   "score": 8,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkzo9b",
   "message": "It is a deal breaker when one partner wants children in the other one doesn't. It's strange she won't really tell you the reason that she's changed her mind, but let her go and find someone who wants children with you.",
   "created_utc": 1701456808,
   "score": 7,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbkzrsm",
   "message": "NTA. Children are a dealbreaker for both those who want them, and those who don’t. Divorce is an acceptable answer if one of you changes your mind. The other big issue is her deception (if she lied) and unwillingness to discuss (presuming marriage has changed her mind).",
   "created_utc": 1701456845,
   "score": 7,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl6jt7",
   "message": "\u0026gt;So I brought up divorce and she told me that I’m trying to strong arm her into child birth.\n\nYou're not strong arming her into anything. You are respecting her choice. She doesn't want kids and that is perfectly fine, you want kids, also perfectly fine. You 2 are no longer compatible and you are choosing the best path forward for your future. \n\nThe fact that she refuses to have a conversation must be frustrating. NTA",
   "created_utc": 1701459416,
   "score": 14,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl1ugn",
   "message": "Can you talk to your wife about anything or is she always in a refuses to sit down and talk mode?\n\nI mean, is she like mid cancer treatment, or her mother is doing chemo and probably has 2 months to live. She said she didn't want this conversation AT THE TIME. Which make me wonder if something was going on at that moment where it's (from her view) ridiculous to ask about when to start having kids now. Like did she 3 months ago forgive you for cheating?\n\nif there is literally zero other context then you wouldn't be an ass for divorcing her for changing her mind, but surely you would want to divorce her if you two can't even have a single conversation about it.\n\nNTA.",
   "created_utc": 1701457630,
   "score": 11,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5q99",
   "message": "She likely never wanted kids and lied to you in order to marry you.\n\nThat to me explains her reaction to your desire to talk.  If she just changed her mind...she'd understand that it might be a dealbreaker.\n\nBut it seems to me she just wants to refuse to talk about it because she thinks by doing so...she can manipulate you into letting go of having kids all together.\n\nIf I were you...I'd get the best divorce lawyer in your area on retainer because it sounds like she is going to make it difficult.\n\nNTAH",
   "created_utc": 1701459110,
   "score": 6,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbliha6",
   "message": "I hate to be “Redditor that insists upon divorce” guy, but…\n\nLife goals such as children are cornerstones of relationships on which the future of a married couple will be built. \n\nShe basically tore everything down and is acting like it’s just another Tuesday. \n\nHer lack of communication and changing of life expectations could warrant divorce proceedings. \n\nNTA",
   "created_utc": 1701463938,
   "score": 6,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl27lf",
   "message": "Nta. It's one thing to change your mind. It's another to refuse to talk about it.",
   "created_utc": 1701457768,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl3yea",
   "message": "Kinda sounds like she never wanted them in the first place and said she did to lead you on. She sounds very manipulative with her response. \n\nNTA, do it.",
   "created_utc": 1701458433,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5og8",
   "message": "NTA.  It sounds like you made this clear when you were courting and she misled you.  She clearly lied about this (and who knows what else).",
   "created_utc": 1701459091,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbldqxv",
   "message": "Updateme!",
   "created_utc": 1701462138,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblfeks",
   "message": "I feel like there’s a lot of context missing from this story and there’s a reason she’s snapping on you",
   "created_utc": 1701462768,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblgbqs",
   "message": "Now that doctors are being much more transparent about the repercussions of pregnancy and childbirth (and in the US, if you're in a state where pregnancy means serious diminishment of your civil rights), she may have been hit with reality and changed her mind.\n\nThe life changing, life-threatening reality is a lot.  She may well have decided not to take that risk after realizing what it actually means.",
   "created_utc": 1701463117,
   "score": 6,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblif4s",
   "message": "\u0026gt;So I brought up divorce and she told me that I’m trying to strong arm her into child birth.\n\nNope, she knows this isn't the case and is trying to manipulate you into dropping it.\n\nWant kids? Divorce her. She'll probably change her mind and say she'll have a kid... but you should still divorce her as she's only going to resent the kid and yourself in the future.",
   "created_utc": 1701463916,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbljt5s",
   "message": "NTA but RUN! This is not healthy or ok",
   "created_utc": 1701464442,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl2e29",
   "message": "NTA - this is absolutely a valid reason to go your separate ways… ESPECIALLY since she refuses to even talk about it with you, and you’d previously agreed that you both wanted kids? Also you are not trying to force her to give birth? You said adoption was a viable option if she didn’t want to be pregnant?",
   "created_utc": 1701457838,
   "score": 4,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl4sdg",
   "message": "Neither of you can make the other have or not have kids but to refuse to even talk about why a fundamental building block of the plans you made together before you got married is not acceptable. You are her partner not her lackey and you deserve honest and open communication. You also deserve the right to make decisions about your future. You didn’t change the plan, she did and if she refuses to be accountable for this sudden change it denotes a serious lack of respect. Without that, no marriage will survive. Best not to waste years on it for both your sakes. NTA.",
   "created_utc": 1701458748,
   "score": 4,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl53du",
   "message": "I don’t think you’re breaking up over her not wanting to have children, you’re breaking up over the fact that you’re trying to bring up something that’s important to you and she’s refusing to have the conversation. Nta",
   "created_utc": 1701458867,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5wyu",
   "message": "NTA - She doesn’t want to have kids and refuses to discuss it with you. If you want kids then there is nothing more to do. It will realistically take about three more years at the earliest to find someone else with whom you can have the sort of love and life you really want. You are not getting younger. Every day you spend trying for get more information before making a decision is another day older you turn before starting your family.",
   "created_utc": 1701459180,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl73n8",
   "message": "NTA she said she wanted them and now she doesn’t. This is often a deal breaker",
   "created_utc": 1701459625,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblb6v0",
   "message": "Be clear. You're not threatening divorce unless she will change her mind on kids. \n\nYou're getting divorced. That's it. \n\nEven if she agrees to have kids, she'll resent you and more importantly she'll likely resent the kids. They will know their mother doesn't love them.",
   "created_utc": 1701461160,
   "score": 4,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblhn1c",
   "message": "Offer the marriage counselling versus lawyer card.  \n\n\nAt this point it isn't even about wanting or not wanting a child.  \nHas she pulled the bait and switch?  \nHad she had some recent trauma?  \nIs she cheating?\n\nHow can you trust her?  \n\n\nShe's not talking and is treating you like you are the enemy.  \nWHAT is going on?  \n\n\nDivorce isn't you aren't trying to strong arm her into child birth.  \nIt's trying to correct a mistake that you may OR MAY NOT have made, but she's not talking.  \n\n\nShe's not going to talk about it unless she has to.  \nApparently being asked to do so isn't enough.  \n\n\nTake her at her word.  \nIf you go for divorce DO NOT TRY TO NEGOTIATE.    \nJust do it.  irreconcilable differences.",
   "created_utc": 1701463618,
   "score": 4,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblln76",
   "message": "NTA, she made a major life decision, didn’t include you, and now won’t communicate with you regarding said decision. You can’t make her talk to you about it but if she doesn’t she killed that marriage, not you.",
   "created_utc": 1701465146,
   "score": 4,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblmmxx",
   "message": "Lemme give you some advice. She changed her mind about wanting kids and knows that saying that out loud means the end of your marriage- because she knows how important this is to you. So she will string you along because she likes the marriage how it is. That’s wrong on her part. What’s not wrong is people changing their minds and taking the steps to rectify their life situation to reflect that. Even if it’s really sad. Nobody has to be evil or wrong here. People change. But the complete shut down on her part will be what makes this even more painful. She can’t keep denying that this is happening and maybe it’s time to tell her it’s couples counseling (where you can untangle some of this together) or you’re out. The status quo is simply not acceptable and she needs to hear that.",
   "created_utc": 1701465527,
   "score": 4,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblodo5",
   "message": "\"So I brought up divorce and she told me that I’m trying to strong arm her into child birth.\"\n\nDamn, this is some serious gaslighting right here. You told her if she wouldn't communicate, divorce was on the table (which is normal if you reached a point where you are no longer compatible), and she tried to turn that into \"strong arm her into child birth.\"\n\nOP, talk to an attorney NOW. Even if you don't have a definite plan to get divorced, get an idea of what you are looking at should it come to that. Because she might be. This kind of distancing is pretty common when someone is checking out of a relationship.",
   "created_utc": 1701466203,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblr0k0",
   "message": "I'd move on. It sounds like she hoped kids would just not come up but you did bring it up so she said no and refuses to discuss it. If she did get pregnant at this point it would be with a huge amount of anger and that won't work.\n\nI'd find someone who wants children. She seems to have lied and hoped that once you were married you wouldn't push it.",
   "created_utc": 1701467219,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbky7ua",
   "message": "NTA. If you are very adamant about having kids when she is not....it will lead to lots of contention between your are better off sparing the heart ache and pain.",
   "created_utc": 1701456271,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl217m",
   "message": "NTA. It's, like, super super common for a woman to choose her partner with wanting kids as a red line. You're entirely entitled to have the same line yourself. And besides that, her unwillingness to communicate openly is really not good.",
   "created_utc": 1701457700,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl2ban",
   "message": "NTA. Given that she refuses to talk to you about it, divorce is the most logical step going forward. You're not trying to force her to do anything. Don't let her twist your words against you and consult a lawyer. Staying together would lead to resentment towards her, and convincing her to change her mind will make her resent you down the line. Either way, you'd be postponing the inevitable.",
   "created_utc": 1701457808,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl2r9l",
   "message": "This is bananas. She refuses to talk or elaborate about the basic structure of your future lives...like, at all? How long have you been married, how long were you together? It sounds like she was saying what she needed to as long as she got married. Not sure how she thought she'd deal with the consequences, or maybe this is her dealing with them? At the minimum, counseling and communication, if she is unwilling then clearly she is not who you thought you were marrying. This is absolutely bizarre behavior, hope you get some answers.",
   "created_utc": 1701457978,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl53m9",
   "message": "NTA - you two were previously on the same page regarding life goals.  She changed her mind about a BIG one.  As a result your life plan is no longer compatible with hers.  She does not get to simply go about her business and expect you to follow along like a dog on a leash.  \n\nDivorcing her so that both of you can go pursue your (now incompatible) life paths is the correct response.  She cannot duck the uncomfortable conversation that is coming.",
   "created_utc": 1701458869,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5a7f",
   "message": "\"Should we become parents\" is 100% a conversation both parties can and should have. \n\nYour wife unilaterally refusing to talk about it ... this shows she has poor communication skills and poor conflict resolution skills. This would make her a *terrible* parent any way. Her self involvement is reason #3 she'd be a rotten parent -- she owes it to her partner to explain why she no longer supports his goals, and she's refusing to do that.\n\nYou had agreed on kids. You're not longer in agreement. The why doesn't matter. \n\nIt is far kinder to you both to divorce. Lawyer up and get it going. NTA.",
   "created_utc": 1701458940,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5hqw",
   "message": "NTA. I left my first husband after his “change of heart.” In quotes, because I see now that he never wanted children. Deal breaker for me.",
   "created_utc": 1701459021,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5iy8",
   "message": "NTA. She’s allowed to change her mind however, she’s being the AH for not talking to you about. A divorce is the only option if you want a family.",
   "created_utc": 1701459034,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5jjo",
   "message": "NTA A decent person would give you an explanation, but it doesn't affect the next step either way. Whether she changed her mind or lied all along, you're no longer compatible, so time to file for divorce. Even if YOU change your mind and don't want kids, don't stay with a partner who treats you like this. She's hiding something - you don't need to know what it is to know you need to get away from her.",
   "created_utc": 1701459040,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5pgq",
   "message": "Yeah you are not NTA. But if she says ok to kids to not get a divorce, never fall for that. She already claimed that you are forcing her to have a kid. Don’t do what she already accuse you of by staying.",
   "created_utc": 1701459102,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5q8j",
   "message": "NTA, communication is like the bare minimum in a relationship. She’s not trying to work through it as a team, not taking your feelings seriously and projecting her own mindset of treating the relationship like a game by acting like youre using the divorce to manipulate her into having a kid from what I can tell (obviously can only tell so much from a one sided post on Reddit but that’s what it seems like to me) And even if she did communicate in a healthy way and decided she didnt want kids you still wouldn’t be an asshole for wanting a divorce. \n\nHaving kids is one of the biggest most life changing decisions you can make so I think you’ve gotta be 100% on the same page about that. If you really really want to make it work and think you guys could come to a decision where you’re both happy then I’d try couples therapy to work through this. If that’s not the case or doesn’t work, divorce is really the only option. Otherwise you guys will most likely resent each other and be miserable",
   "created_utc": 1701459110,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl6pg5",
   "message": "NTA.  This is one of those fundamental life differences that is absolutely a valid reason for seeking a divorce.  Should you two stay together \u0026amp; try to work through it, the odds overwhelmingly are on the side of one of you resenting the other down the line: you resenting your wife for not wanting kids, or your wife resenting you because y’all did have kids.",
   "created_utc": 1701459475,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl6sfx",
   "message": "NTA. She married you under false pretences of compatibility and aligned life choices. That’s perfectly valid grounds for a divorce. \n\nIt sounds like she misrepresented her real views in the hopes you would just give in to her demands once you were married. Only you know if this is a dealbreaker to you. You aren’t strong arming her into childbirth, but you are expecting her to uphold the relationship expectations that you previously clearly communicated about. \n\nShe lied to you OP, and her refusal to talk about it now tells you she doesn’t even respect you enough to have an adult conversation. She’s hoping to shame you into submission by making you the bad guy and turning it around on you.",
   "created_utc": 1701459507,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl8w1w",
   "message": "I don't think you are wrong. Having kids is a big deal and if its important to you, you should not discount it.\n\nIt's not like deciding between chicken or meat for dinner.",
   "created_utc": 1701460292,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblav9a",
   "message": "Nta. Your wife is though. She is allowed to have a change of mind, but she must also deal with what follows; which is the two of you are no longer compatible; and if she refuses to explain why you can't try to find an amicable solution (if there is one) let alone even understand what's causing any of this. \n\nShe is not worth inventing more of your life with her. If you curb your own desires to try and keep your marriage you likely grow to resent her if that hasn't started already. \n\nProceed with divorce. \n\nSorry this is happening to you. \n\nHugs from an internet stranger.",
   "created_utc": 1701461035,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbleft2",
   "message": "You're allowed to want children, if that works out for you and whoever your partner is in this effort. Understand, though, that pregnancy and childbirth are **always** life-threatening for the pregnant person. That's nothing to take lightly. Even in pregnancies that are completely average and without complications, our bodies are permanently changed *and damaged* by the process. And then there's all of the societal pressures that are placed on women to have children, not be damaged by it (impossible), and then be okay with being labeled as unwanted damaged goods afterwards. Socially, it's women who take on the bulk of childcare responsibilities and domestic work. We lose our independent identity and become the accessories of our spouses and children. Many women embrace this with joy, but we're all allowed to be wary of it, too. Furthermore, depending on where you live, she may be looking at a situation where, if the pregnancy goes wrong, she's not allowed to end it, even if it takes her life. And if we express fear or worry about any of this, we're considered to be neurotic and untrustworthy.\n\nThe whole process is a proposition with few objective upsides for your wife. She's allowed to not want any part of it. If she theorized at one time that she might want it, that's not grounds for anyone to force her into it if she changes her mind later.\n\nHere's the important part: if she does not consent to have children, and that's a dealbreaker for you, then you're just not compatible anymore. Don't *threaten* divorce in an attempt to *coerce* her into providing children and childcare for you. Just tell her that you aren't compatible anymore, you're done, and there's no changing your mind. Ideally, she'd sit down with you when you when you **aren't** trying to force her to change her mind and tell you what prompted her change in position. No judgment, no negotiations, just \"what changed?\" You can't force her to do that, though. It sounds like she's completely disengaged, so you can do the same thing and exit this situation that doesn't work for you anymore.",
   "created_utc": 1701462401,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblf5hl",
   "message": "I divorced my wife after this happened to me. It was hard, but she'd 'changed her mind' after we got married, and it was a deal breaker for me. The toughest time of my life but it opened my eyes to who she really was and thank fuck im out of it now!",
   "created_utc": 1701462673,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbliagg",
   "message": "It sounds like she’s already decided on divorce, she’s just not willing to be the one to pull the trigger and be the bad guy.\nUpdateme",
   "created_utc": 1701463866,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblioy2",
   "message": "I’d have divorced my husband if he told me he didn’t want kids. It’s that important to me. If it’s that important to you divorce her and find a partner who does want kids. She sounds like she pulled a bait and switch (oh he’ll forget in a few year he’ll be so happy with me). \n\nMy friend was always clear with her husband she didn’t want any kids he agrees (has three from his marriage he doesn’t see) than got mad at her for getting her tubes tied when she gynecologist finally said it was ok. Bait and switch. Say it but don’t mean it. \n\nNTA",
   "created_utc": 1701464017,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblpttl",
   "message": "She has the right to change her mind and you have also the right to withdraw from the marriage based on evolving differently. Nta.\nMy sis always wanted kids, her partner didn't mind. She wanted to get pregnant so she wanted to see a doctor. He said that having kids naturally was ok but not IVF or other procedures. They divorced. The situation made them not compatible. It's not like one changed drastically. Here, if I was you. I would feel cheated",
   "created_utc": 1701466763,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblu326",
   "message": "divorce her and move on",
   "created_utc": 1701468419,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbluvck",
   "message": "I don't want kids either, and you should divorce her. No other path. Get it done and move on.\n\n\nDon't fuck around, you're not compatible",
   "created_utc": 1701468733,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblvdc5",
   "message": "\u0026gt;I’m trying to strong arm her into child birth.\n\nShe's trying to force you into being childless.",
   "created_utc": 1701468932,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblx148",
   "message": "Completely justified",
   "created_utc": 1701469604,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblx22v",
   "message": "NTA. You were upfront with her from the beginning. If she wasn’t on board then, she should have told you that. \n\nBe careful if she suddenly “agrees”",
   "created_utc": 1701469615,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblxmmr",
   "message": "NTA. I'm with the other commenters, go through with the divorce either way. She clearly has severe communication issues and I don't see it getting any better. Also, are you willing to give up having children? Because it's not like you can force her to have kids and even if you do she'll just be resentful and your relationship will suffer even more. Cut your losses and move on.",
   "created_utc": 1701469852,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbly50y",
   "message": "NTA at all. She won’t even talk about it. She knows you want kids and if she doesn’t then divorce. Even if she supposedly said, she changed her mind you should still not have children with her.\n\nI think she knew all along She didn’t want children, but said whatever she had to so that you would marry her. That is so messed up.",
   "created_utc": 1701470063,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblycyq",
   "message": "NTA. Divorce is the only way forward with someone who refuses to communicate. You no longer want the same things  so it’s time to part ways.",
   "created_utc": 1701470153,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblyha1",
   "message": "NTAH but she is",
   "created_utc": 1701470202,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblyilb",
   "message": "NTA but please do not try an convince her. If no kids is a deal breaker for you, move on and find someone who does want kids. I’ve seen a few times partners be pressured into having kids just for it to end in divorce and custody battles, etc. It’s ok if you guys want different life paths at this point!",
   "created_utc": 1701470217,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblzxxq",
   "message": "NTA\n\nIf you want to be happy, and you want her to be happy, then there are only two real paths.\n\n1. Have a real conversation like two adults and figure out why there's been a change of heart. Afterwards, decide what's best for both of your happiness. (You've tried thus far with nothing in return.)\n\n2. Get a divorce so both of you can find a situation that makes you happy. This is likely the outcome of number 1, but it's the only feasible outcome if she refuses to talk about it.",
   "created_utc": 1701470807,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblzzhw",
   "message": "NTA. You guys legit need therapy. If she refuses, you gotta walk. You deserve better than that in a partner. And I mean someone who will actually have a conversation with you, not the kids part.",
   "created_utc": 1701470825,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbma4gu",
   "message": "NTA: she is gaslighting and manipulating you because she wants what she wants. Which is to be able to stay married to you and have no kids.\n\nJust tell her you are not strong arming her. You have just come to the conclusion that you two are no longer compatible.\n\nTherefore you can divorce and she can go find someone who doesn’t want kids to be with, and you can go find someone who wants them to be with.",
   "created_utc": 1701475212,
   "score": 3,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbky57b",
   "message": "Outside of her not wanting kids now, something is up with her. Never known a woman to get that upset about a conversation about kids. Not to be that guy, but it almost sounds like she is hiding something. \n\nI would suggest MC first, if you can get her to go. But she is right, she doesn't have to tell you anything and you have every right to walk away and find someone who actually wants kids. \n\nBest if luck",
   "created_utc": 1701456244,
   "score": 5,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl1873",
   "message": "This is a no-win situation if you stay together. You want kids, and she doesn't. There is no way to compromise. Either you get your way, and she's miserable, or she gets her way, and you're resentful.\n\nDivorce. You both deserve to be happy. Again, there are no possible compromises. The only way for you both to be happy is to divorce and find a more compatible partner.\n\nNTA",
   "created_utc": 1701457394,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl1s4x",
   "message": "NTA",
   "created_utc": 1701457606,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl2z1v",
   "message": "NTA\n\nyou have one life to live and you need to live it how you want.",
   "created_utc": 1701458060,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl336q",
   "message": "I'm not quick to say this often, but divorce seems to be the only road left. If she lied to you about something this big (kids) then she's going to change the plan on other things as it suits her.",
   "created_utc": 1701458105,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl382a",
   "message": "NTA. She won't even have a conversation with you, sounds like there is no marriage to save anyway.",
   "created_utc": 1701458157,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl5xk9",
   "message": "NTA. You now have your answer. If she doesn't want children and you do, then you have to make the adult decision and move on. It is solely your decision based upon the fact she is not willing to have children, and any conversation you have about it results in her getting defensive and shutting down.\n\nDivorce amicably and wish her the best. But, what you believe is the best for you is finding someone to love who wishes to have children with you. Actions and reactions is the only thing you are doing. Good, bad or indifferent. Good luck.",
   "created_utc": 1701459186,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl6kvm",
   "message": "NTA, divorce. Don't let her tell you she's ready for a baby now and don't have sex with her. That baby would be resented and I'm sure you envisioned bring a much wanted baby into a loving and stable environment.",
   "created_utc": 1701459428,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl6w6n",
   "message": "Nta. Try for an annulment as the refusal to have children can be a cause.",
   "created_utc": 1701459546,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl710c",
   "message": "NTA! \n\nShe knew beforehand she didn’t want kids and that it’d be a deal breaker for you so she told you what she wanted you to hear in hopes you’d forget it.",
   "created_utc": 1701459598,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl73yu",
   "message": "Run as far as you can.",
   "created_utc": 1701459628,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl76xi",
   "message": "Refuses to talk about a major life decision? What major decision is next? Refusing to talk about buying a house? A car? Major medical event? \n\nNTA. If she can't be reasonable, then divorce is the only option.",
   "created_utc": 1701459658,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl7azb",
   "message": "NTA. There's nothing for her to talk about because this was her plan from the start, she lied to trap you. \n\nYou wouldn't happen to make way more money then her??",
   "created_utc": 1701459700,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl8je8",
   "message": "It sounds like you went into this marriage having had the discussion of kids. The fact she refuses to even have this discussion with you is quite bizarre. You're not strong arming anything and as her partner who entered into this relationship and marriage based off the idea you would have kids, you deserve to know the reason why she changed her mind. You are well within your rights to divorce because, quite frankly, you were deceived. Some states will even offer you an annulment based off of this fact. Have you two had any other problems in your marriage recently?\n\nEither way, NTA. She's TA for refusing to even be a mature adult and discuss her reasoning with you.",
   "created_utc": 1701460162,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl8nvx",
   "message": "NTA. Get thee to a divorce lawyer now.",
   "created_utc": 1701460209,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl8o70",
   "message": "Nta. Sounds like she is cheating or something. There is an issue bigger than you know going on. Unless she has been lying to you this entire time about kids. It's fair to have a deal breaker for marriage. Everyone has different goals and dreams in life. You shouldn't have to give up your dreams.",
   "created_utc": 1701460212,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl94m3",
   "message": "Maybe she never wanted kids in the first place.    \n\n\nSeems like you two are incompatible.    \n\n\nNTA if you want a divorce.  Better to divorce now with no kids in the home and find someone who wants the same thing you want.",
   "created_utc": 1701460381,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9bkb",
   "message": "Info - do you have a prenup?",
   "created_utc": 1701460453,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9hd5",
   "message": "NTA and at this point even if she turned around and said she would start trying for children today, you should still walk away. She's refusing to communicate about something really important to you and the relationship; nothing good will come from a relationship with a partner who won't even talk to you about a topic like this.",
   "created_utc": 1701460513,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9jdc",
   "message": "NTA. You are spot on in your thinking, OP. Your wife is shutting down communication. That is NEVER good for a marriage. She has the right to change her mind, but she MARRIED you. You are her husband. She really should be communicating with you.",
   "created_utc": 1701460534,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9ndl",
   "message": "Nta divorce",
   "created_utc": 1701460576,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9ppg",
   "message": "I hate to jump straight to calling your wife a cheater, she could have other reasons but the defensiveness and unwillingness to even have a discussion about it is very sus. Like perhaps you caught her off guard and she didn't want to tell you the reason because she couldn't think of one and can't bring herself to tell you the truth. NTA",
   "created_utc": 1701460600,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9q4o",
   "message": "Sounds like she wants out but wants you to do it",
   "created_utc": 1701460604,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl9y2c",
   "message": "NTA - I wonder if you are the only person she is intimate with at the moment.",
   "created_utc": 1701460687,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblas4j",
   "message": "NTA. Children are not something that you can compromise on.  You can't have \"half a child\" or return it to the shop if you don't like it.\nAlso she doesn't seem completely against the idea of having children, she simply doesn't want biological children and be forced into pregnancy and childbirth. She proposed adoption after all.\n\nWhat's strange is her complete refusal to talk about. The way she shuts off completely.\nYou might try copule's counselling.",
   "created_utc": 1701461002,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblb1jh",
   "message": "Both of you seem to not be handling this too well. She is not communicating which is absolutely a huge problem. However, the way you are writing this makes it sound like you are using the threat of divorce to try and get her to finally talk to you, which frankly is just as big of a problem. As is the case in most couple related posts here, my advice stays the same. get some counseling to help you two communicate, but also figure out the underlying issues that have made you both communicate so poorly on this to begin with.",
   "created_utc": 1701461102,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblc3xz",
   "message": "Have you been married long?   I'm just curious .\n\nAnyway NTA.  It's done really isn't it, there's no way to stay in this marriage now.",
   "created_utc": 1701461511,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbld6ov",
   "message": "NTA. To have/not have kids can often be a make-or-break for people and it sounds like you both were in agreement to having kids prior to marriage. In addition, it is her responsibility to you to explain why she's having a change of heart since it would mean a total change of trajectory for your future together. You became a partnership when you married, which means she needs to meet you halfway and communicate. \n\nIntroducing divorce to the conversation sounds like a reasonable step given the circumstances. It's not strong arming her to remind her that part of your reason for marriage was to have kids together. If she's no longer willing, it would be reasonable to explore whether going your separate ways would be the better outcome rather than avoiding the issue and developing resentment with one another over it.",
   "created_utc": 1701461924,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbldvbw",
   "message": "NTA but, if this is really something that you two used to be on the same page about, do you think that she is depressed? It may be worth exploring that and therapy together and individually prior to divorcing",
   "created_utc": 1701462185,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kble0ic",
   "message": "NTA. Communication and understanding are top priorities in a marriage. She won't let you have either; so, the marriage is already going down the drain, IMO. It sounds like you will spend a lot of time resenting this, which is toxic. You two agreed on the lives you will have together, and that set the tone for the marriage. That kind of bait and switch stuff is no good...she should at least explain her change of mind and heart. She sounds like a spoiled, selfish brat. You are not forcing her into childbirth since you put adoption on the table; so, that argument is moot.",
   "created_utc": 1701462240,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kble3w5",
   "message": "NTA. You’re not trying to force her into anything, you’re asking what changed.",
   "created_utc": 1701462276,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kble56r",
   "message": "NTA. Time to start dividing things up and move on. She has something going on she will not talk about, and you aren't going to change her mind. Just walk away.",
   "created_utc": 1701462289,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblelvg",
   "message": "NTA- whilst she’s allowed to change her mind it now means you two are no longer compatible and want different things out of life",
   "created_utc": 1701462466,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblfde0",
   "message": "NTA\n\nThe bigger problem is her not being willing to discuss this with you. What is she hiding? Why won't she tell you?\n\nChildren are kinda a big deal, so even if she was willing to discuss this with you, it would be enough to end the marriage if you didn't agree.",
   "created_utc": 1701462756,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblfg3z",
   "message": "\u0026gt;So I brought up divorce and she told me that I’m trying to strong arm her into child birth.\n\nAssuming you are speaking truthfully and in good faith:\n\nShe doesn't want kids, she may have at some point but doesn't want them now. Her current strategy is to refuse to talk about it and gaslight you into believing that trying to force a conversation equates to abuse. \n\nI suggest seeing a therapist yourself to get your head on straight and then make a plan from there.",
   "created_utc": 1701462785,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblfh3m",
   "message": "NTA another big issue is that she is not willing to have a conversation. Because frankly, she does need to express what she is feeling with you. In a marriage y’all are building your lives together and that means being able to communicate your needs and desires and compromise. Sorry she put you in this position man.",
   "created_utc": 1701462795,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblgc7a",
   "message": "NTA. That is a legit reason for wanting a divorce.  Can appreciate that she changed her mind, her lack of communication though is a power move. And communication doesn’t mean she has to tell you, it can mean she says “hey, this is really hard right now for me, can you give me a week to get my thoughts together”",
   "created_utc": 1701463122,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblgj1u",
   "message": "NTA, you're not trying to strong arm her or force her to have children u said u talked about it abd she agreed to have kids in the future the fact that she changed her mind and is refusing to tell u why is very suspicious make me believe she never wanted kids and only agreed so that she could marry u and hope she can delay the conversation and change your mind when u talk about it .if u truly want kids u may need to divorce and move on . Find someone who wants kids as much as u want them.\nGood luck man.",
   "created_utc": 1701463194,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblglnp",
   "message": "Am I the only one who thinks she never wanted kids and just agreed with him to get the ring? It's not like he sprung the idea of having a family on her, they had discussed it.\n\nOP isn't trying to strong arm her or force her into childbirth. He is just trying to enact a planned decision and looking for a time-line.\n\nI'm sorry OP is going through this. \n\nNTA.\n\nEdit: typos.",
   "created_utc": 1701463222,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblh90c",
   "message": "My mom lied to my dad about wanting children. He said no children, no marriage. She changed her mind and they had two kids. Honestly, he should've just divorced her. It would have saved a lot of heartache. Growing up with a mom who didn't want kids is awful.",
   "created_utc": 1701463470,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblhafv",
   "message": "NTA.\n\nShe may already be planning to leave the marriage.\n\nEven if not this is a huge fundamental difference.\n\nProtect yourself financially. You have a soft underbelly here and there are several ways you could be hurt.",
   "created_utc": 1701463485,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblhgdh",
   "message": "NTA. She’s your life partner. The two of you should be able to talk about the future together. Of course, you cannot force or coerce her to have children if that’s not what she wants, but the two of you should absolutely be able to talk about this. If she does not want children, and you ultimately do, you have a right to seek out a different relationship that fulfills your needs, or if you need to reassess your future plans. You need to know if you have a future with your current wife.",
   "created_utc": 1701463548,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kblhwwa",
   "message": "NTA. Happens all the time.",
   "created_utc": 1701463723,
   "score": 2,
   "submission_id": "188ik6k"
  },
  {
   "comment_id": "kbl1bvg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "188ik6k"
  }
 ]
}