{
 "submission_id": "188kcms",
 "title": "AITA for asking my girlfriend to reimburse me for the money I lost when she cancelled our holiday?",
 "selftext": "I have been with my girlfriend for a year and a half. We made plans to go on holiday abroad for 10 nights. We picked a nice destination, lovely hotel and booked it. It came to just under £1000 each in total and we both paid for ourselves. \n\n  \nAround 3 weeks before we were due to fly my girlfriend mentioned being quite anxious about telling her parents we were going because she said they don't have a lot of money at the moment and she doesn't want it to seem like she's rubbing their noses in the fact we're going away. I asked if she still wanted to go and mentioned that we could still cancel and get the majority of our money back and only lose the £100 deposit. \n\n  \nShe said no and that she'd be alright and that she just needs to get it over with and tell them. She didn't mention it anymore and then the morning that we were due to drive to the airport for our evening flight she says she can't go. She said she she's anxious and feels bad for her parents. \n\n  \nI point out there's it's not like she would have given them the money she spent on the holiday anyway and the holiday is already paid so there's nothing she can do with that money for her parents. She just repeats that she cant go and that we have to cancel the holiday. \n\n  \nLater in the day she mentions the fact we've both lost a lot of money and I just mention to her that I don't think it's fair for me to lose nearly £1000 because she decided to cancel. She asks what I'm saying and I just say that I think she should reimburse me since she was the one who reassured me she was fine when I mentioned cancelling while we could still get the money. \n\n  \nShe said I was being greedy and cruel and that I was out of order for expecting to be reimbursed but I just pointed out we've only lost the money because she cancelled the holiday last minute. She just repeated that I am being horrible and that I shouldn't even be considering it. \n\n  \nAITA for asking to be reimbursed for the holiday my girlfriend cancelled?",
 "created_utc": 1701459291,
 "permalink": "/r/AITAH/comments/188kcms/aita_for_asking_my_girlfriend_to_reimburse_me_for/",
 "score": 0,
 "url": "https://www.reddit.com/r/AITAH/comments/188kcms/aita_for_asking_my_girlfriend_to_reimburse_me_for/",
 "comments": [
  {
   "comment_id": "kbl751g",
   "message": "Oooooooh I’d be livid. She had plenty of time to tell you. She felt bad for her parents but not bad for you and your money. This was a huge breech of trust. How are you ever going to trust that she won’t cancel last minute on a trip again? She needs to understand that this was HER decision, not a bummer of a situation to be in. She made the choice. The irrational, stupid choice to waste your money for nothing. NTA",
   "created_utc": 1701459639,
   "score": 148,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbl84qm",
   "message": "NTA. She felt bad for her parents but doesn't seem to care that her decision impacted you? It's not as if you wanted to go on a 10 day vacation alone...",
   "created_utc": 1701460009,
   "score": 208,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblb5bn",
   "message": "NTA I would have went with out her. If she wanted to stay that’s fine but I would have went and enjoyed my holiday.\n\nShe is 100 percent responsive and should pay you back.",
   "created_utc": 1701461144,
   "score": 77,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblev73",
   "message": "Ask her if she is going to tell her parents that she just threw away  £2000 so that they wouldn't feel bad that she went on a holiday.",
   "created_utc": 1701462565,
   "score": 47,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblehe8",
   "message": "NTA, but I mean, let's be honest, this relationship is probably over. Unless you're fabulously wealthy, £1000 is a significant amount of money to throw away because of anxiety or guilt that she refused to deal with in a healthy way. £2000, really, if it was £1000 each. \n\nIf you're rich enough that losing the money doesn't impact your quality of life in any meaningful way, then sure, move past it, but most people would have a really hard time staying in a relationship with someone who is this indecisive, anxious, remorseless, and irresponsible. Your mileage may vary.",
   "created_utc": 1701462418,
   "score": 134,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblczta",
   "message": "NTA, but why didn't you go without her? Seriously. She made a choice. By staying home with her, you reinforced that choice.",
   "created_utc": 1701461851,
   "score": 92,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblgdot",
   "message": "NTA. Dump her, she either never booked the trip and stole your money or she doesn't care about your finances and wellbeing. Either way, not a person you want to be in a relationship with.",
   "created_utc": 1701463138,
   "score": 43,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblb7sz",
   "message": "Your are totally justified , she was the one who did this . This is a breakup moment if she doesn’t think it’s fair or respect you enough to fix her flakey behaviour",
   "created_utc": 1701461171,
   "score": 31,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbli2cb",
   "message": "NTA but it sounds like the holiday was never booked. Did you ever see the tickets? Cause based on the info given, seems crazy that she was willing to throw 2k away. \n\nMore likely she gave it to her parents, they couldn’t pay it back and now she can use the cancellation as an excuse to not have to pay it back.",
   "created_utc": 1701463782,
   "score": 22,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbleska",
   "message": "As the parent of daughters in their 20s - I'd be gutted that they pulled out of a booked holiday that they had already paid for because they thought that I would feel upset, that would make me feel far more that I'd failed at being a parent than them going on a holiday when I wasn't going on one\n\nMy job as a parent is to support them into becoming fully functioning adults (I'll always be a prop for them, they don't need to be a prop for me)\n\nNTA",
   "created_utc": 1701462536,
   "score": 17,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbleofo",
   "message": "Nah, I'm not buying her story. She pocketed the money herself and you won't ever see it again. \n\nDon't just run dude. Fly.",
   "created_utc": 1701462493,
   "score": 33,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblgw61",
   "message": "Nta im sorry I couldn’t stay with someone who would burn 2k because she didn’t want to tell her parent. How do you think her parents would feel finding out she threw away a 2k trip. \n\nShe should pay you back but honestly you should be breaking up that’s insane.",
   "created_utc": 1701463332,
   "score": 14,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbl916e",
   "message": "NTA - you losing is a direct result of her actions....or maybe her lack of action is more appropriate.  If anything she's the greedy and cruel one.  GL",
   "created_utc": 1701460346,
   "score": 14,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblecx6",
   "message": "Dude. This is dump her and consider it a life lesson that cost you 1000 pounds. \n\nThat lesson would have been to leave her at home and go yourself. Then dump her upon your return.",
   "created_utc": 1701462370,
   "score": 12,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kble3fy",
   "message": "She felt bad for her parents and didn’t want to rub it in- but Essentially she just threw away money since she didn’t actually attend the vacation- idk how that’s any better, “oh hey I could’ve gone on this trip and built memories since I’m in a position to do so, but I felt bad about your financial situation and canceled last minute. I couldn’t get a refund though so I just spent that £1000 on literally nothing and threw it away”. That’s crazy to me.",
   "created_utc": 1701462271,
   "score": 9,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblfdtv",
   "message": "NTA. It seems that she deliberately led you on about going on holiday, so it's only fair she reimburses you",
   "created_utc": 1701462761,
   "score": 9,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblnskp",
   "message": "Did she really book the holiday, or did she make you believe she booked? Simply ask her to let her see you the account with which she made the reservations.",
   "created_utc": 1701465974,
   "score": 10,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbl7huu",
   "message": "Eh, you should’ve just went on the trip yourself instead of losing money. I don’t think you’re necessarily the ashsole for saying it, but you had to know it wasn’t going to help the situation or her anxiety. Her anxiety though needs addressing for real.",
   "created_utc": 1701459771,
   "score": 47,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbldn3o",
   "message": "Yeah I would have gone without her.\n\n\nIf she wants to be a wasteful (losing out on the money) and flakey that’s on her, but I wouldn’t stand by and twiddle my thumbs with her nonsense.",
   "created_utc": 1701462098,
   "score": 6,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kble8d6",
   "message": "She set a grand of your money on fire for no reason at all. Yeah she owes you. And as soon as you have that cash, I’d be seriously questioning how much I need this person to remain in my world",
   "created_utc": 1701462323,
   "score": 6,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm0r46",
   "message": "Your girlfriend “booked” the tickets, under her account, and never showed you these. \n\nYour girlfriend “cancelled” the trip because she was worried that her parents are poor. \n\nYour girlfriend “got angry” at you for asking her to pay for the cost of her actions. \n\nOr, counter point, your girlfriend never booked the tickets, pocketed the money and, my guess, she actually loaned the money to her parents who didn’t pay her back in time, hence the last minute cancellation. \n\nBlack and white, ignoring the fairly obvious likely fraud, do you want to be with someone who is THAT irresponsible? For any reasonable person, the answer is no. So what’s the next step? Small claims! And, here’s the fun part, my guess is it’ll come out that she stole that money and never even purchased the tickets! \n\nAlthough you could still call the airline today and find out if she actually did book them, which I recommend you do.",
   "created_utc": 1701471142,
   "score": 8,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblo9zl",
   "message": "OP - i hesitate to ask this but did you pay for everything directly or did she do all the booking? did you give any money to her to pay? i worry that she potentially could have stolen from you and realized she couldn’t string you along anymore. i realize this may sound a bit paranoid",
   "created_utc": 1701466164,
   "score": 5,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblp7bv",
   "message": "So let me get this straight.  She feels bad about SPENDING $1000 on trip because her parents are struggling financially.  Yet she's perfectly fine THROWING AWAY $1000 (plus $1000 of YOUR money)?  On top of that you gave her an out saying you could cancel with only losing 10% when she first brought up her parents' struggles?\n\nYeah I'm calling BS in a major way.  If you didn't see the actual booking (like boarding passes, and no they will not issue your boarding pass under her name no matter who booked it, hotel reservation receipts etc...) then I'm pretty damn sure she pocketed your $1k (probably gave it to her parents).\n\nNTA.  But nothing adds up from your GF's side.",
   "created_utc": 1701466522,
   "score": 5,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblkhk7",
   "message": "There’s something fishy here. Are you 100% sure she actually spent the money? Your boarding pass would be yours regardless. I’m not buying this. Not sure she did either.",
   "created_utc": 1701464703,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblfjku",
   "message": "I’d have went anyway and rubbed it in her face",
   "created_utc": 1701462821,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblgcpp",
   "message": "NTA and she needs to give u your money you lost back cuz she wanted to be afraid of her parents for enjoying her life",
   "created_utc": 1701463127,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblgujf",
   "message": "NTA. But why didn’t you just go without her? Or have the discussion about “well, do you plan on paying me back?” Frankly, I would get my money back (good luck), then break up with her because her mental health issues would be hell to live with for the rest of your life. Canceling a holiday because she has “anxiety about her parents” is just…stupid.",
   "created_utc": 1701463315,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblhzs9",
   "message": "NTA, and honestly I'd have gone without her. The morning of??? Fuck no.\n\nIt's weird she doesn't want to rub money in her parents' faces. What was she planning on doing, coming back and bragging at them? Also wouldn't normal parents be pretty happy if their kid got to enjoy a nice vacation?\n\nYour GF needs to see someone to help her get over whatever is between her parents, her, and money.\n\nShe definitely ought to reimburse you. She just threw $2k in the drain, I'm pretty sure her parents wouldn't like that either.",
   "created_utc": 1701463755,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbljac6",
   "message": "Better to dump her now. She’s a controlling manipulative b1tch who will bend you to her wishes as long as you’re together. DTB IMMEDIATELY",
   "created_utc": 1701464242,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbln79x",
   "message": "Why didn’t you go without her??\n\nYou can’t force her to pay you back but you can make sure that never happens an again. Go forth with the decision you’ve made.",
   "created_utc": 1701465745,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblnob4",
   "message": "NTA. She just wasted £1000 of your money. End the relationship and get someone who doesn't flake out easily and communicates properly. Don't let her do same to a wedding that will set you back £10,000 or more.",
   "created_utc": 1701465929,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm1hxa",
   "message": "NTA but I'd ask her for confirmation she even booked the flight cuz I think she just pulled a fast one on ya",
   "created_utc": 1701471456,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm2ni1",
   "message": "NTA but I think she robbed you",
   "created_utc": 1701471946,
   "score": 4,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblhm65",
   "message": "I would almost cut her some slack if she had pulled out sooner or not brought it up weeks before. She was perfectly fine lying to you and wasting all your time and money. I wouldn't ask for the money back. I would have went alone and come back single. \n\nJust my 2 cents. \n\nNTA",
   "created_utc": 1701463609,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbli0po",
   "message": "NTA. With the last minute bait and switch cancelling when its a total loss instead of a loss of approx $100. She can pay cuz there  was ample time to cancel rather than waiting and doing it last minute. Time for some serious financial discussions. Is this going to be her normal?  Can you live within the shadow of never experiencing travel because family is not well off?",
   "created_utc": 1701463765,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbliucz",
   "message": "You probably could have gotten access to the documents you needed to go by yourself, but maybe not in the short amount of time before you needed to leave for the airport. In any case, you should have pressed her to help you do so, because it would have revealed whether it was ever booked to begin with. It doesn't sound like this relationship is long for the world. NTA.\n\nSeparate question: are travel agents (I assume that's what a holiday maker is, in US terms) still a thing?",
   "created_utc": 1701464074,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbljfki",
   "message": "I think you're being to soft on her. Make her feel worse.",
   "created_utc": 1701464298,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbljhs3",
   "message": "What are you even talking about. If you are seriously questioning yourself, you gotta grow up and grow a backbone. \n\nHer reasoning is extremely dumb. Her parents are hard with money so she tosses 1000 of her and 1000 of your money away? Anxiety aside, that's just dumb. If she were worried and said she couldn't because she needed to help her parents, that's one thing. But this.... is literally wasting money. \n\nThis isn't going to change. I had an ex who had similar views and she made life a living hell. We couldn't go out to nice dinners because her parents weren't able to do that for themselves. She wasn't even helping them financially, she just didn't like them to see her do things they could never. Just leave man. You paid for a 1000 lesson, cut your losses before it gets worse.",
   "created_utc": 1701464321,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblk1gn",
   "message": "NTA, check the receipts. I'm increasingly thinking that she either pocketed it, or refunded and pocketed the 1800. I wasn't thinking this initially, but she seems so damn shady about the whole thing. The last minute cancel could screw with your work PTO, too. 1.5 years is too long for a hustle, unless she thinks she can milk you for more money over time. Do you cohabitate? I'd be watching my shit and be preparing for an exit. \n\nAnd honestly, I've never heard of someone feeling guilty because of her parents' poverty. Was she truly covering her share, or maybe they gave her money for something else and she put it towards the vacation. That would make me feel guilty and not want to go, even if my parents weren't poor.\n\nThat's too much money to write off. I'm sorry you're going through this.\n\nETA: Could you work out a payment plan for her? like 20 a week?",
   "created_utc": 1701464530,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblmg78",
   "message": "Did you break up with her ? Because you can’t seriously be interested in someone who is so stupid. She’s concerned with what her parents might think if she spends money on the vacation, but she literally went one step further and spent the money without going and enjoying the experience. The money is gone and in a worse way than going on the trip. The only difference is the appearance which is meaningless. What happens next time when it’s her parents feelings worth $10k? You can’t trust her judgement.",
   "created_utc": 1701465454,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblmt1m",
   "message": "Rethink this relationship. She sounds like a very anxious person. I would be very angry with her, but I wouldn't ask her for the money back because you didn't pay for her. Maybe you should have just gone on the vacation anyway without her. That's what I would have done because I wouldn't have wanted to lose the money.",
   "created_utc": 1701465593,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblnalg",
   "message": "You should have just gone without her.  The money was already spent",
   "created_utc": 1701465781,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbloezb",
   "message": "What the hell? What’s really going on here? Cancelling at the last minute because of her parents makes zero sense. Is she weirdly attached to them or something? If she really felt that bad she didn’t need to tell them? Do y’all live with them? This is bizarre\n\nEdit: please ask her to see the confirmation emails. Something isn’t right.",
   "created_utc": 1701466218,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblotkm",
   "message": "You should have gone without her. But she does owe you the $1,000. I'd die on that hill.\n\nYou must have been so disappointed, she is very untrustworthy. NTA",
   "created_utc": 1701466376,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblozrk",
   "message": "NTA and she should be glad you just didnt go solo. Also I would have 100% pointed out that their parents would be way more upset with her WASTING money and not even enjoying the trip she planned. You are right the money she used would most likely never be given to her parents either way. But it is a way bigger slap in the face to book a (semi) expensive vacation and then just flake out of it.",
   "created_utc": 1701466442,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblp965",
   "message": "This is weird. Really weird…..\n\nShe canceled a trip because she was afraid to offend her parents by spending so much money and had ample opportunity to cancel without a serious hit to the pocketbook only to back out at the very last minute to not go to spare her parents anxiety and feelings of shame for them being poor….????\n\nHer parents won’t be madder that she actually threw out that much money for zilch?\n\nAre you sure there was actually a booking and she didn’t just pocket your money for her own Christmas spending?\n\nSeriously….. this would not be the first time I heard of this kind of bait and switch….\n\nSorry, your NTA but your money is gone. Gone….gone. IMO she probably bought her family Christmas gifts with your dollars. And you should consider making her an exGF unless it’s pretty easy for you to also trash $1K here and there….but, in reality, if you push her into paying you back I suspect she will be the one to break up with you for “being horrible.” And you still won’t get your money back….",
   "created_utc": 1701466541,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblph1w",
   "message": "NTA.  You gave her plenty of time to back out and only lose the deposit.  She drug her heels and now you are out a lot of money.\n\nWhat's with the anxiety about her parents finding out you were going on vacation? Seems like a really strange excuse not to go.",
   "created_utc": 1701466626,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbly8g9",
   "message": "LMAO bro. She fucking stole the money bro.",
   "created_utc": 1701470102,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm28g1",
   "message": "Hey OP did you physically see a confirmation of the booking or your boarding passes? Because your comments are making me think there's a chance she never bought the tickets and spent it on her parents",
   "created_utc": 1701471768,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm2vh2",
   "message": "NTA but are you sure it’s the parents thing? Maybe she didn’t want to go. Or go w you",
   "created_utc": 1701472040,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm5ue0",
   "message": "Nta Did you see the tickets or any of the confirmation emails are you sure she didn't pocket the money",
   "created_utc": 1701473327,
   "score": 3,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbldjzu",
   "message": "NTA, and if she was a \"keeper\" she would have encouraged you to go by yourself - \"Have fun, send lots of photos, don't have too much fun without me, love you, bye!\"\n\nYour GF clearly doesn't understand the value of money and has anxiety issues that prevent her from making rational decisions.",
   "created_utc": 1701462065,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbldw7s",
   "message": "nta honestly you should have gone by yourself or found someone to take over her ticket by paying for the name change",
   "created_utc": 1701462194,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblh0r0",
   "message": "Why didn’t you go by yourself. Her issues are her problem id still have gone without her and that would be on you. She’s still responsible for her actions but you should have gone without her nta",
   "created_utc": 1701463381,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblh686",
   "message": "I would've went on the trip I paid for by myself if she didn't want to go screw that noise. If you went without her you could've given her her portion back. She needs to give you your money back. \n\nGrow a backbone and get her into therapy for her anxiety.",
   "created_utc": 1701463440,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblhbcd",
   "message": "Not saying you should dump her but this is definitely a moment to take a big step back from the relationship.  IMHO trust is everything in a partnership and I don't see how you'd ever be able to trust her again.  Is she seeing a therapist/getting meds for her anxiety issues?  Is this a case of her parents not approving of her going on a vacation with a boyfriend (or you in particular)?\n\nCurious, why didn't you just go on the trip by yourself since it was all paid for?",
   "created_utc": 1701463495,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblhp3t",
   "message": "I might have gone on the holiday without her.",
   "created_utc": 1701463640,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbli621",
   "message": "Why didn’t you go by yourself?",
   "created_utc": 1701463820,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblkx69",
   "message": "NTA.  I would be furious.  You gave her a chance to cancel and she declined.  The day of the vacation she decides to bail???  And it's all about her parents??  You need to rethink this relationship.  If she can't even go on vacation because she's afraid of what her parents will think then she's not ready to be in an adult relationship.  AND I'd want my money back!!",
   "created_utc": 1701464868,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblm2g8",
   "message": "NTA. TBH I'd be industrial grade pissed off about this disrespect and seriously reconsidering the relationship.",
   "created_utc": 1701465306,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblm71u",
   "message": "NTA I would’ve went on the holiday by myself and let her stay home alone instead of us both loosing money and wasting time off from work. In the future you should plan holidays away with others and not include her unless it’s a mini break in your home country.\n\nINFO: Did she ever tell her parents or was she lying about telling them? Her not going and wasting both of your money makes no sense and makes the whole money thing worse as it’s wasted money, she could’ve cancelled and given them or actually use it having a great time and new experience.",
   "created_utc": 1701465356,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblma8s",
   "message": "NTA. Sooo. She felt bad about spending money on a holiday… and then continued wasted £2000 on nothing. Smart. \nWhy didn’t you just go without her? Is it too late for you to go?",
   "created_utc": 1701465389,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblo87s",
   "message": "NTA but I'd be ending the relationship. She cancelled at the minute for a non reason knowing you'd be out the money. She clearly lied and didn't take your feelings into consideration at all. She's selfish and rude and unreliable.",
   "created_utc": 1701466144,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblocws",
   "message": "NTA, and what she did was weak, disrespectful to you, and shows an appalling lack of emotional control.\n\nI'd seriously move on from this person. Imagine a life with someone who behaves this way.",
   "created_utc": 1701466195,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblsfnf",
   "message": "NTA 🥵",
   "created_utc": 1701467770,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblvhfd",
   "message": "Nope. It's her fault y'all lost the money.",
   "created_utc": 1701468977,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblvkkg",
   "message": "NTA. Doesn't her throwing away £1000 defeat her stupid point of her not wanting to rub money in her parents faces?",
   "created_utc": 1701469013,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblxib5",
   "message": "I would be going on holiday with a mate or by myself at this point, arsehole or not, lol.\n\nNTA",
   "created_utc": 1701469802,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbly22a",
   "message": "I would have gone without her",
   "created_utc": 1701470030,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbly6p4",
   "message": "The one thing people who are short on cash appreciate are family who decide to burn it. \n\nShe feels guilty about going on a trip and her decision is to let £2,000 of it go to dust.",
   "created_utc": 1701470082,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblyduv",
   "message": "NTA\n\nI would be so upset -- she canceled when you were getting ready to head to the airport???  Oh hell no.\n\nSHE lost the money because SHE canceled.      \n\nThis is money she was never going to give to her parents.  It sounds to me like she just didn't want to go on vacation with you and didn't know how to tell you.\n\nI probably would have gone on the vacation without her and had a total blast without having to worry about her raining on my parade.\n\nIt's okay to break up.  Really, it is.",
   "created_utc": 1701470163,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kblz4bs",
   "message": "NTA You should have still gone, without her.",
   "created_utc": 1701470466,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm0k7a",
   "message": "NTA \u0026amp; I still would’ve went \u0026amp; came back single! You can still make that last part cause she is 👎🏾",
   "created_utc": 1701471062,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm0ndl",
   "message": "Why didn’t you just go without her?",
   "created_utc": 1701471098,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm0u67",
   "message": "OP you should have gone by yourself, whats wrong with her? NTA obviously",
   "created_utc": 1701471176,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm14dz",
   "message": "Makes zero sense to spend the thousand pound and not take the trip? Nett result is the same but minus an enjoyable trip. Don't like your chances of getting the money back from the Mrs though",
   "created_utc": 1701471295,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm1bf9",
   "message": "NTA get the money and run.",
   "created_utc": 1701471378,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm1c8i",
   "message": "NTA.\nFrankly, I would have gone without her.",
   "created_utc": 1701471389,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm24xo",
   "message": "This would be a deal breaker, I’d break up with my S/O over this\n\nYou gave her the option to cancel before you guys lost your money….\n\nShe feels bad for her parents? But wouldn’t have given the money to them anyways. She could have told them you paid. \n\nShe should have put on her big girl panties and gotten over it",
   "created_utc": 1701471727,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm2je4",
   "message": "NTA - I would of got on the plane and went",
   "created_utc": 1701471898,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm2kjq",
   "message": "NTA. She screwed it all up and could have cancelled well in advance.\n\nI can't believe she threw away that kind of money for nothing. Ridiculous.",
   "created_utc": 1701471911,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm2she",
   "message": "NTA\n\nIs it too late to return the girlfriend?",
   "created_utc": 1701472005,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm3mv4",
   "message": "You are stuck with a winner.  I'd cut ties, she sounds screwy.  AFTER,  she pays you back.  Of course she owes you.  May be time for Judge Judy.",
   "created_utc": 1701472363,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm3ssy",
   "message": "I would never plan another trip with her ever again she definitely needs to reimburse you NTA",
   "created_utc": 1701472434,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm3uq8",
   "message": "Cancel the girlfriend.",
   "created_utc": 1701472458,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm3w6w",
   "message": "Why didn't you just go with a friend or sibling instead?",
   "created_utc": 1701472476,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm4f37",
   "message": "NTA. She’s shown you that her way of dealing with uncertainty or conflict is to be completely avoidant. I’d end the relationship based more on that.",
   "created_utc": 1701472704,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm4fqo",
   "message": "NTA. You should've gone without her.",
   "created_utc": 1701472712,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm4o2q",
   "message": "Any decent parent would be happy their child got to go somewhere that they can only dream about. At least she got some pocket money out of this",
   "created_utc": 1701472813,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm4tew",
   "message": "Dude.  Leave her.  And honestly. Im super petty.  Id bring her ass to court🤷🏼‍♂️",
   "created_utc": 1701472875,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm503t",
   "message": "Relationship is over, bless each other and go the other way. Money is usually the number one reason people break up. Your partners way of reasoning is flawed , not to mention deeply troublesome as well. Cut your loses and move on.\nGood luck to you",
   "created_utc": 1701472956,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm56tr",
   "message": "NTA. Also, if she feels that bad why is she wasting money by canceling a trip so late that she won’t get refunded for? This doesn’t make any sense. I feel like there’s something else going on here.",
   "created_utc": 1701473038,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm5fer",
   "message": "ESH because you should've left her ass at home and gone on vacation.\n\nIf it's already paid for and you knew you couldn't get your money back, you should've given your gf the ✌️and caught your flight.",
   "created_utc": 1701473142,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm6sat",
   "message": "Ya you should have just gone without her dude",
   "created_utc": 1701473741,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbml5h4",
   "message": "NTA\n\nThis is breakup worthy imo. You offered her an out when the loss would only be £100 when she originally brought it up. Only to pull it at the last minute with no new information and expect you to eat the cost? Hell, I would have just gone without her. \n\nI mean if she had a medical emergency or whatever, totally stay behind and cancel but like you said, money was already spent and “she just feels bad”. There is no logic to it and if she feels worse about going in a trip her parents can’t afford vs. wasting £1000 of your money, I can’t see how you wouldn’t feel so much resentment just looking at her. \n\nYou’re not an asshole wanting to be reimbursed, but I doubt you’ll ever get the money. I wouldn’t want to be with someone so stupid and thoughtless.",
   "created_utc": 1701480195,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbml7zn",
   "message": "Why didn't you go without her?",
   "created_utc": 1701480228,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbmlhun",
   "message": "I’d be angry but bro you shoulda just went yourself because nah I don’t think I’d be able to ask for that back. But I got weird ideals and pride issues so. I dunno. I’d have been like ok peace see you in ten days",
   "created_utc": 1701480355,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbls6l4",
   "message": "\u0026gt;AITA for asking to be reimbursed for the holiday my girlfriend cancelled?\n\nYou shouldn't be asking anything.  You should have dumped her and took her to court to recoup your loss.  What she did was completely fucked up.",
   "created_utc": 1701467672,
   "score": 2,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm830d",
   "message": "NTA,   \n\nYou’ll never see that money again,   Best you start looking for somewhere else to live.   \n\nYour relationship is done at this point.   It might drag on for awhile,   But the moment she cancelled your holiday,  that’s when it died.",
   "created_utc": 1701474312,
   "score": 1,
   "submission_id": "188kcms"
  },
  {
   "comment_id": "kbm32a9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "188kcms"
  }
 ]
}