{
 "submission_id": "188m6p9",
 "title": "AITA for yelling at my ex-wife, Anna, after she called her newborn son her first child, completely discarding our daughter?",
 "selftext": "\nSo, my ex-wife Anna and I divorced, but we were mostly good at co-parenting our daughter, who is now seven years old. When our daughter was two, I remarried to Barbara, and they developed a close bond. Our daughter started calling Barbara \"mom,\" which I found adorable. However, Anna didn't like this and demanded that I stop our daughter from calling Barbara \"mom.\" I refused, as I believed it was our daughter's choice and something Anna would have to accept.\n\nAnna tried to get our daughter to stop calling Barbara \"mom,\" but when she realized it wasn't going to happen, she finally gave up. I was relieved that she stopped pushing the issue. Anna then remarried to Carl when our daughter was around six.\n\nCarl, being a strict marine, wasn't as involved in playing the role of stepdad to my daughter as Barbara was, which was fine with me. Anna got pregnant at the beginning of the year, and she and Carl became consumed with preparing for their new arrival. Anna distanced herself from our daughter, using excuses like needing to nest for her baby and attending parent classes with Carl since it was his first child.\n\nLast September, Anna gave birth to a boy, which I knew was something she always wanted. However, after her son was born, she distanced herself even further from our daughter, claiming she needed to bond with her son.\n\nNow, here's where the conflict arises. One day, Anna referred to her newborn son as her \"first child,\" completely disregarding our daughter. This upset me greatly, and I ended up yelling at her. I felt that she was neglecting our daughter and prioritizing her new baby to an extreme extent.\n\nCarl proceeded to yell back at me, saying don’t ever raise my voice at his wife, they left shortly after and Anna has since blocked me and is begin even more distance. It’s hurting Talia a lot.\n\nSo, am I the asshole for yelling at Anna in this situation?",
 "created_utc": 1701464116,
 "permalink": "/r/AITAH/comments/188m6p9/aita_for_yelling_at_my_exwife_anna_after_she/",
 "score": 248,
 "url": "https://www.reddit.com/r/AITAH/comments/188m6p9/aita_for_yelling_at_my_exwife_anna_after_she/",
 "comments": []
}