{
 "submission_id": "188m4ld",
 "title": "UPDATE: AITA for “humiliating” my husband?",
 "selftext": "Thanks to everyone that made me see the situation from my husband’s side and made me realise I’m an AH (or worse).\n\n[Original post](https://www.reddit.com/r/AITAH/s/Z3E7m8vtUW)\n\nI re-read my original post, and there are some things I would like to elaborate on before I come to the update. I did feel empathy and I did care about my husband. I was gentle when I told him after I’d woken him up. However, his reaction caught me off guard, and the time from when he got up from bed until he’d locked himself in the bathroom couldn’t have been more than a minute. After that I felt it was best to leave him alone. I know I was an AH for telling our child, but I didn’t do it to be mean or humiliate him, it was a stupid wrongful decision. I regret it.\n\nFurther, it’s not easy to show someone that you care when you’re being ignored. I did text him after he left and asked if he was ok, but he left it on read. I asked him again when I got home but he didn’t answer. I asked him if we could talk about it – no answer. I asked him if he could at least tell me why he was so mad at me – no answer. I gave up and went to make dinner. After dinner I asked him if he could stop ignoring me – no answer. I asked him if he wanted me to leave to which he replies, “you can stay, I don’t care”. So I ask him again if he will stop ignoring me if I stay, and when he says no is when I had it. And while I don’t think ignoring someone like that is OK, I know I handled it really bad. And I do feel awful for being outright mean to him.\n\nAnyway, I texted him early this morning to say that I was so sorry and asked if he was willing to talk after work so that I could apologise. He texted me back an ok around noon. We met up at home, and he understandably was cold to me when we met, didn’t say much. I apologised for everything, for laughing, for telling our child, for telling him to get over it, and for the part that I’m most ashamed of that I told him he humiliated himself. He was just silent the whole time and when I was done, he just asked why I told our child. I explained and after that we just sat in silence in what felt like forever. Then right out of nowhere he went something like “I scared you, right?”, and I told him that briefly he did. He said he could feel that. I asked what made him react so strong, but he didn’t know, just said that he panicked when he realised he’d wet the bed, that it got even worse when I told our child, and that he just got so fucking angry with me for it. I apologised again for making him feel that way. He apologised for making me scared. \n\nI’m not going to go through all that we said after that, it was a long talk, but in conclusion none of us is happy with how we acted and we have both apologised for it. He wasn’t that bugged about me laughing, but we both agreed that I shouldn’t have told our child. However he’s no longer mad about it and doesn’t think it’s that big of a deal. We both think he shouldn’t have ignored me like that, and that I handled it poorly and was mean. We have both accepted each other’s apologies, but I still feel bad for being so mean to him. But all in all, we are on good terms now.",
 "created_utc": 1701463958,
 "permalink": "/r/AITAH/comments/188m4ld/update_aita_for_humiliating_my_husband/",
 "score": 120,
 "url": "https://www.reddit.com/r/AITAH/comments/188m4ld/update_aita_for_humiliating_my_husband/",
 "comments": []
}