{
 "submission_id": "188m200",
 "title": "Divorce wife asked for open reltationship",
 "selftext": "We (60M) and Her (53F)have only been married for 10 years. I have been struggling with prostate issues along with ED issues for about 4 years. Have tried ED meds while viagra works well for ED it gives me migraines that last for a couple days . Cialis daily has worked but had to change health insurance and Drs because of insurance change and have been fighting with to get daily prescribed again. So have went 6 months without it and thus no sex. Wife said that this is not acceptable that the limited sex has taken toll. She says that her needs are not being met and it’s either open marriage so she can get those needs taken care of or divorce. I told her that she is being cruel and that I have been doing what can and that I miss it as well. That was a few days ago and have decided rather divorce than be made a cuckold. Am I being unreasonable?",
 "created_utc": 1701463774,
 "permalink": "/r/AITAH/comments/188m200/divorce_wife_asked_for_open_reltationship/",
 "score": 76,
 "url": "https://www.reddit.com/r/AITAH/comments/188m200/divorce_wife_asked_for_open_reltationship/",
 "comments": [
  {
   "comment_id": "kbljsm6",
   "message": "NTA. Yes, she has needs, but there are ways to meet those needs that don’t include bringing another man into it. If she’s truly “open marriage or divorce” I couldn’t get to the lawyer’s office fast enough.",
   "created_utc": 1701464436,
   "score": 159,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblr1y2",
   "message": "Nope. Id rather be divorced than be a cuck also. If she cant stick it out until you get your insurance resolved id just end it. I understand it’s definitely not ideal for either of you but it’s not like you’re doing this out of spite.",
   "created_utc": 1701467234,
   "score": 47,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblos0x",
   "message": "From reading and hearing other reddit posts. When the woman is asking for an open relationship, they already have someone in mind or in the process of starting an affair.\n\nYou are better off getting a divorce and moving on with your life. Sounds like your wife has already moved on with hers.\n\nSorry, my dude.",
   "created_utc": 1701466359,
   "score": 123,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm154o",
   "message": "NTA. I don't want to be \"that\" guy, but I think there is someone in the picture already.",
   "created_utc": 1701471305,
   "score": 16,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbll4qc",
   "message": "NTA.  So much for \"in sickness and in health\"...\n\nDemanding an open relationship is a very worrying thing - if she had just said this is a big deal, her needs aren't being met, and she's considering divorce - I would be pretty sympathetic.  \"Open relationships\" aren't really open if one partner is coerced into it.  \n\nIf she actually means it - you're 100% right it's cruel, because one would THINK that a third option would be getting your Cialis.  Why is that suddenly not an acceptable option?",
   "created_utc": 1701464948,
   "score": 35,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm4s0d",
   "message": "When your wife asks for an open relationship it means you're already in one and she's tired of doing it behind your back\n\nDivorce",
   "created_utc": 1701472858,
   "score": 15,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbluq2x",
   "message": "You’re an absolute legend for going the divorce route. She can go hoe around herself just make sure you let the judge know the reason. Maybe they’ll award you more items.",
   "created_utc": 1701468674,
   "score": 9,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm4n2k",
   "message": "Cialis is dirt cheap and you can get it on the internet.",
   "created_utc": 1701472801,
   "score": 5,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmeft9",
   "message": "NAH\n\nThese comments are wild dude.\n\nYour wife has a mature conversation and told you that she cannot handle the lack of sex anymore to the point where she either needs help from a third party to scratch the itch or to pursue a relationship where her needs can be met.\n\nOf course you can't do anything about the medical difficulties you are having and of course it's affecting you badly too.\n\nI'm curious to know how oral and other things play into your guys sex life? Do you give her nice head to make her cum or play with toys together? Or is your idea of sex, the old school penis in vagina or nothing type of deal?\n\nI'm happily in an open relationship with my wife (with rules) and it took a lot of pressure off our sex life and we still have great meaningful sex.\n\nI feel like there's more to this problem than you might realise.",
   "created_utc": 1701477144,
   "score": 5,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblyc5l",
   "message": "Wtf, if the roles were reversed the comments would be so different..",
   "created_utc": 1701470144,
   "score": 19,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm99ug",
   "message": "If she is asking for an open marriage then she all ready has someone in mind or already cheating on you my friend. Divorce is the only answer when that has been brought up.",
   "created_utc": 1701474837,
   "score": 3,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmgm4w",
   "message": "She gave you a hard choice. You went along with that and made a hard choice. NTA\n\nWhat if she gets cancer and are inconvenient to you? What if you get dementia? What if she is disabled? What is marriage if not dealing with the bodies in all the way that happens?",
   "created_utc": 1701478128,
   "score": 3,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblkrqs",
   "message": "What you need to do is pick up something from a sex shop, so you can fulfill her needs even if you can't get it up.  If you use a toy or two on her, then it's just a different manner of sex.",
   "created_utc": 1701464810,
   "score": 3,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblxcna",
   "message": "I don’t think anyone’s the asshole here tbh with you OP…  However, In my opinion, her offering to be open relationship puts me under the impression she already found her other Love Partner already… As for you dawg, I’m sorry. Maybe try finding an Asexual partner or something.\n\nEDIT: It should go without saying you should see a divorce lawyer ASAP",
   "created_utc": 1701469737,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm5irm",
   "message": "NTA, \"in sickness and health\" is supposed to mean something. Furthermore it's not like you intentionally said no. Lastly it's rather sad to see a woman in her mid fifties complain to her husband in his early sixties that she requires more sex to the point of divorce. Does she honestly think that penetrative intercourse was going to last the rest of her days for decades into the future? The party was going to slow down and stop at some point. \n\nI think she needs to reevaluate her needs and reach a compromise that doesn't involve breaking marriage vows.",
   "created_utc": 1701473183,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmg0pl",
   "message": "NTA: ask her if the situation were reversed would she be OK with you going out with another woman whilst she sat home with her imagination running wild? \n     Some guys are into being cuck either by watching or she doing it then retelling the details as the hubby gets off. \n      Perhaps counseling or go down on her while reaming her out with a dildo? I think it shows for her character to give you an ultimatum like this. Perhaps the divorce is better then she can give her side to friends and family as to why she wanted a divorce. \n     Good luck to you sir 👍🏻",
   "created_utc": 1701477858,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmip88",
   "message": "NTA Man, get your medical directives squared away. You should probably also get your finance squared away first thing with your lawyer. When you tell her you have chosen divorce start recording your interactions. Don’t leave the home!",
   "created_utc": 1701479079,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmj7qv",
   "message": "No you're not being unreasonable. You guys are married and having medical issues is not a reason for that behavior unless you're both into it... Now, listen here sir, have you tried marijuana oils or tinctures? I know you're probably not up for it because you lived through the worst of the war on drugs, but I'm a paramedic and research shows it can help with ED and other sexual drive issues, me myself have used to get over sexual anxiety making it hard to keep longer lasting erections and difficulty reaching orgasm, it's great and the psychotropic effects are extremely mild",
   "created_utc": 1701479313,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblw16c",
   "message": "NTA. She, as your wife, is supposed to be supportive. What if it was more serious than ED? What if you had cancer and needed chemo treatments and were unable to have sex because you’re going through treatment? Would she drop you then too because life was getting in the way? This is much bigger than her needs not being met. She’s an AH and unsupportive wife. Move on with your life and find someone that will actually live their vow of “in sickness and in health.”",
   "created_utc": 1701469197,
   "score": 3,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm6w09",
   "message": "Bro. If she can’t wait longer than 6 months due to an actual health issue, drop her ass, she doesn’t love you. \n\nDo you have kids? Would’ve she been okay if you asked for an open relationship during her pregnancy, if she couldn’t had sex?",
   "created_utc": 1701473786,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm8764",
   "message": "Get a dildo n a vibe n go to town on her",
   "created_utc": 1701474364,
   "score": 3,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm3pmp",
   "message": "It’s amazing how men think they need their penises to have sex. \n\nNumber one — learn other ways to satisfy her. If it weren’t about your satisfaction, you’d have already explored this. My penis doesn’t work, thus — no sex.  Wow.  Find her clitoris and give her an orgasm. Penetrate her with your fingers. \n\nProsthetic penis — swallow your pride and get one. \n\nToo many men depend on their penises to “have sex”…when the percentage of women who can have a vaginal orgasm is abysmally low anyway.",
   "created_utc": 1701472396,
   "score": 4,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblmynf",
   "message": "NTA - You should remind her about that for better, for worse, in sickness and in health part.  Don't tell her about the divorce.  Get everything in line and then kick her out.  She belongs to the streets.",
   "created_utc": 1701465652,
   "score": 4,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm1e6s",
   "message": "NAH\n\nYes, you have a physical problem that you've tried to remediate; however it hasn't gone to plan.  You are continuing to work at it but it seems her time table is not in line with yours.  We've seen many posts about a dead bedroom and she has offered an ultimatum where both options aren't pleasant for you but I cannot fault her for wanting to have sex.\n\nShe most likely already has the person in line and either she has or will cheat if a divorce isn't established",
   "created_utc": 1701471412,
   "score": 6,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbly857",
   "message": "Lol, so many people crying \"but what about the entire 'in sickness and I'm health's thing\".  That's a christian tradition, and is rarely seen outside of traditional church services where the officiant dictates to YOU what will be said.  It's only made popular on TV and films.",
   "created_utc": 1701470098,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblpylk",
   "message": "NTA She made her case and just give her a divorce. Simple as that. If she starts banging other guys you can bet she’ll be asking for a divorce as soon as she finds someone else. Mine as well beat her to the punch and get down to your attorneys office and get the ball rolling. The alternative is not the road you want to go down.",
   "created_utc": 1701466814,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblxyuo",
   "message": "Wow!! What a horrible woman. No loyalty get a divorce.",
   "created_utc": 1701469992,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm5l3n",
   "message": "Divorce her. She doesn’t care about you, she cares about D",
   "created_utc": 1701473212,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbltrr6",
   "message": "[deleted]",
   "created_utc": 1701468294,
   "score": 2,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmcuyu",
   "message": "Generic cialis is about $20 a month. You can get non daily just as needed for even cheaper. Look at good rx app for discounts. If you need it to have sex, go get it. If sex is not that important to you, it is to your wife, then take the responsibility for it and divorce or let her have sex outside of the marriage. Don’t use not being able to get a prescription as an excuse, it’s not that hard. (Pun intended)",
   "created_utc": 1701476438,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblim3w",
   "message": "[deleted]",
   "created_utc": 1701463989,
   "score": 0,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmbwwv",
   "message": "By Viagra online bro. It's cheap. With a doctors prescription ofcourse",
   "created_utc": 1701476017,
   "score": 0,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmckyf",
   "message": "Yes, YTA. Viagra (sildenafil) headaches are manageable- they're likely not migraine but sinus headaches that can be ameliorated with a decongestant.  If your insurance doesn't cover Cialis (tadalafil), then suck it up and go out of pocket, as its still cheaper than divorce. \n\nYour wife gets to get laid as a condition of being married to you. Quit scrambling for excuses not to have sex with her.",
   "created_utc": 1701476315,
   "score": 0,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmg1qo",
   "message": "Why can't you be intimate and use toys to satisfy her?",
   "created_utc": 1701477872,
   "score": 0,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmh48z",
   "message": "\n\nBud, you still have to pleasure her. There are other ways! You have hands and a mouth, learn how to use them! Go buy a toy together!\n\nYou can work this out if you love each other, go to marriage counseling",
   "created_utc": 1701478354,
   "score": 0,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmjuas",
   "message": "My heart truly goes out to you. It's not like you're choosing this. But, let's keep this in mind - 6 months. No sex for 6 months. That would drive me up a wall.\n\nWhether or not she has chosen a lover is irrelevant. I'm sorry, but it really doesn't matter at this point.\n\nSo your question is if you decide to divorce under these circumstances, is this unreasonable.\n\nNo. It is not.\n\nBut as you described, NAH here. To each their own. You refuse to stay with her if it's not you getting intimate with her. I just read a story about a guy who's wife was asexual. Turns out, he's ok with it because of her other qualities. He didn't like sex all that much, anyway.\n\nIs it worth it for you to stay? Or is leaving preferable?",
   "created_utc": 1701479597,
   "score": 0,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblsdaf",
   "message": "Hims worked great for me didn't give me headaches.",
   "created_utc": 1701467745,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblv4g6",
   "message": "Try ?Trimix(unsure of the spelling) injections. Like you Viagra gave me headaches and Cialis didn't work that well. Tried Trimix and it worked wonders!! Only downside is giving yourself a shot in your penis",
   "created_utc": 1701468834,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblx284",
   "message": "NTA\n\nThere are other ways to satisfy her than to let her go fuck other people. I dont think putting that ultimatum on you is right. I worry she may already have someone lined up. I would say divorce too. Im so sorry man",
   "created_utc": 1701469617,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblznb5",
   "message": "Check out Mark Cuban's Cost Plus drugs. It is amazing for generic versions of ED drugs (and many other drugs).  Your prescription will be like 15 bucks a month and they do not accept insurance.  Started getting my meds set up thru there 2 years ago.\nFeel free to PM with questions.  I do not work for them, looked at getting meds thru Canada and then read about Cost Plus. Good luck with relationship OP. https://costplusdrugs.com/",
   "created_utc": 1701470685,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kblzx3h",
   "message": "NTA. Get the divorce, get a different insurance, get that Cialis and start spreading your Royal Oats.",
   "created_utc": 1701470798,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm0ire",
   "message": "Nah man. I would probably do the same.\n\nIt might suck because you are afraid the next women will feel the same. But without all the pressure and a new women, the problem might solve itself. \n\nI would agree to the divorce as long as she doesn’t screw you over. Let her leave with what is fair, and find a new woman. \n\nShe will leave anyway",
   "created_utc": 1701471046,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm0oke",
   "message": "\"In sickness and in health, through good times and bad, until death do us part.\"  It's amazing to me how many married couples (or one person in the couple) just can't seem to get on board with this part.  I have ED (I mean, that's just something that happens as you get older) and my wife has been amazingly compassionate and understanding, and would never ask to go outside our marriage.  NTA.",
   "created_utc": 1701471112,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm0utc",
   "message": "Never go into an open relationship if you don't want it. Or if you're doing this just to keep your wife happy.\n\nI'm a woman and sadly I got myself dragged into an open relationship without feeling good about it. \n\nOn the other hand, I have seen open relationships work. It just didn't work out for me. \n\nLong story short: don't do it if it doesn't feel right for you.",
   "created_utc": 1701471183,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm27jo",
   "message": "Has she thought about using sex toys?",
   "created_utc": 1701471758,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm2i47",
   "message": "Hey man. You gotta get tri mix. It’s a small shot you give yourself in the dick. Super easy. Raging hard on for three hours.  Olymia pharmacy. Telephone consult and enough med for 30-40 shots is like 140 then you can buy bull meds cheaper. It’s like 2-3 bucks a shot.zero side affects. And doesn’t interact with any other meds",
   "created_utc": 1701471883,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm38a9",
   "message": "NTA. She’s a cunt. I say protect your assets and let the trash take itself out.",
   "created_utc": 1701472189,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm3ueu",
   "message": "NTA, she is being cruel.  This should be a discussion not an ultimatum.  I would evaluate if this is the kind of person you want to be with.",
   "created_utc": 1701472454,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm3vmf",
   "message": "She A HO.  Drop her at the curb as you go by.  She's already seeing someone.",
   "created_utc": 1701472469,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm4gbg",
   "message": "NTA\n\nImo, this is the \"in *sickness* and in health\" part of being married.\n\nIt's a contract, and she isn't standing by the terms of the contract. You have every right to invalidate the contract, and honestly seek an annulment if certain criteria are met (and local laws allow)\n\nBefore saying anything to your future ex-wife, speak with your lawyer. If my read on this situation is correct, then she may be the type who would rip and tear until it is done, purely out of spite. I would secure your assets to the best of your ability with someone you trust. That could be a friend, lawyer's holding service, holding  company, etc.\n\nMake sure all your ducks are in order, like taxes, debts, etc, and document everything like texts, phone calls, videos, pictures. These can all be used to help your side if things happened to go the nuclear route.\n\nObligatory: Not a lawyer, local laws may differ. My experience here comes from my wife being a bilingual court clerk for BC's (canada) Supreme Court. My father also experienced the nuclear option ala one of his less than stellar lady choices and they were common law at the time.\n\nGood luck brother",
   "created_utc": 1701472719,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbm4pcp",
   "message": "I thought you meant you were divorced and she came asking for an open relationship, but honestly I’d prefer that to this, if you are strong enough, divorce, there will be someone out there who will care for you no matter what and everyone is deserving to find it, well I can think of quite a few who don’t, but based on this post sir you do!",
   "created_utc": 1701472828,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmcdke",
   "message": "Amazon pharmacy 33 dollars for a 90 day supply.",
   "created_utc": 1701476224,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmd7bo",
   "message": "NTA but you should look into diet and exercise to help with ED as well. It helped me a ton",
   "created_utc": 1701476588,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbme1a5",
   "message": "Ditch the heartless witch! If she is so obsessed with having an orgasm over your health issues she not worth being married to! I stupidly agreed to an open relationship. Ya it never ends well for the guy. He gets cast off for some other guy and completely forgotten about. He is just an ATM machine while she goes out and spreads her legs for multiple guys. Ditch her! She may bring home some STD you or her can’t get rid of.",
   "created_utc": 1701476962,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbme40t",
   "message": "NTA for choosing divorce over an open relationship\n\nYTA for refusing to give your wife an orgasm for six months because you couldn’t get your dick hard.\n\nPut your mouth to work for an hour make her come three times   Repeat every other day until she tells you to stop",
   "created_utc": 1701476997,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmel5d",
   "message": "FYI. While this marriage is over, you can easily get any of the drugs from hims or blewchew etc. there are plenty of websites that give them for cheap like $30 a month. Don’t need insurance",
   "created_utc": 1701477211,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmep45",
   "message": "So what have you done for her these last 6 months? Just because you can't get hard doesn't mean you can't satisfy the needs she has.\n\nIf you've at least been doing that, or trying, then NTA.\n\nThat said \"For better or worse\" but maybe she thought that meant only when she was worse and you were better.",
   "created_utc": 1701477262,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmetqg",
   "message": "NTA like do what you want but there are also other ways for her to get her needs met and I’m wondering why just bc you have ED means she isn’t getting anything. I used to date someone with ED and they always got the job done anyway!",
   "created_utc": 1701477320,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmf9kd",
   "message": "I'm pretty sure most saying \"in sickness and in health\" is just a religious thing, probably think they're morally superior on most issues.   Probably think they're never morally wrong about anything.\nIf you think she's in the right, don't believe in the sickness and health bit, you are probably morally wrong in most of your life.   Be better liberals.",
   "created_utc": 1701477516,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmftkw",
   "message": "Half of the sex I have is oral. OP only talks about his prostate and ED, no mention of oral...something to consider",
   "created_utc": 1701477768,
   "score": 1,
   "submission_id": "188m200"
  },
  {
   "comment_id": "kbmly39",
   "message": "NTA. Go get that divorce, she just showed you her true colors.\n\nIf she bails at ED, imagine if you got terminally ill and truly needed her.",
   "created_utc": 1701480562,
   "score": 1,
   "submission_id": "188m200"
  }
 ]
}