{
 "submission_id": "188nmn0",
 "title": "AITA for refusing to see my grandson because my daughter refused to cosign an apartment for me?",
 "selftext": "My (56F) daughter \"Sofia\" (24F) lives in a gated mansion, all the while knowing I am on the verge of being homeless. And if not homeless, then living in an inherently unsafe multiple roommate situation in Los Angeles.\n\nI have been facing financial difficulties for the past 5 years and I just thought that if anybody would understand, it would be my daughter because of all the uncertainties we faced together due to her dad. \n\nHer dad \" David\" and I got together when I was 29 and he was 33. He was already very successful in real estate. I had been married prior with a then 6 year old son, and my ex husband so hated the fact that David was well off that he alienated my son against me. My son and I are on comfortable terms, he treats me more like a friend than a mom.\n\nMeanwhile my daughter and I are closer and she has a husband of 2 years who is very well off and while he prefers handling business matters on his own, with regards to family matters, he mostly does what she says, especially after their 2yo boy was born.\n\nDavid was perfectly ok with dating me and my post Baby #1 body, but after I gave birth to Sofia, he visibly lost interest in me. He reneged his proposal, my modeling career was struggling, and David cheated on me with women I felt most insecure next to.\n\nThis went on for 6 years until he left. Paid child support, but other than that iced us out. I have tried to move on, but after the events of 2020 and how it affected the investments I put my savings into, I can't afford the rent increase from my apartment building.\n\nI tried to negotiate but the manager said this was a fully staffed, access controlled building in a upper middle class area and that I was getting a deal compared to what the company could get for it.\n\nI've been apartment hunting since and staying in a coliving situation. It is awful- everybody there is under 35 and I feel they don't respect me as somebody older as they should. A lot of clashing personalities makes this an unsafe situation.\n\nAfter a lot of rejections, I talked to a building manager who agreed to consider me if my daughter, one one half of a financial powerhouse cosigned so I asked her to do so. Forwarded a bunch of emails. Instead of a constructive conversation she kept saying \" So I am paying the rent? I have to ask my husband.\" I told her I was paying the rent as I started a luxury sales job. She then said this isn't her money- it's her husband's so she can't make this commitment.\n\nI was so distraught and now have to spend my holidays in this dump or my car. Somebody else got the apartment I wanted. Meanwhile my daughter comes asking if I wanted to visit and see my grandson. I was insulted that she'd essentially flaunt her and her son's life of luxury in front of me knowing I'm basically homeless. I told her just that and she said that wasn't her intention and to not be petty. I told her I could not bear to be around her any time soon, especially during Christmas. AITA?",
 "created_utc": 1701467853,
 "permalink": "/r/AITAH/comments/188nmn0/aita_for_refusing_to_see_my_grandson_because_my/",
 "score": 88,
 "url": "https://www.reddit.com/r/AITAH/comments/188nmn0/aita_for_refusing_to_see_my_grandson_because_my/",
 "comments": [
  {
   "comment_id": "kblxc2q",
   "message": "YTA - there is probably a whole lot more you aren’t saying about what you have done to your kids and what you have done in the way of poor life choices ….\n\nYou could have worked - maybe not something like luxury sales - but worked - Walmart, target, Starbucks, cleaned houses, wherever and whatever and saved your money.  Then you would be a responsible 56 year old woman.  \n\nAnd now you want your daughter who married well to cover you.  She doesn’t want to for a reason…and it would be good to hear from\nBoth your kids what the truth is.  \n\nAnd now, you don’t want to see your grandkid because his mom won’t give you money… you don’t deserve to see him.  \n\nIt would seem you are reaping what you sowed.",
   "created_utc": 1701469730,
   "score": 198,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kblu1p9",
   "message": "Sounds like there's a reason that Sofia declined, and isn't all that worried about you not seeing her kid.    \nBut yeah, you sound like a self absorbed AH.   \nYTA.",
   "created_utc": 1701468403,
   "score": 140,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kblv5wq",
   "message": "Sounds like you’ve never been financially responsible, I wouldn’t cosign a damn thing for you either. Yta.",
   "created_utc": 1701468850,
   "score": 218,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm1bc3",
   "message": "YTA.\n\nBesides it sounding like you've never been very financially stable, she's right in that she can't just cosign away because if you fail to make payments then she will have to do so via her husband. Sure, in marriage money is shared, but that's an agreement they have to come upon together. \n\nAlso, nobody owes you extra respect because you're older. That's nonsense from a bygone era. Age doesn't automatically make you more valuable or worthy. Sounds like you just think you're too good for the place and want better- maybe you need to live within your means, even if it isn't glamorous.",
   "created_utc": 1701471377,
   "score": 95,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm2n23",
   "message": "YTA\n\nYour daughter doesnt owe you anything. \n\nThose younger roommates you speak of? Respect is *earned* not owed to you or anyone else.\n\nMove somewhere (probably out of LA) you can afford.",
   "created_utc": 1701471941,
   "score": 150,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kblv5z8",
   "message": "YTA. What did the grandson do to you? Using a child to hurt someone because you didn't get your way is very cold. Also parents have a responsibility to children, at the very least until they are grown. Not the other way around. I didn't even read the rest. Title and first couple of lines were enough.",
   "created_utc": 1701468850,
   "score": 73,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbly5pw",
   "message": "I wouldn’t co-sign a McDonald’s cheeseburger\n\nHappy holidays",
   "created_utc": 1701470071,
   "score": 60,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm3ijl",
   "message": "If you started a luxury sales job why can't you live in the shitty place for 6 months \u0026amp; save money to get a better place?",
   "created_utc": 1701472311,
   "score": 53,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kblxo9b",
   "message": "Your child is not responsible for your life events. She is not obligated to do anything and if you had a hard life, she probably did too since she is your child…\nco-signing an apartment is not something people just do for fun lol. \nShe said its not her money, which is correct and she respects her husband enough to discuss it with him before saying anything. What is wrong with that? Just because he makes a lot doesnt mean he doesnt care where it goes…\nYou sound really petty and jealous because your daughter got her life together before you did and now you feel entitled to it. If i were her, i would not cosign it just because of this reaction. I have a feeling you would demand much more than just a signature after a while, and i wouldnt deal with that. \n\nYTA",
   "created_utc": 1701469870,
   "score": 37,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kblxzq9",
   "message": "OMG. Yes! YTA. Grow up. Get your own life in order. Your financial issues are your responsibility. Not your daughters.  Wth kind of grandmother and mother are you.",
   "created_utc": 1701470002,
   "score": 34,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm4ymo",
   "message": "YTA. \"Financial powerhouse\"? This reads like rage bait written by ChatGPT. Everything is someone else's fault, never yours. There's no accountability from you anywhere in this post. You sound very materialistic and self-centered, like a very one-dimensional sit-com villain. I don't believe for a second this is a genuine post.",
   "created_utc": 1701472938,
   "score": 30,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm2cyv",
   "message": "YTA. Cosign means if you fail to pay they come after the signee. Yeah I wouldn't want to go sign with someone with your attitude either.",
   "created_utc": 1701471823,
   "score": 22,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm93i9",
   "message": "Just going to leave this [here](https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html).\n\nWhy don’t you ask your grandson if he thinks you’re the AH. Oh wait, he can’t. Cuz you won’t see him. Quit your shit and grow the fuck up. Your attitude is pathetic and hateful and it will rot you from the inside out until even your grandson won’t give you the time of day.\n\nGet a cheaper place and use your spare income for therapy.",
   "created_utc": 1701474759,
   "score": 17,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm9z7k",
   "message": "Ohhhhh, so this is what happens to all those “hot young model“ types who most husbands leave their wives for, huh? Who knew they get old and get left and broke, nobody owes YOU anything, except YOU!!! YOU owe YOU everything, and I’m sure your grandson will not suffer because he doesn’t see YOU!! YTA. Take care of yourself for once!!!",
   "created_utc": 1701475148,
   "score": 16,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7bzf",
   "message": "YTA.  You’ve just been a victim all your life, haven’t you",
   "created_utc": 1701473980,
   "score": 16,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm1pf2",
   "message": "YTA you sound a mess and I wouldn’t co-sign anything for you either if I were her, sorry not sorry. Put on your big girl panties and get it together. Im sure she’s not losing sleep over you “refusing” to see your grandson lmao",
   "created_utc": 1701471544,
   "score": 13,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmbmzo",
   "message": "Try not pulling the ‘respect your elders’ bs with your roommates and your current living situation might start to get better YTA",
   "created_utc": 1701475894,
   "score": 12,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7b6l",
   "message": "YTA.  If her husband makes the money then of course she should consult with him. Even if he wasn’t the main breadwinner they are a team.  Also, your daughter doesn’t owe you a damn thing.\n\nYou also sound like a nightmare of a roommate.  Your age is not a reason for anyone to respect you.  Get over yourself.",
   "created_utc": 1701473971,
   "score": 13,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm6s0j",
   "message": "YTA. Seems like you have lived off someone else your whole life. Just because you are older doesn’t mean they should give you more respect. All roommates should be treated as equal, that goes for you treating them as adults as well. If you are all adults clashing personalities should be uncomfortable at most not unsafe. Your daughter isn’t “flaunting her and her son’s life of luxury in front of” of you. They are just living their life. \nYou can apply for low income housing. You don’t have to be homeless. You are petty and your grandson doesn’t need to be in your life. Grow up.",
   "created_utc": 1701473738,
   "score": 9,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm61c6",
   "message": "Yes, YTA.\n\nIf your daughter cosigns a lease for you, she's on the hook for that lease. And you frankly don't sound responsible enough for her to do that without misgivings.\n\nYou seem to feel entitled to your daughter's money, why?  And you seem to feel entitled to unearned extra respect from your housemates, why?\n\nI think your daughter knows she can't trust you. And she's also right to think you're being petty for not wanting to see your grandson until she gives you what you want.\n\nUgh. I somehow get the feeling your grandson would be better off.",
   "created_utc": 1701473413,
   "score": 9,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7707",
   "message": "YTA\n\nUnfortunately your financial shortcomings make you seem irresponsible with money. THis is not your daughters fault. Your daughter cannot wager her husbands money to get you into an apartment as it is not your daughters money and the fear of having this come back to bite them is pretty big.\n\nShe is not your bank and you shouldn't ghost them on the holidays to get back at them. That will only make you more miserable. She may have even been trying to help and get you out of that environment for a little while, but you rejected it.",
   "created_utc": 1701473920,
   "score": 9,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kblws4g",
   "message": "YTA\n\nGold digging model got fat after having kids and can’t use men for money anymore, so she tries to manipulate her own daughter into funding her lifestyle 🤮",
   "created_utc": 1701469502,
   "score": 33,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmf8ac",
   "message": "I'm kind of stuck on this statement:\n\n*everybody there is under 35 and I feel they don't respect me as somebody older as they should*\n\nWhat do you mean by this? Do you show them respect as you should?  And how would they show respect \"as they should?\"  You don't get respected just because you have a few more miles on you than they do.  You earn respect.  \n\nYour post reeks of a victim mentality.  All the negative in your life is because of other people--husbands, landlords, roommates, daughter...when is any of it your responsibility and up to you to fix?  Maybe it's not them.  Maybe it's you.",
   "created_utc": 1701477500,
   "score": 8,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7mjk",
   "message": "YTA, she's is right it isn't her money, and it is her financial risk she is taking by co-signing for you. She is married and either of them cosign anything is a discussion between them",
   "created_utc": 1701474110,
   "score": 7,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7pxj",
   "message": "YTA what kind of a joke of a grandparent are you? First, you’re a grown adult and you are not entitled to your daughter’s (or her husband’s) money. She was 100% right to ask her husband. The fact that you are holding them saying no against a literal BABY that has nothing to do with the situation shows that you are a despicable human. I hope she completely cuts you off for causing drama.",
   "created_utc": 1701474152,
   "score": 6,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7qny",
   "message": "INFO: have you been working?  You only mention modeling about 20 years ago, and now starting a new job.  If you haven’t been working, why do you live in LA with its huge COL?  Even Riverside County would be cheaper.",
   "created_utc": 1701474160,
   "score": 5,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm8zad",
   "message": "YTA - you are asking her to co-sign a place. That is her name on the lease if you can't pay the rent. She is stuck and it can ruin her credit. It is her husband's money and not hers. Why didn't you ask if you could live with them.\n\nYTA BIGGERST ONE I EVER SENN ON HERE - Not seeing your grandson because you are acting like an entitled spoiled brat. \n\nThe comment about the roommates. I am guessing you expect things a certain way and are not getting it. You get what you give and by this response, you think you are better than they are.",
   "created_utc": 1701474708,
   "score": 5,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmev98",
   "message": "YTA.\n\nYou go into detail about how everyone caused your situation except for you. Your daughter drew a healthy boundary and told the truth. You're an adult and need to act like one, maybe for the first time ever.\n\nYou tried to issue an ultimatum and it has failed. Lay in the lonely bed you have made, knowing you could have spent the holidays with your family. I suspect that no matter how big their \"mansion\" is, your ego could never fit inside.",
   "created_utc": 1701477339,
   "score": 6,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmccd2",
   "message": "YTA\n\nYou could have stayed with your daughter over Christmas (rather than in the dump or your car). Instead you apparently can't stand to see the wealth your grandson lives in? What the ever loving fvck is wrong with you? I would be SO HAPPY knowing my grandson is safe and well cared for. \n\nYou clearly have main character syndrome. Yikes.",
   "created_utc": 1701476209,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmgi08",
   "message": "YTA.\n\nYour daughter is not responsible for your financial mess.\n\nAre you fully aware of what cosigning means to the cosigner? If anything goes wrong, the cosigner has an awful mess to clean up. Your daughter knows you pretty well,so I'm guessing she has pretty good reasons for not wanting to take the risk. \n\nYour description of the circumstances leading to your predicament is full of excuses. Your description of your daughter's home and husband reeks of envy and entitlement.",
   "created_utc": 1701478076,
   "score": 5,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm5xou",
   "message": "yta - it is not your child’s job to bail you out. it sounds like you are getting back on your feet. keep moving forward.  you have a job, start saving again.",
   "created_utc": 1701473368,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbm7mfc",
   "message": "YTA.  What does seeing your grandchild have to do with the price of tea in China?  Given the poor life choices you chose to admit to in this post, I have to wonder how much of this story you've left out.  Maybe in the future you'll have [missing missing reasons](https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html) as to why your kids don't talk to you any more.  I urge you to seek therapy to avoid that terrible fate.",
   "created_utc": 1701474109,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbme4q9",
   "message": "At first I felt this was fake. But the more I read, the more I realized you just DO NOT live in the real world. You are delusional and not someone on the verge of homelessness. You are mad because you couldn’t get what you wanted. You could find and afford a place to live, it just may not be up to your standards. Someone who is truly worried about being homeless learns to lower their expectations and does what they need to do.\n\nNo one is entitled to respect due to their age. You probably act like an AH to them and that’s why they don’t respect you. For someone your age, you really need to grow up and get over yourself. YTA",
   "created_utc": 1701477007,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmejmg",
   "message": "YTA - The missing reasons you are clearly leaving out of the story are the size of a mastodon, and you are covering them with a hand towel.  \n\nYour daughter doesn’t trust you to pat the rent. That doesn’t come from nowhere.",
   "created_utc": 1701477192,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmfr3y",
   "message": "YTA. You created this situation and she is not responsible for housing an adult woman. Figure it out.",
   "created_utc": 1701477738,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmfzyc",
   "message": "This is a troll post, right? Like no one on earth can be this clueless and narcissistic",
   "created_utc": 1701477849,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmg2lh",
   "message": "YTA. So you made a series of bad choices in your life. You haven’t worked for or earned a place but you feel because your daughter married a rich guy she should just provide you with a luxury place to stay knowing you probably won’t pay for it and she will be on the line for it. Stop blaming others for your poor choices and work to improve your own situation. Pretty soon your daughter won’t be asking you to spend time with her or her kid she will be no contact.",
   "created_utc": 1701477883,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmg8mw",
   "message": "YTA. Big time. Wow. For so many reasons. Ugh. \n\nYou say in your post you’re “basically homeless” but also say you are stuck in “this dump” of an apartment because daughter won’t co-sign for you. You’re not homeless and it’s disgusting you would even have the nerve to compare yourself to someone who is truly without housing. \n\nIt’s also disgusting you are asking your adult child to co-sign. Entitled much? Wow. So disturbing",
   "created_utc": 1701477958,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmgp0g",
   "message": "Yta 100%",
   "created_utc": 1701478164,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmgqgj",
   "message": "Yta. This is a lot of drama over your daughter wanting to discuss a financial situation with her husband, which is completely appropriate.",
   "created_utc": 1701478182,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmig5o",
   "message": "YTA. That’s one of the most ridiculous things I’ve ever heard. Sounds like you chose very unwisely in your mates and put your children through hell in the process. You have brought on everything by your own choices. Are you proud of your daughter for making a better life?  No!  You see it as your due for what?  From anyone else’s perspective, she owes you nothing. The fact she is kind and open enough to still allow you around your grandchild amazes me. Because she won’t bail you out of a situation that you (at your age) should be able to handle on your own, you refuse to spend time with your grandchild at Christmas. And, by the way, she’s not flaunting her wealth. Because you are too irresponsible to have your own place to live, it seems you would have to visit her home to see him. I’m sorry you’re so bitter at others for your mistakes. I suspect your problems with your young roommates are not due to THEIR immaturity but YOURS.",
   "created_utc": 1701478962,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmj6ck",
   "message": "If this is real, this answers the question 'What happens when pretty, self absorbed, shallow individuals age?'",
   "created_utc": 1701479296,
   "score": 4,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmc1ue",
   "message": "Ummmmm this isn’t hurting anyone other than you. The only thing I am certain love with this story is that we definitely don’t have all of it.",
   "created_utc": 1701476078,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmdv8r",
   "message": "YTA, why haven’t you asked your son for help?",
   "created_utc": 1701476887,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmf0vg",
   "message": "YTA \n\nYou’re JEALOUS that your daughter has a prosperous life. You should be proud of her. Happy for her. Instead you are making her out to be a villain for not getting you out of a co-living situation you got yourself into. It isn’t dangerous just bc they don’t respect you as an elder. You’re their roommate not their mom. And then to get an invite to see your grandson and turn it into your daughter trying to do something nefarious instead of just wanting her mom to see her kid? You need therapy.",
   "created_utc": 1701477408,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmg70c",
   "message": "Yea YATAH.",
   "created_utc": 1701477938,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmhar1",
   "message": "Yta your daughter isn’t responsible for your shitty life choices and she was right to talk to her husband and maybe this is why your marriages didn’t work out.",
   "created_utc": 1701478436,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmhc6o",
   "message": "Unfortunately you're trying to live somewhere that is not in your means and you are trying to put the additional responsibility on your child. This is not acceptable.\n\nYou need to move to another area that is more affordable to you and as far as your comments regarding the people you live with, I'm going to take a punt and say that it's your attitude and behaviour as to why you don't get along with them - I think this because you don't have a good trusting relationship with either of your children too and I feel like whenever anything happens, it's never your fault.\n\nYTA",
   "created_utc": 1701478454,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmhpq3",
   "message": "YTA.  Probably for the best for him.",
   "created_utc": 1701478626,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmhzuo",
   "message": "YTA... she's married and have to talk to her husband ...  she also has a child... you just got a luxury sales job  put money back and save until you can move elsewhere... be thankful and grateful you do have a place to live ....\nGrandson will never know you and when you gr your head out your a** dont be shocked when you are denied seeing him and dont post  why does my daughter keep my grandkid away from me...\nGlad your daughter is smart and you do know co signing if you miss payments and what not she will have to pay.... or you could ruin her credit ....obviously you told the person your daughter would co sign with out giving her a conversation",
   "created_utc": 1701478755,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmi26l",
   "message": "good lord you remind me of my mother! this is not a compliment, and in fact Ive gone no contact with her :) YTA - reflect on your own decisions and be accountable for your own life",
   "created_utc": 1701478785,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmieds",
   "message": "Yta Sounds like you don't want to see your grandson",
   "created_utc": 1701478940,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmitix",
   "message": "YTA and I hope your grandson finds out when he’s older that grandma wouldn’t see him unless mommy helped pay for grandma’s unfortunate life circumstances.\n\nNobody cares how old you are or how you got to where you are now. Only you are responsible for your life and your daughter owes you nothing.\n\nSo by all means, ice yourself out of more of your family’s life while trying to emotionally blackmail them. This is why YTA.",
   "created_utc": 1701479134,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmiw2g",
   "message": "Kinda sounds like the plot to a TV series, but if it's real, then yes, YTA, drama-queening your daughter into paying your rent is never the answer.",
   "created_utc": 1701479165,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmj0md",
   "message": "YTA - the 35 year olds don't owe you respect simply because you're older.  Respect is earned, and if you feel entitled to their respect you're never going to get it.  Treat them the way you want to be treated and they may reciprocate.\n\nRefusing to see your grandson isn't the treat that you think it is.  It's your daughter's husband who brings in the money, so of course she has to check with him.",
   "created_utc": 1701479224,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmj1xc",
   "message": "I'm 51 years old and this comment \"It is awful- everybody there is under 35 and I feel they don't respect me as somebody older as they should.\" blows my mind. WTF are you talking about?",
   "created_utc": 1701479240,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmj46s",
   "message": "Anyone else really want to hear the kids’ version?",
   "created_utc": 1701479268,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmj995",
   "message": "YTA - I feel like we’re not getting the whole story here about you and your daughters relationship. But for the record, your daughter cannot cosign on a lease without first talking to her husband. If I was her husband, I’d be pissed if she made financial decisions that would affect me, especially if she isn’t working herself. Just because they’re well off doesn’t mean she can do whatever the heck she wants. I have a feeling that you have a miss guided conception of their relationship. Can you perhaps stay with her for a month or two until you get your job going? Or is there a reason you can’t stay there?        \nWhile I feel for your situation, you seem to think that you’re entitled to a lot more than you are entitled to. If the people you are living with are adults, why do you think they need to respect you as an elder? They’re not your family. They’re adults and should be consider equals. If you’re not getting along with your housemates, maybe you’re the problem.         \nYou go into quite detail about your relationship with Sophia‘s father. I don’t know how that’s relevant to the story other than you’re trying to blame your daughter for ruining your body??? And that somehow she owes you?? That’s kind of how it’s sounds. But remember, she didn’t ask to be born. That was all you. So if you think your daughter owes you for some thing because you decided to have another child, she doesn’t.",
   "created_utc": 1701479332,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmk0zc",
   "message": "Sounds fake af",
   "created_utc": 1701479683,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmkbic",
   "message": "So you are considering living in your car because your younger roommates don’t like you, probably because you act like a super entitled narcissist whose plan in life is to mooch off others. \n\nYTA.",
   "created_utc": 1701479815,
   "score": 3,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmker5",
   "message": "Wow op you really are an asshole",
   "created_utc": 1701479856,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmku6k",
   "message": "Welcome to the real world, lady. YTA. Not a victim. An entitled asshole. Get your life together... you're almost 60 and sound 25.",
   "created_utc": 1701480051,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmku84",
   "message": "You had a 2nd child while trying to have a modeling career?",
   "created_utc": 1701480052,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbml2mg",
   "message": "YTA- You asked your DAUGHTER to co-sign an apartment. You’re the MOTHER! You don’t bring your children into your mess, you don’t just assume they’re in a position to do ANYTHING for you! \n\nThen because her life is a success for HER, you want a piece of her! \n\nYou’re a horrible parent and an AH!",
   "created_utc": 1701480157,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbml31o",
   "message": "YTA\n\nYou have relied on your first husband, your second husband and now you are trying to rely on your daughter. I understand and sympathize with your situation, but you need to stand on your own two feet. Your daughter should not be cosigning an apartment for you. If you need a cosigner, then you can't afford it. Your daughter has a family of her own now, and she needs to make responsible decisions for the sake of her family. If you can't afford LA, then you need to move out of LA. There is a very, very high degree of drama and victimhood in your description of why you are in your current predicament- but there is no evidence of accountability. \n\nYou have also displayed that you value your daughters credit profile over your grandchild. \n\nYou need to really, really look at where you are in your life right now. It's very possible to turn it around and develop healthy expectations of your family and also have a stable career, but you are not going to succeed with this mentality that you currently have. You are in your current predicament as a result of **your choices**. Those choices are not necessarily bad, but they are choices that you made. You decided to stay in a bad marriage, you decided to pursue modeling instead of something more reliable, you decided to live in an apartment that is outside of your means, you decided to invest all of your savings into investments that you didn't understand and now you've decided that your daughter's family is obligated to take on substantial risk to dig you out otherwise you're severing your relationship with your grandchild. \n\nYou are not at risk of being homeless. But you are at risk of being a lonely, elderly woman that is living in a home in the future. And you need to start the work of being accountable to your own decisions.",
   "created_utc": 1701480163,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbml935",
   "message": "YTA but you’re doing them a favor by staying away.",
   "created_utc": 1701480242,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmlcq1",
   "message": "YTA. I think there's a lot missing here.\n\nYou are coming off very entitled. Your daughter or anyone else doesn't owe you anything in life.  Your daughter isn't rubbing anything in your face. She invited you to see your grandchild.  Your butthurt self is reading into it.\n\nAnd as someone who is just a couple of years younger than you, no one owes you respect. Be a decent human and you will earn respect. The old saying of respect your elders... F that. Just because we are old doesn't mean we know it all. \n\n\nI get a sneaking feeling that your daughter isn't going to be that upset you don't want to be around her. The guilt tripping is probably strong.  And you have reduced your relationship with your daughter to one of financial transactions. You only want her if she pays up. \n\nYou may not be able to repair this for a long time if ever. She probably doesn't want someone involved in her child's life that can dissappear when her undies get in a twist.",
   "created_utc": 1701480289,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmltgz",
   "message": "A narcParent has decided to post.",
   "created_utc": 1701480503,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmjd1m",
   "message": "Your daughter is not flaunting her situation. She is inviting her mother to spend Christmas with her family. When in an apartment complex it is not necessary to interact with other residents. People under 35 don’t automatically respect older people. Respect is earned. Learn how to take care of yourself.",
   "created_utc": 1701479381,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmji8i",
   "message": "Get your shit together",
   "created_utc": 1701479447,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmjkex",
   "message": "YTA- you see your daughter wanting you to have a relationship with your grandson as a slight to you- you need therapy.",
   "created_utc": 1701479474,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmjvlh",
   "message": "Yta. Lord have mercy. Co-signing is not a small favor. And you are manipulative and petty.",
   "created_utc": 1701479613,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmk0ag",
   "message": "YTA",
   "created_utc": 1701479674,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmk12e",
   "message": "How I can let everyone know I’m manipulative and don’t actually CARE about my grandchild without actually saying it ?",
   "created_utc": 1701479684,
   "score": 2,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmkdqb",
   "message": "All undo is talk about u -",
   "created_utc": 1701479843,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmkogz",
   "message": "YTA that grandbaby should be the light  during this rough patch in your life. Very immature. They are better off without you.",
   "created_utc": 1701479979,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmkraf",
   "message": "YTA. You are a grown up. Figure out a way to live without complaining about your daughter's birth ruining your modelling career. \n\nOf course she had to ask her husband before cosigning. That is what partners do. \n\nIf you refuse to see your grandson because they won't cosign for you, that will definitely make things worse.  Somewhere there has to be a roommate situation that would be better for you. Or you can get headphones and stay where you are. Your daughter does not \"owe\" you cosigning.",
   "created_utc": 1701480015,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmktg0",
   "message": "You sound like my mom… who never tells the full story, only calls when she needs my help, and ices me and her grandkids out for years at a time when we’re not in a position to help someone who’s not responsible. YTA OP. It’s not your children’s job to be providing and safeguarding you. You should be doing so for them instead. There’s a reason she doesn’t seem too bothered by you needing space.",
   "created_utc": 1701480042,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbml42h",
   "message": "YTA",
   "created_utc": 1701480176,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmld5c",
   "message": "Sounds like your daughter was being responsible in her marriage since that needs to be a decision the two of them make, and then still extended an olive branch to you in showing she wanted you to remain a part of their life. Your response was to essentially spit in her face. All you did was reinforce the validity of their decision in their minds probably. I would apologize personally.",
   "created_utc": 1701480294,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmlif9",
   "message": "There are some deeper issues here, I feel like we don’t have the full story.\n\nI mean you have two kids who both seem very indifferent to you. You also have two ex-husbands, one who was super wealthy, yet the child support and alimony wasn’t that good?\n\nThe biggest question for me is why your daughter can’t let you live in her mansion. Something isn’t making much sense. I would die for my mother, and I think most people would, so why can’t she let you live with her?",
   "created_utc": 1701480362,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmln2f",
   "message": "YTA. For some reason you think its the childs job to take care of her parent. I'm guessing you have taken advantage of her for far too many years and shes decided shes not helping you anymore because you need to take care of yourself.  YTA for trying to make your irresponsibility your daughters problem and youre a bigger AH for being a jerk to your innocent grandchild.",
   "created_utc": 1701480422,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmlpjk",
   "message": "You thought she'd understand because of her dad?\n\nIt reads like you mean: she owes me for wrecking my body, for her dad leaving and for your son not being closer to you.\n\nNews flash, everything I read is about facing the consequences of your own choices. YTA. Try to get some therapy when you can afford it. You might not want to hear it, but cluster b personality disorders are manageable if you're willing to put in the work.",
   "created_utc": 1701480453,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmlxrw",
   "message": "YTA.\n\nI think you should reread your post. It's comes across very much as 'every single problem I've ever had is someone else's fault' \n\nTypically, these posts are skewed to an OP's point of view and their is an allowed amount of bias. This is your side of the story and you still come across as TA.",
   "created_utc": 1701480558,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmm0ic",
   "message": "why should people younger than you respect you more ?",
   "created_utc": 1701480592,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmm590",
   "message": "Yta. Stop playing a victim",
   "created_utc": 1701480653,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmmjqs",
   "message": "You sounds like a self-centered asshole. So you must be the asshole.",
   "created_utc": 1701480836,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmmk4x",
   "message": "YTA who wants to punish a *toddler* for your being in a shitty financial position. \n\nYTA x100 for this little gem:\n\n\u0026gt;they don't respect me as somebody older as they should",
   "created_utc": 1701480841,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmmldo",
   "message": "Parents are not their children’s responsibility.",
   "created_utc": 1701480856,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmmm89",
   "message": "Sounds like she lived off the child support as mommy support and then was SOL when the kids aged out. It's not your daughter's responsibility to raise you now.  You put yourself into this mess. You have to get yourself out of it. Also, LA is an incredibly HCOL area. You could downsize and move to a state with LCOL and look for a job to support yourself. \n\nI get the feeling she is mad at her daughter for being smart to get the ring first then baby. Her life is set and she should be proud of her and instead of miffed at her.",
   "created_utc": 1701480866,
   "score": 1,
   "submission_id": "188nmn0"
  },
  {
   "comment_id": "kbmmnjz",
   "message": "YTA- this has absolutely NOTHING to do with your grandson. I would live in a tree stump to see my grandkids.  Why are you punishing your relationship with him? He had nothing to do with it.  As a grandma who held one of their grandchildren while they passed away you area giant AH!  Be f*%#ing thankful you have a grandchild!!",
   "created_utc": 1701480883,
   "score": 1,
   "submission_id": "188nmn0"
  }
 ]
}