{
 "submission_id": "188wt7m",
 "title": "AITAH for refusing to give my brother money for a lawyer, so he can fight an emergency custody order for my nephew?",
 "selftext": "My brother's wife is divorcing him. In addition to filing for divorce she filed for emergency custody of my nephew and it was granted. My brother wants me to give - not loan - him money for an attorney so he can appeal the emergency custody order. I refused to do it because I agree with the order. AITA for refusing to give him the money even though I can afford it? He's in denial and doesn't think he has a problem.\n\nMy brother got a new job and one of his colleagues there was giving him Adderall to help him be more productive. My brother does not have ADHD or any other condition that would mean he would be prescribed Adderall but he lied to his doctor about having the symptoms of ADHD to get a prescription after his colleague got fired and he lost his supplier. One prescription was not enough and he was going to try to get another one from a different doctor until he found out that our province tracks who is prescribed Addreall, and he would get flagged because he already has a prescription.\n\nThis is where he crossed the line in my mind. He took my nephew to the doctor and lied about him having ADHD symptoms. My nephew was only 3 years old when my brother did this. He doesn't even have ADHD. The pediatrician was suspicious because my nephew has no symptoms and because my brother told the doctor not to tell his wife about my nephew being prescribed medication since it would \"worry her\". The doctor refused to prescribe my nephew Adderall and notified his wife. His wife told my brother he had to seek treatment for his Adderall use and wanted him to see a therapist too. He agreed but then he was caught trying impersonate someone to get another prescription. He was charged for that by the police and he also admitted he was planning to rob a pharmacy if he couldn't get the Addreall another way. All of the above are things my brother admitted, it's not secondhand information.\n\nA judge agreed with my sister-in-law that my brother can't be trusted to be around my nephew. My brother is only allowed to see my nephew while supervised by a social worker. He also has a trial coming up over the impersonation to get more Addreall. He wants me to help him appeal the emergency custody / supervised visitation order. But I agree with my sister-in-law and the judge that my brother shouldn't be alone with my nephew right now. My brother says I am betraying him though, and being a bad brother by refusing to help him with this.",
 "created_utc": 1701495629,
 "permalink": "/r/AITAH/comments/188wt7m/aitah_for_refusing_to_give_my_brother_money_for_a/",
 "score": 108,
 "url": "https://www.reddit.com/r/AITAH/comments/188wt7m/aitah_for_refusing_to_give_my_brother_money_for_a/",
 "comments": [
  {
   "comment_id": "kbnkwma",
   "message": "NTAH. Do not enable dishonest drug addicts",
   "created_utc": 1701499017,
   "score": 119,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnpylb",
   "message": "I seriously doubt a cent of that money would actually be used for a lawyer.",
   "created_utc": 1701502870,
   "score": 175,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnt4tn",
   "message": "NTA.\n\nIf 'betraying' your brother means keeping his 3-year-old child SAFE, then I'd do it a million times over.\n\nUntil he accepts that his drug use, lies, manipulation tactics, and a planned attempted robbery are the reasons why he's not a safe person to be around his child unsupervised I wouldn't entertain him at all. I wouldn't be answering calls, texts, or speaking to him in person till he got his shit together.",
   "created_utc": 1701505446,
   "score": 151,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbngqb2",
   "message": "He needs treatment first and foremost. Before he can take care of his son he needs too take care of himself. He is an addict. People think that addicts are all homeless junkies on the street begging for change. In fact you could be normal for 20 years but the moment you get that substance you like you can become hooked instantly some people are just wired like that. I agree with what you did by not giving him money. That would be a waste. He needs to get sober and until then he won’t be able to write these wrongs. Jail might be a blessing for him to be able to see the wreckage he caused.",
   "created_utc": 1701496164,
   "score": 148,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnm6pn",
   "message": "\u0026gt;I refused to do it because I agree with the order.\n\nYou would be the ah if you gave him the money\n\nnta",
   "created_utc": 1701499951,
   "score": 175,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnsss3",
   "message": "NTA. You'd be burning money bc there's no way he'll win. Completely agree with your SIL too. Keep your nephew safe and don't waste money.",
   "created_utc": 1701505170,
   "score": 37,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnursh",
   "message": "You are being a good uncle and a good brother. NTA. You are, in fact, being a good person.",
   "created_utc": 1701506832,
   "score": 22,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnnhxa",
   "message": "NTA",
   "created_utc": 1701500936,
   "score": 14,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnucpb",
   "message": "NTA. Tell your brother that you're being a good uncle. I hope you can keep up a good relationship with your nephew and SIL through all of this.",
   "created_utc": 1701506475,
   "score": 15,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnx4i9",
   "message": "NTA - He is literally a dangerous drug addict",
   "created_utc": 1701508850,
   "score": 13,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnyz27",
   "message": "NTA and good on you for doing it. Way too often people only focus on “but he’s my brother” and find every excuse to defend a horrible parent. I feel for your brother, drug addiction isn’t easy to cope with and he seriously does need help. Have you suggested he get into a rehab program or support group and therapy? The only way he will ever get any type of custody of his son is by showing he’s fighting his addiction and clean.",
   "created_utc": 1701510457,
   "score": 14,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnrx3t",
   "message": "You answered your question in the first paragraph.  You *definitionally* cannot be the asshole if you legitimately believe the emergency custody order was warranted.  \n\nEverything else is irrelevant.  All the context is irrelevant.  If you LEGITIMATELY believe he shouldn’t have the kid how could anyone possibly justify giving him money to fight it?  So, there.  You are validated.  Delete post and move on",
   "created_utc": 1701504453,
   "score": 44,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo0lnq",
   "message": "No he needs medical help, fast.\nAdhd meds are basically meth. That’s his next stop if he doesn’t get help.\nNTA, don’t enable him, maybe offer to pay for rehab if you have some money and can afford to help somehow. Rehab is his best bet for getting access to his kid back, and surviving the future.",
   "created_utc": 1701511853,
   "score": 17,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnym7v",
   "message": "NTA. He's sadly created this situation for himself. There is no way the court would change the order unless he overcame his Adderell addiction and demonstrated that he would never try to  exploit his son again. You would be throwing money down the toilet. Let's hope he gets it together.",
   "created_utc": 1701510145,
   "score": 7,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnxyzo",
   "message": "NTA NTA NTA Your brother is being a terrible parent.   \n\nYour nephew definitely not safe with him.",
   "created_utc": 1701509584,
   "score": 8,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo34r0",
   "message": "NTA. Addiction makes people do crazy things. Sometimes the best way to love someone is to refuse to facilitate their actions. Be there for him and encourage him to get help, but remember that he has to do the work of sorting out the addiction himself. Best of luck.",
   "created_utc": 1701513991,
   "score": 7,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo0ljq",
   "message": "NTA - Your nephew's safety is the top priority here.  \n\nYou brother needs to seek help and clean himself up if he wants to get back on track with his life.",
   "created_utc": 1701511850,
   "score": 6,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo75vq",
   "message": "Doesn’t matter how much money you throw at him, he’s never ever going to get custody which of course is the right thing until he gets himself sorted. He’s a drug addict facing prosecution, no judge in their right mind would give him custody \n\nNTAH",
   "created_utc": 1701517260,
   "score": 6,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo895r",
   "message": "NTA.\n\nBased on the description, the emergency order is in everyone's best interests, including your brother's.  He needs to get himself right with the law and with his addiction first, and then reassess.",
   "created_utc": 1701518097,
   "score": 6,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbopz4z",
   "message": "INFO: Where the hell is he getting Adderall?!? I know people who have to go pharmacy shopping every month just to get their legitimate prescriptions filled. I have ADHD and I'm on one of the few medications that isn't a part of a massive shortage but I still get nervous when I get a refill.\n\nYour brother is a complete ahole if for no other reason than the fact that he's making a bad situation even worse. Involving his THREE YEAR OLD in his drug seeking is utterly disgusting!",
   "created_utc": 1701528542,
   "score": 7,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnq7m7",
   "message": "NTA.",
   "created_utc": 1701503075,
   "score": 5,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnyp9s",
   "message": "NTA.",
   "created_utc": 1701510218,
   "score": 4,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo0e9n",
   "message": "NTA,",
   "created_utc": 1701511673,
   "score": 4,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboaswy",
   "message": "Yikes. NTA. Rarely has anyone been less the asshole.",
   "created_utc": 1701519945,
   "score": 6,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboen3j",
   "message": "NTA. \n\nBtw that money would probably go to drugs and not an attorney.",
   "created_utc": 1701522440,
   "score": 5,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbps5k6",
   "message": "Child's welfare comes first.\n\nGood uncle!\n\nNTA",
   "created_utc": 1701544454,
   "score": 6,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo1c1x",
   "message": "You are being a good uncle.",
   "created_utc": 1701512481,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbojjfr",
   "message": "NTA- Your brother needs help with his addiction problem that he is definitely in denial about.  That will help with his custody fiasco.  But throwing money at problem he's not willing to admit he has or fix, what's the point? \n\nYour brother is spiraling out of control and he can't see it. The obsession to get the Adderall by any means because he needs it has taken over.   He is destroying his life as surely as any other drug addict. He's lost his wife, has only supervised visits with his son and is likely in danger of losing his job because of this mess. Not sure what his bottom is, but I hope it's soon and he get his life together.",
   "created_utc": 1701525246,
   "score": 5,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbppchi",
   "message": "Addicts try to manipulate those around them.",
   "created_utc": 1701543295,
   "score": 5,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbojwwi",
   "message": "NTA. You agree that he shouldn’t have custody so it makes no sense for you to help him fight to get it. It also doesn’t sound like he has a chance, making it an even bigger waste of money.",
   "created_utc": 1701525452,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbojz25",
   "message": "Nope.",
   "created_utc": 1701525487,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbok056",
   "message": "NTAH. He does not deserve your help and he would never win that appeal.",
   "created_utc": 1701525503,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbok61k",
   "message": "NTA\n\nHe is beginning his spiral to rock bottom.  All you can do is minimize the damage and protect your nephew.",
   "created_utc": 1701525592,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbok791",
   "message": "NTA. You are doing the right thing. Protect your nephew until your brother gets te help he needs.",
   "created_utc": 1701525610,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbokfmo",
   "message": "NTA\n\nYikes!",
   "created_utc": 1701525735,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbokmz6",
   "message": "NTA.  Your brother is lying anyway, he wants the money to buy Adderall.",
   "created_utc": 1701525844,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbol7yd",
   "message": "NTA, a bad brother? No, more like a great uncle. Keep being a great Uncle.",
   "created_utc": 1701526148,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbol9go",
   "message": "NTA.  Hope he gets the help he needs.",
   "created_utc": 1701526170,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbomsrd",
   "message": "NTA I agree with the order, too. You would be out of your mind giving him money to get custody when he has a serious drug problem, and a trial coming up. Or even loaning it to him.",
   "created_utc": 1701526973,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbonln3",
   "message": "NTAH. Yea, don't waste your money.",
   "created_utc": 1701527380,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboo3xs",
   "message": "NTA",
   "created_utc": 1701527630,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboovxe",
   "message": "NTA and good for you, not enabling such behavior.",
   "created_utc": 1701528015,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboowhn",
   "message": "NTA.\n\nNephew is much safer with his Mother rather your Brother.",
   "created_utc": 1701528023,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbop7zb",
   "message": "NTA. Assistance that OP can provide to help, not enable, his brother includes spending quality time with his nephew and assisting his brother in finding an appropriate treatment program when/if he agrees to participate.",
   "created_utc": 1701528177,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbopg3y",
   "message": "NTA, besides seems the brother has bigger problems to worry about right now",
   "created_utc": 1701528287,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboph6w",
   "message": "NTA.  Perhaps this will be his rock bottom.",
   "created_utc": 1701528302,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbopkoy",
   "message": "NTA. Your brother has a serious problem and he needs to take responsibility for his actions. In the meantime your nephew is safe with his mom and you are right to keep him away from your brother",
   "created_utc": 1701528349,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbp77sw",
   "message": "As the child of a addict parent, let me assure you that you are NTA and are doing the right thing.\n\nHe will try to use that child again to get drugs.  And if his son ever actually does need meds for a legitimate condition, he will steal them.  I lived that and wish it on no child.  Hold the line.  You're doing the best thing for your nephew.",
   "created_utc": 1701536035,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbp8n96",
   "message": "NTA. Your brother is an addict and it has not hit home for him that he has hit rock bottom. He has lost his marriage, he has lost access to his child, and he is probably going to do some jail time. \n\nSupport your former sister-in-law here. Your nephew's safety needs to come first.\n\nIf your brother pushes, tell him: \"You used Nephew to try to get drugs. You were planning to rob a pharmacy. You are not a safe or positive influence for him right now. You need to get help for your addiction if you want a relationship. Because I love you and your son, I am putting HiS safety first.\"",
   "created_utc": 1701536620,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbp9c40",
   "message": "You need to tell him that you're not siding with his wife. You're siding with YOUR nephew, and his well-being is what's most important.",
   "created_utc": 1701536895,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbppneu",
   "message": "NTA\n\nHe isn’t to be trusted.\n\nHe’d probably sell his own kid, just to get another fix.\n\nIf he’s willing to rob pharmacies, and con doctors to get more pills, I wouldn’t be surprised if he would use the money, if you have it to him, to buy them from someone off the street.\n\nHe needs to face the consequences of his own actions. \n\nFunny how he calls you a bad brother, and says you are betraying him, because he’s the one betraying his own family, and is a bad father and husband.\n\nHe truly needs to want help, because nobody can fix things for him.\n\nHe has to be willing to take control of his life, and his addiction. As well as rebuild the relationship with his kid",
   "created_utc": 1701543420,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpu82n",
   "message": "Please don’t enable your brother. You aren’t the ah here - at all.",
   "created_utc": 1701545279,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpyfc3",
   "message": "NTA - Your brother will be going to jail most likely.\n\nHe is a drug addict and needs to face the consequences of his actions.",
   "created_utc": 1701546993,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbqhrye",
   "message": "sterilize him and snip that limb off the tree. give the kid whatever money and support he needs.",
   "created_utc": 1701554810,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo1fn4",
   "message": "You made the right decision, the most important person in all of this is your nephew. And if your brother is using him for drug seeking then clearly there’s a big problem. NTA",
   "created_utc": 1701512564,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboaqqb",
   "message": "Being a bad brother isn’t a crime. \n\nSay no. Your brother is a manipulative scammer and he can get himself out of this mess.",
   "created_utc": 1701519902,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboqmle",
   "message": "Hell no. NTA that money would go to drugs",
   "created_utc": 1701528850,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboqq2f",
   "message": "NTA \n\nHe can appeal it anyway he wants.  After what he did no judge will entertain visitation without him being in some sort of program.  He’s lucky CPS isn’t involved.",
   "created_utc": 1701528896,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbor6rv",
   "message": "NTA. Do not give addicts large amounts of money. Full stop.",
   "created_utc": 1701529117,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbous9k",
   "message": "NTA, you're protecting that little boy.",
   "created_utc": 1701530750,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbp6dz5",
   "message": "NTA Your responsibility is to your nephew.. keep him safe. Don't give your brother money for drugs",
   "created_utc": 1701535699,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpd6t5",
   "message": "When someone is in the throws of addiction nothing will ever be their fault and everyone is always against them… do not feel guilty over his accusations even though it’s easier said than done… please join a alanon group to discuss what is happening to you and ask your sis in law to do the same… it will help you understand and be able to work through all of the feelings and things that those who are in an addicts life are dealing with… just bc you aren’t the addict doesn’t mean your life isn’t being affected",
   "created_utc": 1701538441,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpg0fo",
   "message": "NTA. Your brother needs help and he'll probably spend the money on drugs. This is a wakeup call and hopefully he'll get it.",
   "created_utc": 1701539560,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpg0ls",
   "message": "NTA. I’d bet money he’d spend the money on drugs instead of a lawyer, the money being for a lawyer us just what he’s telling you.",
   "created_utc": 1701539562,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpl2bq",
   "message": "What a waste of your money that would be.  He's not going to win. \n\nBesides, any money you give him would be wasted.  He will never use it responsibly.  You would never give it back.  \n\nI'm sorry your brother is a delusional wreck of a man.",
   "created_utc": 1701541572,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpo7vx",
   "message": "NTA, help SIL and nephew instead, your brother made his bed let him lay in it",
   "created_utc": 1701542840,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpou3z",
   "message": "You are doing the right thing.",
   "created_utc": 1701543090,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbppcbb",
   "message": "NTA  Protecting your nephew is your priority and you are doing a great job with that.  Quite frankly he would probably spend the money on drugs. \n\nWhat you are doing is tough love and it is very hard to do when you love someone.  It is however the only thing that has any hope of making him hit bottom.   If he can lose custody and visitation of his son over his drug use he is in deep. \n\nThe only money I would give to him (and not directly to him) is to pay for a Resident Rehab program",
   "created_utc": 1701543293,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpuz9p",
   "message": "NTA. Please do not give this addict money, for any reason. Enabling his illness is not helpful to anyone, and if he is mad at you, so be it. There is an innocent child who needs a sober father, \u0026amp;if you want to be a 'good brother' who pays for things, offer to pay for his drug and alcohol co-pays so he can get treatment.",
   "created_utc": 1701545587,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpv23d",
   "message": "NTA.",
   "created_utc": 1701545620,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbpxeq0",
   "message": "It’s a losing battle if you give into him.",
   "created_utc": 1701546579,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbq0hpv",
   "message": "Nta sounds reasonable to me.",
   "created_utc": 1701547819,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbq271y",
   "message": "Nta- your brother needs to rehab. His habit is ruining multiple areas of his life. They don’t even give adhd meds at that age ….(mother of a child with actual adhd).",
   "created_utc": 1701548490,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbqgj38",
   "message": "NTA. Custody issues are often an endless money pit.  He should look at associations that assist dads with custody..",
   "created_utc": 1701554299,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbqlj0p",
   "message": "Man, you would think using your toddler to score more drugs, getting caught, and losing your family would put shit into perspective. NTA for refusing and I agree with you, your brother has shown he cannot be trusted. I hope he gets his shot together for the sake of hopefully having a future with his kid one day, sorry you’re in this position, it can’t be easy.",
   "created_utc": 1701556349,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbqlltn",
   "message": "NTA. Why are you even questioning it?? Your brother is an addict and used his kids to obtain drugs. And, hysterical… they don’t prescribe 3 yr olds stimulants. They don’t even diagnose 3 yr olds with ADHD bc it’s too early. He deserves to be in the position he is in. Tell him the damn truth and stop second guessing yourself.",
   "created_utc": 1701556381,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbqm322",
   "message": "100% NTA. Here’s the thing about drug addiction.\n\nIt is true it’s a disease. Unfortunately one of the side effects is that the addiction takes over the person, and they’ll do anything to get their fix. This includes theft, manipulation, and as you have witnessed, using their own kids as pawns to get what their body craves.\n\nMy best friend from university became addicted to cocaine and possibly meth, and he became a lying thief and a master manipulator.\n\nThe loving thing to do here is to tell your brother why you are not giving him money for this, and why you would testify against him getting custody at this point, without proof of sobriety, rehab, and firm steps towards making amends. This may take years, but you have done the right thing, as has your sister in law.\n\nI am so sorry your family is going through this.",
   "created_utc": 1701556577,
   "score": 2,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbny5qr",
   "message": "He told the cops he was planning to rob a pharmacy if it didn't work out? He just threw that out there?  Either he's incredibly stupid or I'm sensing some exaggeration, that being said adderall is basically meth so I could see it forming a substance abuse issue that severe. So I'm going NTA, keep your nephew safe",
   "created_utc": 1701509744,
   "score": 3,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnsv5q",
   "message": "NTA, hopefully he can get his shit together. my sister became an adderal addict, silly bitch crushed and snorted them and ended up dead.",
   "created_utc": 1701505224,
   "score": 5,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnrp1g",
   "message": "Seriously? Your brother can go to a GP and just claim he has ADHD and he gets a prescription, just like that, with no testing? Where I live you have to wait for ages to be tested for ADHD. You certainly can't just get a prescription by self diagnosing.\n\nI also do not believe for a second that a paediatrician even contemplated giving a three year old these types of drugs. Once again, diagnosis? And it's not recommended to do so.\n\nIf you must fake post at least make it believable.",
   "created_utc": 1701504276,
   "score": 5,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbnhhag",
   "message": "You do not loan family money. You give it; or you don't give it.  \n  \nIn the grand scheme of life (from what is told to us here) your brother has not done all that much wrong beyond become addicted to a stimulant. What he did with his son was exploitative but beyond that did not place his son in any harm. The emergency order should not have been granted by a judge but he is part of the system that makes money off of people like your brother. CPS is paid by the cases they execute so they need a case-mill to make money to stay alive. Whether or not it helps your brother is secondary to the machine. It is vital that you internalize this. You will not be able to navigate the coming days without an acceptance of how our government [dys]functions. It does not matter how genuine or how much the assigned social worker wants to help. They are incapable of helping and are compelled to intervene in a way that discourages positive outcomes.  \n  \nYou need to decide if you care about your brother enough, and if there is enough of your brother left, worth actually helping. That means being father-like to him; which means punishing poor behavior and rewarding good behavior. If he ever bitches that your not his father then tell him you decided to become his father when he asked you for money and you look forward to the day that you become brothers again.  \n  \ne.g. If he wants to fight this order then he needs to come up with half the money and you will gift him the other half, if the money isn't that material to you.",
   "created_utc": 1701496648,
   "score": 195,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo2f6i",
   "message": "You are so NTA! However your brother is. The simple issue that he got himself addicted is in itself a pretty good marker that he does not have ADHD, ADD or any other related npf diagnostics as for those (and I live with 3x diagnosed) that needs it does not easily get addicted and hyper, instead the medication calms them down and brings order to their thoughts. A \"normal\" person would however become horribly addicted and hyper from the same dosage. These meds are not to be trifled with and your brothers behaviour enrages me as his actions ruins accessability and creates unnecessary hoops to jump through for those who desperately needs it. Do not enable, do not pay. May he has the rightful consequences for his actions. If any you should be supportive of your brothers soon to be ex wife and your nephew.",
   "created_utc": 1701513395,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo2yv5",
   "message": "NTA - you’re not being a bad brother, you’re being an awesome uncle by protecting your nephew from his drug addicted father.",
   "created_utc": 1701513855,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo38dp",
   "message": "NTA. You’re being a good uncle by not helping your brother.",
   "created_utc": 1701514076,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo3kr5",
   "message": "NTA. There is no world in which you could be the asshole in this situation.",
   "created_utc": 1701514361,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo5kvl",
   "message": "Nta",
   "created_utc": 1701516003,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo5lkr",
   "message": "NTA for several reasons. \n\n1I agree with his actions its best the childs mother have custody. \n2 have some doubts the money will actually go to a lawyer \n3 you’d probably be throwing your money away because given his actions and his upcoming court case odds are the judge will decide to keep the order in place",
   "created_utc": 1701516019,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo67g6",
   "message": "You are a good brother giving him tough love. He should fight his addiction not the mother of his son. She is protecting your nephew, his son from a derailing drugaddict. Keep communicating with him to get hopefully through his denial. If you can afford it, tell him you will (help) pay rehab, just won't give him money directly.",
   "created_utc": 1701516502,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo6ic6",
   "message": "NTA",
   "created_utc": 1701516747,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo7cka",
   "message": "NTA. Your bro needs help to get himself sorted and his own life back on track before anything else.",
   "created_utc": 1701517405,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo7gk7",
   "message": "NTA protect your nephew!!!",
   "created_utc": 1701517492,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo7lqn",
   "message": "NTA!\n\nYou are being a GOOD sister by not enabling his behavior and making him face the consequences for his actions. Hopefully, he takes this as a wake-up call and seeks out the help he needs.",
   "created_utc": 1701517604,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo7rj2",
   "message": "NTA!",
   "created_utc": 1701517727,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo8kn9",
   "message": "NTA. He’s an addict. He shouldn’t be with his kid.",
   "created_utc": 1701518340,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo99wz",
   "message": "NTA",
   "created_utc": 1701518860,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbo9jse",
   "message": "NTA drug addict being a druggy, once he’s cleaned his  act I’d revisit it as a loan but until then not only no but fuck no.",
   "created_utc": 1701519060,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboa203",
   "message": "Oh, great. Your idiot brother wants to throw an expensive Hail Mary with your money!  Tell him to fuck off. Contrary to popular belief, siblings are not obliged to share. I would give each of my my four sisters anything, but that's because I love them all madly.",
   "created_utc": 1701519422,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbob249",
   "message": "NTA: Nope.  Don't give your brother money for a lawyer.  He's an addict.  It does not go well for addicts till they find their rock bottom.  The right thing to do is to protect the innocent from his stunts in the mean time, and that means keeping the kiddo safe - which right now sounds like with the mother.",
   "created_utc": 1701520124,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbob7j3",
   "message": "Do NOT give this man any money, no matter what he says. Frankly, he belongs in jail.\n\nNTA",
   "created_utc": 1701520228,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbob9sk",
   "message": "NTA\n\nYour brother committed a crime to feed his addiction so his problem is well documented in the courts. Giving him money for a lawyer would be a waste because he’s not going to win. I wouldn’t trust that’s what he wants the money for anyway.\n\nThe only way your brother will beat this is by getting help for his addiction.",
   "created_utc": 1701520271,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbobfp6",
   "message": "NTA",
   "created_utc": 1701520383,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbobn8a",
   "message": "NTA\n\nThat money wouldn’t be used to fight custody, it’d go right to drugs.",
   "created_utc": 1701520527,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbobqme",
   "message": "I have a friend that got hooked on Adderall.  He was never the same.  Hasn't held a job since (5 or 6 years). I think it must seriously alter brain chemistry.  I'm sorry but you are definitely NTA.",
   "created_utc": 1701520589,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbobuej",
   "message": "Only help him after he is cleaned up, and has proven he has kicked the addiction.  He may need to be admitted to a clinic.",
   "created_utc": 1701520661,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbod5d8",
   "message": "NTA he mad he cant get.your money... it will be a total.waste he will get denied especially with all he's trying to do... \nHe do know if he robbed a pharmacy he will get arrested",
   "created_utc": 1701521512,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbodhgs",
   "message": "NTA\n\nAnd one day, if your brother does comply with treatment program and get sober from drugs, he will completely understand why you did what you did and forgive both you and his ex for protecting his son from him.\n\nHe is not a safe parent right now. He does need the supervision of a professional to be around his child.\n\nHis addiction has escalated to fraud and a planned attempt at robbery. This is serious stuff. He needs to have his parenting time limited - not forever, but certainly for now.",
   "created_utc": 1701521725,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbodoon",
   "message": "NTA the safety of that kid trumps anything your brother needs. Good on you for not enabling him. I know it's not always easy.",
   "created_utc": 1701521853,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbodqzz",
   "message": "You did the right thing!! Do not enable him!! Let him hit rock bottom.",
   "created_utc": 1701521894,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboe15z",
   "message": "NTA - The only one conducting betrayal is the child’s father. You have zero involvement in what has happened but there it is saying you’re betrayed him. Priceless.",
   "created_utc": 1701522069,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboeemp",
   "message": "NTA. Your brother has a problem. He’s a danger to himself and your nephew. \n\nBeing a good brother or other family member doesn’t mean enabling them or helping them with their self destructive behaviors. By not giving him money, you ARE being a good brother and uncle. \n\nHopefully he’ll get the help he needs and will realize that one day.",
   "created_utc": 1701522299,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboekw0",
   "message": "NTA. Your brother is a drug seeking addict who is stopping at nothing to get his next fix. So gross he tried using his toddler. You’re right not to help him.",
   "created_utc": 1701522403,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboen1c",
   "message": "NTA, this is the rock bottom he needs as a wake up call to seek treatment for his addiction",
   "created_utc": 1701522439,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboes3q",
   "message": "I didn’t even need to read what you posted. It does not matter what the circumstances are your money is your money and no one else is entitled to it. It doesn’t matter why your brother needs it if it’s your money, you decide if you give it or don’t. Don’t feel bad about your decision because it’s your money.people get into bad situations all the time that doesn’t mean that they’re entitled to other peoples good fortune or good choices.",
   "created_utc": 1701522523,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbog4kf",
   "message": "NTA you are a good uncle to your nephew.",
   "created_utc": 1701523324,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbogqn2",
   "message": "NTA that diagnoises would follow your nephew. His teachers would have been informed and he would probably be watched a lot harder than the other kids, treated differently and had to deal with any of the teachers that think those diagnoises = bad kid not worth giving time/effort to.  \n\n\nPeople dont realize the stigma these lables have. The boy with ADHD is not seen as responsible or trustworthy as the neurotypical, its not right but its how our society runs and thrives. His dad was not thinking or caring about his kids future.",
   "created_utc": 1701523679,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboh0g3",
   "message": "NTA. Thank you for protecting your nephew over your brother. I hope your SIL realizes this and lets you have a relationship with him, he could probably\nuse a male role model.",
   "created_utc": 1701523836,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboh4xs",
   "message": "NTA. He's in denial on how bad this actually is.\n\n\n\"Dude, I'm not going to throw away money. No judge is going to give you custody of a kid. You are awaiting trial for trying to illegally get Adderall and admitted to planning on knocking over a pharmacy to get it if you had to. Get help for your habit then when you showed you can stay clean and actually care for a kid then revisit trying to get custody.\"",
   "created_utc": 1701523907,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbohssu",
   "message": "Save your money until he's clean. He has to help himself first. Never stand on the side of wrong out of loyalty. NTA and you sound like a great brother and uncle.",
   "created_utc": 1701524283,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kboi1zn",
   "message": "LoL give him the money to fight the order right before prison?\n\nNTA",
   "created_utc": 1701524427,
   "score": 1,
   "submission_id": "188wt7m"
  },
  {
   "comment_id": "kbqwra5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "188wt7m"
  }
 ]
}