{
 "submission_id": "188z7iu",
 "title": "AITA for insisting my fiancee invite her brother to our wedding instead of her best friends?",
 "selftext": "My fiancee and I are both 29 and are in the process of planning our wedding. I've let her take the lead on just about everything, but the one thing I'm insisting on is causing a major rift between us. We met because I went to law school with her brother, they don't have the closest relationship but he and I are good friends and he fixed us up after we graduated.\n\nA big part of the drama between them is that he dated both of her best friends from high school, and both relationships ended very poorly - he cheated on one friend with the other, and then on her with someone else. She's done her best to keep them apart since then.\n\nMy fiancee insists that they can not coexist at the wedding, and her solution is to not invite her brother. I haven't put up a fight on any other decision she's made, but I drew the line on this one - I've already asked him to be a groomsman, and if she's going to take sides, it has to be her brother that gets invited over her high school friends. He's the reason we are together, and it would also cause major family drama if he wasn't invited.\n\nI'd be fine her just having everyone come,, but she insists her friends wouldn't be okay with that even for just the one weekend. She says they've always dreamed of being in each other's weddings, but I'm just not okay with disinviting her brother/my good friend particularly since he's the reason we're together.\n\nBefore anyone asks, no - there is no history of trauma between them beyond normal sibling issues. This purely has to do with him dating her friends over a decade ago and how poorly those relationships ended. For the record, he's definitely not the kind of person who would behave that way now, it was a long time ago. It just doesn't sit right with me for him to not be there.\n\nMost of our friends think that I'm right to draw this line, but my parents seem to think I should just let this be her decision and let it go. Am I being the AH here?",
 "created_utc": 1701505315,
 "permalink": "/r/AITAH/comments/188z7iu/aita_for_insisting_my_fiancee_invite_her_brother/",
 "score": 164,
 "url": "https://www.reddit.com/r/AITAH/comments/188z7iu/aita_for_insisting_my_fiancee_invite_her_brother/",
 "comments": []
}