{
 "submission_id": "1894aqi",
 "title": "AITA for ending my friendship after they abandoned their foster mom?",
 "selftext": "So for context: my friend, let's call her Sarah(F 23), was put in foster care after her mother, Karen, was an avid drug user and thus deemed unfit to properly raise her; she was put in the foster home around the age of 10 but only stayed for about 10 months before her foster mom, Julie, adopted her. Fastforward 13 years and She's now in college and on her way to getting her Bachelor's(still needs 2 years). \n\n\nHowever, Karen comes back into the picture around this time, having sobered up and getting her life back on track, and expresses how she wishes to live with Sarah again and make up for lost time; Sarah without a second of hesitation agrees to this and completely disregards the woman that raised her for 13 years. Now my issue is that Julie raised \u0026amp; supported her for those 13 years when sarah's other family didn't take her in, and she just dropped her like \"you've served your purpose, so i don't need you anymore, bye!\" . When we used to hang out, she would often say she'd go back to her \"Real mom\" in a heartbeat, despite how great her situation is now because as she put it \"It doesn't matter what somebody else gives you, children need their 'real' parents in their life, even if it's just one\" i always used to think she was doing satire or something but to know she was serious the whole time just makes me feel stupid for not seeing her true character. I've met Julie, and she's a lovely \u0026amp; mature woman so i can't understand how Sarah could just abandon her like she didn't raise you for **13 years**. \n\n\n\nI eventually stopped hanging out with her and blocked her on social media \u0026amp; my phone after our last convo, where she revealed that since she moved out from Julie's house, Julie would no longer pay for her tuition and so after our spring semester, she'll need to pay out of pocket for the last 2 years, which to me sounds reasonable; Sarah ranted on and on about how \"ungrateful\" her foster mom was and how she's only doing this to be petty, let ne assure you, out of the 10 people at the table, 0 were on her side.\n\n\nSo am i the asshole for dropping them as a friend, because i've known them for a bit but i can't shake the idea that she might drop one of us(her friends) just as fast or for so little.",
 "created_utc": 1701525493,
 "permalink": "/r/AITAH/comments/1894aqi/aita_for_ending_my_friendship_after_they/",
 "score": 53,
 "url": "https://www.reddit.com/r/AITAH/comments/1894aqi/aita_for_ending_my_friendship_after_they/",
 "comments": []
}