{
 "submission_id": "189409k",
 "title": "AITAH for telling my sister to be quiet while having sex with her boyfriend?",
 "selftext": "For context, i 16F and my 20F sisters rooms are next door to eachother with relatively thin walls. in the past few months my sister got a boyfriend and everything was fun and exciting until she started bringing him home. It started with then very loudly laughing while play fighting and hitting eacother ect which would’ve been fine during the day but he only come around form 7pm onwards. I brought it up with her, just asking them to be quiet because in the end it’s our house too. I’ve had to bring it up a lot because they don’t listen, which in my opinion is highly disrespectful to everyone around them. Every time i’ve brought it up she gets defensive and makes an excuse. The longer they’ve been together they have obviously had sex, they’re adults they can do what they want. i’m not a prude i don’t think people shouldn’t have sex, but i don’t get the appeal of having sex to a noticeable level in a house with 5 other people. It made me and my other sister very uncomfortable to hear my SISTER having sex next door like i could hear slapping, moaning, you get it. Regardless of my feelings about it i waited until he left to be respectful of him because he’s a nice guy and my family likes him, and i brought it up when her. She began her usually excuses either laughing it off or one of my favourites being, me: you need to be quiet i don’t want to hear that. her: we can’t be quiet, you’ll get it once you get a boyfriend. me: if you can’t be quiet just DONT DO it at ALL. her: we can’t NOT do it. And that was that conversation. It was really heavy on my mind and were a pretty open family so i told my mum thinking she would understands and have a conversation with her and she did at first, my sister didn’t listen, and the more i brought it up the more my mum started getting mad at me. Getting mad at ME for being uncomfortable hearing my SISTER having sex. What. The. Actual. Fuck. Tonight is my last straw. i am a respectful person i didn’t want to embarrass them but i can’t handle it anymore. They were having sex and i could hear it so i first messaged her to avoid what eventually happened but i banged very loudly on the wall, and yelled “SHUT UP”. They did in fact shut up. But they obviously don’t care that much as only 15 minutes later i could hear them laughing through the wall. I am\nso fucking sick of this and it has literally brought me to tears of frustration. i can’t just leave the house at night Im only 16. I can’t move out. and i have no authority over her. I’m still waiting to see if she’ll say anything tomorrow but if she does i’m not going to hold back. i just don’t understand why she doesn’t care. like does she want me to fucking hear that? Isn’t she embarrassed by the fact we can hear it? i don’t know what the fuck she’s thinking all i know is i need it to stop or\nim gonna blow up.",
 "created_utc": 1701524551,
 "permalink": "/r/AITAH/comments/189409k/aitah_for_telling_my_sister_to_be_quiet_while/",
 "score": 59,
 "url": "https://www.reddit.com/r/AITAH/comments/189409k/aitah_for_telling_my_sister_to_be_quiet_while/",
 "comments": [
  {
   "comment_id": "kbokywf",
   "message": "NTA\n\nPut your music against the wall and crank it up as high as it will go.  When your sister complains, tell her that when she gets good taste in music, she will understand.",
   "created_utc": 1701526016,
   "score": 183,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kboiscb",
   "message": "Bang on the wall and embarrass the fuck out of her every time you hear her. Sounds like she deserves it.",
   "created_utc": 1701524834,
   "score": 59,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbollk7",
   "message": "NTA. She is not going to stop, so you can stop trying to reason with her. Talk to your mom again about your anxiety and how it's affecting you and your other sister.\n\nIf it continues, you can wake your mom up while they are having sex and let her deal with it. Or record her every time she wakes you and play it back to your mom and her during dinner. Or bang on her door, open it, and have a random conversation with them. They are not going to stop until you make them as uncomfortable as they are making you and your other sister. \n\nIf mom continues blowing you off, talk to trusted family members. Let them hear your recordings of your sister and her boyfriend. They may be able to get your mom to actually parent your sister.\n\nYou deserve a peaceful night's sleep!! With any luck, your sister will move out. Good luck.",
   "created_utc": 1701526347,
   "score": 11,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbop3su",
   "message": "Record it play it in front of your mom or parents lol and make them uncomfortable",
   "created_utc": 1701528121,
   "score": 147,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbokgnp",
   "message": "There’s not really a right answer to a situation like this. It sounds like your parents aren’t doing their job. Maybe try talking to your dad? Otherwise I’d find a new, creative perspective. Like playing really lame music loudly and singing along, or knocking on the door and asking if you can show her a picture of the huge dump you took earlier. You know, just simple psychological warfare stuff.",
   "created_utc": 1701525750,
   "score": 227,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbojhyf",
   "message": "You should start mimicking the noises they make really loudly. I bet they will stop. Or record the audio and play it loudly. Also where are your parents? Do they not care?",
   "created_utc": 1701525223,
   "score": 186,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbonsvu",
   "message": "Oh definitely NTA, that sounds so annoying. I’d be mortified if I heard my sibling having sex next door to me. And considering your sister is an adult, you’d think she’d act more maturely about this. Why doesn’t she go to her BF’s place? Or why don’t they both find a place to spend a night or two together so they don’t disturb you and your family? And what does she mean “I can’t NOT have sex?” Is her self control so fragile? Does she have any at all? Sorry, that’s just pathetic. Anyway I hope this gets resolved for you soon, OP",
   "created_utc": 1701527479,
   "score": 139,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbokot2",
   "message": "Just play sounds of tortoises having sex",
   "created_utc": 1701525871,
   "score": 90,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kboovik",
   "message": "Honestly, where the in the actual fuck are your parents and who the fuck is in charge at your house. I have 4 teenagers and I sure as shit would never allow an adult child to live with me and disrespect the rest of the family like this. Your parents have an obligation to provide a safe and healthy environment for you. You can get petty revenge all you want, but in the end this is not fucking ok on so many levels.",
   "created_utc": 1701528010,
   "score": 149,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbpav8x",
   "message": "Tbh, when someone is purposefully being loud enough to hear while having sex and they know the other people are uncomfortable with it, it’s sexual harassment. The fact that you’re a minor and her sister is even worse. If they want to have sex, they need to either go to the boyfriends’ house or learn to be quiet so other people aren’t forced to hear everything. You shouldn’t have to be uncomfortable in your own home because they can’t control themselves.",
   "created_utc": 1701537515,
   "score": 31,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbozi5l",
   "message": "NTA.\n\nIt’s so disrespectful to have sex loudly with other people home, especially your family. Nobody wants to hear that. \n\nSorry she is being this way, OP.\n\nIt might be time to talk to your mom or dad about this. If she wants to have sex and not be respectful of other people in the home, she can go have sex at his house or get her own.\n\nIt’s actually quite disgusting to put your family member in that position and not listen to their boundaries.",
   "created_utc": 1701532807,
   "score": 29,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbpeprt",
   "message": "Do what I did with my older sister when I was growing up.  Bang on the wall and yell \"this is the fifth night in a row you two, can't you take a night off?\".  FYI her bf had not been over the last two nights",
   "created_utc": 1701539047,
   "score": 24,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbol6d8",
   "message": "Put a hentai on full blast every time they are at it. \n\nBonus points for extra squeakiness.",
   "created_utc": 1701526125,
   "score": 66,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbopqwg",
   "message": "She should go to a hotel or something. Can you imagine telling your high school teacher why you couldn’t study for the final exam? Oh goodness.",
   "created_utc": 1701528431,
   "score": 61,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kborzg8",
   "message": "NTA. The thought of my family hearing me have sex at any point in my life is absolutely mortifying.... why is your sister so okay with it? And why do your parents not care at all?? Your sister needs to move out if she's gonna be that disrespectful to her siblings like that....",
   "created_utc": 1701529494,
   "score": 41,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbou5dq",
   "message": "If you can’t sleep- and in school and need your rest.\n\nYou’re a kid- you don’t need to hear that.\n\nCan you switch rooms? Headphones? Play music loudly.\n\nIf you’re up I guess everyone needs to be up too-\n\nMake it everyone’s problem because it’s really unfair that you’re losing sleep.\n\nAlso that’s not her boyfriend he only comes over at night for sex.\n\nShe’s super dumb to think this is a real relationship- the dude probably got himself someone during the day.\n\nBut just keep pounding on the wall and being really annoying back.\n\nIt’s not that hard to consider a child- the fact that he wants to be noisy enough for a child to hear him. Is so gross.\n\nI could not have a boner knowing an actual child could hear -\n\nLike it seems to be a kink on his part.\n\nIt’s pretty rare for a dude to want to keep a little sister up while he bangs her sister.\n\nHe’s gross-",
   "created_utc": 1701530470,
   "score": 17,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbom6xg",
   "message": "Wait til they are about to get off \u0026amp; then bang on the door or wall.",
   "created_utc": 1701526660,
   "score": 13,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbovwif",
   "message": "NTA. As a rule of thumb, anyone living in a shared space shouldn't hear you fucking your partner. That goes for roommates, sisters, parents. Either you put on really loud music/sound or she does *or* she finds somewhere else to go.",
   "created_utc": 1701531246,
   "score": 13,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbovwea",
   "message": "Maybe compile a good list of David Attenborough narrating various animals during their mating rituals and blast that through the wall lol \n\nOr some seriously annoying songs that just get stuck in your head so you never forget them and then they're associated with sex forever. Like baby shark lol",
   "created_utc": 1701531244,
   "score": 13,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbp0kdf",
   "message": "It’s time for her to move out of the family home.  What is the plan for that?",
   "created_utc": 1701533261,
   "score": 13,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kboqajv",
   "message": "NTA. Your sister is shameless bitch. Where are your parents in all of this? Why cant they intervene?",
   "created_utc": 1701528691,
   "score": 41,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbovby2",
   "message": "Hey OP, can you talk to your school counselor? This is actually pretty abusive behavior and your parents should be stopping it.\n\nI know someone who had sex with a young teenager in the room and the teen was so embarrassed she kept pretending to be sleeping. So they kept going. Once the child told their parents what happened, the couple was charged with sexual abuse. The male partner ended up having to register as a sex offender, because having sex in front of a child is literally not okay according to the law. \n\nRecord the sounds, bring it to your school counselor. Your parents should be protecting you from this, ESPECIALLY because it makes you uncomfortable. You don't have to listen to sex sounds constantly if you don't want to.",
   "created_utc": 1701530992,
   "score": 71,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbouiv4",
   "message": "If you know how to use a hammer and flathead screw driver, remove her bedroom door from the hinges and lean it against her wall in her room. Hide the pins somewhere.",
   "created_utc": 1701530636,
   "score": 48,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbow4v3",
   "message": "Where are your parents and why aren’t they doing anything about it?! You shouldn’t be uncomfortable in your own house and your sister needs to grow the f’up .",
   "created_utc": 1701531347,
   "score": 22,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kboxs1g",
   "message": "You are being so very kind and respectful. Maybe too kind? I would go in my parents room every time they do this. Play annoying music-do whatever you have to do. This is so disrespectful",
   "created_utc": 1701532066,
   "score": 9,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kboot91",
   "message": "Why don't you start recording live on SM? A stories or something like that?\n\nAsk the viewer: \"My sister and her boyfriend are together. What are they doing? Wrong answer only\"  \n\nSee how long until a friend of theirs let them know about it.",
   "created_utc": 1701527978,
   "score": 37,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbounol",
   "message": "Loving all the revenge comments, but since you’re 16 and can’t move out - get a good set of noise reduction headphones and listen to music. \n\nGagging at the thought of family members having loud sex over here.",
   "created_utc": 1701530694,
   "score": 27,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbox6du",
   "message": "NTA. Inconvenience them back. Bang on that wall. Make exaggerated noises back. Yell at them to shut up, you're trying to sleep. Put a speaker against the wall and play Crazy Frog. No one can fuck to Crazy Frog. \n\n Whenever your ma gets mad at you for bringing it up *again*, simply tell her that it has now become everyone's problem and until it gets resolved, you will not shut up. You have done your best to politely and respectfully get them to stop, but they won't. And you're right, it's your house too. Unfortunately, with your parents downstairs and you being the one who shares a wall, it affects you the greatest and your ma might even think you're exaggerating or overreacting to something she may believe you don't yet fully understand. Use your phone to record how noisy they are and play it for your mom. Personally, I'm petty enough that I would do it at the breakfast table for everyone to hear and embarrass the shit out of her, but Idk your family dynamic.\n\nIf your parents still have an issue, just say, \"Ok, but when my grades start suffering due to lack of sleep, don't come crying to me.\"\n\nYou know that vine with the lady banging pans together going, \"I'm not gonna get no sleep cause of y'all, y'all not gonna get no sleep cause of me?\" Yeah, do that. Not while they're fucking, wait til they settle down after and get quiet and you know they're sleeping or about to be. THEN get the pans.",
   "created_utc": 1701531802,
   "score": 17,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbpwoq7",
   "message": "Your parents suck",
   "created_utc": 1701546283,
   "score": 7,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kboxieh",
   "message": "#Record it and play it back 100× louder when she's trying to sleep. Or when Grandma is visiting.",
   "created_utc": 1701531949,
   "score": 23,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbotwh1",
   "message": "My mom would beat my ass if I did that wtf. Like I couldn't even have a guy in my room with the door open.\nTry putting nuclear alarms for sirens instead of music. They may end up liking the music.",
   "created_utc": 1701530358,
   "score": 16,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbowqqv",
   "message": "Record it and play it to your parents. Ask them to change room and include your other sister who’s also bothered by this in the conversation. Two versus one, so they have to go with the majority. Set up a big camp in the living room the two of you and make noise each time it happens so your parents are bothered and will focus then on finding a solution. Yes, you will be tired, but you will be getting results. It is a situation worth being petty. Good luck!",
   "created_utc": 1701531610,
   "score": 7,
   "submission_id": "189409k"
  },
  {
   "comment_id": "kbqfesz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "189409k"
  }
 ]
}