{
 "submission_id": "1895hov",
 "title": "AITAH for taking banking access away from family?",
 "selftext": "For detail, my mother opened mine and my sister’s bank accounts at a 11 (me) and 16 (sister) to start us a banking and savings account. Because of this my mother and sister could see how much I had in the bank, and vis versa. \n\nI started my first job at 17 and saved most the money I had to save up for college and continued to do so my first two years of community college because I received scholarships and went for free. When I started going to a four year college is when I had to start paying for tuition and such. \n\nBefore my first semester at this four year college came the bill which I was going to pay from my savings account. I knew I had plenty to be able to pay it no problem. I went into my savings account and noticed that $1,000 had been taken out and moved to my sister’s account. Looking further into it I noticed that transactions had been made for a couple of months and almost $4,000 had been taken out and moved to my sister’s account. \n\nI looked at her bank account and she had overdraft costs the same months money was taken out of my savings. At the time I was too nervous to ask my sister why she was taking money out of my savings account. So instead of talking to her I went to the bank, asked to change who had access to my account, and ended up closing that account and moving my money into a new account. \n\nA month or so went by and my mother calls me asking why she couldn’t see my account anymore. I told her the situation about my sister taking money out of my savings. She said she knew my sister was doing that and thought it was no big deal. Each of us had our own banking and savings account so I told her I wasn’t okay with her taking money out of my saving. If she would have reached out to me and ask it might have been a different story. \n\nFast forward to today and they both bring it up at when they are having hard times with money. So, AITAH?",
 "created_utc": 1701529208,
 "permalink": "/r/AITAH/comments/1895hov/aitah_for_taking_banking_access_away_from_family/",
 "score": 1,
 "url": "https://www.reddit.com/r/AITAH/comments/1895hov/aitah_for_taking_banking_access_away_from_family/",
 "comments": []
}