{
 "submission_id": "18964xw",
 "title": "AITAH for staying silent during an intimate moment when my gf said “Mine’s the best p… you’ve ever got.”?",
 "selftext": "Both 30, together for a few months, things are going well except for some issues she has with the fact that I’m friends with my ex from 8 years ago. I’m not in love/infatuated with my girlfriend yet, but she’s the sweetest.\n\nShe is very kinky (BDSM, toys, lingerie, films herself for me when I’m away, doing it in public, can go an entire night) but also very monogamous and only had serious relationships. I used to be very promiscous, though, I’ve had orgies and open relationships but she still jokes about me being the vanilla one in bed.\n\nToday while we were doing the deed, she got very turned on and said something (talking dirty is very normal for us). She said: “Since our first date when you f…ed me raw I knew mine was the best p..ssy you’ve ever been inside of, isn’t that so?”\n\nI didn’t wanna lie to her but 5 years ago I was very in love with a girl with whom I had the best sex, but I had to break up with her because I wanted kids eventually and she had… let’s say a lot of issues with substance abuse and mental health and almost cheated. She also used to let me do it with other women (which I’m not going to expect from my gf and that’s fine).\n\nObviously my gf noticed it and I can tell she’s still sad.",
 "created_utc": 1701531095,
 "permalink": "/r/AITAH/comments/18964xw/aitah_for_staying_silent_during_an_intimate/",
 "score": 14,
 "url": "https://www.reddit.com/r/AITAH/comments/18964xw/aitah_for_staying_silent_during_an_intimate/",
 "comments": [
  {
   "comment_id": "kbp0e0p",
   "message": "Yeah if you can't tell, that's not really a situation that calls for honesty.  She isn't publishing a paper.  \n\nLeave the academic integrity out of the bedroom.",
   "created_utc": 1701533187,
   "score": 107,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpgv0k",
   "message": "It’s called dirty talk dude, you think you’re the best dick she’s ever had? Hahaha",
   "created_utc": 1701539893,
   "score": 126,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp3b53",
   "message": "Reverse the roles.  \n\nYou say, mid coitus, \"Mine's the best, isn't it.\" \n\nShe responds, while still on her back with her legs open for you, \"No, actually Tommy's was bigger, Oliver really knew how to work it, Roy knew how to tease me until I was begging him for it, and Barry glazed me like a donut. But you'll do in a pinch or until I'm infatuated.\"\n\nTalking dirty in bed isn't about having an entirely truthful conversation.  It's about joining in a shared fantasy.  You broke the fantasy and, accidentally, revealed how you really feel.\n\n\u0026gt;I didn’t wanna lie to her but...\n\nThat's noble but have you told her that you're not even infatuated with her yet?",
   "created_utc": 1701534424,
   "score": 184,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp41o9",
   "message": "\u0026gt;“Since our first date when you f…ed me raw I knew mine was the best p..ssy you’ve ever been inside of, isn’t that so?”\r  \n\r  \nI didn’t wanna lie to her but 5 years ago I was very in love with a girl with whom I had the best sex...\\[s\\]he also used to let me do it with other women...\n\nWhat does this comment about your ex have to do with the question your current gf asked? I know there was more to your comment about your ex, but I'm trying to understand if you think it being an open relationship is relevant to the question at hand.",
   "created_utc": 1701534735,
   "score": 202,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp6bim",
   "message": "YTA. Set her free so she can find someone who's actually in love with her and wants to be monogamous. You don't. You think she's \"sweet\" and bemoan the fact that she doesn't want you to fuck other women. Imagine if you were really into a woman and she made this post about you on Reddit with the roles reversed. You'd be hurt. Do her a favor and cut it off.",
   "created_utc": 1701535671,
   "score": 1,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp3are",
   "message": "You are 30 and can't lie?",
   "created_utc": 1701534420,
   "score": 160,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpag90",
   "message": "YTA - I don't think you are into this girl.  If you were, you would have responded differently to her comment.  Let her go so she can find someone who is into her.",
   "created_utc": 1701537345,
   "score": 195,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kboymfp",
   "message": "It’s been months and you’re not even infatuated with her yet? I don’t think YTA but maybe that’s something to explore.",
   "created_utc": 1701532428,
   "score": 30,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp6f57",
   "message": "It sounds like you’re not being fully honest with her or with yourself and it came out in a pretty rude and humiliating way. I think you owe her an apology at a minimum. What would be even better is if you worked on managing the depression. Iv’e been there before and it’s awful, like trying to climb out the bottom of a cold slippery well. But for real think in your connection with her, what makes connections deep/meaningful to you, and proactively cultivate a relationship more meaningful than ignoring your psychosocial issues with sex.",
   "created_utc": 1701535713,
   "score": 31,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp3c3y",
   "message": "YTA.  This was not a question that needed to be answered honestly.",
   "created_utc": 1701534435,
   "score": 59,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpn6sl",
   "message": "YTA It's sex talk. You're not in the witness stand under oath. If a girl asks you if hers is the best pussy you've ever had, you say yes.\n\nAlso, I don't buy that any woman actually used the phrase \"isn't that so?\" in bed. That makes me think this story could be fake.",
   "created_utc": 1701542422,
   "score": 76,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpulsy",
   "message": "YTA. OP likes to have a girl and still screw other women.....and still says his ex almost cheated while he's sleeping around ....not sure why monogamy is a thing when he's not into that and this girl is all about relationships......seems he's only loving women who allow him to screw around......sucks man.....even with the best P your ex gave you ...you still wanted to be with others. You're just with this girl for sex...move on of it's not the best. Go live in the past.",
   "created_utc": 1701545433,
   "score": 69,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpg9h6",
   "message": "If you don't love her or are not infatuated with her why do you stay with her?",
   "created_utc": 1701539657,
   "score": 23,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpld46",
   "message": "YTA -  It is called sex talk. People say all kind of shit during it.",
   "created_utc": 1701541693,
   "score": 22,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpkj8d",
   "message": "YTA ,dirty talk doesn't have to be factual .",
   "created_utc": 1701541356,
   "score": 19,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpxi7y",
   "message": "From this we can all tell you’re bad in bed and not that into her.",
   "created_utc": 1701546619,
   "score": 16,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpjtqm",
   "message": "You do realize the woman you had “great” sex with was probably so great because it was the only time you felt like you were actually getting your needs met in the relationship. People always talk about how great sex with their toxic partners was, and this is the psychology behind it. Also, YTA.",
   "created_utc": 1701541072,
   "score": 17,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq5e3i",
   "message": "YTA. When your partner asks that question you say yes. Every idiot knows that. Congrats on probably blowing up your relationship over some sex you had 5 years ago, i hope the memories you'll jerk off to once your girlfriend breaks up with you are worth it.",
   "created_utc": 1701549797,
   "score": 15,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpjon5",
   "message": "I say let your gf go so she can find the one who will love her. \n\nAlso, the x (from 5yrs ago) you're still hung up on/love you have no idea if you actually like HER. During  the duration of your relationship her mind/personality was being influenced or impacted by drugs. Technically, how do you know it was HER you liked or was it the persona/illusion created from her drug usage?",
   "created_utc": 1701541016,
   "score": 14,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq5hbq",
   "message": "YTA, turn her loose; you're just not that into her.  And just a little life tip, the best pussy and/or dick you have ever had is who you are fucking right now. Do the statistical analysis at a later date if you feel so inclined. But it the moment, just say \"you are.\" SMH.",
   "created_utc": 1701549834,
   "score": 11,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp7f9u",
   "message": "Just came here to say use condoms people. First date fucking people raw? Ever heard of STDs….any way. It’s ok to Lie sometimes. She wasn’t looking for a play by play of past relationships to see if she was the best.",
   "created_utc": 1701536121,
   "score": 27,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqcz1y",
   "message": "Men will lie to your face about actual cheating but in moments like that all of a sudden they are full of integrity and can’t lie",
   "created_utc": 1701552855,
   "score": 20,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqbynk",
   "message": "\u0026gt;with the fact that I’m friends with my ex from 8 years ago. I’m not in love/infatuated with my girlfriend yet, but she’s the sweetest.\n\n\u0026gt;5 years ago I was very in love with a girl with whom I had the best sex\n\nYTAH for those comments alone.",
   "created_utc": 1701552449,
   "score": 9,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqk6x0",
   "message": "You claim you have a very promiscuous past but you have no idea how to navigate dirty talk? Yes, YTA. Who the hell cares if your ex was the best lay you ever had. If you're in the middle of sexy time and your GF claims her 🐈‍⬛️ is the best you've ever had, you agree and then you show her how much you like her 🐈‍⬛️ by jackhammering the hell out if it. Or, or, you could avoid answering the question entirely by telling her that you'll show her how much you like her 🐈‍⬛️ and then proceed with the jackhammer. It's dirty talk, not 20 questions. 🤦‍♀️🤦‍♀️",
   "created_utc": 1701555803,
   "score": 8,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpcw8d",
   "message": "YTA.  It’s called a little white lie.",
   "created_utc": 1701538325,
   "score": 15,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpdmdx",
   "message": "This is when you should absolutely lie and say \"oh yeah, baby.\"",
   "created_utc": 1701538611,
   "score": 7,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp2dad",
   "message": "Sometimes, it’s okay to lie. This is one of those times. \n\nAlso - not infatuated with her yet and still friends with your ex (which has caused problems but you’ve not changed anything). Maybe you need to work out what that actually means.",
   "created_utc": 1701534030,
   "score": 13,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbppguy",
   "message": "Everybody says shit in the bedroom. You’re just supposed to agree. You fucked up buddy.",
   "created_utc": 1701543344,
   "score": 6,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq8fym",
   "message": "Why are you with this woman if you don't have any feelings for her beyond \"she's the sweetest\" and it's very clear she's feeling a lot more and acting on that? you're pretty much enjoying what she's giving but not meeting her half way.. which is pretty AH/selfish on your part.\n\nyou're also really scattered everywhere when it comes to sex and emotions and the difference between these two.  so maybe stop putting your dick in everything and get a better grip on these areas of yourself and what you actually want before getting involved and indirectly using/misleading others in the process.",
   "created_utc": 1701551025,
   "score": 7,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq9dh8",
   "message": "AH is too strong for you\n\nI think jack@$$ is more in line with your behavior .\n\nThat is a question that nobody in their right mind really wants the answer to .\n\nTell her she’s the best and enjoy the reaction",
   "created_utc": 1701551409,
   "score": 7,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqqukb",
   "message": "You’re not an asshole , you’re an idiot",
   "created_utc": 1701558580,
   "score": 7,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqrq6x",
   "message": "YTA\n\nHonestly you seem immature, inconsiderate, and unaware of the basic needs and desires to be fulfilled in a loving relationship.\n\nEven your question is written as a humble brag about how experienced you are. My eyes are audibly rolling.",
   "created_utc": 1701558954,
   "score": 5,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbown8q",
   "message": "[deleted]",
   "created_utc": 1701531567,
   "score": 21,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpyshj",
   "message": "YTA. Dirty talk is not where you need to be honest. Literally no gain at all for both sides from that kind of honesty.",
   "created_utc": 1701547143,
   "score": 4,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq2zxc",
   "message": "Dumb fuck 💀",
   "created_utc": 1701548815,
   "score": 5,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqc5b6",
   "message": "YTA Let her go",
   "created_utc": 1701552522,
   "score": 5,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqcap7",
   "message": "You’re an idiot",
   "created_utc": 1701552582,
   "score": 6,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqez6u",
   "message": "It's dirty talk dude, you aren't under oath. Tell her what's going to get her off. Jfc imagine having this whole ass inner monologue during sex.",
   "created_utc": 1701553664,
   "score": 6,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqgx22",
   "message": "DUUUDE.  There is honesty and then there is stupidity.  Next time say yes and move on.",
   "created_utc": 1701554459,
   "score": 4,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq4n64",
   "message": "YTA - If you aren’t infatuated with her after a few months, you probably never will be. You know this. You’re leading her on and keeping her around because she’s the best option “at the moment.” You like the sex and you probably even like her, but not enough in the way that matters. She should know that. Let her go.",
   "created_utc": 1701549490,
   "score": 5,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqdxti",
   "message": "Dude it’s dirty talk, say something back that’s hot and dirty. Like why even think about the “truth” it’s just being in the moment.\n\nOmg \n\nYTA",
   "created_utc": 1701553243,
   "score": 4,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqelg2",
   "message": "Well, at least you didn't tell her that she's definitely in the top 10.",
   "created_utc": 1701553509,
   "score": 4,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr14tp",
   "message": "Yta it’s merely sex talk, in the moment we all say some nonsense",
   "created_utc": 1701563056,
   "score": 4,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpriad",
   "message": "You know how I really feel about someone romantically when I describe how I feel about them and say they are “the sweetest.” \nYTA I would let her find someone who is really into her and doesn’t condescend while talking about her. (I don’t know her but I’m going to guess you’re not the best she’s ever had either, she was just being really sweet saying that)",
   "created_utc": 1701544191,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbptpva",
   "message": "Soft YTA only bc you were completely silent. Say something!! That was awkward to read and if I were the girl, I’d probably ghost out of embarrassment",
   "created_utc": 1701545078,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq2bpz",
   "message": "Dude, YTAH. It was just dirty talk. She wasn't asking for a dissection of all past pussy. Also, way to throw in the \"crazy women are the best in bed\" trope 😒 YTAH just for that.",
   "created_utc": 1701548542,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq3mf2",
   "message": "Dude, YTA. Just fuckin agree with her.",
   "created_utc": 1701549073,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq4rk5",
   "message": "YTA bro it’s called lying to validate your partner. Men and women have been doing it since they beginning of time.  You should’ve instantly said “Fuck yes it is”",
   "created_utc": 1701549539,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq5chq",
   "message": "why would you admit to being this shit lol, just go \"mmm yeah\" sorted, fuck me she's not checking your sources, grow up",
   "created_utc": 1701549779,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq6adp",
   "message": "why are you even dating if you dont like her in the first place? lol leave her alone she deserves a man who knows what dirty talk is about and not someone whos just gonna destroy her self esteem permanently just because u cant figure out ur own feelings",
   "created_utc": 1701550157,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq9lup",
   "message": "\"I’m not in love/infatuated with my girlfriend yet, but she’s the sweetest.\"\n\nBro. Do her a favor and breakup with her ASAP so she can find someone who is actually worth her time.",
   "created_utc": 1701551506,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqcfap",
   "message": "Just tell her what she wants to hear. It's all fantasy talk anyway.",
   "created_utc": 1701552633,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqejzw",
   "message": "dude just say yes omg. no need to get critical and deep into thought about it.🤦🏽‍♀️",
   "created_utc": 1701553493,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqfujw",
   "message": "My rule is whatever vagina I'm currently in is by default the best pussy.... \nOP definitely the moron in this situation...",
   "created_utc": 1701554016,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqgwsm",
   "message": "\"Fuck yeah bitch i love your pussy\"  was the appropriate response",
   "created_utc": 1701554456,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqhg77",
   "message": "Are you dumb? The answer is yes, if you actually like this person. You're 30, you should know this by now.\n\nYTA, obviously.",
   "created_utc": 1701554675,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqhiyl",
   "message": "Yes you lie. Yta.",
   "created_utc": 1701554707,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqnbnl",
   "message": "The only correct answer is yes. It’s the same for when a guy asks if his dick is the best.",
   "created_utc": 1701557091,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqp2es",
   "message": "You’re vanilla af if you don’t know how to dirty talk! This your first rodeo with a real girl? You been in silent era orgies? Y’all take lie detectors while mid coitus? Is this real? Are you stupid or something?",
   "created_utc": 1701557820,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbquk16",
   "message": "Dude.\n\nThat one's gonna fester, and I can tell since you're polling here you didn't run damage control even remotely right. You hit her in a very private place inside, and I hope it bounces back.\n\nShe's always the best, most beautiful, greatest lover, best cook, etc. Period",
   "created_utc": 1701560175,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqvsp8",
   "message": "i’d break up with you immediately. this literally made me sick to read. poor girl needs to find a man who actually loves her.",
   "created_utc": 1701560716,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqygni",
   "message": "OP, some people are not going to leave you no matter how cruel you are to them. Resist the urge to keep her just because it’s convenient that she won’t go anywhere. Break up with her and let her find something better. No need to be casually cruel. \n\nYTAH",
   "created_utc": 1701561890,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqz708",
   "message": "Just lie? Like what do you get from embarrassing her??",
   "created_utc": 1701562209,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqzg8b",
   "message": "it was dirty talk... 🤦‍♀️",
   "created_utc": 1701562324,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqzo2j",
   "message": "Look just say yes…she may be lying about your dick being the best, but that’s how it works.",
   "created_utc": 1701562423,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr20bg",
   "message": "Maybe she wasn’t the best p**** you ever had but you were probably the worse dirty talker she has ever had lol the bedroom is about having fun. One of my flings and I use to say wild shit to each other, as much experience you’ve had you sound like a dud here",
   "created_utc": 1701563421,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr2d3m",
   "message": "Time for this woman to find a new lover",
   "created_utc": 1701563572,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpa5nr",
   "message": "Are competing for a prize in honesty or something ?! This was the worst moment to tell the truth. You very likely permanently damaged her sense of self while with you. How does one even overcome being told by their partner that they’ve had better…DURING intimacy. I think you don’t want her to like you too much, because you already know you’re not into her. You’re likely just using her as a placeholder until you find someone else. Because no genuine person is going to knowingly hurt someone they care about. You’re holding out or waiting for someone else and you know it. YTA.",
   "created_utc": 1701537224,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpe0br",
   "message": "What exactly constitutes the best pussy anyway? Is it like, the way the pussy feels, or how hot she is, or what?",
   "created_utc": 1701538765,
   "score": 5,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp9v5f",
   "message": "I think Admiral Akbar said it best……….",
   "created_utc": 1701537107,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpov63",
   "message": "Darling…. Darling… darling… lie. Yta",
   "created_utc": 1701543102,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpppm0",
   "message": "I would have lied. This is one of those moments where it’s ok to lie to your gf lol",
   "created_utc": 1701543446,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpqdq0",
   "message": "Red foremans favourite word came to mind when I was reading this.",
   "created_utc": 1701543723,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpurxh",
   "message": "Lying is ok sometimes, dude….",
   "created_utc": 1701545504,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpxtbf",
   "message": "I'm a big fan of honesty in a relationship at all times. With that being said, this is a perfectly ok situation to lie. You should have lied your ass off, unless you'd appreciate it if she told you she's been with better guys with better junk. AH.",
   "created_utc": 1701546743,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqm4dj",
   "message": "You ruined the moment and crushed her self esteem at the same time. Amazing example of efficency. The best pussy is always the one you are playing with at the time. You may think you have had better in the past, but this is wrong because it's in the past and you don't have it right now.",
   "created_utc": 1701556592,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqpq1y",
   "message": "YTA. You're supposed to play along because you're in the moment, dirty talk. It's oblivious and dumb of you to react how you did.\n\n\n\n\n\n\nYou strike me as one of those people who needs the punchline of a joke explained.",
   "created_utc": 1701558098,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr5fw6",
   "message": "Go along with it",
   "created_utc": 1701564918,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr5nwl",
   "message": "YTA because obviously dirty talk doesn't need to be answered super honestly lmao.\n\nBut the bigger issue here is that it seems like you aren't that into your girlfriend... If you aren't infatuated now, I don't think you ever will be.",
   "created_utc": 1701565019,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr5o0u",
   "message": "Lie next time dumbass",
   "created_utc": 1701565020,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr5yt1",
   "message": "Bro just say “fuck yeah” why are you being the “Um, acktually” guy right now lmao",
   "created_utc": 1701565154,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr60ju",
   "message": "Lol…..I know it flew over your head but the only answer should’ve been “yes yours is the best I’ve ever had” \n\nIf there’s a time to expand the truth it’s then my guy lol🤦🏽‍♂️\n\nGo make it up to her and stop the “honesty” hour in the bedroom 😂",
   "created_utc": 1701565176,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr60uk",
   "message": "GF: does this dress make me look fat?\n\nOP: No. But your giant stomach and fat ass do.",
   "created_utc": 1701565180,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr6ai6",
   "message": "Just nod your head and smile, not that fucking hard to do.",
   "created_utc": 1701565302,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp330d",
   "message": "Do you lose anything by saying yes? Open relationship is crazy though. \n\nNo downsides of saying yes so why didn't you.",
   "created_utc": 1701534330,
   "score": 4,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbphyqp",
   "message": "I hope she tells you about her ex big dick tom next time. \n\nYes YTA. That wasnt you swearing an oath at the stand, that was a way to connect with your very present, real and currently in your life gf.",
   "created_utc": 1701540332,
   "score": 3,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp0493",
   "message": "You should have told her its actually her moms that is the best",
   "created_utc": 1701533072,
   "score": 2,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbp1tly",
   "message": "NAH, Y'all very different i don't see this for the long run",
   "created_utc": 1701533798,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpp5ry",
   "message": "🤦🏻‍♂️",
   "created_utc": 1701543220,
   "score": 1,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr2erx",
   "message": "did you really need to tell everyone that you fucked her on the first date or that your ex “let you fuck other women” ??? oh and yeah YTA",
   "created_utc": 1701563592,
   "score": 1,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq8q8i",
   "message": "Why? Just why didn’t you just say yes?  Are YTA? Not really. Are you an idiot?!  Unquestionably. Bro? Seriously?",
   "created_utc": 1701551143,
   "score": 1,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqz0cj",
   "message": "When you’re in the moment and someone says something like that, and you’re not naturally a liar, it’s easy to stumble, fumble or go silent.\n\nI cant stand lying, even if it makes the other person sad and it tends to be a fault with me, because it seems every other partner I’ve had asks the same question. Personally, I’d rather not know if I am ‘the best ever’, and just trust that they’re enjoying it with me.",
   "created_utc": 1701562127,
   "score": 1,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqpxqu",
   "message": "But why lie to her when she is obviously putting him in a shit position with a trap ass question\n\n\nEdit.:     run dude. Or if you wanna save it.  Have some serious communication about this and how it's not ok.. how would she feel if you asked her if you had the biggest dick she's ever had. And she knows it's not",
   "created_utc": 1701558190,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqx2kj",
   "message": "NTA. She should never say anything, dirty talk or not, that could lead to hurt feelings during sex. Just my opinion.",
   "created_utc": 1701561272,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpraja",
   "message": "She clearly is not the person you are going to marry so no reason to give her a big head about it.",
   "created_utc": 1701544102,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbpvv74",
   "message": "Isn’t it odd, though, that she didn’t tell you that you were the best she ever had?  She expressed it as “when we fucked so hard I knew **I** was the best **you** ever had.”  That’s an oddly narcissistic way to express enthusiasm for sex with your current partner, isn’t it?\n\nThat’s weird enough to me that I’m almost inclined to give OP a pass for having to think about it for a second.",
   "created_utc": 1701545948,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq4bfd",
   "message": "Well, you already blew it so now you get to apologize. Just say you were thrown off because all you were thinking about at that moment was HERS, and suddenly you were asked for a comparison. \nYou can be honest in saying \"I have great sex with you, and I've had great sex with someone else, but I can't really say what's best; I don't think that way. All I want to think about right now is YOURS.\"\nYou may also want to point out that it doesn't sit that well with you when she jokes that you're the vanilla one. Your kinks are just different.",
   "created_utc": 1701549358,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqg817",
   "message": "She's not going to hunt that one specific ex, and tell her.  \"HA HA, bitch.  He said my pussy is the best he's ever had.\"  Should have just humored her and said \"hell yes\". Now you might not get that chance again.  Here's my suggestion.   When she's in the living room or kitchen or wherever, walk up, grab her by the throat, shove your hand down her pants, look her in the eyes and say \"Best pussy ever, and it's mine\".  Might be the start of something magical.",
   "created_utc": 1701554170,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqsx9t",
   "message": "NTA \n\nI don’t understand why almost every woman seems think their particular equipment is so special or unique. \n\nThey think it’s some kind of flex to tell guys “either you do this you’re not getting any of that anymore“ \n\nOK, that sucks but there’s only tens of millions of other women out there in this country within my age range, all with the exact same thing you have down there. 🤷🏻‍♂️",
   "created_utc": 1701559477,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqxz5k",
   "message": "Women don't want the truth, they want to be told what they want to hear.   \nThe sooner you learn this, the better your relationship will be.",
   "created_utc": 1701561675,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqyec9",
   "message": "Literally the only time someone should ask their partner if they were the best pussy/dick the other has ever had is if they know definitively that they are the ONLY pussy/dick their partner has had.  Otherwise you are setting yourself up for disappointment.",
   "created_utc": 1701561862,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbqzdbf",
   "message": "Might want to reconsider this girl for many reasons , you want the mother of your kids be someone you raw dogged on first date?",
   "created_utc": 1701562287,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr2k2k",
   "message": "Nta\n\nIts a weird question too ask, but i probably just would have said yes to not make it awkward. \n\nPersonally her saying that too me would turn me off. Shes asking because shes insecure. I think a reasonable thing to do would be to deflect and tell her your not dealing with those type of questions (similar too \"do i look fat in this dress\"). They are just trap questions and your feeding the insecure monster and making ot grow",
   "created_utc": 1701563655,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr3phc",
   "message": "Don’t ask questions that you can’t handle the answer to.",
   "created_utc": 1701564156,
   "score": 0,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbq66ea",
   "message": "NAH\n\nShe set herself up for that.. Don’t ask questions you can’t hear answered truthfully.\n\nYou did nothing wrong. Her being upset is human, doesn’t make her an asshole. She got pleasure from thinking of herself as the best but was embarrassed that you did not feel the same.",
   "created_utc": 1701550113,
   "score": 252,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kboxpmp",
   "message": "No and she needs to grow up. Sex isnt a competition",
   "created_utc": 1701532037,
   "score": 230,
   "submission_id": "18964xw"
  },
  {
   "comment_id": "kbr41fl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18964xw"
  }
 ]
}