{
 "submission_id": "1896qza",
 "title": "AITAH for saying No to my GFs Christmas puppy?",
 "selftext": "My gf(f26) and I (m26), 2 years together, had an argument about her receiving a puppy for Christmas from her mom. \n\nFor context, her and I had an “informal non-sitdown”-her words, conversation about why another dog/puppy would not be good for us in our current situation roughly 4 weeks ago. We both work full time and I go to school full time while she is doing classes online. We currently have a dog, live in a 750sqft apartment and work 12 hr shifts in the medical field. She walks the current dog until he pees and poops and then straight back inside, that’s it. Once every few months she’ll take the dog to the beach. \n\nMain:\nWe got home from work and was excited to tell me some huge news, “my mom bought me a puppy for Christmas”. I could have reacted differently and been better about how to handle it but immediately I thought about our informal talk about not getting another dog and said “no we talked about this” “we agreed this wouldn’t be good for us” “we dont have the time and money for a puppy”. Not very open of me and I could have handled it differently I’ll admit. She said I was “raining on her parade” and being “very negative”. She gave me the silent treatment and ignored me for 1.5 hours. \n\nShe came over to me ~9:30pm and said she’s ready to talk, I said I was tired needed to be up early and asked if we could talk about it tomorrow. She pushed and said she wanted to talk about it now and I said ok. It started good, us apologizing to each other for our approach and said some of our feelings. It got worse fast, she said I was being unfair because I wasn’t taking into account how she feels, she wants the puppy and it would make her happy. Then she said “its not my decision, my mom did it not me” and “i didn’t choose this, its an innocent gift and I cant let a puppy who needs a home go without one”. \n\nMore context info; her mom has been controlling and manipulating her all her life. She admits this and I’ve seen it first hand. She wont stand up to her mom ever. \n\nSo I said “your mom is making decisions for the both of us and our relationship and im supposed to be ok with that?”. She reiterated that its not her fault her mom did this and shes just trying to have a discussion with me about it. Then she threw in that her mom bought the puppy already and is picking it up in a few days. She asked what I wanted from her, “you want me to tell my mom no?”and texted her mom “bf is worried about puppy but I am excited”. \n\nSounds to me like a decision has been made for our relationship and she’s throwing her hands up and saying its not her fault. Doing nothing is still a decision. Less than 24 hrs isnt enough time for me to say yes to imo a very big decision. Where is the line? How many decisions can her mom make for us before gf says no? Hypothetically, how many puppies could she gift us before gf says no?\n\nAITAH?",
 "created_utc": 1701532933,
 "permalink": "/r/AITAH/comments/1896qza/aitah_for_saying_no_to_my_gfs_christmas_puppy/",
 "score": 185,
 "url": "https://www.reddit.com/r/AITAH/comments/1896qza/aitah_for_saying_no_to_my_gfs_christmas_puppy/",
 "comments": [
  {
   "comment_id": "kbp0m1l",
   "message": "NTA- Mom hasn’t picked up the puppy yet so still time to back out. Any reputable place would fully support this especially as the puppy is a surprise gift. \n\nYour girlfriend needs to set clear boundaries with her Mother.\n\nGiven both of your schedules, it wouldn’t be fair to the puppy or you to take this on now",
   "created_utc": 1701533281,
   "score": 62,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp30li",
   "message": "NTA, no one should EVER give a pet as a gift (unless it's already agreed upon with the recipient).  This is something every mother should know",
   "created_utc": 1701534302,
   "score": 77,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp4i6z",
   "message": "NTA but it’s clear that this is a problematic relationship. What I see in your post is she communicates one thing, does the opposite, and acts like you took it too far or aren’t having a good faith discussion. Nah we did that already and y’all wouldn’t be having this talk again if she held. up. her. end. \n\nAs a fellow dog owner I validate your analysis and conclusion that getting another dog isn’t just untenable but maybe unethical, given that your current dog gets to exist outside only for bathroom breaks and goes on normal walks on a once per quarter basis. \n\nMy experience with people like this is you have to be firm. They will push back just like a kid whining about the consequences they knew they’d face. So you gotta be loving and firm and say “we talked about this and the answer is no. And it’s not just about the puppy, about respecting our boundaries and limitations, it’s about good communication. I’m sorry but if we can’t hold to our agreements then I’ll have to go my own way.”",
   "created_utc": 1701534925,
   "score": 45,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp6q9x",
   "message": "Oh this relationship is going to be fun. I can’t wait till your GF decides a baby/another baby is just what you need when you’re having trouble paying the mortgage and have no time or money for child care.",
   "created_utc": 1701535840,
   "score": 30,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbphhek",
   "message": "WHEN!! Are people going to stop gifting pets without consent!!!!  Mother is a big jerk for doing this!! How inconsiderate! You need to stop this right now, you already have a dog you feel guilty about. Nothing good will come of this.",
   "created_utc": 1701540140,
   "score": 21,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp8mbl",
   "message": "\u0026gt;We currently have a dog, live in a 750sqft apartment and work 12 hr shifts\n\nWho, in their right mind, thinks that getting a puppy working these long shifts is a good idea?   \nHopefully your schedules aren't set up so that there's a 12 hour absence from the home; even still, you're gonna be saddled with a puppy that you don't want. How is that fair to you? \nNTA.",
   "created_utc": 1701536609,
   "score": 16,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp7niz",
   "message": "NTA\n\nI keep hearing about Christmas puppies and it is the most ridiculous, almost obscene concept I have ever come across. \n\nGetting a puppy is a huge financial, emotional, and resource intensive commitment. The first year of a puppy's life is insanely difficult and the investment should be taken with the utmost seriousness.\n\nMay I suggest getting your MIL a foster child for Christmas.",
   "created_utc": 1701536214,
   "score": 16,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpp1mm",
   "message": "Dude, you need to mirror it all back to her.\n\n*she said I was being unfair because I wasn’t taking into account how she feels*\n\nYou aren’t being fair to ME, and aren’t taking my feelings in to account - we agreed no puppy, how am I the bad guy?\n\n*its not my decision, my mom did it not me*\n\nThen let your mother live with the consequences of her actions.  The puppy lives with her and you can visit it.  We agreed no puppies HERE.\n\n*“i didn’t choose this, its an innocent gift and I cant let a puppy who needs a home go without one”*\n\nIt will have a home with your mother.  If she didn’t want a puppy, she shouldn’t have bought one without asking, first.  We agreed NO PUPPY!  Why does your mother have any say in this?\n\nThe reality, dude, is she wants the puppy, conspired with her mother to steam roll you, and doesn’t care what you want.  She learned well from her mom, and even if her mom were out of the picture, you’d STILL be living with her.\n\nYou are with a ‘mommas girl‘.  As hard as it will be, you need to look at your relationship with ‘strangers’ eyes, and reassess.  I doubt this is the first time stuff like this has happened.",
   "created_utc": 1701543173,
   "score": 13,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp8l32",
   "message": "NTA.\n\nI would say your current dog needs rehoming. You are not giving it a good life.\n\nAnd you most definitely are not in a place to take in another dog.",
   "created_utc": 1701536594,
   "score": 20,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp0rtv",
   "message": "NTA - you barely have time for your current dog, throwing in another dog will just neglect the current dog even more. It is a 10+ year commitment so to let her mom make that decision is ridiculous, it's not like you 2 openly stated that you wanted a puppy and are actively looking for one. Her mom didn't pick the puppy up yet so it's not like they put the puppy down if she decides to not take the dog. I would confront her in a way she realizes that her mom is making decisions in BOTH of your lifes throwing her hands up and say \"there is nothing i can do\" is not the right approach for that. Just tell her that the current dog is already neglected and her \"feels\" that a new dog could make her happy are not relevant because the puppy will suffer the most. Puppies need a lot of care and want to be active / destroy stuff / then you have the potty training (a puppy won't hold it in for 12 hours lol) not to mention that the puppy won't get much exercise and could potentially become aggressive because he has no outlet whatsoever.",
   "created_utc": 1701533350,
   "score": 8,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp9fmz",
   "message": "You’re neglecting the dog you have now. You and your girlfriend don’t have the bandwidth for another one. It would be cruel to both dogs.\n\nThe bigger issue is that you will be steamrolled by your girlfriends mother. GF has no boundaries. Think hard how this will be if you have children together.",
   "created_utc": 1701536934,
   "score": 7,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpf37a",
   "message": "NTA. Your current dog doesn't get enough attention. She thinks there's time for a puppy?  Poor puppy.",
   "created_utc": 1701539196,
   "score": 5,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpf5hg",
   "message": "Your girlfriend doesn't get to make this decision. Pets are a \"both partners have to agree\" thing.\n\nI would find it concerning that she is both under her mother's thumb, and that she prioritizes that over you.\n\nNTA. It would also be very sad for that puppy.",
   "created_utc": 1701539222,
   "score": 5,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpi1mt",
   "message": "[deleted]",
   "created_utc": 1701540362,
   "score": 4,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbppmox",
   "message": "Any reputable rescue or breeder would not allow someone to purchase a puppy as a gift for someone else (without the gift recipient talking to the breeder/rescue and verifying the quality of the home and fit with the puppy). A reputable rescue/breeder also would not send a puppy into a home where every resident is not on board with the puppy. That's the first red flag. Second red flag is: living animals aren't gifts. They are living things that require long-term financial, emotional, and time commitments. Your gf is at best being manipulated and doesn't understand how buying puppies goes. At worst this was a plan to get a puppy without your consent.  \n\n\nThe puppy is likely coming from a pet store/puppy mill situation. I promise that if her mom does not complete the purchase/pick up of the puppy, another poor sucker will come and take it. Sure, every animal deserves a home, but that home doesn't need to be with her and you.\n\nETA: NTA",
   "created_utc": 1701543412,
   "score": 4,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpay1p",
   "message": "NTA. Puppies aren’t Christmas presents, let alone surprise Christmas presents.",
   "created_utc": 1701537547,
   "score": 4,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpfzs8",
   "message": "Leave now while you can. Your girlfriend needs another dog like she needs a hole in her head. She has already made her mind up and you are screwed.",
   "created_utc": 1701539553,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbplklu",
   "message": "NTA - She doesn't really take care of the one dog you have. \n\nA dog is 2 yeses or 1 no. Are you even allowed to have 2 dogs in your place?\n\nThis is a dealbreaker. She can't stand up to her mom, and that is a bigger problem than the dog.",
   "created_utc": 1701541778,
   "score": 4,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpm1en",
   "message": "NTA\n\nYou discussed this and cane to a decision on no more dogs at this time. She very likely told her mom of this decision who decided to exert her control B and got the puppy. \n\nThis is deliberate on her mother’s part.  She is trying to establish dominance over not just her daughter but you as well.  \n\nSince your gf is unable/unwilling to set boundaries with her mother you have two choices. \n1.  Give up any hope of ever having any say over major decisions in this relationship. \n2.  Set your boundaries, stick to them and if she doesn’t respect that and still takes the puppy, end the relationship. \n\nIMO your relationship is doomed.  You are not comparable and gf seems to be as manipulative as her mother. \n\nGood luck OP",
   "created_utc": 1701541965,
   "score": 5,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpn62i",
   "message": "I hate pet owners like your girlfriend and mom. Pets aren’t toys.",
   "created_utc": 1701542414,
   "score": 4,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpoyc0",
   "message": "Nta but she’s manipulating you like her mom does to her. Just realize this is probably the first of many battles where in your just expected to get over it. It is not fair to a puppy to be alone for 12 hours. It’s cruel. I would break up with someone who would be so selfish to the puppy.",
   "created_utc": 1701543137,
   "score": 4,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp6db4",
   "message": "NTA, text her mum saying that after a discussion you have both decided not to add another dog to your household",
   "created_utc": 1701535692,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpa4j5",
   "message": "NTA but I have to tell you that your GF sounds as manipulative as her mom. The silent treatment followed by insisting on having the conversation when it’s convenient to her regardless if you are up to it or not. Followed by turning tables “ accusations of you being unfair and inconsiderate to her feelings” , ending with it’s somebody else’s fault “her mom”.\n\nI’m very familiar with the tactic , been there before and it will take you some time to read the pattern but when you do you will realize that you have been played for some time .",
   "created_utc": 1701537212,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbplza3",
   "message": "Sounds like she’s learned the art of manipulation from her mom. She wants to discuss this but only if it leads to you changing your mind. It is unfair and disrespectful of her to bring another living thing into the home when you are not ready for it. This is a decision BOTH partners need to 100% on board with. It’s also clear that her mom’s feelings/opinions have more weight in the relationship than your feelings/opinions. And unless there’s a reason for an egregious breakdown of trust, your partner needs to present a unified front to your mother on major decisions like this. My hubs and I will disagree on things, but we don’t throw each other under the bus in front of our kids, friends, or family. \n\nMy two cents: leave. This manipulation will only get worse when children are involved. And your gf could start teaching those tactics to your offspring. \n\nLife is hard enough without throwing in manipulating partners and parents. You deserve better.",
   "created_utc": 1701541942,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpm2co",
   "message": "That sounds as if you shouldn't have a dog at all.. the existing dog gets neglected already and she thinks another puppy is a good idea?! No. Just no.\n\nNTA \n\n\u0026gt;She asked what I wanted from her, “you want me to tell my mom no?”and texted her mom “bf is worried about puppy but I am excited”. \n\nWell.. yeah. She has to say no. End of story. Her text is stupid. She needs to step up against her mother.",
   "created_utc": 1701541975,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpnb3x",
   "message": "NTA. Your gf is straight up manipulating you. “Mom did it, not me” is BS. If you back down then you’ll never have a say in a single thing. For God’s sake don’t have a baby with this girl! \n\nTell her no if the puppy, shows up you’ll have a decision on if you want to stay, because your opinion will never matter.",
   "created_utc": 1701542470,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpnzoo",
   "message": "It is your girlfriends fault. The answer to her is in fact no. It sounds like if anyone wants to ruin your financial stability they just need to buy her expensive to maintain pets. You do not goft pets to a household that doesn't fully want it. If only half want it you stay out of it. If your girlfriend can't stand up to her mom then this won't work out. Also your girlfriend is saying how happy this would make her and ignoring how you feel. This is unfair to you AND the dog.",
   "created_utc": 1701542747,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpujle",
   "message": "NTA  GF and her mom are both manipulative.  Decide soon if that is what you want for the rest of your life and move on from that point.",
   "created_utc": 1701545408,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpzhfh",
   "message": "**she wants the puppy and it would make her happy.** \n\nYoung immature children often want things to make them happy.  Your GF isn't a toddler and a puppy isn't a cookie.\n\n**Then she said “its not my decision, my mom did it not me”** \n\nCalling total BS on this.  Her mom did buy the puppy but GF is \"deciding\" to accept the puppy--and no doubt was behind her mom buying the dog in the first place.\n\n**and “i didn’t choose this, its an innocent gift and I cant let a puppy who needs a home go without one”.**\n\nBut she absolutely IS choosing this and the puppy will absolutely have no trouble finding a home. \n\nHow is your GF planning on training and housebreaking this puppy given she's working 12 hour shifts and taking classes?   Is this poor animal just going to be left alone in a crate all day?   \n\nIs this the life you want for yourself-- making an agreement with your partner and her using her mommy and pouting like a spoiled toddler to get what she wants.",
   "created_utc": 1701547427,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq4ix4",
   "message": "She TOLD her mom she wanted a puppy and her mom got her a puppy. Now this is presented as a done deal to you while your GF acts like she's innocent in all this. I feel awful for that puppy - your irresponsible GF thinks it's a toy, not a real being with actual needs and feelings. In your place, I would think deeply if I wanted to be in a relationship with someone shallow and selfish and manipulative like your GF.",
   "created_utc": 1701549442,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq51t2",
   "message": "The puppy is just the first of many times where GF will run to mom to get what she wants when you disagree with her. Are you willing to put up with that?\n\nYou say you live in an apartment. Do you rent? If so, I’m sure your landlord will be THRILLED to know you’re adding an untrained puppy. Puppies chew everything in sight and use the bathroom everywhere. Even housebroken puppies chew stuff. With your long hours and limited time for the dog you have, you are doing a disservice to the puppy as well.",
   "created_utc": 1701549656,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq9g89",
   "message": "NTA.  Your GF is no different than her mother.   The sooner you realize this, the better.  She gave no regard to your feelings or legit concerns.  Then in front of you she texted her mom about it.",
   "created_utc": 1701551442,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqa777",
   "message": "NTA. Puppies are easy to find a home for. Your girlfriend is thinking only of her feelings and not about what's best for the animals or you. I love animals, I have a few myself, but we make sure they get outside to play.\n\nI would tell her that the dogs are not going to have a happy life with you, you're both too busy and the home is too small. But if it has to happen, I would tell her that she has to take both dogs to the dog park at least every other day, and for long walks every day, until you have a house with a fence. And if she can't keep that up, then the dogs need to find a home with a fenced in yard- together. Because at that point they'll be bonded. \n\nBut honestly she's manipulative and selfish, and I think that's a recipe for disaster",
   "created_utc": 1701551748,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqjofc",
   "message": "Your GF is using her mother as an excuse. They are both manipulating you. It is not fair to a puppy to be gone the length of time you two are. She has given you fair warning what married life will be like. It is up to you to chose because both she and her mother have warned you. NTA",
   "created_utc": 1701555593,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqkjy7",
   "message": "BS. She asked her mom to get her a puppy because then you 'couldn't/wouldn't tell her no'. This was planned. And no, you don't have the time to train a puppy. It will tear everything up. It would be great for the older dog. But you really need to train it.",
   "created_utc": 1701555953,
   "score": 3,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbp8smn",
   "message": "NTA\n\nBut if you want to be an ass and solve your problem that's easy.  Tell her she can have the puppy if she wants it but that she is fully responsible for it as you do not have the time, energy, or desire.  Tell her that the very first time you see the puppy not properly cared for that you are giving the puppy away.  \n\nProperly cared for includes training which she doesn't have time to attend and walks which she isn't interested in doing.  As soon as she fucks up, which should be less than a week, give the dog away - to her mother.  Drop it off at mom's house and let her deal with the unwanted pet since it's her idea to begin with.\n\nYou're in a no win situation.  No matter what you do you aren't going to be happy.  You'll either be stuck with an untrained and neglected puppy or a girlfriend who cares more about her mother's manipulation than behaving sanely.  She knows what sane is, you two already discussed it.  But she's throwing sane out the window.  Until her mother dies that will continue to be the case.  Mom does something stupid and girlfriend indulges whims and you try to be sane but get labeled the asshole for it.  I feel sorry for you, that sounds like an exhausting future you've chosen for yourself.",
   "created_utc": 1701536680,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpbc67",
   "message": "You really need to think about this relationship and if you want to get married or bring kids into this situation. You already know she doesn't have boundaries with her mom and doesn't really want to make any. So, really, it comes down to what you can handle... It needs to be an either we go LC with your mom and you get into therapy or we need to be done for your own sanity.",
   "created_utc": 1701537702,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpf0f4",
   "message": "The only reason I'd say keep it, is your dog must be so lonely. It actually pains me to think your dog is alone for 12 hours a day. I had a solo dog years ago, then we got another and I will never only have one again. They play together,love each other, and are company for each other if we go out. Your girlfriend is being unreasonable and if she doesn't set boundaries with MIL perhaps you should. She also needs to start being a responsible dog owner with the one you've got. Going out for proper daily walks where the dogs gets to run off lead and socialize with other dogs. She's not being a good owner.",
   "created_utc": 1701539165,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbphghd",
   "message": "The dog she already has gets the bare minimum. You need to push back hard on this or the steamrolling will never stop. I think this might be a watershed moment for you both- will she put appeasing her boundary stomping mother over your relationship? How she acts in this situation will set the tone for your future life together.",
   "created_utc": 1701540131,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbplsuq",
   "message": "She can keep the puppy but loses you since she only cares about what she wants",
   "created_utc": 1701541871,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbplz5t",
   "message": "Can someone tell the mom that living beings are NOT GIFTS, not for Christmas,  not for birthdays, or graduation,  and even less for just an impuls 'just because' presents. \nAnimals are not presents. You can not surprise someone with a living creature. \n'Here you go, a 15 year responsibility,  with plenty of monthly costs, because I couldn't decide what color of socks to buy you this year. Next year, I'll get you a feathered 80 year responsibility, but I'm not going to tell you it's a parrot,  because it's a surprise'",
   "created_utc": 1701541940,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpo5qg",
   "message": "Run",
   "created_utc": 1701542816,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq9kf0",
   "message": "NTA. An animal should never be a \"surprise gift\" and your GF shouldn't be accepting this dog after you both agreed that now isn't the right time for another pet. You need to keep your foot down and not budge.",
   "created_utc": 1701551490,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqtn3b",
   "message": "She probably had her mom get the puppy so you couldn’t say no. I’ve had this happen … it’s weird anyone would give this as a gift. Animals are NOT gifts. Gf and mom are being enormous AHs and blindsiding you. Manipulating you. Shitting on you and are completely disregarding of the responsibility they are dumping on you. Die in this hill.",
   "created_utc": 1701559788,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqyr05",
   "message": "Of course it makes her happy. It’s a fucking puppy. It’ll make anyone happy. Then reality will set in and she’ll take shitty care of this one just like she takes shitty careful the dog she already had. NTA. Ditch this girl if she can’t stand up to her mom or you are in for a world of hurt. Imagine when kids come.",
   "created_utc": 1701562014,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbr035m",
   "message": "If she can’t set boundaries don’t move forward with her.",
   "created_utc": 1701562606,
   "score": 2,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpd9mo",
   "message": "YTA only because you've apparently known about her mother's manipulation/control and your girlfriend's inability to set down boundaries with her. Logically, you had to have known that eventually something like this would happen. If not a Christmas puppy, then in another huge way. There's literally no way that you and your girlfriend can have a safe, secure, healthy relationship with your girlfriend's relationship with her mom. It cannot happen. Something needs to change and like, right now. This needs to be a make it or break it situation because this is how the rest of your life can look.",
   "created_utc": 1701538471,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpkgtz",
   "message": "This is something every mother should know..",
   "created_utc": 1701541329,
   "score": 255,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpjbp6",
   "message": " This is something every mother should know...",
   "created_utc": 1701540872,
   "score": 254,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpmi04",
   "message": "No you are not however if you have been conditioned by your parents your entire life it's very hard to break free of that chain I know it all to well. It's her fault true indeed as she is grown trying to live her life but mother sounds very manipulative give her some slack. Maybe tell her she can keep the puppy but you will not be responsible for it's care no vet trips no walks no cleaning up after it no money of your own will be contributed to this pet. But who knows maybe the puppy will grow on you and be company for your current dog. Just playing devil's advocate here",
   "created_utc": 1701542147,
   "score": 254,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpotg9",
   "message": "Damn. Y’all are already terrible dog owners. Seems super mean to bring another pet into your house when you do the bare minimum for the dog you have.  You’re both assholes, and so is the mother.",
   "created_utc": 1701543082,
   "score": 254,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpc6cm",
   "message": "nta only good thing i can see about this is the other dog won’t be so lonely all day.. but that’s only if they get along",
   "created_utc": 1701538039,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpp8qe",
   "message": "Updateme!",
   "created_utc": 1701543253,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbppuvc",
   "message": "Nooooooo Nta. Puppies are not Christmas gifts.",
   "created_utc": 1701543504,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbppw88",
   "message": "Does she really think a puppy can hold its bladder for 12 hours?",
   "created_utc": 1701543520,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbprkos",
   "message": "NTA. You have a dog. You live in apartments. Two dogs is not compatible to your lives. Enough said. You can and should decline gifts. Especially dumb ones with 10+ years of obligations attached.",
   "created_utc": 1701544218,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbprlkf",
   "message": "Tell her she can go home to her mom and dog. She sounds like a child having a tantrum.",
   "created_utc": 1701544228,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbprrik",
   "message": "For God's sake, dump her. She has no back bone. Reverse the gender roles and everyone would call u a Mama's boy that needs to be dumped. Dump her now.",
   "created_utc": 1701544295,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpruwb",
   "message": "I have a hard time believing your GF's mom decided on her own that you need ANOTHER dog in your apartment, and didn't ask your GF, first. Despite how your GF rolls-over for her mom, do you really think your GF would allow a puppy into your home if she didn't want it?  Nobody living independently is THAT powerless.  Even if the mom \"swears\" it was all her idea and a complete surprise for your GF, I would not believe it.",
   "created_utc": 1701544334,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbps9hk",
   "message": "NTA. She’s already neglecting one dog, and any animal is a two-yeses-one-no decision in a partnership",
   "created_utc": 1701544498,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpssw3",
   "message": "NTA; and given your lifestyles, getting a puppy is cruel as hell. They need a lot of exercise, training, and stimulation, none of which either of you have the time to give at the moment. A dog is a 2-yes pet. And this doesn’t even touch on the mom issues. Tbh, I think she was complaining to mom cause she wants the puppy, and mom took matters into her own hands. Possibly with your gf’s approval. The timeline of the informal sit down to the puppy purchase is pretty suspicious.",
   "created_utc": 1701544715,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpt1tw",
   "message": "Mom needs to mind her own business and stop with the \"surprise\"! animals.  It isn't fair to force an animal on anyone.  You already have one animal she barely deals with on top of work and school obligations.\n\nGF needs to realize she is grown and living with another adult.  She needs to grow up and put her mom in her place.  Just imagine how she is going to be if/when kids come into the picture.",
   "created_utc": 1701544814,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbptc07",
   "message": "OP unless your gf is willing to put in the effort likely with a therapist this will never change.  \n\nAs to you having kids.  Let’s  say you both agree waiting 4 years from now to start trying should work.   A year from now your gf lets you know she’s pregnant.  When you ask why she will likely tell you her mother told her 4 years was too long to wait and she’d have a harder time getting pregnant so better to do it now.  Of course no discussion with you. \n\nSo to the puppy.  The big decision primarily is not the puppy itself but what it represents.  Your gf doesn’t invest time in the dog you have now.  \n\nWho is going to be at your house to let the puppy out to potty every four hours during the day and halfway through the night?  \n\nWho is going to feed the puppy at mid day as young pups eat three times a day for a number of months.  \n\nWho is going to be responsible for cleaning up the pee and poop in the house? \n\nDoes your gf have the money to hire a dog sitter/walker to come by at least twice a day to take care of the pup?  \n\nAt this point OP IMO this is a serious situation and it needs a serious conversation and consequence.  \n\nYou need to let your gf know you do NOT want a puppy in your shared home.  You will not help care for a puppy nor contribute to the costs associated with having a puppy.  \n\nEither her mother can cancel getting the puppy or the puppy can live at her mother’s house.  If your gf ‘can’t live without this puppy and needs it to make her happy’ then she should go live at her mother’s with the puppy.  \n\nYou don’t have to break up but living together requires compromise. \n\nRight now it seems like what you have from gf is ‘tough shit it’s a gift so I am just going to accept it and you can deal’.  Nope - not how a healthy relationship works. \n\nWish you the best OP",
   "created_utc": 1701544925,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbptj2m",
   "message": "NTA\n\nI wouldn't have had half of your patience, and your gf sounds childish and emotionally immature.\n\nEta: And also: between \"my mom BOUGHT me a puppy\" and \"puppy doesn't have a home, I had no role in this\" there's a whoooole lot of stuff. Calling BS wouldn't be uncalled for.\n\nSounds like gf told her mom about how sad she was that you said \"no puppy\" and the toxic mama took matters into her own hands so that you'd have no agency. \\[end of edit\\]\n\n\u0026amp;#x200B;\n\nSounds like gf told her mom about how sad she was that you said \"no puppy\" and the toxic mama took matters into her hands so that you'd have no agency. \\[end of edit\\] must *want* to change and do the work to get there (and often won't)\n\nAnd that usually doesn't end well (check reddit, it's a goldmine of ex-spouses who ran because of the in-laws)\n\n\u0026amp;#x200B;\n\nThey put you in a pretty shtty position and they know it - I'm sorry, man",
   "created_utc": 1701545003,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbptn83",
   "message": "NTA. OP, would you be able to find out the name of the breeder? You could call them and explain that the puppy is meant for you but in your current situation you won’t be able to properly take care of it. The breeder (if they are any good) may cancel the deal then…",
   "created_utc": 1701545049,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbptp14",
   "message": "Yeaaaaaa, she's not going to change. Your mil will be making decisions for you 2 for the entirety of your relationship. Nta.",
   "created_utc": 1701545069,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpu4xt",
   "message": "NTA. The line is right here, and your gf already crossed it. Ideally you should sit with her again and tell her that getting a puppy into your place needs two “yes” - yours and hers. If one is against, puppy is not coming. Text to MIL directly and say “no”. Make it loud and obvious to everyone that you are against such present. Tell your gf that you will leave her if she will proceed with puppy, and be ready to do it.\nIt should be done now and it will be for good - either she will learn to respect you, or you will be free for new better relations. If you will not stop her now, and will stay with her, you will have no say in any big decisions. And if/when kids will be involved, you will be in your personal hell.",
   "created_utc": 1701545243,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpu5lr",
   "message": "NTA. You are living together. Couples living together need to make certain decisions to change major things--those that have a big impact on both of them-- together. One person cannot make the decision unilaterally. In this case your GF is making a unilateral decision....and worse, much worse....is refusing to take responsibility for doing so. This is a deal breaker in many relationships. \n\nThis is a huge red flag and needs to be dealt with now if the relationship is going to succeed going forward.  Good luck!",
   "created_utc": 1701545251,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpuaky",
   "message": "NTA: you need to decide if this is how you want your life to look like. You will have no say in anything. Maybe sit her down and tell her no puppy and if she insists then maybe she needs to move back in with her mom. You don’t need this manipulation and stress especially with your job and work schedule. She’s supposed to be a partner to you not another responsibility.",
   "created_utc": 1701545307,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpuba3",
   "message": "So I have a lot of experience with breeders. Which I'm assuming that's where the mom got the dog. \n\n1 most GOOD breeders will ask for details on the place puppy will live. When I adopted during covid I had to do a FaceTime call of my house. I bet the breeder would not allow the sale if they knew it was in a smallish apt, the 2 ppl who have 0 time and already another dog (as in the dog takes up space). Even rescues do this now. So I'm wondering if this is a backyard breeder.\n\n2 if this is a backyard breeder, that means you could be in for A LOT OF MEDICAL ISSUES.  Is mom paying for that? Bc a lot of backyard breeders are inbreeding (my friends got sucked into one and ha e the dog from hell) many backyard breeders flourished during covid bc everyone wanted a temp pet.  They sell \"pure breed\" dogs way cheaper with no certificate.  And they come riddled with issues. Behavioral, medical, you name it. \n\n3 is mom also buying everything a new puppy needs? Toys? Food? Crate(if you go that way)? Shots? Spay/netuer? Heartworm? You get the idea.\n\n4 puppies need training from day 1, is gf doing that? Will she have time? Also puppies need to go out ALOT to pee and poop. Is she gonna clean all that up bc your gone so long? My mom's new puppy (she's a stay at home) constantly has to go outside. Like every hour almost. \n\nThis is so not a good idea I agree and I get a new ani.al is exciting but if you don't spend enough time with a dog they get really bad Behavior issues. They can become aggressive bc they are so bored 😐 \n\nI would 100% give an ultimatum to gf. Me or the puppy.",
   "created_utc": 1701545315,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpv0a2",
   "message": "NTA\n\nA dog isn't a game console. It's a family member and an 8-14 year commitment, that requires regular attention, food and doctors. You and she knows it since you have a dog already. \n\nThe discussion you'd rather need to have is whether to find a home for your current dog, who are able to spend more time with it, longer walks etc. If any changes to the family situation should come, that discussion would be the first instead of getting more dogs.\n\nYou know it's her mother who is manipulating you and her. The mother invests 400-2000$ and she's off the hook. Puppies are cute etc. But it's way more than that. She should not be affecting your family situation and composition at all.\n\nThis one of the medium sized tests. Your wife is shifting responsibility to her mother. Like it's a done deal and the only way is to either accept your faith, or forfeit the gift and mother loses her money and wifey is sad because there will be no puppy. I'd stand firm and not get a dog, firstly because of your current living situation and secondly because it's not the mother's call, and she should be put in her place.\n\nIf you kneel and take it to the chin, expect your resentment grow as you are excluded from other decisions in the future. Maybe she'll even decide to get pregnant without consulting you.",
   "created_utc": 1701545599,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpwpzv",
   "message": "Mom should take the puppy back, cancel the purchase, whatever.  That was a serious lack of common sense on somebody’s part thinking you both could handle a puppy right now.",
   "created_utc": 1701546298,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpx3i6",
   "message": "NTA - I don’t mean to be overly negative, but this is a watershed moment. If she cannot follow through with your previous mutual agreement and set boundaries for her mother now, she never will. \n\nI think a comment mentioned something along the lines of “what about when we have kids?”  I can tel you from experience that overly involved, manipulative, controlling parents are very very very difficult to manage even when the couple agrees, sets boundaries, and enforces them. \n\nThis may be a moment for you to reevaluate your future with this person. \n\nI’m sorry.",
   "created_utc": 1701546451,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpx3th",
   "message": "This will be your life.\n\nAnd it should be a dealbreaker that her mom can \"decide\" this and you have to deal with it.Not to mention that her mom is doing what she wants her to do.Absolving her of all responsibilities.\n\n\"It's not my fault my mom bought me a puppy, that I want so bad, that I am excited about so our discussion about having another dog is null and void.\"\n\nShe isn't a good dog owner.Your lives aren't set up for a dog.AND she isn't taking any responsibility even though we KNOW that her mom did not do this unsupported or without being asked.\n\n\"What do you want for Xmas?\n\nI'd really love a puppy... but my BF won't let me have one.\"\n\nI'd leave.  \n\n\nETA- NTA.",
   "created_utc": 1701546454,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpxw3x",
   "message": "NTA. I'd call the place who is selling the puppy and explain the situation. This is such a bad set-up for a puppy.",
   "created_utc": 1701546774,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpy0or",
   "message": "If it shows up , take it back to mom…",
   "created_utc": 1701546826,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpybmg",
   "message": "\u0026gt;So I said “your mom is making decisions for the both of us and our relationship and im supposed to be ok with that?”\n\nGood. Straight to the point.\n\n\u0026amp;#x200B;\n\n\u0026gt;She reiterated that its not her fault her mom did this and shes just trying to have a discussion with me about it.\n\nDeflection. Also, she was not trying to have a discussion about it. She was trying to explain to you how wrong you were to not just accept the opposite of what you and your GF has discussed previously.\n\n\u0026amp;#x200B;\n\n\u0026gt;Sounds to me like a decision has been made for our relationship and she’s throwing her hands up and saying its not her fault.\n\nWhose fault this is - is irrelevant. This situation showed you, OP, that having a relationship with your GF means her mother making decisions for both of you. You need to ask yourself if this is the kind of relationship you want to be in.\n\n\u0026amp;#x200B;\n\nNTA.",
   "created_utc": 1701546951,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpym7b",
   "message": "Yall shouldnt even have one dog never mind a dog AND a puppy. NTA\n\nWatch it be a high energy breed that NEEDS a job that will literally destroy the apartment and get yall evicted. \n\nWhat breed is it?",
   "created_utc": 1701547069,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpyoqe",
   "message": "Is this a plot by her mother to break you two up?",
   "created_utc": 1701547099,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpz1r5",
   "message": "NTA - I lived in a one bedroom 750sq ft apartment and it was even crowded with just our cat and our minpin/chi mix and the two of us.\n\nI couldnt imagine bringing a puppy into that mix already with both of your full schedules and then having to house break (if not already) a puppy.\n\nAgreed with others on setting bounderies. My MiL was like this with both of our kids. \"I know best!\"...yep, you do...your oldest was an alcoholic at 16; middle kid is dead; and you have mentally destroyed my wife; aces..tell me more!",
   "created_utc": 1701547248,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbpzwto",
   "message": "\"She gave me the silent treatement and ignored me for 1.5 hours.\n\nUm, you are aware that this is now considered abuse, yes?\n\n\"She said I was being unfair and not taking into account how she feels.\"\n\nPot, I'd like you to meet the kettle.\n\n\"I can't let a puppy who needs a home go without one.\"\n\nThere are TONS of puppies without homes, so this is both untrue and unrealistic. Add to that she's not taking care of the dog you have NOW. How would she like to be walked once a day until she pees, then shut inside a small apartment for the rest of the day, with a once-a-month beach trip? It's cruel.\n\nNTA. I get being struck by the cuteness of a tiny puppy, the tail, the smell of the puupy breath, it's part of their charm and why so many get adopted when they are little. But, she has made a unilateral decision that you had already discussed, and is not good for the animal.\n\nLong term...I wouldn't be able to be with someone that could not set boundaries with their parents. You need to think about this relationship and how long you're OK with her doing things like this.",
   "created_utc": 1701547603,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq0bzw",
   "message": "NTA. Puppies aren't presents or objects. As for your gf, she needs to learn the difference between want and need. \n\nA puppy is a want. At that it is a living want that requires money, time, and care. I wonder if your gf has wanted a puppy and mom is doing the work for her as gf knew you would be reasonable and say no.",
   "created_utc": 1701547755,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq0e95",
   "message": "NTA. Not only does her.mother make decisions for you both but your gf is also doing that to you too. Expect more of these manipulations.\nThe puppy needs to go back. Puppies need a LOT more time than you two have to give. Training has to be done more often than you can do.",
   "created_utc": 1701547780,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq114r",
   "message": "I badly want a puppy. My  whole family badly wants a puppy.  We have a house and yard and money. What we lack is time.  No time=no puppy.  And you already have a dog that isn't being taken care of very well.  Is she nuts?\n\nBy the way, this might be a good time to think about a vasectomy/new girlfriend.  You think puppy on the brain is bad?  Wait until she wants a baby.",
   "created_utc": 1701548015,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq2mdq",
   "message": "I feel sorry for that puppy.",
   "created_utc": 1701548662,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq2rq5",
   "message": "NTA, but your gf is. She sounds like a whinny child and doesn't seem responsible enough for a puppy. I know it's a bit harsh, but her feelings in this situation don't matter. It's about the puppy's life, and to be frank, it seems like you guys don't have the capacity for one dog, let alone a puppy.",
   "created_utc": 1701548723,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq2xgo",
   "message": "Not only are you NOT TA but it's incredibly unfair to the new puppy AND the dog y'all already have! IMO if someone doesn't have the time to devote to 1 dog then they certainly don't have time for 2. So is this new puppy going to be in a kennel 12 hours a day? Hard to train a puppy to potty train if it has very little interaction. \n\nI think GF's mom is just trying to flex on you and let you know where you are in the chain.",
   "created_utc": 1701548788,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq3jt9",
   "message": "Your literally not home enough to get a puppy.  NTA",
   "created_utc": 1701549043,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq3z3f",
   "message": "Yes, tell her to tell her mother no \n\nI doubt she didn’t know about this puppy until just now. You don’t have the time or means for a second dog. \n\nTell her that if she brings it in then she will be leaving with it as well. She can’t just bring a dog home and expect you to go with it. \n\nThis reminds me of the internet trend of women bringing dogs home after being told no and expecting their husbands to deal with it",
   "created_utc": 1701549217,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq3zru",
   "message": "NTA not only do puppies NOT make good gifts EVER but this is a long term commitment that everyone in the house needs to agree on. Reputable breeders will NOT sell puppies as gifts so now not only are you getting an unwanted puppy but also one that would potentially come with life-long issues with both health and temperament. Tell mom to keep the dog at her house if she wants a dog.",
   "created_utc": 1701549225,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq45qd",
   "message": "My boyfriend more or less bullied me into a Christmas puppy right before the pandemic hit. The only reason I didn't leave him when he started neglecting the dog is because I'm disabled and physically couldn't without being homeless. Our relationship has repaired, but I still can't look at that dog as anything other than a crossed boundary. I've tried. It's not the dog's fault. And we're both too disabled to take care of it, so the dog's living a miserable life. But he'll never agree to rehome the dog where it'll actually be able to be happy, so... it's fine. It's whatever. Just about another decade until we're free, because y'know, a puppy is up to 20 years of commitment. \n\nNTA btw, I would literally suggest breaking up with her. I still kinda wish I broke up with my boyfriend, but y'know, too late now.",
   "created_utc": 1701549292,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq55b2",
   "message": "Nta but your gf definitely.  Two people working 12 hour shifts is not the right home for a puppy.   She’s being childish and selfish",
   "created_utc": 1701549696,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq5frs",
   "message": "Someone who puppy traps you isn’t beyond trapping you in different ways",
   "created_utc": 1701549816,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq5qld",
   "message": "NTA - and you are thinking of that puppy and it's best interests as well. It is a baby, it cannot be left for 12 hours at a time. \n\nTime to take a stand - tell the MIL she can keep the puppy, because it is not coming home with you to be neglected by her shiny toy I wants it daughter!",
   "created_utc": 1701549938,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq6675",
   "message": "Just dump her already unless you want a lifetime of this.",
   "created_utc": 1701550111,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq6scd",
   "message": "You cannot have a dog nor a puppy. Unless you pay someone to take care of them. A dog-nurse. Those are living beings. Paying a dog-nurse will be expensive. Already you are neglecting the dog that you own. This is not good. :-( nta",
   "created_utc": 1701550354,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq6szj",
   "message": "You cannot have a dog nor a puppy. Unless you pay someone to take care of them. A dog-nurse. Those are living beings. Paying a dog-nurse will be expensive. Already you are neglecting the dog that you own. This is not good. :-( nta",
   "created_utc": 1701550362,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq6ye3",
   "message": "On what planet does this mom think this is a reasonable idea? Puppies as a surprise gift is an absolutely horrible notion. In light of OP's current lifestyle/workload it's especially bad. Puppies are a lot of work. Not to mention expensive!  The dog will become psychotic in no time from lack of attention.  This stupid idea needs to be shut down. There is some kind of weird power play going on. A goldfish would be better.",
   "created_utc": 1701550422,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq6yzt",
   "message": "Honestly it sounds like it's time to find a new partner. One who doesn't unilaterally make decisions for your relationship contrary discussions you've had prior. And then getting cahoots with her mom to manipulate you into having no other option but to look like the bad guy. Geez she learned it from the best didn't she?  run. Nta",
   "created_utc": 1701550429,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq70vj",
   "message": "She and her mom decided to get another dog. She is trying for the asking forgiveness rather than permission routine.  \n\nShe completely disregarded your wants.  Pets are two yes one no. I guess her and her mom are the two yes. \n\nYou do see where this is going, right? Mom will be a third in your relationship. GF will use Mom to get what she wants.  \n\nHate to say it, but you need to really think about the future of this relationship.  \n\nNTA",
   "created_utc": 1701550450,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq7bu3",
   "message": "NTA and you should stomp on this hard while you still can. It won't end until you make it end, and if gf isn't ready to be independent from her mother, she needs to take the puppy and go back to her mother.",
   "created_utc": 1701550575,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq7fpb",
   "message": "NTA. Those poor dogs deserve a life outside of a cramped apartment (750 is barely enough for 2 people) and only seeing the world for the few minutes it goes the bathroom.\n\nHonestly, you need to move on and take those dogs to a no kill shelter or friends who will take care of them. You both work such hectic schedules you don't spend enough time together to realize you should have called it quits long ago. Like, before moving in together. She's shown you plenty of red flags, yet you are hoping she's going to randomly change?",
   "created_utc": 1701550619,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq8ewq",
   "message": "NTA. She obviously has learned the art of manipulation from her mom. Get out before you have kids and gf and her mom make major decisions for your kid without consulting you.",
   "created_utc": 1701551014,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq8stl",
   "message": "You're NTA. \n\nAs a side note, I rescued a dog from a home where she was given to a kid as a surprise gift. After the initial excitement, she was neglected for years. And sorry, but buying a puppy does not mean the puppy needs a home. If it was coming from a shelter, that'd be a valid argument IF you could afford it and had the time.",
   "created_utc": 1701551173,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbq9bnz",
   "message": "NTA. Literally discussed it before and agreed!",
   "created_utc": 1701551389,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqbdp7",
   "message": "NTA, but you need to end this relationship or all you're doing is showing her she can trample your boundaries all she wants with no consequences. Tell her \"i dont want the dog. If that dog comes into this house, i will be leaving it and not coming back\". Its not an ultimatum, its setting a boundary (i dont want another dog) and laying out a consequence for crossing it (i will move out if you ignore this). Stop being a doormat for her and her mother, they're both manipulative assholes.",
   "created_utc": 1701552215,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqbigt",
   "message": "NTA - stick to your guns.  And maybe consider leaving the relationship.  It's only going ot get 100 times worse when you get married.  Guaranteed.",
   "created_utc": 1701552268,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqbs2a",
   "message": "NTA The line is so far crossed you can’t even see it. Her mother controls her life. If you stay she will continue to control both of your lives. Tell your gf is she brings the puppy home you are breaking up.",
   "created_utc": 1701552376,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqc5vg",
   "message": "You sure you want to spend the rest of your life with a person who doesn’t respect you?",
   "created_utc": 1701552528,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqcayf",
   "message": "NTA She just can’t/won’t see it’s her mom’s fault for this situation. It is not ok for her mom to control you and your relationship.\n\nThe real question is: Why is she ok with her mom trying to control you?",
   "created_utc": 1701552584,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqcs28",
   "message": "NTA Tell your gf to protect your current dog, there's that respiratory thing going around killing dogs and you don't want to expose your current pupper to this unknown. \n\nYou need the new one to stay at her mothers house until vet checked and shots and potty trained for at least a month cause if anything happens to your other one, you're leaving. I bet she back tracks since mommy doesn't want it to ruin her floors and drapes being responsible.",
   "created_utc": 1701552776,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqdhm8",
   "message": "NTA.\n\nPets are never an appropriate gift. Especially if the gifter isn't even someone who would care for or live with it.\n\nYour GF is making you the villain when it's her mother doing this to the both of you.\n\nIf her inability to draw boundaries with her mother is habitual, she needs therapy.",
   "created_utc": 1701553062,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqdso0",
   "message": "NTA. I rescue and train unwanted dogs. It's never a good idea to get a puppy for Christmas, and your schedules are too busy right now. They're an expensive 15-year commitment. It's our responsibility to get dogs properly trained. A lot of time and money are needed for this, just like a child.",
   "created_utc": 1701553186,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqe7g8",
   "message": "It's not good for the dog. The current dog doesn't get much interaction from her. Hopefully it gets everything it needs from you?\n\nShe isn't very engaged with the low maintenance pet, and puppies are high needs. \n\nSounds like her mother is pulling a substitute baby move combined with power play.\n\nYou need to have a firm discussion as a couple.\n\nNTA",
   "created_utc": 1701553351,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqecim",
   "message": "I think it may be time to dip. She chose a puppy and her mom over you. So mom can take care of gf, neglected dog and new puppy.",
   "created_utc": 1701553409,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqegtc",
   "message": "NTA\n\nAND - you all need a dog walker. Leaving your dog alone for 12 hours is not okay. It sounds like this dog is cruelly neglected. \n\nFind out where her mom got this puppy (puppies need to be taken out EVERY HOUR, they do not come potty trained, and they will interrupt your sleep) AND TELL THEM WHAT IS GOING ON. They will probably contact her mom and try to get the dog back.",
   "created_utc": 1701553458,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqf0em",
   "message": "NTA but it’s clear your gf respects her mom more than you , she doesn’t care about you or how you feel and she’s made that clear that only her and her moms feelings matter I think it may be time to step away because warning comes before destruction and it’s only going to get worse",
   "created_utc": 1701553678,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqfl9f",
   "message": "Sounds like you've lost and she knows she can get away with anything now. Either put your foot down on this or you will be the one walking and taking care of the dog down the line.",
   "created_utc": 1701553912,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqfp1y",
   "message": "I’d move out",
   "created_utc": 1701553954,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqg1t2",
   "message": "I hate when people don’t take their dogs for good romps multiple times a week. Like why get that kind of animal?",
   "created_utc": 1701554098,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbqgta3",
   "message": "Breeders are happy to keep puppies out of inappropriate situations. Find out the name of the breeder, call and say this is an unwanted gift, and not to sell to mom anymore\n\nMom appears to be trying to buy daughters love and cause you two to fight",
   "created_utc": 1701554417,
   "score": 1,
   "submission_id": "1896qza"
  },
  {
   "comment_id": "kbr18pi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1896qza"
  }
 ]
}