{
 "submission_id": "1898iya",
 "title": "aita for telling my roommate im taking the washer and dryer when i move out?",
 "selftext": "for context i work at a hardware store and got an amazing deal on a washer and dryer set, i was very fortunate but there’s no way i would be able to get a deal like that again. i bought it on my card with the understanding that my roomate and i would go half since we both would be using them. that was 6 months ago and im now moving out somewhere else. i told them i would be taking them with me since i never received any money for them and have been asking at least once or twice a month since purchasing them. its always ‘i dont have it’ or ‘i cant afford to right now’. which is fine, except when there’s a dozen bags from the mall or target etc. now that im moving out they’re arguing that i should let them keep them because i could get a better deal than they could xyz. they said they would pay half but when told they would be paying me back in full (about $500) they said ‘well what am i going to do with nothing?’. i feel like an asshole but at the same time the complex has washers and dryers available just not in the unit? aita?",
 "created_utc": 1701538032,
 "permalink": "/r/AITAH/comments/1898iya/aita_for_telling_my_roommate_im_taking_the_washer/",
 "score": 157,
 "url": "https://www.reddit.com/r/AITAH/comments/1898iya/aita_for_telling_my_roommate_im_taking_the_washer/",
 "comments": [
  {
   "comment_id": "kbpcxgx",
   "message": "Lmao why do you feel like an asshole? You bought them, they are yours, they didn't pay a cent. If anything they should pay you a fee because they could use them for free.   \n\n\nNTA - fuck those roommates.",
   "created_utc": 1701538338,
   "score": 243,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpes1k",
   "message": " Would you leave the bedroom set you bought or your computer because they need them?  No.  Same with the washer/dryer.  You bought it, you own it.   They have been fortunate to have been able to use it for free all this time.",
   "created_utc": 1701539072,
   "score": 214,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpdlxt",
   "message": "Not sure why you need to ask but why in the hell would someone think they have any claim whatsoever on appliances you paid for and they did not??!!  So they want you to get another deal and pay again for something that already belongs to you? Wtf",
   "created_utc": 1701538606,
   "score": 94,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpevif",
   "message": "NTA - super confused why you would think you are an AH for keeping something that you purchased. they can pull their money and go on Marketplace or OfferUp and get used ones for now. Or go to a laundromat.",
   "created_utc": 1701539111,
   "score": 22,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpf6zx",
   "message": "I’m confused as to why you would feel like an asshole. You bought them in full. They’re yours. Stop trying to let them gaslight you and toughen up. NTA",
   "created_utc": 1701539238,
   "score": 40,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpfpuv",
   "message": "If they didn't pay their share, the item is yours.",
   "created_utc": 1701539445,
   "score": 5,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpux9q",
   "message": "NTA\n\nThey tried to take advantage of your good nature. Why would you leave them there and be forced to replace them out of pocket?",
   "created_utc": 1701545565,
   "score": 4,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpdma9",
   "message": "NTA.\n\nYour roommate FAFO. That ‘nothing’ they’ll be left w/is the same nothing they paid you. \n\nSquare deal all around, imo.",
   "created_utc": 1701538609,
   "score": 7,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpgso3",
   "message": "Those roommates are leeches. Take the appliances. You paid for them. They didn't.",
   "created_utc": 1701539868,
   "score": 3,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbphy7d",
   "message": "Why exactly do you feel like an asshole? Because you don’t want to give your ex roommates a free washer and dryer?",
   "created_utc": 1701540326,
   "score": 3,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpi4cb",
   "message": "NTA.  They have no leg to stand on.  You made that purchase.   If they got the money to buy the washer and dryer off of you, then they have the money to go and buy a washer and dryer for themselves.",
   "created_utc": 1701540391,
   "score": 3,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpv2xk",
   "message": "You paid for them, you own them, they're not part of the apartment, they never paid what the agreed so they have no claim. You'd be foolish to abandon perfectly good machines you could use elsewhere or sell.\n\n\u0026gt;they said ‘well what am i going to do with nothing?’\n\n[https://laundry-alternative.com/](https://laundry-alternative.com/)\n\nOr go to the laundromat like everyone else.\n\nNTA.",
   "created_utc": 1701545629,
   "score": 3,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpzlw9",
   "message": "NTA, but also make sure they don't break them before you leave.",
   "created_utc": 1701547479,
   "score": 3,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbps0nl",
   "message": "NTA it's YOUR washer and dryer. They are YOUR possessions. They belong to YOU. Your roommate has absolutely no claim to them whatsoever. Don't let them guilt you into leaving them behind. Don't let them pay you half to leave them behind. Their lack of an in unit washer/dryer is not your problem to solve.",
   "created_utc": 1701544398,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpslwk",
   "message": "You paid for them. They belong to you. The roommate should be lucky they didn’t have to pay you wear and tear that they have caused over time using the set.",
   "created_utc": 1701544638,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpugvl",
   "message": "If they had any intention of paying you, they would have already.  You paid for them, they’re yours to take.  And in what universe would only paying half now be grounds to keep the full set?   I think I can figure out why you’re moving out.",
   "created_utc": 1701545378,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq0ad1",
   "message": "NTA. And you dodged a bullet because they DIDN'T pay you a dime.\n\nThis is why you don't pool your money with roommates for major purchases: because eventually someone moves out, and then there is drama about who owns what, promises to pay, and trying to collect money from people who dodge you. \n\nYou can certainly allow roommates to use your things, maybe work out that you pay a little less rent or get the master with ensuite-- but you want to establish from the get-go who owns what and what will be taken with you when you move on.",
   "created_utc": 1701547739,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq31oq",
   "message": "NTA. You bought it, they declined to pay you for half. Shrug your shoulders at them and give them a list of local coin laundry places.",
   "created_utc": 1701548836,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq84z4",
   "message": "NTA and I really wish people could look at their own situation from an outsiders perspective.  \nRead your own words, this is a crazy entitled reaction that your roommate is having.  I say this in the kindest way, stand up for yourself, don’t doubt yourself.  They didn’t put any money towards the washer dryer, you did and will be needing a washer dryer for your new place.  If you read this story on here from a stranger you’d say NTA too.  Don’t be guilted or feel you have to take the high road.  It’s your washer dryer, screw the roommate.",
   "created_utc": 1701550905,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq87j5",
   "message": "NTA. What will they do with nothing? Laundry mat, rent to own a washer and dryer. Wash clothes by hand, not your problem. You paid for that shit, it's yours. They can fuck all the way off.",
   "created_utc": 1701550932,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq9epd",
   "message": "NTA. You bought them. You own them. If the roommate had actually paid you half when first purchased, you’d have more of a conundrum now. So they actually saved you a headache.",
   "created_utc": 1701551424,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqsbmu",
   "message": "They didn’t even pay for half, why would you leave the W/D there?",
   "created_utc": 1701559213,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqx3mu",
   "message": "NTA. It's called a laundromat.",
   "created_utc": 1701561285,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqx4wc",
   "message": "You got a great deal.\n\nYou paid for them in full.\n\nYou repeatedly asked for partial payment to share the cost.\n\nYou were repeatedly ignored or lied to about what they could afford.\n\nAnd now, they're trying to gas light you to taking half of your bargain price so they can keep them.\n\nNTA. decline any last minute attempts to pay. But those are your appliances. Don't feel bad that your old room mates are leeches. They will find someone else to leech off of soon enough.",
   "created_utc": 1701561300,
   "score": 2,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpgv75",
   "message": "NTA. They're yours. Either the roommate coughs up some dough or uses the complex machines.",
   "created_utc": 1701539895,
   "score": 0,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpki0c",
   "message": "Why does your dad..",
   "created_utc": 1701541343,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpnizm",
   "message": "Why is this a question? You bought them, nobody else contributed to the cost so who other than you could possibly be the owner?",
   "created_utc": 1701542557,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpnuin",
   "message": "I’m always surprised that some people think there’s a grey area in their situation. NTA. You bought them.",
   "created_utc": 1701542688,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpo4qc",
   "message": "NTA laundromats exist they'll be fine.",
   "created_utc": 1701542805,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpqczl",
   "message": "You better absolutely take the washer and dryer.  You are paying for it.  They deserve nothing.  They took advantage of you because YOU let them.  Now stand up for yourself and take what is rightfully yours.\n\nDo not give in to people who step all over you.  You were nice enough to do them a favor and what did they do?  did they pay you, NO they strung you along for months.  Now the time has come for you to move on. \n\nGood luck.",
   "created_utc": 1701543715,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpqvkg",
   "message": "NTA. Your roommate never paid, so they are all yours. Don't feel the least bit guilty about it.",
   "created_utc": 1701543931,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbprsy3",
   "message": "NTA.  You paid for it all.  They paid nothing.",
   "created_utc": 1701544311,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpsbgq",
   "message": "NTA. 109% paid by you. 0% by them.",
   "created_utc": 1701544520,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpsxn7",
   "message": "Nta you are 100% right. They pay for it fully or you take them. \n\nI honestly would just take them because 500 for both is a steal.",
   "created_utc": 1701544767,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbptviy",
   "message": "NTA",
   "created_utc": 1701545140,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpupko",
   "message": "NTA. You and your roommate had a deal. Roommate failed to honor the deal and has no actual ownership of the washer/dryer. Paying you half now does not purchase them full ownership of said washer/dryer. You are leaving them with access on property to do their laundry. \n\nRoommate is the asshole for not honoring the deal in the first place and then trying to get your w/d for free and then half price.",
   "created_utc": 1701545477,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpv6rd",
   "message": "NTA. Not your fault your roommate didn’t pay you back. Lesson learned, don’t split the cost of furniture, appliances, or electronics with anyone because 1. They rarely pay for them and 2. Because when one of you leaves it’s an issue.",
   "created_utc": 1701545673,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpxeoi",
   "message": "NTA. I honestly wouldn’t even have the conversation again, you’ve already told them you’re taking it and your reasons for taking are completely valid. I would just leave it, it’s up to them to get something sorted, and then just take it with on moving day. Just have someone with you to help you bring it out (because of the weight and also in case they try to stop you taking it)",
   "created_utc": 1701546579,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpy94z",
   "message": "NTA You own them. They had their  chance to co-own them. Freeloaders",
   "created_utc": 1701546922,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpya46",
   "message": "NTA mooch roommate not learning the lesson doesn’t make you a jerk",
   "created_utc": 1701546933,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbpymdl",
   "message": "Take the washer dryer with you and don’t feel bad about this again lol",
   "created_utc": 1701547072,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq0qq4",
   "message": "They are 100% yours. Take them, and anything that belongs to you when you move. It's not your problem. Your roommate did this to themselves.",
   "created_utc": 1701547921,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq163o",
   "message": "NTA\n\nwhat are they gonna do without them? \nBecome responsible and figure out a way to do their laundry.",
   "created_utc": 1701548071,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq196e",
   "message": "Lmao what? Thats is your property that you purchased. Thats hilarious, tell her to buy a set or go to the laundromat.",
   "created_utc": 1701548107,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq2jyh",
   "message": "Tell them you’ll buy them a new one with your employee discount if they give you the money",
   "created_utc": 1701548633,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq2vts",
   "message": "Your roommate knows they didn't pay you.  Take them, they are yours.",
   "created_utc": 1701548769,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq2y9q",
   "message": "NTA and I can't even believe you're worried about this. You bought them. They are yours. The end. Roommate was lucky that they got the use of free w/d for awhile.",
   "created_utc": 1701548797,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq3123",
   "message": "NTA You bought something, you take it with you. They have access to machines in the building, it's a no brainer. Saving and paying you back should have been their first priority.",
   "created_utc": 1701548829,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq36gn",
   "message": "NTA - Just take them with you. Roommate never paid for them.",
   "created_utc": 1701548890,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq3j6x",
   "message": "NTAH, but why tell your roommate anything, just take your stuff on moving day.",
   "created_utc": 1701549036,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq46er",
   "message": "NTA, if they would have paid when you asked there might be a different option (like pay for the other half now) but I'd just take MINE with me just like you are.  They want something for nothing lol.",
   "created_utc": 1701549300,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq4sug",
   "message": "They can wash their clothes at a laundromat",
   "created_utc": 1701549554,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq5jl8",
   "message": "NTA.  Obviously.",
   "created_utc": 1701549860,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq5nf7",
   "message": "Nta. You're the only one that paid for it, so you're the only owner.",
   "created_utc": 1701549902,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq5x80",
   "message": "Nope. NTA. It's yours",
   "created_utc": 1701550011,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq5xq1",
   "message": "NTA.\n\nThat's your property. You could offer to sell them to her for a good price, considering they're used now, but don't give them to her. Even if you can't use them at your new place, take them to sell. Let her use a laundromat.",
   "created_utc": 1701550016,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq66g4",
   "message": "If there was a washer and dryer in the apartment before those and you got rid of the original then you are legally obligated to leave them. You can't make the house worse than the original state it was when you moved in",
   "created_utc": 1701550114,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq6etg",
   "message": "lol no, NTA. Your soon to be ex-roommate failed to follow through with their half of the agreement, so instead of paying half price on a good deal they get to go pay full price. That's entirely on them.",
   "created_utc": 1701550205,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq7gv2",
   "message": "Seriously?  NTA.  It’s your washer and dryer.  You own it.",
   "created_utc": 1701550633,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq8w11",
   "message": "If you bought them you own them. NTA",
   "created_utc": 1701551210,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbq96eb",
   "message": "You bought them. Of course you take them. They can figure it out once you are gone. Not your problem",
   "created_utc": 1701551328,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqbcn6",
   "message": "NTA they are yours and yours alone since only you paid for them",
   "created_utc": 1701552204,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqbpiu",
   "message": "How would it work if they did split it with you?",
   "created_utc": 1701552347,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqc4pj",
   "message": "NTA. They are 100% yours right now. Roomie can use the community ones like every other person that has not bought their own W/D units.",
   "created_utc": 1701552516,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqc6wg",
   "message": "NTA\n\nMuch better just to pay for them yourself and keep them.  It would be so confusing if you moved after both if you paid equally for the appliances.  Who would get custody of the set?",
   "created_utc": 1701552539,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqcilr",
   "message": "You paid for 100% of the item, you are taking it with you. Your ex roommates want to pay half and keep the item cause \"you can get a better deal?\" No way you can think youre the asshole here. Sounds like a fake post, but it's waaaay too boring to be fake right? Lol\n\nTell your roommate that washer/dryer store may be hiring soon and they can possibly get a discount too.",
   "created_utc": 1701552670,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqclms",
   "message": "NTA - they are yours, take them.",
   "created_utc": 1701552704,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqd050",
   "message": "Nta they didn't contribute anything to them, there all yours",
   "created_utc": 1701552867,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqdzde",
   "message": "The entitlement is grand here\n\nNTA",
   "created_utc": 1701553260,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqept0",
   "message": "NTA , you are a good person for even bringing those machines for their entitled selves to use. The only thing I want you to have available is the receipts, in case they try to call the cops and claim you stolen it from them. Don't back down, they're users! Good luck to you!",
   "created_utc": 1701553558,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqetfq",
   "message": "NTA - do you get to keep all their shit that they paid for? No because they paid for it. Do they get to keep your car? Your bed? No because you paid for it. They sound like manipulative people. Reminds me of a narcissistic family member I have",
   "created_utc": 1701553599,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqf3pg",
   "message": "NTA. they haven't paid. End of discussion.  Sorry about their luck.",
   "created_utc": 1701553716,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqfa7i",
   "message": "Why would ybta for taking YOUR stuff?",
   "created_utc": 1701553790,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqfc9t",
   "message": "The best part is that you have machines at the apartment complex.",
   "created_utc": 1701553813,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqfu2z",
   "message": "NTA, they’re yours. It was kind of you to warn them they won’t have machines and to offer to sell them if they want them.",
   "created_utc": 1701554011,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqfzb2",
   "message": "It's yours. They're never paid you. It's simple. They were using you. What exactly are you trying to salvage....? Cuz this is not friendship. NTA",
   "created_utc": 1701554070,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqgxy8",
   "message": "Why would you be an asshole for taking something you bought and paid for they have paid nothing for.  That’s called just moving out and taking your stuff.",
   "created_utc": 1701554469,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqhxlm",
   "message": "NTA. Take your washer and dryer and leave a copy of “The Little Red Hen” in their place.",
   "created_utc": 1701554875,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqijob",
   "message": "They are yours take them and don’t feel bad",
   "created_utc": 1701555127,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqj1z1",
   "message": "\u0026gt;now that im moving out they’re arguing that i should let them keep them because i could get a better deal than they could xyz.\n\nI don't care what they're arguing, that's your property, take it with you.",
   "created_utc": 1701555336,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqj69t",
   "message": "Not an AH at all. Tell them you've long since paid for them. If they wanted ownership, they had their chance. If they want an in unit washer and dryer they have to buy their own just like everyone else. They can't just demand that someone give them theirs. That's not how commerce works.",
   "created_utc": 1701555385,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqjf61",
   "message": "Take that washer and dryer they are yours.",
   "created_utc": 1701555488,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqjyou",
   "message": "$500 for a 6 month 9pm washer and dryer?  They should jump all over that!  That’s very cheap.",
   "created_utc": 1701555709,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqkdik",
   "message": "Actually, it's better that your roommate didn't pay you because then they'd try to argue they owned half. And it sounds like your future ex-roommate would try that.\n\nGood for you for sticking to your guns, you're NTA.",
   "created_utc": 1701555880,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqkp18",
   "message": "You’re really not serious",
   "created_utc": 1701556010,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqm0bk",
   "message": "I would sell it on Craigslist to a choosey beggar for free with a cancer kid who's last dying wish is to have a washer dryer delivered to them.  Before I left it in that apartment.",
   "created_utc": 1701556546,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqmn5b",
   "message": "NTA. Not your problem. It’s their problem and they can figure this out on their own.",
   "created_utc": 1701556807,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqnfn8",
   "message": "NTA.  you bought the appliances they are yours....does they want you to leave your furniture and clothing behind too? This is no different.  They'll just have to revet back to whatever they did about laundry before you were kind enough to share your washer and dryer with them an that is NOT your problem",
   "created_utc": 1701557137,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqnpdg",
   "message": "NTA- it was nice of you to let them use your machines, and since you paid for them, they ARE your machines.",
   "created_utc": 1701557251,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqoytb",
   "message": "NTA. Haven’t paid, can’t use!",
   "created_utc": 1701557778,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqpqfq",
   "message": "You are NTA\nIf they HAD paid their half, then you would have to buy back their half to take it with you when you move. Or they would have to buy your share to keep it when you leave. \nThis way is easier. You own it 100%. It's yours to take with you. End of story.",
   "created_utc": 1701558103,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqqele",
   "message": "But at least maybe he can recoup some of the wear and tear and then using it for free",
   "created_utc": 1701558391,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqr9dr",
   "message": "NTA but your roommate wins the AH status instead. You bought them. Doesn’t matter where or what you paid. The fact is you paid for them. Roommate didn’t pay half as they promised and really shows their messed up thinking process by saying they’ll pay half now and then you should leave them with her. That’s nutz",
   "created_utc": 1701558754,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqrfxd",
   "message": "NTA You paid for them in full they are yours. I guess they’ll be going to the complex laundry.",
   "created_utc": 1701558831,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqsthc",
   "message": "You bought them.  They are yours to take.  Period.",
   "created_utc": 1701559432,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqsyrt",
   "message": "NTA, they are the problem.  They didn't pay and they can get thier own",
   "created_utc": 1701559494,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqtrfk",
   "message": "NTA. In fact you’re the opposite. The AH move would’ve been just taking them with you when you leave with no forewarning. Your roommate is just trying to get something for nothing. Ignore them and take your stuff.",
   "created_utc": 1701559841,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqu58k",
   "message": "You are definitely not an a\\*\\*hole.",
   "created_utc": 1701560003,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqvuug",
   "message": "NTA. You paid for it. They didn't. Even when you offered them the opportunity to do so. Why are you the ahole because they need something to wash and dry? They can buy it with their own money JUST LIKE YOU DID",
   "created_utc": 1701560741,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqyaaj",
   "message": "No",
   "created_utc": 1701561810,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqydta",
   "message": "NTA. You bought them, your roommate never reimbursed you, so legally and morally they’re your property. They’re going to have to either buy their own, or go back to doing their laundry in the apartment laundry facility.\n\nEdit: fixed pronouns",
   "created_utc": 1701561855,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbqzrcn",
   "message": "NTA. You bought appliances, so you take them with you. \n\nYour roommate is trying to force you to give expensive appliances to them. \n\nThe answer is no.",
   "created_utc": 1701562463,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr043d",
   "message": "You gonna give them half of your stuff? Your car? How about the money in your bank account?",
   "created_utc": 1701562618,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr1aj9",
   "message": "NTA, they're  yours! Take them! Why would you feel like an asshole when you paid for them and your roommate has been using them for FREE! Get over that guilt complex!",
   "created_utc": 1701563123,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr1ou4",
   "message": "YTA for making this post and having zero common sense. Of course you keep them.",
   "created_utc": 1701563289,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr1tqz",
   "message": "They are yours not theirs PERIOD. their lack of means or effort is not your problem. They need to grow up and enabling them is doing more harm than good.",
   "created_utc": 1701563345,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr29zn",
   "message": "NTA. They have the money for a laundromat.",
   "created_utc": 1701563536,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr2c7w",
   "message": "NTA. If you can get a deal on them again, the kind thing and overly generous thing to do would be to tell them you can get them a deal once they give you cash, but it doesnt seem like thats the case despite that they think you can. All that is irrelevant though. Its your property 100%. You gave them fair notice you are taking them with you. You owe them nothing. They got to use them for free while you lived there, that is plenty generous. They can probably find a marketplace deal on a set for a few hundred dollars. Maybe they could return some of the stuff they bought instead of paying you.",
   "created_utc": 1701563562,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr2nfn",
   "message": "Offer to help with your discount if they wanna buy brand new in full, but they have to pay for it all, if you feel bad .",
   "created_utc": 1701563694,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr2xbv",
   "message": "Nta. You bought them, you have been the only one to pay, even now they haven’t paid anything \u0026amp; seem to think they are entitled to them?!? They’ve used them \u0026amp; put wear n tear on them so you owe them nothing",
   "created_utc": 1701563813,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr3mpi",
   "message": "Did you throw a perfectly working set away so you had a place to put yours and now they dont have any? Otherwise NTA\n\nNormally NTA but extreme circumstances “could” make it questionable",
   "created_utc": 1701564122,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr5b8g",
   "message": "You brought them they are yours. Your are NTA its your property",
   "created_utc": 1701564860,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr61xj",
   "message": "You are NTA, you bought them with your money. The did not pay for their half. Therefore it is yours to do with as you wish. \n\n  \nAre you afraid of an asshole like them calling you an asshole? I really do not understand how you can in anyway think you are the asshole here. Fuck that roomate take your shit and be happy.",
   "created_utc": 1701565194,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr79n7",
   "message": "Fuck those assholes",
   "created_utc": 1701565732,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr7nis",
   "message": "It's your W/D.",
   "created_utc": 1701565903,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbr8fpv",
   "message": "You are ...NOT...the AH. Tell them to use the laundromat.",
   "created_utc": 1701566254,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbra52j",
   "message": "NTA. You purchased these large appliances on your own. They are your property. You’re not leaving him without a washer and dryer - he just has to work a little harder to wash his clothes now. The audacity of some people.",
   "created_utc": 1701567017,
   "score": 1,
   "submission_id": "1898iya"
  },
  {
   "comment_id": "kbra9e2",
   "message": "NTA. You paid for them. They’re yours.",
   "created_utc": 1701567071,
   "score": 1,
   "submission_id": "1898iya"
  }
 ]
}