{
 "submission_id": "18981uw",
 "title": "AITAH for dividing my family over my sister's bf?",
 "selftext": "Throwaway account. I planned a trip for my dad's birthday for the whole family (mom, dad, me \u0026amp; hubs, sis 26F \u0026amp; bf 26M) and planned to pay for everything but the flights. I tried to include my sister in the planning to be a good sibling, but she made everything painful and all about her - including changing where we'd fly into so it was $100 cheaper for her but 4 extra hours of driving to the spot, convincing my mom to get an airbnb instead of the hotel I was paying for, etc. \n\nThe trip was rough but I tried to keep the peace. The boyfriend would constantly sleep in and complain if we didn't do what he wanted that day, which sister would back him up on. On the 4 hr drive back to the airport, sis and I got into a squabble which resulted in the boyfriend calling me entitled and selfish. I think he wanted to be defending my sis, but it came across as very aggressive and completely uncalled for. I have spent all of 6 days with this kid, so I can't imagine this opinion is all his own - likely comes from my sister as we've had issues in the past. I told him to fuck off and we spent the rest of the drive in silence. My husband was ready to get physical if he said another word, it was pretty bad.\n\nHere's where I need help. Sister and boyfriend have never said anything to me since this incident 1.5 years ago. I told my parents I wouldn't be around him last Christmas and they said they wouldn't tell him he couldn't come, so I didn't come. I maintain the same conviction this year and my parents insist I just need to get over it. Apparently my sister tells my parents I just need to get over it, too. They tell me he's not going to apologize so there's no point in hanging on to this.\n\nAm I the asshole for dividing my family over this? I don't get how someone can be so disrespectful and yet I'm the one who just has to \"get over it\". For context, me and my husband have been together for 10 years. The boyfriend has been around for 2 years.",
 "created_utc": 1701536694,
 "permalink": "/r/AITAH/comments/18981uw/aitah_for_dividing_my_family_over_my_sisters_bf/",
 "score": 76,
 "url": "https://www.reddit.com/r/AITAH/comments/18981uw/aitah_for_dividing_my_family_over_my_sisters_bf/",
 "comments": []
}