{
 "submission_id": "189biyv",
 "title": "AITA for telling my aunt she is cruel for selling puppies.",
 "selftext": "I 33F and my husband 34M live on a farm with two houses.   My maternal aunt stays in one house and we stay in the other.  My husband and I have two dogs and my aunt has two.  My aunt expects us to feed her dogs with ours. she is working full-time and her salary is almost double what my husband and I make together.  We usually don't mind feeding all the dogs.  But about 4 weeks ago her female dog as well as our female dog both gave birth to a litter of puppies. This morning when I went to feed the dogs I noticed all her dog's puppies were missing.  When I asked her about them she told me she sold them as they are able to eat on their own and they just cost her money.  I told her they are only three weeks old. She then went ahead to tell me that she does not care.  I then told her that they still had to get milk from their mom, she proceeded to tell me that it does not bother her in the least because they are already gone. I called her a cruel old lady that only cares about money. She then told me that am an AH and need to treat her with respect as my mother would be disappointed in me at the way I was treating her.  (mom passed away 5years ago).\nSo AITA?\n\nUpdate to answer some questions:\n\n1.  I am from South Africa and the houses are in a estate from my grandparents. I own a third and she owns a third.\n2. We had our Male dog fixed and we had to wait for mom to be old enough unfortunately she got pregnant before we could. \n3. A couple of months ago we found a stray on the farm and immediately called the animal rescue (after which we found out she is pregnant at our vet appointment which is why we postponed our appointment to get her fixed to early 2024). \n4. We do keep our dogs seperate but found a hole in one of our fences, where the stray could have gotten in.\n5.  My puppies are still fine, I threatened to call the police if she so much as touched them.  To clarify we are not breeders. Even thought I never know what goes through her mind.\n6.  I showed all the comments to my husband, he is already so mad at himself and blames himself for the entire situation. Especially since the stray got in.  He now feels he does not do enough to keep us and the animals safe.  He actually does and I keep reminding him.  I also told him accidents happen. And we will just make sure to not let it happen again.\n7. We have a community group on WhatsApp and Facebook.  I send on both groups messages that if anyone has any information on the puppies or buyers to please contact me urgently. \n8.  We will also be talking to my aunt to get her dog fixed.   I am also going to tell her if she does not do it I will. ",
 "created_utc": 1701546530,
 "permalink": "/r/AITAH/comments/189biyv/aita_for_telling_my_aunt_she_is_cruel_for_selling/",
 "score": 247,
 "url": "https://www.reddit.com/r/AITAH/comments/189biyv/aita_for_telling_my_aunt_she_is_cruel_for_selling/",
 "comments": [
  {
   "comment_id": "kbq5sbx",
   "message": "In Sweden it is illegal to sell them before 8 weeks, kittens before 12 weeks they get to stay with their mother. She is an abuser for sure.",
   "created_utc": 1701549958,
   "score": 196,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbpxxkt",
   "message": "nta\n\nrespect is earned and shes a pos. honestly, if this was me, and this is probably an ah move but i wouldnt care, i had her dog fixed so she cant get pregnant anymore. she sounds like she shouldnt own dogs to begin with, let alone pups.",
   "created_utc": 1701546791,
   "score": 76,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqkqnu",
   "message": "It’s illegal in most states (here is the US) to get rid of puppies before 7/8 weeks. Mothers do more for puppies than feed them. I would call animal control on the old hag.",
   "created_utc": 1701556029,
   "score": 114,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbq29fz",
   "message": "NTA\n\nIt sounds like both of your dogs need a trip to the vet to get spayed.",
   "created_utc": 1701548517,
   "score": 181,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbpxirz",
   "message": "NTA, puppies should usually stay with their mother for 3 months",
   "created_utc": 1701546625,
   "score": 123,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqn51b",
   "message": "NTA,look into your areas law and report her. I'm not aware of any state its legal to do that and anyone that bought them is questionable",
   "created_utc": 1701557014,
   "score": 28,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqlytf",
   "message": "NTA your aunt is very cruel. No one in the right mind gives away three week old puppies. They cannot eat enough solid food yet. She's also an ahole for bringing up your mom. She probably sold them for Medical research.",
   "created_utc": 1701556529,
   "score": 51,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqnh4s",
   "message": "Selling 3 week old puppies like a heartless ignorant dipshit is the most on brand lead poisoned boomer thing it is physically possible to do. NTA but maybe a little of an AH bc you didn’t go far enough to instill deep shame in her thick skull. She would be embarrassed to be alive by the time I got through with her.",
   "created_utc": 1701557154,
   "score": 24,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqnkos",
   "message": "Who owns the property? If it's it you, give her notice to be gone by the end of February.",
   "created_utc": 1701557197,
   "score": 24,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqn288",
   "message": "I highly doubt she sold them. She killed them.",
   "created_utc": 1701556981,
   "score": 31,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqjxyt",
   "message": "NTA",
   "created_utc": 1701555701,
   "score": 12,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqnkks",
   "message": "I was going to say Y-T-A until I read 3 weeks, that's too young.  A reputable breeder won't sell a puppy until around the 9/10 week mark (depending on breed)\n\nNTA",
   "created_utc": 1701557195,
   "score": 8,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqqcab",
   "message": "Well, what she did is illegal. You should report her to the proper authorities in your area.\n\nBut you’re both TA. Fix your dogs.",
   "created_utc": 1701558364,
   "score": 16,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqm049",
   "message": "NTA your aunt is very cruel. No one in the right mind gives away three week old puppies. They cannot eat enough solid food yet. She's also an ahole for bringing up your mom. She probably sold them for Medical research.",
   "created_utc": 1701556544,
   "score": 8,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqowmt",
   "message": "You both are assholes for having unneutered dogs, and arguing about which of you are more cruel.",
   "created_utc": 1701557753,
   "score": 27,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqmzfg",
   "message": "NTA\n\n3 weeks? That’s cruel and will absolutely cause lifelong problems for those dogs. Respect is earned through action, not time spent with a pulse. \n\nHer dog about your mom is manipulative AF. She had nothing else intelligent or relevant to say so she reverted to insults. \n\nI’ll echo getting her dogs fixed. Since she DGAF about animal cruelty, she should be done having animals",
   "created_utc": 1701556949,
   "score": 6,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqp6uo",
   "message": "Nta.  It was a cruel/inhumane act.  The poor mother dog..",
   "created_utc": 1701557871,
   "score": 6,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbq9s50",
   "message": "ESH\n\nWhen there are so many discarded and homeless dogs being put to death,  you are both AHs to be breeding puppies.",
   "created_utc": 1701551577,
   "score": 43,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqpbcd",
   "message": "NTA but please get all the dogs spayed and neutered.",
   "created_utc": 1701557923,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqw09z",
   "message": "And what is your dog doing having puppies.  SPAY your dog!!!  Jeez",
   "created_utc": 1701560805,
   "score": 4,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqw9m3",
   "message": "if she didn't want puppies \"costing her money\" she should have had her damn dogs fixed. Some places will even do it for free or a severely reduced cost. There's just no excuse. \n\nas for her actions, would it be something you could report to the humane society or something?\n\nRespect is something that is EARNED, not a given. Her actions have not earned any respect and her inability to see her callousness just shows what an unpleasant person she really is. She deserves nothing but contempt. \n\nShe's already taking advantage of you by forcing you to care for her animals as she clearly can't be bothered. \n\nMaybe it's high time she had them taken away.",
   "created_utc": 1701560919,
   "score": 4,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqy1nt",
   "message": "Backyard breeders ick",
   "created_utc": 1701561705,
   "score": 5,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqqkfq",
   "message": "Call the police and report her for selling your puppies from YOUR OWN DOGS LITTER. At the same time contact whatever animal cruelty body who covers your country and report her for cruelty to animals. It’s harmful and negligent to part such young pups so have her charged on both fronts. Then separate your dogs from hers and refuse to pay to feed her dogs any more or to do the Labour if feeding them for her.",
   "created_utc": 1701558461,
   "score": 6,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbq2daq",
   "message": "I'm calling BS because no one is stupid enough to BUY 3week old puppies.",
   "created_utc": 1701548560,
   "score": 19,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqxq5o",
   "message": "ESH. Your aunt for selling puppies way too young but both of you are backyard breeders.",
   "created_utc": 1701561562,
   "score": 7,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqmni2",
   "message": "Not an asshole in any way, shape or form. She should be reported. Puppies should go to new homes at eight weeks of age AT THE EARLIEST.",
   "created_utc": 1701556811,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqotxt",
   "message": "NTA.  Fuck that old bitch.  Cut ties with her",
   "created_utc": 1701557721,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqpi49",
   "message": "NTA and she is TA.",
   "created_utc": 1701558003,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqs3gb",
   "message": "NTA\n\nTell her she has to pay rent. Charge her twice as much...to cover the cost of dog food.",
   "created_utc": 1701559117,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqtj6t",
   "message": "I thought this was gonna be like, one of those if you ever allow your dog to breed you’re ruining the world posts, but nah she’s the asshole. A few weeks is not gonna hurt her world as much as being separated from your mom too early does. What a hag",
   "created_utc": 1701559740,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqye0q",
   "message": "Desex your effin dog yo. Jeesus",
   "created_utc": 1701561858,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr13r6",
   "message": "YTA for not fixing your dogs.",
   "created_utc": 1701563044,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr1nxz",
   "message": "NTA\n\nWhy doesn’t your aunt feed her own dogs?  \n\nShe certainly had the energy to take not totally weaned pups from their mother and selling them I presume to a puppy broker.  \n\nI’d suggest you tell your aunt her dogs are her responsibility to feed but then I presume she’d let them starve or dump them.  \n\nI hope when her life ends on this planet she can explain herself to whatever deity she believes in for being such a cruel person.",
   "created_utc": 1701563279,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqry6y",
   "message": "ESH There are too many homeless dogs being euthanized every day for adding to their population to make any sense - spay your dog.",
   "created_utc": 1701559052,
   "score": 4,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqsncy",
   "message": "Dog pro here. Call animal control and report her. This is highly illegal. She sounds like a real peach. If you make that call, it'll probably be quiet on the farm for an extended period of time. You'll also be carrying for four dogs.",
   "created_utc": 1701559355,
   "score": 5,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqpmhh",
   "message": "NTA. Call a vet and ask if someone there can lay the biggest, thickest guilt trip on her possible. If she won't listen to you call her a cunt, maybe she'll listen to someone else.",
   "created_utc": 1701558055,
   "score": 4,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqtd68",
   "message": "Fun fact about respecting elders. Once you are an adult, they are no longer elders but peers.",
   "created_utc": 1701559668,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqnszr",
   "message": "NTA. Get her dog and yours spayed next time she goes out of town.",
   "created_utc": 1701557293,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqs4gl",
   "message": "NTA !! The harm it does to puppies being away from mum is unreal !! We got a puppy, was told 8 weeks but in fact was soooo much younger luckily I knew how to look after pups, however behaviour wise it’s hell !! They have no bight perception as play with mum and siblings teach them this, they get over stimulated really easily because again mum wasn’t around to teach, and so much more. It’s totally unfair on the pup to be taken away so young !",
   "created_utc": 1701559129,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqsx6k",
   "message": "Gross. I'd take her dog and get it fixed behind her back so she stops being a shitty dog owner.",
   "created_utc": 1701559476,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqw3ky",
   "message": "Your aunt is an evil pet owner and this story breaks my heart. She should not be allowed to own animals. She is cruel and you should report her to the ascpa. Those puppies need mother for at least 8 weeks!!",
   "created_utc": 1701560845,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqwwzb",
   "message": "NTA - and I feel very sorry for the two adult dogs she has; she doesn't deserve them.",
   "created_utc": 1701561205,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqzao9",
   "message": "NTA\n\nNot only is she cruel, but she’s likely a criminal. In most states it’s illegal to sell puppies before 8 weeks! It’s literally animal abuse!",
   "created_utc": 1701562255,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr2y4t",
   "message": "NTA and she's disgusting for bringing up your mother when your aunt is the one who did something morally reprehensible. Under no circumstances should those puppies have left their mom that young. What a horrible, selfish person.",
   "created_utc": 1701563822,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr403t",
   "message": "NTA - What your aunt did was monstrous to the puppies and their mother (who's probably searching for her babies).\n\nAlso, she's not entitled to respect simply because she's older.  Respect is earned and with what she did, she lost the respect of every dog-lover on Reddit.\n\nPlease spay and neuter your dogs.",
   "created_utc": 1701564285,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr4yf0",
   "message": "NTA, I recommend getting the female dogs fixed as well as the male(s). Especially the males if your aunt finds out you plan on getting the female fixed. If you and your husband own the farm give her notice and kick her out, she was already horrible but that comment about your mom made it even worse. Keep your puppies away from her and if you can find out the laws on selling puppies, if you can nail her for anything I'd say do it. If you can kick her out and do maybe see if you can rent the other house or something. Whatever you do make sure she doesn't get anymore puppies.",
   "created_utc": 1701564701,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr5f8z",
   "message": "Out of curiosity, whose dog knocked them up?",
   "created_utc": 1701564910,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr6jq3",
   "message": "NTA. You should call animal control on her ass!",
   "created_utc": 1701565419,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr6psv",
   "message": "NTA.",
   "created_utc": 1701565493,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr6vef",
   "message": "NTA. Should take her dog and get her spayed so she can no longer have pups. Your aunt is a garbage human being.",
   "created_utc": 1701565561,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr7k9a",
   "message": "ESH get both dogs spayed.",
   "created_utc": 1701565862,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr8vhd",
   "message": "Make sure your dogs are fixed. Don't let this asshole treat dogs that way.",
   "created_utc": 1701566447,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr9he1",
   "message": "NTA - literally lightyears from being TA. Your aunt was cruel, you told her the truth when you called her on it.  Thank you for doing so!  \nAunt isn't entitled to respect, but merits contempt.",
   "created_utc": 1701566719,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbq2wbh",
   "message": "As an animal lover, NBISTA. To be honest, your aunt is someone to stand on bidness.",
   "created_utc": 1701548775,
   "score": 3,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqxb6e",
   "message": "NTA\n\nBut I’d absolutely be the asshole, bc I’d be taking every dog on the farm, hers included, to get fixed.",
   "created_utc": 1701561377,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqqxjj",
   "message": "We got our dog at 5 weeks as the dad dog had eaten 3 of the other puppies , so I saved our astro , but she definitely needed more socialising  and puppy milk",
   "created_utc": 1701558616,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqxntq",
   "message": "Puppies need 6 or 8 weeks milk, so you're not wrong.  But if it's her place, her dog, she has to be respected even when you disagree.",
   "created_utc": 1701561534,
   "score": 252,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqus03",
   "message": "That's way too young for sure. Unethical.",
   "created_utc": 1701560272,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqvk8d",
   "message": "NTA, you were right. It’s disgusting to breed animals for cash.",
   "created_utc": 1701560615,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqwcs9",
   "message": "She's the AH. Pups have to stay until weened; 6-8 weeks AT least. In some states it's illegal and she could get animal abuse charges because there isn't much chance those pups are gonna make it unless they're bottle fed.",
   "created_utc": 1701560958,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqwfjw",
   "message": "That’s fully illegal to sell\nBefore 8’weeks of age in many countries",
   "created_utc": 1701560992,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqwpgd",
   "message": "Pretty sure in the UK it is illegal to sell puppies before 8 weeks (could be more). I'd report somebody if they did what your aunt has.\n\nNTA",
   "created_utc": 1701561113,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqwxih",
   "message": "NTA and she needs to get her dog fixed.",
   "created_utc": 1701561211,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqxo8o",
   "message": "NTA.  It raises their risk of cancer astronomically.  I had the most amazing “throwaway mama,” EmmyLou.  She died of breast cancer.  It is brutally cruelty what your Aunt is doing.  Thank you for standing up for the animals.",
   "created_utc": 1701561539,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqzaiz",
   "message": "No but you live next to her lol. Good luck.",
   "created_utc": 1701562253,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqzotu",
   "message": "I didn’t read past the title——no you are not. I hate dog breeding, period.",
   "created_utc": 1701562432,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbqzpqm",
   "message": "NTA if you can call animal protective services and animal control because bits definitely abuse of animals and those puppies could die from not getting the nutrients they need to survive.",
   "created_utc": 1701562444,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr0ai5",
   "message": "NTA at all - there’s a special place in hell for people who could be this cruel to vulnerable puppies and their poor mom. Also, way to set these pups up for failure - they get a lot of important behavioral queues from their mom and siblings in that 4-8 week period.",
   "created_utc": 1701562696,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr1ad4",
   "message": "I don’t know if there’s a law in Canada but almost everyone I’ve met waits until 8 weeks for pups and kittens - I worked with a cat rescue and we rehomed at 8 weeks. \nThe lady we got our puppy from (my daughter rescued the litter from under a small shack and was offered a pup as a reward for her help) was giving them baby formula full of lactose so we took our pup at 5 weeks at the direction of our vet. He’s special … probably from being taken so early or from being fed inappropriate food",
   "created_utc": 1701563121,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr1gzq",
   "message": "NTA but you both need to get your dogs fixed.  There are already too many being euthanized everyday because no one wants them",
   "created_utc": 1701563198,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr1mjt",
   "message": "I doubt she sold 3 week old puppies unless it was to be lab animals. I suspect she killed them.",
   "created_utc": 1701563263,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr1vz9",
   "message": "Hi, everybody sucks here. Why are either of you breeding?",
   "created_utc": 1701563371,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr2t1j",
   "message": "That’s horrific.\n\nSteal her animals and get them fixed",
   "created_utc": 1701563762,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr4cxl",
   "message": "I think dog breeding in general is cruel. You force a dog to go through the pain of giving birth over and over, then steal their babies so you can make a profit. They get nothing out of it.",
   "created_utc": 1701564440,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr4s49",
   "message": "NTA. She is cruel.",
   "created_utc": 1701564625,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr59hv",
   "message": "NTA. She is a shithead.",
   "created_utc": 1701564838,
   "score": 2,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr5bot",
   "message": "NTA\n\nI would report her. Selling the puppies that early is completely wrong. And tell her your mother would support you being against animal cruelty. Blast her on all forms of social media. Make her life a living hell.",
   "created_utc": 1701564866,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr762v",
   "message": "Sooo you’re backyard breeders?",
   "created_utc": 1701565688,
   "score": 1,
   "submission_id": "189biyv"
  },
  {
   "comment_id": "kbr7lv5",
   "message": "What a bitch. I’ve worked with rescue for MANY years and the earliest a pup should leave Mom is at 8 weeks.  Yea things happen and that can’t always be the case, but this is pure selfishness and greed in your Aunt’s case. Those pups, if they even survive this are going to have a plethora of health and behavioral issues. Then as I’m sure your Aunt since she’s nothing but a backyard breeder, and doesn’t have a contract saying to give the puppy back to her in the case it doesn’t work out, will be dumped at a shelter or worse. \n\nYou are absolutely NTAH. Your Aunt on the other hand is a huge one.",
   "created_utc": 1701565882,
   "score": 1,
   "submission_id": "189biyv"
  }
 ]
}