{
 "submission_id": "189bgbn",
 "title": "AITAH for twisting my mom's arm after she wouldn't stop hugging me when I wanted to be left alone?",
 "selftext": "Yesterday after I came home from school, I just wanted some time to myself to relax and watch some YouTube videos. When I got to my room, my mom followed me in and tried to give me a big hug even though I told her nicely \"not right now, I want to be alone for a bit.\"\n\nShe kept saying \"but I'm your mom, I just want to hug my kid...\" No matter how many times I told her politely that I needed some space (probably said it 5 times), she wouldn't listen.\n\nI finally got so frustrated that when she went in for another hug, I sort of twisted her arm to get her to stop. I barely used any force at all, and she didn't get injured or anything.\n\nBut she went crying to my dad making it sound like I violently attacked her for no reason. She told him she wishes she never had me just because I didn't want a hug after school. My dad called me into his room and said \"Why did you hit your mother? She says she wishes she never had you, that's an awful thing for a mom to say.\"\n\nI tried explaining that I barely touched her and just wanted to be left alone. He told me to apologize so I did, even though she was the one smothering me when I politely asked for space several times.\n\nLater, my mom came into my room AGAIN as I was trying to watch videos and started lecturing me about studying more because my cousin just recently got a good job because of studying. I told her I have all A's, and why this even had anything to do with our previous conversation. I ignored her but she got mad that I wasn't paying attention to her.\n\nWhen my dad came in and sat on my bed too trying to talk to me, I sort of snapped and was like \"I don't need another person on my bed!\" So I went to the guest room and just slept there the whole day to get away from them.\n\nNow today my dad is pissed and my mom is still being kinda cold to me. But I don't think I really did anything that wrong here... I just wanted to be left alone and blew up after asking nicely many times. AITA?\n\n\\----------------------------------------------\n\nUpdate: I talked to my mom and she actually said she wasn't even mad at me for twisting her arm yesterday. She was more upset that I was being \"distant\" and she thinks I don't \"love her\" anymore just because I wanted a little alone time after school.\n\nSo clearly I'm NTA there. But now my dad is the bigger issue.\n\nMy parents got into a bad fight about some financial problems my family is having. I'm interested in finances and want to be a financial advisor one day, so I tried offering my dad some advice on where I thought he was going wrong financially.\n\nWell he got really pissed off and aggressive about me \"teaching him\" and when I tried to just walk away from the argument, he grabbed my hand and twisted it a little, but he purposefully tried not to add any force for it hurt but I knew exactly what he was doing.\n\nHe was still mad about the situation with my mom yesterday and did that to show me what it felt like when I twisted HER arm. Even though I barely touched her and she admitted she wasn't even hurt or upset!\n\nThis whole thing feels ridiculous. I just wanted to be left alone for a night to relax, and now my family is imploding with these crazy arguments over nothing. Am I the asshole here?? My dad is way more out of line getting physically aggressive when financial advice triggers him. My dad has a bad history when it comes to financial matters, like INSANELY bad. To the point, even a 15 y/o (me) is better than him when it comes to financial decisions. This whole situation feels like a movie, there is no way this is shit is actually happening. What the actual fuck am I supposed to do? Stay in this shitty household for another 3 years?  Not to mention, last night he was somewhat on my side and understood where I was coming from Now it feels like he's completely against me like wtf??  \n\n\nI think it's too late to figure out if I'm the asshole or not, because I know for a fact I'm not. I don't need sympathy points or whatever. I'm leaving this post up because I have no idea what to do and leaving it for recommendations on how I could get my parents to better understand me and turn this whole situation around. \n\n\u0026amp;#x200B;",
 "created_utc": 1701546332,
 "permalink": "/r/AITAH/comments/189bgbn/aitah_for_twisting_my_moms_arm_after_she_wouldnt/",
 "score": 196,
 "url": "https://www.reddit.com/r/AITAH/comments/189bgbn/aitah_for_twisting_my_moms_arm_after_she_wouldnt/",
 "comments": []
}