{
 "submission_id": "189duw8",
 "title": "Aitah for telling my mil to just keep the clothes?",
 "selftext": "Aitah  for telling my mil to just keep the clothes? One of our daughters love in another state and so for Christmas I bought her some clothes and my husband told me to have them shipped to my mils house so she could add her gifts before shipping them to our daughter. Yesterday the outfits arrived I asked her to open the package to make sure everything was there, today she sent me pictures of our neices wearing the outfits. She was not confused about who they are for but said she wanted to see how they fit. I'm not body shaming here but our daughter is tall and skinny, our nieces are short and over weight. I told her to just keep the outfits and I would by our daughter more but not shipped to her. My husband says I am an ah for this and that his mom didn't do anything  wrong. So here I am shopping again wondering if I am tripping. Aitah?\n\n\nJust for those who will ask our daughter that lives out of state is my stepdaughter she lives in PA,  my mil lives in TN, and we live in il. Which is why we figured one big package this year would be easier then everyone sending separately. I am also not going to be sending her toys there either because I don't want her cousins playing with them first.",
 "created_utc": 1701553224,
 "permalink": "/r/AITAH/comments/189duw8/aitah_for_telling_my_mil_to_just_keep_the_clothes/",
 "score": 83,
 "url": "https://www.reddit.com/r/AITAH/comments/189duw8/aitah_for_telling_my_mil_to_just_keep_the_clothes/",
 "comments": [
  {
   "comment_id": "kbqf83b",
   "message": "NTA\n\nI wouldn't want my daughter to think that I was sending her used clothes.",
   "created_utc": 1701553766,
   "score": 125,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqh9mp",
   "message": "In what universe is what your MIL did appropriate? That’s absolutely wild she thinks allowing your nieces to try on your daughter’s clothes is an ok thing to do.",
   "created_utc": 1701554600,
   "score": 103,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqlswd",
   "message": "NTA, who the fuck opens gifts meant for another person and uses it themselves/on kids NOT meant to have it to \"see if it fits\"?\n\nI wouldn't send the toys to her either, she'd probably give it to the nieces and then claimed they got lost or something so the nieces could keep them. Wasting your money, and time.",
   "created_utc": 1701556462,
   "score": 57,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqjku2",
   "message": "Whose idea was it to double ship the clothes?  Seems like a huge waste of money.  NTA and it was very weird of your MIL to have the cousin's try on the clothing.",
   "created_utc": 1701555553,
   "score": 49,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqieud",
   "message": "NTA - they are for your daughter, not nieces.",
   "created_utc": 1701555072,
   "score": 22,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqn4b5",
   "message": "NTA. Doesn't your husband care those clothes meant for his daughter are probably stretched out? If those cousins are a bigger size than you SD, than they most definitely won't fit right. Now you know that your MIL can't be trusted with sending stuff to your SD.",
   "created_utc": 1701557005,
   "score": 14,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqphg3",
   "message": "Remember this: If you want something done right do it yourself.",
   "created_utc": 1701557995,
   "score": 13,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqmpon",
   "message": "NTA I would be pissed and do exactly what you did. New clothes for your daughter period.",
   "created_utc": 1701556836,
   "score": 17,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqqvej",
   "message": "You are not the asshole at all, your MIL is for taking the clothes and letting someone else put them on. If your stepdaughter is smaller than her cousins then she doesn't want stretched-out clothes that don't fit.\n\nJust sending them to her yourself makes more sense and your husband is being as big of an asshole as his mother is for defending her.",
   "created_utc": 1701558590,
   "score": 8,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqejoc",
   "message": "NTA. Your opinion.",
   "created_utc": 1701553489,
   "score": 6,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqopz7",
   "message": "I’m confused as to why you’d ship to mil instead of directly to daughter. Did your husband intend for her to get the credit for giving the gifts to your daughter? NTA and just give your gifts directly.",
   "created_utc": 1701557674,
   "score": 7,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqteu4",
   "message": "It makes 0 sense to ship the clothes to the mil so she can add her stuff and then send it on. Buy new stuff, send it direct. So what if multiple packages get sent- it truly does not save big bucks to do it that way - only reason to do that is if the recipient only gets their mail at a PO Box and the shipper can’t deliver it there.",
   "created_utc": 1701559688,
   "score": 5,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqzsdh",
   "message": "Why would she put the clothes on kids who they weren’t for?",
   "created_utc": 1701562476,
   "score": 5,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbr5vnv",
   "message": "NTA. Who puts a gift on another kid????",
   "created_utc": 1701565115,
   "score": 5,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqon29",
   "message": "NTAH",
   "created_utc": 1701557640,
   "score": 3,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqp6b4",
   "message": "NTA. Bizarre.",
   "created_utc": 1701557865,
   "score": 3,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqwdoy",
   "message": "MIL was way out of line. Keep her out of anything in the future.\n\nGet Stepdaughter clothes that haven't been worn.",
   "created_utc": 1701560969,
   "score": 4,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqyprm",
   "message": "Big no. Buy new stuff. And just in case the MIL decides to send the stuff anyway, I’d let them know what happened. Send stuff direct from now on.",
   "created_utc": 1701561999,
   "score": 4,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbr1qii",
   "message": "Stick to your guns on this. MIL seems like the type to force your daughter to share. All the while sharing is ruining the experience for your daughter. Opening up gifts and trying them on is a really nice experience. Taking that away to give to the niece is not cool. Don’t allow them to set this precedent that you will take what she gives you.",
   "created_utc": 1701563308,
   "score": 5,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqhlzc",
   "message": "[deleted]",
   "created_utc": 1701554742,
   "score": 3,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqwufe",
   "message": "NTA at all.... MIL was way out of line and the double shipping seems like a waste. Just send directly to your daughter.",
   "created_utc": 1701561174,
   "score": 3,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbr1s3h",
   "message": "NTA  Tell husband that you're glad that he feels that way because you had ordered some clothes for him too but had the sent to (name of friend) house but their son found them and wore them so you're glad to know it's okay that someone else wore his new clothes before he got a chance to. See what he says about it then. Afterward you can explain it didn't happen that you just wanted him to understand what his mom did was not okay.",
   "created_utc": 1701563326,
   "score": 4,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbr3tda",
   "message": "Your mil did everything wrong.the fact that your husband thinks this is ok is ridiculous.Buy more clothes, ship directly to who you want them to go to. If mil tries this again tell her that the clothes were not meant for the niece’s, you had to spend more money to replace them, and you won’t be shipping to her anymore to save money. Tell husband that this will not happen again.  If by chance you buy gifts for your nieces tell your mil to consider those their Christmas presents.",
   "created_utc": 1701564203,
   "score": 4,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbr5g8c",
   "message": "Lesson learned. \n\nYes shipping is expensive these days but is still better than having your MIL pull this. Buy your stepdaughter new clothes, and unless the store will wrap for you, have them sent to you. Wrap them, box them up and ship them.\n\nIf your MIL does wrap and ship like she was supposed to, to begin with, tell your stepdaughter the truth and make arrangements to have the stretched out clothes shipped back to the store as a return.",
   "created_utc": 1701564922,
   "score": 3,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbr9h7l",
   "message": "NTA\n\nGood choice to replace them instead of sending used stretched out gifts. Your MiL was out of line IMO.",
   "created_utc": 1701566717,
   "score": 3,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqfibd",
   "message": "Is it that they had the clothes on their skin or that you think they tore them? I can’t be sure without knowing the size difference. Were the clothes going to be a tight fit for your daughter or loose like a maxi skirt or cardigan?",
   "created_utc": 1701553879,
   "score": 0,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqn9xw",
   "message": "It's odd that she did that, but obviously no malice was intended.\n\nBut you insisting on buying new clothes was deliberately offensive.\n\nYTA.",
   "created_utc": 1701557071,
   "score": 247,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbql9fa",
   "message": "YTA. Do you ever buy clothes in stores? Fun fact: other customers have tried them on before you.\n\nDo the nieces have lice? Do they never shower? Or why is trying them on such a big deal here?",
   "created_utc": 1701556240,
   "score": 244,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqs1gc",
   "message": "I don't know why you think the nieces weights are relevant to your point tho",
   "created_utc": 1701559092,
   "score": 251,
   "submission_id": "189duw8"
  },
  {
   "comment_id": "kbqz7fh",
   "message": "Your husband is an idiot. Sorry. They used the presents you bought for your daughter. \nThis is not normal behaviour.\n\nI would be honest to it to MIL (without the bodytype thing) and say that it was not ok to use the clothes.",
   "created_utc": 1701562215,
   "score": 1,
   "submission_id": "189duw8"
  }
 ]
}