{
 "submission_id": "189ddpg",
 "title": "AITAH for telling my sister that her husband set me up with a pimp?",
 "selftext": "I (19F) was set up to go on a date with a guy Jack, by my sisters husband Blake (32M). I was over at my sisters house with her, Blake and their children about 2 weeks ago, and Jack came over to drop something off to Blake. We met and I thought he was cute. Blake later told me that Jack asked for my number and he gave it to him, and that since I’ve been single for a while, Jack is a good guy and I should give him a chance.\n\nJack and I went on a first date later that week and a second one two days ago. Things were going ok. I wasn’t crazy about him but it seemed we were compatible and I enjoyed our conversations. He told me that he works as a mechanic but he never spoke much about it and dodged most of my questions, which I thought was odd.\n\nDuring our date 2 days ago, he told me he wanted to be honest and tell me the truth about him because I’m his dream girl and he can see himself with me long term, and he needs to know now if I accept him for what he is. He told me he’s a pimp. He’s the manager at a “strip club” which is actually just an illegal brothel and his job is to find girls willing to do the job, and find men that want the service. It’s illegal in our country and pimps get probably a decade in jail if they’re caught. \n\nI was honestly shocked and told him I’m not interested in dating someone who does that for a living, and quickly left. I called Blake and asked him if he knew what Jack does for a living and he said “yeah, what about it?”. I said “wtf do you mean what about it?? Why wouldn’t you give me a heads up about that?” And he said “you’re acting like he’s a murderer. Relax, not even he owed you that information”. I was honestly very pissed off and told him to F off. \n\nI told my sister what happened and she had no idea Jack was a pimp, and got angry at Blake for setting me up with him without telling us what Jack actually does. Blake also apparently lied to my sister that Jack was a mechanic and only found the truth out through me, so they’re having quite the fight at the moment. Blake called me but I didn’t pick up, and he later sent a message saying “I hope you’re happy with the anxiety you’ve given your sister, all because you exaggerate and over react to every little thing”.",
 "created_utc": 1701551840,
 "permalink": "/r/AITAH/comments/189ddpg/aitah_for_telling_my_sister_that_her_husband_set/",
 "score": 227,
 "url": "https://www.reddit.com/r/AITAH/comments/189ddpg/aitah_for_telling_my_sister_that_her_husband_set/",
 "comments": []
}