{
 "submission_id": "189epq2",
 "title": "AITAH for telling a neighbor to stay out of my yard?",
 "selftext": "For the past couple of months I've noticed one of my neighbors walking his dog through my front lawn. Rather than walking on the street he walks ~10 feet into my yard and continues to walk his dog to the next street corner. For a little more context, I live on a corner property and my front and side yard are not fenced in, but my back yard is. I haven't said anything (until today) because it seems like something that isn't worth getting upset over. Over the last 2-3 weeks I've found 3 different piles of dog poop in my yard while raking,  I don't know it's his dog for sure, but he's the only person I ever see walking his dog on my lawn so I while I can't guarantee it's him, I feel like it's likely.  Today I was in the kitchen making coffee and I see him walking through my yard, and his dog starts playing in a pile of leaves that I had raked but hadn't picked up yet. Instead of making his dog stop, he just sat there and watched it. I was pretty pissed about this because that meant I'd either have to rake them back up or it would be more difficult to scoop them into a yard waste bag. So I went outside and said to him \"hey man,don't walk your dog through my leaves, I don't want to deal with that\"  and he immediately got very defensive and told me he was new to the neighborhood.  I told him that was irrelevant and he needed to keep his dog out of my leaf pile. He proceeded to tell me that he was originally from LA and so he didn't know what the \"lead protocol\" is. It seemed like common enough sense to me,so  I responded by telling him to not come onto my property anymore, and stay the hell off of my lawn.  He proceeded to call me a jack ass and flipped me off as he was walking away. I feel like I have the right to tell somebody they aren't welcome on my property, but was I perhaps over reacting?  I know I can be a bit self righteous at times and part of me is worried I'm turning into the stereotypical \"stay off my lawm!\" Old dude.  Any thoughts and perspectives would be appreciated.",
 "created_utc": 1701555779,
 "permalink": "/r/AITAH/comments/189epq2/aitah_for_telling_a_neighbor_to_stay_out_of_my/",
 "score": 1,
 "url": "https://www.reddit.com/r/AITAH/comments/189epq2/aitah_for_telling_a_neighbor_to_stay_out_of_my/",
 "comments": [
  {
   "comment_id": "kbqqne8",
   "message": "Fuck that guy. Staying off private property isn't a big secret us suburbanites keep from city dwellers. Neither is picking up your dog's shit.",
   "created_utc": 1701558495,
   "score": 145,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbqryhe",
   "message": "Motion-activated sprinklers. They're cheaper than fences. Get a camera on it, too. That way, if he retaliates, you'll have evidence. NTA.",
   "created_utc": 1701559055,
   "score": 37,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbquul7",
   "message": "NTA. What does being from LA have to do with it? Stay off people's lawns and property and pick up after your dog. That's pretty much common sense across the US.",
   "created_utc": 1701560303,
   "score": 160,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrb9uq",
   "message": "So in LA your dog can shit on anyone’s property.. you don’t pick it up and it’s cool? Seriously doubt Californians wouldn’t have a shit fit over dog shit left abandoned in the yard. Stay the F off my lawn is totally appropriate.",
   "created_utc": 1701567513,
   "score": 24,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbqkze6",
   "message": "NTA, and it might be time for a fence.",
   "created_utc": 1701556127,
   "score": 40,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbra82h",
   "message": "NTA  Protocol anywhere is you don't trespass on someone else's property and you don't allow your dog to mess up someone else's hard work.",
   "created_utc": 1701567053,
   "score": 11,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrqedk",
   "message": "NTA. He knew exactly what he was doing and did not care about you or your lawn. Playing dumb does not work. He behaved like an AH and demonstrated that to you. \n\nFind out where he lives and give him back his dog's poo.\n\nYou did not overreact.",
   "created_utc": 1701574353,
   "score": 11,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbru1ag",
   "message": "For about 20 years we had a small picket fence in our front yard right along the sidewalk, because our house is close to the street, and to give structure to and protect my wife’s very involved front garden. It finally rotted away this summer. So we took out the remains and my wife said let’s not replace it. \n\nSince then, I’ve seen several neighbors walking in our garden even though the sidewalk is right there.   And a group of 12-year-old boys stomped through  the garden onto our front porch and dingdong ditched us 😂\n\nWho knew that a ratty old wooden fence was all that was separating us from the fucking heathens in this neighborhood! \n\nThe fence is coming back next spring. \n\nYou should get a fence, too!",
   "created_utc": 1701576076,
   "score": 10,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbqlcsu",
   "message": "Nta. Report him to HOA if there is one. Or document and then post on local social neighborhood groups.",
   "created_utc": 1701556278,
   "score": 13,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrooua",
   "message": "NTA - this might be too much, but my dad would take pictures and video of a dog pooping on his lawn and the owner just leaving it there. He sent them to the municipality and they fined them. My dad was persistent and they avoided his lawn after that. \n\nYou telling the neighbor to his face was more than he deserved, you did a good thing.",
   "created_utc": 1701573571,
   "score": 4,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrtz58",
   "message": "NTA. Its not okay to fuck up someone's yardwork then act like he was entitled to, then act like *you're the problem.* He's boundaryless. \n\n\nYou could always take his dog poop \u0026amp; smear it *all over his front door, grand brown swooshes ala Pollock.* He's trespassing \u0026amp; is well aware of it. His too cool for school el lay excuse is doody too, bc ppl from bigass cities are REAL aware of personal property \u0026amp; space, overly so. \n\n\nThe acceptable response would have been, \" Oh, hi, sorry! I didn't mean anything. Hey, let me put it back the way it was. I'm so sorry. Btw, my name's Matt. I just moved to the block.\"\n\n\nDoubt Matt'll stop. Can you fence that stretch? Get a camera on your porch?",
   "created_utc": 1701576046,
   "score": 5,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs65rt",
   "message": "What a liar! LA doesn’t want people walking on neighbors’ lawns either",
   "created_utc": 1701582417,
   "score": 4,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrcc6k",
   "message": "NTA. Fucker needs to stay off your lawn. Now he knows!",
   "created_utc": 1701567987,
   "score": 4,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrjxzq",
   "message": "Does LA not have houses on corners with no fences?  Seems a strange excuse for not having common courtesy.  Not TA but the neighbour is.",
   "created_utc": 1701571381,
   "score": 4,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrruxt",
   "message": "Ef that asshole\nThese people that think their neighbors properties are a toilet bowl for their dogs\nI had a similar incident. I was pleasant about it the first time..\nI asked the woman to please keep her dogs off my property. Corner lot. No fencing.\nA couple days later, she and her SO( M) walk their dogs by my driveway.  I'm in the garage. I hear that creaking sound of a retractable leash. Yep both of their dogs are in my yard \nI looked at them both and said \" you're kidding me, right?\"\nThey both look at me like WTF are you..I repeated my demand ..\nWell, the guy has to stand up for his woman.\nI told him point blank to stand down and back off. That this wasn't a battle he wanted.. they stormed off in a huff..",
   "created_utc": 1701575041,
   "score": 4,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs1vwg",
   "message": "NTA. I've lived in suburbs, cities, apartments, whatever. If there's a patch of grass between road and sidewalk, I keep to that. If there isn't, I stay within 2 or so feet of someone's lawn and pick up any crap (should be obvious but yknow). 10ft into someone's yard? Is he brain dead? That's hella rude.",
   "created_utc": 1701579991,
   "score": 4,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrajfs",
   "message": "I feel like there should only be other measures taken IF he so happens to step foot on your lawn again.. or if you find more dog shit on your lawn. Otherwise, I feel like there shouldn’t be anything to come of this if he listens and respects your request for him to stay away.",
   "created_utc": 1701567195,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrp31p",
   "message": "NTA. I watched in disbelief as a neighbor lead a whole pack of beagles across our yard. It was rude. Maybe he caught my annoyance because he stopped.",
   "created_utc": 1701573753,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrv55n",
   "message": "In my neighborhood you have to clean up your dogs poop or get fined.",
   "created_utc": 1701576609,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs4i5q",
   "message": "I looked around my neighborhood and realized that all the houses on corner lots have flower beds right on the corner next to the sidewalk. Most have a small tree and perhaps some decorative rocks. This would require a corner cutter to either stay on the sidewalk or cut far into the lawn near the house to cut the corner. The lots are not particularly large but have a minimum setback of 20 feet on the front and 15 feet on the side. So some creative landscaping might help your situation.",
   "created_utc": 1701581452,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs63sl",
   "message": "NTA",
   "created_utc": 1701582386,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbshdyl",
   "message": "If he’s from LA (the city) he should know better.",
   "created_utc": 1701590275,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbshvhl",
   "message": "NTA\n\nI don't care what kind of weirdo friendly neighbor shit you did in your previous city but around here we stay off other people's property. Fuck that guy",
   "created_utc": 1701590647,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsnt0b",
   "message": "Well, he was irritated by being called out but the next stage is to see if he stops. I wouldn't be surprised if he does and if you, excellent. If he doesn't  I love the sprinkler idea 🤣\n\nNTA",
   "created_utc": 1701595354,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsnxpx",
   "message": "I would shout Honey get my shotgun I got to varmits to shoot.\n\nNot American just grew up watching US films.",
   "created_utc": 1701595461,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsz482",
   "message": "NTA. People like him are why I constantly tell my kids to get out of somebody's yard. We have a large enough yard that my kids do not need to mess around in the neighbors' rocks. I caught my son shortcutting through the yard of the corner lot on his way home from the bus Friday and yelled for him to not be rude like that. Thanks for reminding me to address it with him in more depth than the immediate \"git awf their lawn!\"",
   "created_utc": 1701604579,
   "score": 3,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrusn1",
   "message": "As a California native - sorry our plague has spread to your yard..the flipping you off when he’s caught outta pocket is quite the LA move. NTA \u0026amp; eff dat guy.",
   "created_utc": 1701576438,
   "score": 6,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrfdpj",
   "message": "NTA, not yours, don’t touch and stay off it. It’s private property, not public.",
   "created_utc": 1701569342,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrkfqp",
   "message": "Get the hose.",
   "created_utc": 1701571601,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrl1hu",
   "message": "If you can't decorative fence, auto sprinkers, air horn if you see it( dog will remember and be afraid). Follow him home filming or pretending to. I have two huge bulky mixes, when we walk, no potty till we hit the park, period. Females, pee will brown lawns. Live in CA, poop bags on auto order. He's a dick, This girlie would be proactive and let him know, it's not happening.",
   "created_utc": 1701571871,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrmv55",
   "message": "NTA. \n\nIt’s rude to leave anything behind on another’s property.  Even if the dog never left you any gifts, he will all too soon trample a path into your grass, which will encourage others to use the same pathway, exacerbating the damage.",
   "created_utc": 1701572710,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrxh06",
   "message": "put a fence",
   "created_utc": 1701577743,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs3635",
   "message": "NTA.  He's probably letting the dog wander off-leash as well.  Take that opportunity to nail it to his front door with a polite note \"You dropped this.\"",
   "created_utc": 1701580692,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs400k",
   "message": "NTA. I live in a city that has been inundated by people moving here from other, more expensive coastal states, and the amount of entitlement about where people feel they should be allowed to go and what they feel entitled to do while they’re there…   My puppy knows the command “stay off the yard”, and knows he can wander anywhere between the edge of the yard and the street (leashed, of course). If he can figure out boundaries I don’t understand why other AH can’t.",
   "created_utc": 1701581160,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs76zz",
   "message": "Your neighbor was being a jackass by stating he didn’t know what the leaf protocol is. Fuck him.",
   "created_utc": 1701583043,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs9db7",
   "message": "I too live on a corner lot. Between a college and off-campus apartment complex. It’s unreal. I also asked a guy to keep his dog out of my yard and he was pissy about it. First of all, it’s my property and he has no right to trespass on it, secondly my lawn is chemically treated. It’s organic chemicals, but I’m sure it’s not good for his dog, who will go home and lick his paws.",
   "created_utc": 1701584453,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsj7nm",
   "message": "\"I'm from LA I didn't know your leaf protocol\" is such a just mind blowing cope.\n\nlike. dude. do you know what you are a blood in a crip area protocol is? stay the fuck off other people's lawns goddam",
   "created_utc": 1701591671,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbskrbn",
   "message": "NTA he’s a lazy idiot.",
   "created_utc": 1701592888,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsx10u",
   "message": "There is a reason for \"stay off my lawn\" and you just discovered it.  You do not have to deal with his animal's filth or re-raking your leaves.  Also foot traffic compacts soil, causes erosion and kills grass.  Additionally, you are responsible for any injuries on your property.  Post a sign that says, \"Stay off the lawn\" and spread red pepper liberally throughout the grass.  When he comes back with that dog, and he will, the dog will try to pull him right off the grass.",
   "created_utc": 1701602956,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbt6d65",
   "message": "Nta\n\nDogpeople truly are a different breed.",
   "created_utc": 1701609468,
   "score": 2,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbr1xzf",
   "message": "Not sure about your city, but our streets have right of ways. Generally 20-30 feet either way from street centerline is owned by city, for sidewalk,  utilities, etc. Our actual property line is 25 feet from edge of street on 2 sides of yard. Our neighborhood  doesn't have sidewalks so I always told my kids to walk in grass, if the neighbors complain,  inform them that this land belongs to the city. We can't put trees or fences up, the city comes and cuts them down.   Also, NTA. Because get out of my yard, asshole.  And pick up the shit and put it on his front step.",
   "created_utc": 1701563394,
   "score": 5,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrdlsr",
   "message": "Esh from what I can tell. You have every right to tell the guy to stay away but it sounds like you came out on the offensive right away with accusatory language, which triggered his defensiveness, and ultimately caused a feedback loop of escalation and lead to a breakdown in communication where no one is likely to see the other's pov.",
   "created_utc": 1701568548,
   "score": 250,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrwqu0",
   "message": "NTA. If it weren’t for the poop and leaves maybe a little over dramatic but he’s fucking up your yard so he’s way outta line.",
   "created_utc": 1701577387,
   "score": 0,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsbr5e",
   "message": "It’s your property. Get the shotgun ready if the bro come along again! Well, if this is clearly your lawn what are he and his mutt doing on it? NTH.",
   "created_utc": 1701586102,
   "score": 0,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbszfk3",
   "message": "NTA for having reasonable boundaries over your yard. It IS common sense.\n\n\u0026gt;it would be more difficult to scoop them into a yard waste bag\n\nYTA for this though.",
   "created_utc": 1701604820,
   "score": 0,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbt1waa",
   "message": "YTA. Don’t approach someone with bad faith. You have no proof it’s his dogs poop.",
   "created_utc": 1701606610,
   "score": 0,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbt5vnv",
   "message": "Well the good news is you don’t have to worry about *becoming* the old grumpy “get off my lawn” man.. you’re already there.\n\nThere shouldn’t be a problem with the dog walking on your grass, you’re weird for that. And overly aggressive with the dude, like calm down, it’s just leaves. You should have finished the job instead of half assing it. You have no way of knowing it was his dog that pooped… but now he definitely will.\n\nAlso you gave up a perfectly good opportunity to play with a cute dog in the leaves and make a new neighbour friend. Now you have a guy who hates you over nothing.\n\nThe dog shit was probably left by all your other neighbours that already hated you. Now this guy will make sure his dog poops on your lawn too. Good job. YTA.",
   "created_utc": 1701609178,
   "score": 0,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbro9fd",
   "message": "You overreacted. Next time apologize to him.. still ask him not to walk on your yard in a kind way.",
   "created_utc": 1701573371,
   "score": 248,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrtqfv",
   "message": "YTA\n\ndude seemed like he was trying to be nice and just tell you about himself,",
   "created_utc": 1701575929,
   "score": 246,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrwjc7",
   "message": "Maybe u over reacted a little. We need to be more neighborly. He did try to apologize although it was obv in a very defensive position. Then you can ask like he mightve made a mistake forgetting to pick up the poop. New friend in the neighborhood whos an extra set of eyes walking around who knows you and what would be odd happening on your property when you aren't there. Free security",
   "created_utc": 1701577286,
   "score": 250,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs10pp",
   "message": "I kinda get both sides. For you, it was grating on your nerves for a long time, so you had a gradual build from 0 to 100%. For him, I believe it must have seemed like you came out of nowhere at 100% since that was the first interaction you two seem to have had, based on this story. For someone from a big city like LA, they usually don’t take too kindly to someone being like that lmao they usually (in my experience anyway) have a snap-back feature that activates lol\n\nI guess what I’m saying is, you might have come on a little strong because for you, this has been an ongoing issue. He was most likely caught off guard with you “coming at him” like that, and responded “in kind” if that makes sense.\n\nIt’s something I’ve had to watch about myself tbh. Something bothers me for so long that I get so annoyed and end up sounding way harsher than I intended. I’ve tried to fix it by speaking up earlier. Besides, how is someone else to know that they’re crossing a line if they don’t even know there’s a line?\n\nHope that helps and makes sense!\nSomeone who grew up in the south but has lived in multiple different places",
   "created_utc": 1701579531,
   "score": 254,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs2asp",
   "message": "Don’t know if your post is verbatim how you engaged with him, but adding a please to the request might have de escalated the engagement and allowed the dog owner a way to graciously say “Ok”. \nNot every encounter needs an aggressive approach. He might have turned out to be a nice neighbor to get to know.",
   "created_utc": 1701580214,
   "score": 254,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsfpd4",
   "message": "NTA but a little more friendliness is free and works better, I think. You can stay calm and show some interest in your new neighbor and perhaps even the dog. I guess by telling you he was new and where he is from he tried to open the conversation. Within that basis you can make a good start in which it is easier to tell him the customs and boundaries. Having him flip you off is not that good start you’d want. Perhaps start again?",
   "created_utc": 1701588998,
   "score": 253,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsg2sg",
   "message": "I mean you literally said \"stay off my lawn\".. which is not the most neighborly thing to do. I would at least introduce myself first and say hey, it's not cool what you're doing can you please be more considerate? But yeah I have never lived in a suburban place so I guess you guys have different views on lawns and stuff..",
   "created_utc": 1701589278,
   "score": 253,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsmpyf",
   "message": "Although his dog shouldn’t go to the bathroom on your lawn and I’d be upset if it was too, this is 1,000% old man get off my lawn vibes. Ease up. This is not a “real” problem. It’s leaves ffs. How about a “welcome to the neighborhood, how are you?” Why is that too hard these days versus getting fired up over re-raking leaves? Kindness goes a long way in life.",
   "created_utc": 1701594466,
   "score": 250,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbr7b5y",
   "message": "YTA, definitely not worth getting upset at. Be kind and be good to dogs. It's not the end of the world to scoop up dog poop or rerake some leaves",
   "created_utc": 1701565751,
   "score": 232,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrfz0n",
   "message": "I'm jealous. I can't wait to tell people to get off my lawn!!",
   "created_utc": 1701569610,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbrtm2z",
   "message": "NTA, but you should also tell them to get a haircut for the full effect!",
   "created_utc": 1701575871,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs24w3",
   "message": "Playing in my leaves? Awww. Pooping without scoop, nope.",
   "created_utc": 1701580124,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbs42ax",
   "message": "Angelenos are terrible people. You don't want someone like that in your yard or town.",
   "created_utc": 1701581196,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbsq7et",
   "message": "NTA we always find dog s*#%t in our front yard. One time one of my packages left on my front step had poop on it. Clearly the delivery driver used it to scrape off the bottom of their shoe.",
   "created_utc": 1701597335,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbss08l",
   "message": "So so soooo hate people walking thru the yard, but even more those who will not leash or pick up. And the pee on everything , oh it's no big deal. 😡\nYou need a fence and a no trespassing sign.\nDoesn't have to be fancy. Two foot green chicken wire is cheap and blends in really well. You could have a strip of garden along it, on the inside or the dog pee will kill the plants.\nGood luck!",
   "created_utc": 1701598837,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbt09it",
   "message": "I had this problem as well, I told the people who kept doing this that one, I garden which mean I use products like pesticides on my plants, did they want that on their dogs paws for them to lick and get sick (I don’t but a lot of people do, I was trying to make a point), and two, I told them that I kept finding nails and other things on my lawn thanks to people driving by and throwing shit on my lawn and from when they did construction so they also didn’t want their dog stepping on anything and getting hurt (this is actually true). They stopped walking across my lawn.",
   "created_utc": 1701605446,
   "score": 1,
   "submission_id": "189epq2"
  },
  {
   "comment_id": "kbt2ngc",
   "message": "sounds like you were pretty aggressive from the get go. I would have started out with the old \" hey do you mind not walking your dog on my lawn anymore. I would appreciate it\". you attract more flies with honey than shit. if the guy had a rude about that, then you can ramp it up verbally",
   "created_utc": 1701607125,
   "score": 1,
   "submission_id": "189epq2"
  }
 ]
}