{
 "submission_id": "189hg7w",
 "title": "AITAH for telling my husband to delete Snapchat or I’m filing for divorce?",
 "selftext": "I’m new to this Reddit thing so please bare with me. I (45f) have been married to my husband (45f) for 28 years. When our daughter got on social media, we both had a rule that she had to have us on all her social media to monitor her activity, including Snapchat. Now that she’s an adult, I deleted my Snapchat account as I felt that the app was too juvenile for me. That was two years ago. \n\nI recently saw my husband receive a notification from a woman on Snapchat. We both have full transparency on each other’s phones so I opened the message and found that he had been using Snapchat to cheat on me. There were multiple women and reading the recent messages that I could see, he was sexting them or begging for sexual content from them. I confronted him and he swears he never met them in person and he was just lonely. He says that he would add random women on there to talk to. Either way, he was emotionally cheating on me by telling these women the things he was telling me and sharing sexually explicit pictures with them. \n\nHe was begging me not to leave him and claims he wants us to work it out. I took a week away from him and during that time I decided I wanted to work it out but under two conditions: \n\n1.) he has to delete Snapchat, account and app, completely. \n2.) we have to go the marriage counseling. \n\nHe said he would do the marriage counseling, but he thinks it’s wrong for me to ask him to delete an app he uses for social media. I don’t see why a 45 year old man should be using an app geared towards young adults and kids, and I also feel that the deleting of his messages is a big red flag. My other concern is what if he was sexting with underage girls and was lied to about their age. He called me an asshole and that he’s not a pedophile. We have been arguing about this all day today and decided to ask on here. \n\nSo people of Reddit, am I the asshole?",
 "created_utc": 1701564060,
 "permalink": "/r/AITAH/comments/189hg7w/aitah_for_telling_my_husband_to_delete_snapchat/",
 "score": 37,
 "url": "https://www.reddit.com/r/AITAH/comments/189hg7w/aitah_for_telling_my_husband_to_delete_snapchat/",
 "comments": []
}