{
 "submission_id": "189k8e2",
 "title": "Aita for leaving my fiance with outr daughter",
 "selftext": "My fiance (32m) was drinking and decided to go to sleep at around 6pm. I (24f) made supper and put my daughter to sleep.\n I'm sitting here on an early Saturday night and I was bored. I started messaging my mom and she sent me a picture of my brother and everyone sitting st the kitchen table playing skip bo. I wanted to join so I woke up my fiance and said our daughter is asleep and I would like to go over for a few hours. He protested alittle by saying \"no don't leave me\" but I never get to do really anything. I care for our daughter 24/7 and thought it'd be nice to do something for a few by myself. I give him a kiss goodbye and leave. And hour later I get a video call from my fiance and my daughter is crying while he's holding her and he's screaming asking where tf I am. I tell him I'm at my moms I just left like an hour ago and woke him up. He screams and says get home now and calls me dumb. My mom doesn't want me to leave she says he's a dad she should be fine and I just got there. But I know how he is and I leave because my daughter needs me. He calls me a few more times and says \"how can you be so irresponsible to leave our daughter with a drunk guy\" and calls me a stupid bitch. I get home he hands me our daughter and I take her back to her room and put her to sleep.\n He says nothing.\nI get her to sleep in about 20 mins and I walk past our bedroom and he's not there. So I'm like great he's waiting for me in the living room to yell at me some more. Nope. I notice the keys are gone and the car is gone. He left. He shut off his phone too. I just want to know what reddit thinks. I feel like it shouldn't of been too big of a deal. But maybe iata.\n\nEdit: after reading some comments\nI agree I shouldn't of left her when he'd had too much to drink. I definitely can see my flaws in this. He never let's me go anywhere without her or really do anything. I always have to ask to do anything. I shouldn't of left her. I feel terrible for my daughter for that. Shes 4 years old usually sleep throughout the night I just figured 2 hours would be fine, but of course the night I do something for myself this happens. I just wish I wasn't the only parent and that he could take care of her. He wasn't drunk to where he couldn't do anything or maybe calm her down.  It won't happen again that's for sure. :(  \n",
 "created_utc": 1701573418,
 "permalink": "/r/AITAH/comments/189k8e2/aita_for_leaving_my_fiance_with_outr_daughter/",
 "score": 14,
 "url": "https://www.reddit.com/r/AITAH/comments/189k8e2/aita_for_leaving_my_fiance_with_outr_daughter/",
 "comments": []
}