{
 "submission_id": "189kyqh",
 "title": "AITAH for telling my racist MIL that I’m infertile even though I’m not?",
 "selftext": "I (24F) got married earlier this year to my husband (27M). I get along with everyone in his family exceptionally well except for his mother. She disapproved of the relationship ever since I met my husband because I’m mixed race (Black/Asian), she wanted her son to settle with a white woman. (*He has two brothers who are married to WOC so his mother really wanted him to marry white*). \n\nShe’s also constantly asking about kids and when we plan to have them/how many. \n\nAnyway I recently cosplayed as Chel (from El Dorado) and published those pics on my socials. MIL brought up my cosplay pics during dinner I had with his family in a very snarky, catty tone. She said that I “probably shouldn’t” be posting “highly suggestive material” like that since I’m married now.  \n\nThis turned into a full blown argument however my husband defended me immediately. MIL freaked out even further and literally said “childbearing hips but no children in sight, the irony”. \n\nI untruthfully confessed that the doctors informed me that I’m infertile and will never be able to have children. This caused her to turn absolutely hysterical, claiming that she knew something was “wrong”. She literally made it all about herself and said that her life is ruined, this is why her son shouldn’t have married me etc.\n\nI then clarified that I’m not infertile and simply wanted her off my back. However this lead to an even bigger argument and I left early. \n\nSo of course she’s furious but my husband is also upset. He said that I shouldn’t say those kinda things even if they’re not true. He said he’s excited about having kids and that hearing me say I’m infertile wasn’t pleasant.\n\nAm I the asshole here or is my MIL? Or both?",
 "created_utc": 1701575667,
 "permalink": "/r/AITAH/comments/189kyqh/aitah_for_telling_my_racist_mil_that_im_infertile/",
 "score": 172,
 "url": "https://www.reddit.com/r/AITAH/comments/189kyqh/aitah_for_telling_my_racist_mil_that_im_infertile/",
 "comments": []
}