{
 "submission_id": "189ley6",
 "title": "AITAH for telling my sister she should’ve left her husband for what he did before they were married?",
 "selftext": "Ok so I (39f) have a younger sister (33f) and when she was 20 she started dating this guy who was really good to her. Then he lost someone very close to her and he started to abuse alcohol and he apparently was verbally violent and would yell a lot. I didn’t know the details but I know one night 10 years ago it got really bad and she was scared of him and left to live with our mom for a bit. This was apparently his wake up call and he checked himself into a rehab and has been sober ever since that night. Since then, they’ve gotten married and are one of the loveliest couples I’ve ever witnessed and he seems like a genuinely good guy.\n\nI mentioned earlier that it was 10 years ago that things got really bad one night and I know this because the 10 year anniversary was last week. Today my sister mentioned that to me and we went back and forth about it and she told me she’d finally tell me what happened that night. She said it was the night after a thanksgiving dinner they had with his family and they came home and he got black out drunk and I’m not quite sure all the details (she didn’t give them) but she said he grabbed her and held her down and forced himself onto her. She said she had bruises on her torso, butt, and breasts and he apparently saw them the next morning and that was what made him check into rehab. She said they very slowly started building their trust back and he apparently told her he could never accept her forgiveness for what he did and promised he would try to be the partner she deserved.\n\nI firstly told her I was so sorry that happened to her…but I was also kind of horrified and told her she should’ve left him and reported him to the police. She said he apparently told her if she wanted to go to the police he would confess and cooperate with her but she knew he wasn’t his addiction and it was her choice to forgive him and support him into being “the man she knows he was capable of being.” I told her I didn’t know how she was completely mowing over the fact that *he fucking raped her* and she said I didn’t understand the situation and had no right to judge and I don’t know him or what he’s gone through. At this point I got up and said I was gonna go home and hoped her rapist husband got home from work ok that night. That last comment made her start crying and she went upstairs.\n\nThat last comment may have been a bit over the top but come the fuck on, did he really deserve a second chance after that. I don’t care what you were on or going through, once you do that, I have always seen it as an automatic “over.”\n\nAITAH?\n\ntl;dr: my younger sister told me her husband sexually assaulted her 10 years ago when he was struggling with alcoholism and she forgave him for it, and I told her I think that was an awful decision.",
 "created_utc": 1701577112,
 "permalink": "/r/AITAH/comments/189ley6/aitah_for_telling_my_sister_she_shouldve_left_her/",
 "score": 244,
 "url": "https://www.reddit.com/r/AITAH/comments/189ley6/aitah_for_telling_my_sister_she_shouldve_left_her/",
 "comments": []
}