{
 "submission_id": "189mlr7",
 "title": "AITAH for not letting this intrusive girl vlog next to me on the plane",
 "selftext": "\n\nI 21M have been flying all my life without issues, and finally ran into a ‘bad’ experience. This situation happened on a flight departing from the UK (not American) if that matters. \n\nI feel like it might’ve been cursed from the start because I had to grab a flight last minute due to a family emergency.\n\nBy the time I booked there were no aisle seats available, but I found a row of 3 seats with extra legroom and selected a window seat. Seated next to me was a man around my age or maybe older, and in the aisle was a woman (22F). The woman was very talkative. The man was very quiet. I had no intention of getting friendly. I think I was sad.. or worried.. but it might’ve translated into asshole. \n\nShe initiated and we all made brief introductions. I had the family emergency on my mind so I switched my headphones on and closed my eyes following our intros, and waited for us to take off. I heard the other two talking and felt them shuffling around. 22F switched seats with the guy. Now he was in the aisle and she was in the middle.\n\nSome time later, I heard her talking.. she was making a video. I opened my eyes and she had the camera on me in that moment. It was brief so I let it slide, gestured a little acknowledgement, not saying anything because at that time I had no idea how annoying it was about to get.\n\nShe eventually turned the camera off and started asking me a lot of questions I wasn't in the mood for. I understand she was feeling chatty, and maybe I wasn't in the right headspace for someone like that. She was headed on an adventure. I wasn’t. I answered a few questions briefly and then I told her to talk to the other guy because I want to sleep. She told me she does not want to talk to him, she wants to talk to me. At this point I felt like she wasn’t taking a hint so I told her bluntly... I don't want to talk. This worked (kind of).\n\nI thought she had stopped bothering me for a while, because it was silent, but when I opened my eyes I saw that she was filming me. I raised a brow and she giggled. I told her I need her to stop. She laughed and told me I had said I don’t want to talk but I didn’t say I don’t want to be filmed. I replied to that with “now you know”. She brushed this off, switched to filming herself, and said to her camera 'he is so cranky'.\n\nShe stopped filming me though, and finally settled in, watching something on her iPad. I fell asleep. \n\nWhen I woke up, the flight attendant was offering refreshments and I requested one. The girl wasn't there, I guess she went to the bathroom. The guy in the aisle seat told me in our language that while I was asleep, she was not only filming me, but also trying to do stupid things like pretending to touch my face, waving her hand in front of my eyes, hovering her hand over mine to compare size(?), put her shoe next to mine, etc. And took pictures he’s not sure I’m in. He said he told her to stop, and she did, but he has also been sleeping and isn’t sure if she did things while he slept. He asked me not to bring it up because he didn't want to 'get in the middle'. \n\nI waited for her to get back and then immediately confronted her. She turned to the other guy angrily.. meanwhile he looked uncomfortable (English was his second language). Before she could go off on him I stopped her. I requested she delete whatever footage she took of me. She doesn't have my consent. She stated she doesn't need it. I gave her an… are you serious? look and she switched to pleading. I was so tired of it at this point so I gave her a warning: no more filming, or i'm complaining to flight staff. (Edit: she stopped filming me after this).\n\nMid flight: she fell asleep, kept resting her head against me.. which I kept pushing away.. only for her to kind of frustratedly put her head back? The entitlement of this girl. I got a pillow and shoved it between and tried to get some sleep as well.\n\nWhen we were approaching the landing, she asked me to take her camera and film the descent. Not only that.. she asked me to also give commentary. I told her i'm not doing any of that. This made her start reaching over me to film the window. The flight attendant doing her checks and I made eye contact ..  she told the girl off. The girl straightened up and stayed quiet. Some time passed, and I felt a little bad she wasn't going to get her stupid shot for her stupid vlog, so I offered to let her switch seats with me. She refused. She said it was too late (disagree). She said I ruined her video. It was her first time visiting this country and I was starting her off on the wrong vibe. She also said I was single-handedly giving her a bad impression of men in my country. I was being a bad “ambassador for the brand”(her exact words). This made me laugh. She asked me aren't I going to 'make it up' to her? I said I didn’t know I owed her that. I’ll get her luggage down from the overhead. She said it wasn't good enough. I disengaged. \n\nI heard her asking the other guy if men in his country are like me.. she was clearly baiting him. The poor guy didn't know what to say. He said something like 'don't worry, people have good manners’. This made me remark to him in our language 'you should tell her to work on her manners'. She spun around and asked me what I said. I told her I said if he wants, he can help you with your luggage. \n\nAnyway. I know various “content creators” exist because I see their videos on TikTok etc. but I had never encountered one in real life until I met this person. AITAH for not being a good sport or would you find this AH behaviour? In hindsight, I admit I was in a bad mood because of the situation that had put me on the plane in the first place, but I still don't think it's appropriate to film in close quarters. It’s a public place, sure, but come on.. \n\nI want to know what you think. Or more importantly how you would have reacted.",
 "created_utc": 1701581452,
 "permalink": "/r/AITAH/comments/189mlr7/aitah_for_not_letting_this_intrusive_girl_vlog/",
 "score": 178,
 "url": "https://www.reddit.com/r/AITAH/comments/189mlr7/aitah_for_not_letting_this_intrusive_girl_vlog/",
 "comments": []
}