{
 "submission_id": "189n4vm",
 "title": "My wife hit me in the balls. I'm pissed.",
 "selftext": "About a month ago we were hanging out with family several hours away. We had both been drinking so I know that's not a good  recipe for success. \nThe town she lived in when we met was notoriously racist (she is not in any way). But throughout our 20 plus years together I've alwaysteased her for being \"from\" there even thoughher parents moved there from out west.  She's truly a decent person overall.\n\nI've definitely teased her before about it. But she's never expressed anything other than mild annoyance (unless I'm a dumbass who missed the clues, which I think is a valid possibility).\n\nSo we are drunk. I thought her way more drunk. I made comments about her being from the town.\nShe says stop \"saying that or I'll hit you\".\n\nSo, thinking this is playful banter (again repeating that I'm clearly a dumbass), a say it. And instead of hitting me in the arm, she hits me in the nuts. It hit just right. And hurt. Like... bad.\n\nThat night she repeatedly said she didn't hit me that hard. Not \"Sorry\". \n\nHonestly I probably escalated things by threatening violence if she did it again. \n\nWe went to bed that night without speaking and didn't talk about it again until we were talking about her sister's marriage and fights. I mentioned that as our worst fight, and explained what happened,  thinking that, her being drunk,  she must not remember. \n\nShe responded that I should have shut up and not pushed.\n\nAnd honestly I'd get that 200% if she had, at any point in time,  told me in a meaningful way that she was offended.  We've been married 24 years and it's been a somewhat running joke , being brought up on average every other year. \n\nLike... I love this woman. I'm not looking to call her the AH. \n\nBut I snapped tonight. Just realizing that she definitely remembered hitting me in the nuts. And also felt justified. I honestly thought she would tell me it didn't happen or that the dreamed it.. not that she remembered and  thought she was right. Driving home I told her to call her friends and her sister and ask their opinions. And to think about whether, if I were offended by words, she would think it acceptable if I slapped her. \n\nTo be fair,  I also told her if she comes back with that being acceptable, to go fuck herself. Obviously not a statement that helps ease tension.\n\nThen I turned on loud music for the rest of the drive.\n\nAs I lay on the couch instead of a comfortable bed with my wife... I can't help but wonder if I'm the asshole.",
 "created_utc": 1701583440,
 "permalink": "/r/AITAH/comments/189n4vm/my_wife_hit_me_in_the_balls_im_pissed/",
 "score": 78,
 "url": "https://www.reddit.com/r/AITAH/comments/189n4vm/my_wife_hit_me_in_the_balls_im_pissed/",
 "comments": [
  {
   "comment_id": "kbszknm",
   "message": "Everyday reddit reminds me to be thankful for my relationship. It's faaaar from perfect but at least we don't fight over stupid shit.",
   "created_utc": 1701604926,
   "score": 50,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbss2dw",
   "message": "Everyone is telling you about communication and working things out etc.  Fuck that, if you had hit her in any capacity this would not be the conversation. Violence is absolutely never acceptable. She’s not only the asshole but if she thinks it’s okay to get violent with you because of something you said then she’s also a pretty terrible person.",
   "created_utc": 1701598885,
   "score": 99,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbss4qp",
   "message": "She appears to not want to see any issue with engaging in some domestic violence.\n\nIf you don't want to call her an AH, okay, but she's fine with what she did. Which means she'd be fine with doing it again.",
   "created_utc": 1701598939,
   "score": 34,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbskmy5",
   "message": "You are right that if the genders were reversed, everyone would be siding you. Violence is never an appropriate response or means of communication. It's sad how many people in the comments act like you are responsible for her being violent towards you. It's like someone asking a woman \"what did you do?\" after she was hit by her husband.\n\nNTA.",
   "created_utc": 1701592790,
   "score": 64,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsb3sl",
   "message": "NTA. I hope you guys develop more lines of communication; such a long marriage should not devolve because of not understanding each other's feelings.",
   "created_utc": 1701585643,
   "score": 43,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbs86sl",
   "message": "I think you’re a little more of an idiot that an asshole lol. But i definitely see that you saw it as a joke when you said it. I feel like I’ve been in the same situation when you’re joking around with someone. If she had never expressed being upset at you mentioning it I wouldn’t have had a second thought either. \nMy partner and I are from neighbouring towns and people often hate on mine and I always joke about being pissed and he knows I don’t care. If I randomly turned around one day and hit him over it, I’d definitely understand why he’d be confused af. \nShe shouldn’t have hit you, especially in the balls, especially that hard because it can do some serious damage. A playful punch in the arm maybe I’d let her get away with but she’s definitely the asshole here. A total 180 on her reaction to the joke",
   "created_utc": 1701583668,
   "score": 54,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbss8nh",
   "message": "NTA, this is domestic violence. \n\nIf she insulted you, and you punched her in the chest, this would be domestic violence, right?\n\nThere is a very clear line, where any altercation goes from a verbal disagreement to a physical one, that is not to be crossed. \n\nI think in this scenario, she was probably as surprised as you and probably regrets this.\n\nI would make it very, very clear this line is not to be crossed again, and I don't think it will.",
   "created_utc": 1701599028,
   "score": 19,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbssvfq",
   "message": "this thread gave me a great way to find domestic abuse apologists.\n\nwhen it is a man being abused.\n\nedit: NTA divorce this abuser, it will only get worse when she realizes she can get away with it",
   "created_utc": 1701599555,
   "score": 19,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsa0qz",
   "message": "How's it feel being a victim of spousal physical abuse?\n\nYou do realize that's literally what she did, right? She hit you intentionally in a way that she knew would cause you severe pain. That's abuse, plain and simple.",
   "created_utc": 1701584889,
   "score": 106,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsuzip",
   "message": "NTA if the genders were flipped I don’t think people would be saying you need to work on your communication. She shouldn’t have hit you, period.",
   "created_utc": 1701601299,
   "score": 23,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsdl8h",
   "message": "You two should maybe work a bit on your communication. As you said OP \"unless I am a dumbass who missed the clues\". I bet she didn't like you teasing about it for a long time. And she clearly said to you that she wanted you to stop that night. You didn't.But that isn't a justification to get violent on you. The interesting question is why did you miss her clues and why was the only way to make herself clear hitting you in the balls. Don't ask around friends and family who is wrong or right. You both have to work on this together. And other oppinions won't matter here. You both have a real communication problem you should try to solve.",
   "created_utc": 1701587423,
   "score": 80,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbswxi2",
   "message": "That's literally a low blow. She's an AH!!",
   "created_utc": 1701602877,
   "score": 5,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsvcx2",
   "message": "So many women feel that it's ok to get physically violent just because they've been raised in an era where boys are taught not to hit girls. That's obviously the right thing to teach, but surely now we should instead be telling all kids to just not hit at all.",
   "created_utc": 1701601600,
   "score": 13,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsum07",
   "message": "NTA\n\nThere is no excuse to *escalate* to physical violence. Ever.\n\nIf she has a problem with something she needs to use her big girl words, not lash out.\n\nEdit: it’s wild the number of people excusing her physical abuse. One of those times where you have to say ‘flip the sexes and would this be anything but condemnation for the abuser?’",
   "created_utc": 1701600989,
   "score": 10,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsejc5",
   "message": "NTA. Assault is an assault. A spouse hitting another is bad. Male on Female or Female on Male. Doesnt matter. Laying a hand on SO is unacceptable. You are right and the fact that she thinks its okay to hit you, especially in the balls, is very concerning.\n\nGood for you for standing up to her. You are in the right. This should be a red line in any relationship.",
   "created_utc": 1701588120,
   "score": 13,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsjudl",
   "message": "NTA. everyone needs to keep their hands to themselves. If a woman never deserves it than neither does a man. If you disagree you’re a misandrist POS",
   "created_utc": 1701592166,
   "score": 11,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsc29c",
   "message": "Don’t let it go, she is clearly abusing you",
   "created_utc": 1701586320,
   "score": 22,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsyfdk",
   "message": "Welp, I kinda wrote that and then turned my phone off and went to sleep. \n\nSo good morning. I'll probably end up deleting the post eventually since I don't know if I want all the notifications about it. But reading through the comments it's really nice to see that at least the majority don't feel like violence is cool.\n\nSome of y'all need to stay single. \n\nI'll be having a serious conversation with her today. And yes I'll apologize first for what I saw as a joke. But obviously she didn't. I'll even ask if she has any other things that she wants me to change. \n\nBut I'm not going to budge on it also being wrong on her part. I suppose the thing that shocked me last night was that we were having a conversation about her sister, who has been dealing with DA for as long as I can remember,  and finally left her husband last night.  And I can't even count how many times his excuse was that she kept saying things even when she knew it made him mad. We, and the police, had always agreed that nothing she said mattered, as it relates to justifying violence. The fact that I have a size and strength advantage really doesn't matter. \n\nI'm not letting one instance end my marriage. I do understand the mentality of \"leave immediately \" and if we were dating or newly married I'd absolutely agree. At this point I'll chalk it up to a mistake. \n\nBut I'm also not doing it again. Thanks for the comments. Even all of the assholes.",
   "created_utc": 1701604054,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsz85x",
   "message": "NTA.  If you hit her in any way , you would be in jail right now.  Honestly, I would call the cops and file a report.   They most likely won't do anything but it lets her know you mean business.  It doesn't matter what you said, cuz it doesn't give your partner the right to hit you.",
   "created_utc": 1701604663,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbskn6r",
   "message": "This marriage sounds toxic as hell. Why would you joke to your wife about her being from a racist town? On what planet is that even a joke? You’ve pushed her to the end of her rope after 20 odd years together and it resulted in both of you being violent and threatening violence, why would either of you think your actions were the correct way to handle things? Do better, get therapy, you clearly both need it.",
   "created_utc": 1701592796,
   "score": 16,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsmzcq",
   "message": "Seriously? How is this even a question? Your wife ASSAULTED YOU! You need to stop doubting yourself, and go speak to the police, and a divorce lawyer ASAP.",
   "created_utc": 1701594679,
   "score": 8,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsl6tv",
   "message": "ESH\n\nShe has absolutely no right to touch you. She needs to apologize. It doesn’t matter how much you antagonize her. She should’ve communicated her feelings instead of putting her hands on you.\n\nYou are TA too though because you can’t basically call someone a racist all the time and just think “oh I’m just playing”\n\nYou were bullying her and she didn’t like it. You didn’t realize it",
   "created_utc": 1701593236,
   "score": 21,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsrv7n",
   "message": "NTA and fuck people goin es here.\nJust imagine if the genders were reversed.",
   "created_utc": 1701598724,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsdh66",
   "message": "So, you were a DV victim, that's pretty obvious.\n\nWhat happens now, does she make that call and see if other people agree she abused you, or does she ignore it and you go on until the next time she decides you need a smack in the pills?\n\nYou need to adress this somehow \n\nNTA",
   "created_utc": 1701587341,
   "score": 5,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsjula",
   "message": "She told you to stop calling her racist, she warned you to stop calling her racist. You kept doing it. I bet it's been YEARS since she found it funny.  ESH.",
   "created_utc": 1701592171,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsj9zz",
   "message": "NTA\n\nShe physically assaulted you, dude. I hate men who are domestic abusers, but I also hate women who do the same.",
   "created_utc": 1701591722,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbskrjk",
   "message": "Appropriate: \"hey SO you really have to stop with your joke. Its not funny and it hasnt ever been funny. I dont want to hear it again.\"\n\nUnacceptable: sexual violence\n\nIf youre going to stay in this relationship, keep your eyes open for further abuse. Sometimes its hard to spot it as a victim",
   "created_utc": 1701592893,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsmyzl",
   "message": "You're both assholes that need to work on your communication.",
   "created_utc": 1701594671,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsfqqr",
   "message": "I think she is expecting you to understand that it hurts being categorized with the racist part of her town even by joking and to apologize for it.\nThen she will apologize for hitting you in the nuts and then you will explain her that she was absolutely wrong in doing that and never ever try to do it again! Even if tipsier than usual. \n\nI’m sorry she kicked you it must have hurt very badly.",
   "created_utc": 1701589026,
   "score": 6,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbshse7",
   "message": "NTA. But she did warn you. But seriously. Hitting your SO in anger is unacceptable. Add that it was a nut shot makes it even worse.",
   "created_utc": 1701590581,
   "score": 3,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsikld",
   "message": "She's the asshole and should count herself lucky you didn't call the cops on her. You should not be the one sleeping on the couch right now.",
   "created_utc": 1701591180,
   "score": 5,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsp9ro",
   "message": "Incessant teasing about something someone has no control over sucks. Physical abuse of a spouse does too.",
   "created_utc": 1701596562,
   "score": 4,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsi9ix",
   "message": "So for situations like this I always go back to basics.  The person who gets physically violent first is the person in the wrong.  You don’t respond to words with physical violence.  You only use it in self defense.  She got physical first so it’s on her.  NTA.",
   "created_utc": 1701590944,
   "score": 3,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbso0jw",
   "message": "ESH. She should have obviously never hurt you physically - not ok. But of course you are making inappropriate jokes and you shouldn’t do that as well. And personally - I can’t understand how you thought, that would be funny or ok to say that to your partner.\nWouldn’t wanna be with either of you, as your behavior and reaction shows lack of communication and respect for each other.",
   "created_utc": 1701595526,
   "score": 5,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsvpjy",
   "message": "ESH\n\n“Running joke” 🤦🏽‍♀️she clearly never found it funny so essentially you’ve just been thinking you’re funny whilst you’ve actually just been bullying her for years. And resentment builds. \n\nDoes that give her a right to hit you when she finally snapped? No. Does that give you a right to threaten violence in retaliation, no. You started this shit, now you both have to deal with it.\n\nYou say you love her but your words and actions say otherwise.",
   "created_utc": 1701601890,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsmzrx",
   "message": "Esh it sounds like she's been tired of your jokes for years. I don't think needling your partner continuously after they ask you t9 stop is ok. She shouldn't have hit you. You shouldn't be threatening to hit her.",
   "created_utc": 1701594690,
   "score": 5,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsg0r5",
   "message": "[deleted]",
   "created_utc": 1701589235,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsgvnl",
   "message": "All I can think about while reading this is the time that I playfully punched my boyfriend in the arm too hard. I don't think it hurt him even remotely that bad, but he made a pouty face and I cried for a solid ten minutes. You aren't supposed to want to hurt your partner.",
   "created_utc": 1701589888,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbstpfh",
   "message": "\u0026gt; But she's never expressed anything other than mild annoyance (unless I'm a dumbass who missed the clues, which I think is a valid possibility).\n\nI mean \"mild annoyance\" is not \"ahah right it's a funny joke\", so why do you keep doing it? On top of that, you said she's not like that, so why do you keep associating her with racists? \n\nJokes are funny if everyone laughs at them.",
   "created_utc": 1701600246,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsmhyq",
   "message": "She's probably very tired of this joke since a decade or more. This was all the boiled up anger of a couple of years over this remark that was probably a very one sided running gag on your behalf. I guess women also don't really get how hurtful it is to be hit in the balls, which isn't an excuse, but you can work it out. Doesn't seem to be a substantial problem and one both of you should be able to make the necessary changes.",
   "created_utc": 1701594290,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsfe8l",
   "message": "ESH. She shouldn’t have reacted like that and I hope that it’s not a recurring thing but you shouldn’t have pushed after she told you to stop.",
   "created_utc": 1701588763,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsqyc2",
   "message": "Sounds like communication issues. NTA, nor is she (probably).\n\nAs a side note, if a woman ever did that to me, I'd end it then and there, no questions asked. That's just me though. It's a dealbreaker no matter how serious we are.",
   "created_utc": 1701597959,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsr4b4",
   "message": "YTA. I cannot stand men who push, and push, and push, and push for YEARS, and ignore every request for them to stop. Then when they get a reaction (maybe not like the one you did) they act all hurt. Just like you did. Grow up, have a proper conversation about this, and BOTH decide on some concrete boundaries then KEEP them. \n\nHaving said that, a wife who will hit you in the balls also needs to learn boundaries and should NOT be hitting anyone, so on that basis, she's TA too.",
   "created_utc": 1701598095,
   "score": 3,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsp54k",
   "message": "Teasing if any sort is emotionally abusive. What she did wrong but you’re still the\n a$$hole. Grow up, man. geez",
   "created_utc": 1701596458,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsqo8y",
   "message": "So \"stop it or I will hit you\" wasn't clear enough?",
   "created_utc": 1701597727,
   "score": 2,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt17tv",
   "message": "YTA. She warned you to stop and you didn't.  You asked for it.  Staying angry about it when you admit you were both drunk just makes your anger more absurd.",
   "created_utc": 1701606135,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsbv99",
   "message": "Sounds like you both got pretty hammered, she did something really dumb (should’ve apologized 100%), but also sounds like you were admittedly threatened some sort of violence in return.  She was an AH first, continued to be done and then you also joined in as an AH.",
   "created_utc": 1701586182,
   "score": 254,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbshu03",
   "message": "I would say after being called a racist for 24 years one smack in the balls is justified. \nI'm not married but maybe try not calling your wife a racist.... Just an idea. \nAnd also for handling it sooo piss poorly like a little bitch with your threats of violence and loud music.",
   "created_utc": 1701590615,
   "score": 252,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsf10z",
   "message": "NTA.  And hope the jewels feel better",
   "created_utc": 1701588483,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt3w2n",
   "message": "You bullied her for years about something that bothered her enough to show “mild annoyance” and then finally to the point of a threat… and you still intentionally pushed it further.\nSounds like a bit of “fuck around and find out” 🤷🏻‍♀️",
   "created_utc": 1701607941,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsl3hc",
   "message": "NTA. Physical violence is not good.  Just reverse it and imagine your wife giving you a ribbing about the town you were from and then you hit her because she push it too far....",
   "created_utc": 1701593161,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsxr3t",
   "message": "YTA and your wife is a criminal. Domestic Violence knows no gender. Had you responded to your wife's teasing with physical violence, you'd be behind bars.",
   "created_utc": 1701603535,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsy8sr",
   "message": "ESH.  Violence is never acceptable in a relationship because it's physically abusive and meant to diminish and demean the other person.  \n\nAt the same time your joke is old and doesn't sound very funny at all.  All you're doing is picking on her and belittling her.  She should be commended for growing up in a racist town but managing to not be a racist.",
   "created_utc": 1701603912,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsyol0",
   "message": "So I think Yta. So you’ve told this joke for 24 years and said it playfully and had a laugh which seemed one sided. She said she would hit you if you said it again and you did so what really did you expect? And now you sound like you are just pushing and pushing until your on the lounge and she has the whole bed to herself and has a great sleep while you stew on it and make yourself mad haha",
   "created_utc": 1701604249,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbszdq2",
   "message": "You’re kind of TA and soo is she but just a little bit, more than anything I think it was stupid. She said stop or she’d hit you, you didn’t stop so she hit you. That’s not right on either part but it was pretty clear. I have 4 brothers, if someone says stop or I’ll hit you, I’ll stop unless I think wrestling is the way to go 😂 I wouldn’t do this to my partner though and definitely not in the balls, maybeee an arm punch off I was drunk. I feel like you should just put it behind you and talk snout whether the comments you have made really bother her or if it just bothered her in the moment",
   "created_utc": 1701604781,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbszu0m",
   "message": "Dude, you've been together forever and you were both drunk. Its never happened before and probably never again. Let it go already.",
   "created_utc": 1701605125,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt0ga1",
   "message": "ESH however the only time violence is justifiable is in self defense. Even then the amount of force used should only be what is required to get you out of immediate danger. If if it were me I’d strongly be considering divorce. Her not realizing what she did was wrong would clear any residual doubt.",
   "created_utc": 1701605584,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt16g7",
   "message": "ESH",
   "created_utc": 1701606109,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt2yyf",
   "message": "ESH. Try this. Stop getting drunk. Learn some self-control. Be an adult. Both of you.",
   "created_utc": 1701607342,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbstp9a",
   "message": "YTA \n\nDuuuuudde\n\nYou’ve called your wife a racist for 24 years. \n\nIt’s not funny. \n\nShe has probably told you 666 times it’s not funny. \n\nNow you finally get it",
   "created_utc": 1701600242,
   "score": 254,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsmyuy",
   "message": "YTA for saying that crap which she obviously doesn't like.\n\nAnd so is she for attacking you.\n\nBut, you need to shut up with that stupid racist joke. It's annoying me and I only read it a few times in the post. I can't blame her for jacking you up, but I do feel there are better ways to handle these things where violence is not an option.",
   "created_utc": 1701594669,
   "score": 254,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsmqrf",
   "message": "Bro what. I get that it sucks to get hit but… fuck around and find out?? She literally warned you, even being drunk she warned you. Lmao. Jesus.",
   "created_utc": 1701594484,
   "score": 253,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbslicq",
   "message": "Don’t know about being the asshole but you sound a wee bit c@nty…Now I’m not saying you’re a c@nt, just that you sound like one",
   "created_utc": 1701593495,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt02k4",
   "message": "YTA. Stop bugging her. You know she don’t like it. Take that as a warning to stop bugging her. And if you do keep bugging her hopefully she hits you in the balls again harder.  Be a man. Treat your woman right",
   "created_utc": 1701605300,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt0llg",
   "message": "I come from an area where white people are the vast majority.\n\nmy friends indicate that im racist \u0026amp; joke about it.\n\nI will crack eventually.\n\nYou may not have deserved assault, but dont expect to insult someone or where they come from and get away with it.\n\nYTA. Stop poking the bear.",
   "created_utc": 1701605694,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsjr2k",
   "message": "I'm gonna go with YTA. Sounds like she has told you several times to stop. Your bringing it up is probably dredging up bad memories. You say the town is racist, but she isn't right? How do you think they treated her there as a non-racist? You think she wants to be constantly reminded of those people?",
   "created_utc": 1701592093,
   "score": 252,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsn6a6",
   "message": "Everybody's the asshole. But you definitely instigated this and brought it upon yourself.  Instead of listening to your wife, you only escalated the situation. Instead of apologizing first, you continue to escalate the situation.",
   "created_utc": 1701594841,
   "score": 253,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsjm1c",
   "message": "I cannot see how her not being racist is pertinent to this story. Maybe I missed something. I am an old man and I do not see you as an AH. I do think in this situation you might be holding on to some things too long as you did say it happened years ago.\n\nWishing you two the best.",
   "created_utc": 1701591983,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsrqk2",
   "message": "NTA. She hit you. Didn't we learn in school that words can't hurt. If you're offended it's not you get leprosy and die. You should have defended yourself. Honestly if she was this upset about the teasing she might have some racists tendencies that she doesn't want to admit.",
   "created_utc": 1701598615,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsxe5n",
   "message": "ESH\n\nShe shouldn’t have hit you. \n\nAnd you shouldn’t pester on a topic that people don’t want to talk about. By 20 years you should know if it’s annoying. And when people tell you to stop, you should. Those were the consequences. Whether justified (which it wasn’t) or called for (still no reason to hit people), stop when you are told to and you were warned by her. Emotional assault can be just (if not more) damaging than physical assault. \n\nGrow up you two",
   "created_utc": 1701603249,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsz3rf",
   "message": "YTA. You answered your own question. You were drunk, which is absolutely no excuse because you still made a willful choice. You got warned, yet persisted, and got exactly what you deserved.  Yeah, that shit hurts, and she got the perfect hit, which hurts without having to be really hard. Now you're PO'd and threatened violence...\n\nThis isn't middle school. You are an adult or supposed to be. Alcohol isn't an excuse to threaten your spouse with violence as retaliation.\nTBH, you should lay down and let her kick you in the nuts for threatening violence. Maybe a few times...",
   "created_utc": 1701604570,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbszstc",
   "message": "You're an idiot who missed some clues. Stop picking on her regarding her hometown. You're not just insulting her. You're insulting her family and the friends she grew up with. How would you feel if she did that to you?",
   "created_utc": 1701605101,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbshyyk",
   "message": "Making your racist jokes in front of family is very different than doing it alone",
   "created_utc": 1701590721,
   "score": 1,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsubpx",
   "message": "YTA.",
   "created_utc": 1701600753,
   "score": 253,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsgl7j",
   "message": "She warned you.\n\nYou did it again.\n\nYou fucked around and found out.\n\nYTA",
   "created_utc": 1701589669,
   "score": 246,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsiskr",
   "message": "YTA\n\nStop pushing that button. Yeah, she’s from some racist shithole. So stop bringing it up. That “joke” wore itself out years ago. \n\nShe shouldn’t have hit you. You shouldn’t be bringing up that same old crap.",
   "created_utc": 1701591350,
   "score": 247,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsokri",
   "message": "Yta, I mean...you literally fucked around and found out? Play stupid games win stupid prizes. She told you to Stop, that means Stop. Not \"continue\". Has she really never said anything else about it, because this is hard to believe with you claiming how you are a \"dumba\".",
   "created_utc": 1701595995,
   "score": 254,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsfsdd",
   "message": "She asked you to stop.",
   "created_utc": 1701589059,
   "score": 251,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbskeix",
   "message": "YTA.\n\nYour wife finally snapped after years and years of “jokes” from you and you still questioning whether YTA?\n\nApologise and never make derogatory comments about her, her family or where’s she’s from.",
   "created_utc": 1701592608,
   "score": 248,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsn3ae",
   "message": "Lol",
   "created_utc": 1701594772,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbssvgq",
   "message": "She's never allowed to hit you.\n\nBut you are also never allowed to keep going and going and going and going with teasing until she snaps (that snap should not include a punch to balls but still)\n\nDid you not have any siblings growing up? Surely this dynamic would be familiar to you if you did.",
   "created_utc": 1701599556,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsv3gq",
   "message": "ESH? So you tease her for 20 years not getting that it’s long past a joke anymore? And she thinks violence is a justified answer to that? 🙄\n\nWords, use words, both of you.",
   "created_utc": 1701601389,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbswoyj",
   "message": "Making the same snide remarks about her hometown, even more so since she herself has none of those typical behaviour traits, after 20 years it gets really really old.\n\n Her not being more adamant about you shutting up is not her fault, so when she is finally fed up she hits you, not even unexpectedly by your own admission. The only thing you misjudged was her hitting you in the nuts... \n\nAnd now boohoo you are upset and angry... \n\nstop crying and apologize to her, something that is about 19 1/2 years overdue. she may apologize back but even if she doesn't you better deal with that. You simply fucked around and found out.",
   "created_utc": 1701602688,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsz7rc",
   "message": "YTA.... how old are you? This is like middle school drama ffs. I hope she included you threatening to hit her when she tells people about the fight. She shouldnt have hit you but she warned you, you do this often and shes clearly not a fan. She even said \"Stop or ill hit you\" and youre still here trying to play the victim! \"I must have missed the signs, woe is me shes mean 😭\"🤮\n\nAnd then, you being stronger and baing able to do damage, threaten to slap her after you went years ignoring her verbal requests and being upset.\n\n\nI hope you tell everyone the story so they can see how weak of a person you are, she will have an easier time explaining leaving or cheating on you if they already know who you are....so good job there",
   "created_utc": 1701604655,
   "score": 255,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsxded",
   "message": "You both are toxic as fuck",
   "created_utc": 1701603232,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt62fa",
   "message": "I don't agree with violence, however, you pushed past a boundary that she set within literal seconds of her setting it. \nChances are she'd actually had no intent to actually hit you when she said she would. She probably thought her asking you to stop and telling you what would happen if you didn't would have been enough for you to realise she didn't like it.\n\nShe shouldn't have hit you, but YTA",
   "created_utc": 1701609292,
   "score": 0,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbslx4l",
   "message": "Well, you definitely know she doesn't like it now😆. Apologize, grovel a little bit, maybe😄. Do not ever tease her about being from that town again.🤣 I hope you're not in any pain anymore, if you are you should probably see a docto🙂r.",
   "created_utc": 1701593827,
   "score": 250,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbt0fdq",
   "message": "Oh. And again. YTA.  You deserved it",
   "created_utc": 1701605565,
   "score": 254,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsquyw",
   "message": "To me you sound like a whiney bitch you said it yourself you knew you were pissing her off and she gave you fair warning you should of laughed it off and realised you went too far.\n\nIt doesn't sound like it's her normal behaviour at all but clearly she's had enough of your shit and while it hurts (I know) she didn't injure you. Odd that your first response is physical violence when you got the reaction you've been working towards for what sounds like a long time. \n\nIf you cant read ques read the room are you the only person that finds your jokes about her funny would you wind her dad up the way?  Would you let someone treat your sister like that? If my sister came to me and said her husband has been giving her shit for where she's from I wouldn't be happy at all, If he threatened her for finally snapping he would get one more warning with a threat attached that would carry injury she's not a punch bag physically or emotionally. \n\nGet over it what reaction did you want she's clearly at the end of her rope with it, it would of felt worse seeing her break down and knowing forever you bullied her to that point it's good she's stuck up for herself. I'd say sorry for the numerous times you've upset her and explain you thought it was running banter and just pack it in, she may even apologise for your poor nads but I wouldn't expect it.",
   "created_utc": 1701597881,
   "score": 251,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbsk4ey",
   "message": "YTA. I hope it hurt.",
   "created_utc": 1701592388,
   "score": 248,
   "submission_id": "189n4vm"
  },
  {
   "comment_id": "kbs9g3m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "189n4vm"
  }
 ]
}