{
 "submission_id": "189q5xc",
 "title": "AITAH for not wanting my husband to give his Christmas bonus to my inlaws?",
 "selftext": "My husband and I both have professional careers, and despite being fairly young, we have made good choices that have allowed us to buy a home and build a modest savings account while also caring for our three young children. We have managed to avoid accumulating any debts, apart from our mortgage. This meant delaying purchases and saving up to pay with cash. Currently, we both drive cars that are over 10 years old, and we had hoped to replace one of them within the next two years without incurring any debt.\n\nOn the other hand, my husband's parents are financially irresponsible. For their anniversary last year, they bought matching Teslas, even though they own a new truck that cost them over $100,000 and had recently remodeled their home. Despite this debt, having 15 years before retirement, and no savings or retirement funds at all, my FIL decided to cut his hours to part-time work because he disliked his one-hour commute.\n Just a few weeks later, he and my MIL took a two-week vacation to the Bahamas. When they returned, he was let go from his job. Now, with my MIL only working three days a week as a receptionist in a doctor's office, they are facing financial struggles.\n\nTypically, everyone comes here for Thanksgiving, since we have plenty of room for everyone to stay without getting a hotel it's always worked nicely and saves us from  traveling with 3 children under 5 across the country. However, since my MIL used up all of her PTO on their Bahamas trip, we had to fly there instead. Airfare for the 5 of us was close to $3000, plus another $800 for the Airbnb since my inlaws only had room for my SIL, her BF and College roommate. It was hectic but we were not too upset over the cost since  my husband had just learned he'd be receiving a $10,000 Christmas bonus. My husband was excited but chose not to mention the bonus not wanting  to come across as bragging when they were struggling. However, my sister-in-law found out about the bonuses through a friend of hers who also works for the same company and brought it up during Thanksgiving dinner. Later that night, on our drive back to the Airbnb, my husband said his mom had approached him privately and asked if he would consider giving them his bonus as a gift since it was an \"unexpected blessing\" and he was torn. I understand that it's not my bonus, and that we should want to help family; however, I can't help but feel they partially contributed to their situation. I'm also upset that outside of my MIL letting us know that she will not be buying gifts this year (even the grandkids) my in-laws have not adjusted their spending habits. They still shop at Whole Foods and just updated both their iPhones. While we drive older cars, cook at home, and shop for sale items at Walmart. Outside of this Thanksgiving trip to her house, in the 7 years we've been married, never have gone on a vacation. I don't know what to do; I feel guilty because I know my husband hates to see his parents struggling, but I can't help but feel a little resentment and feel because they have made poor choices, our family will be further behind.",
 "created_utc": 1701596316,
 "permalink": "/r/AITAH/comments/189q5xc/aitah_for_not_wanting_my_husband_to_give_his/",
 "score": 155,
 "url": "https://www.reddit.com/r/AITAH/comments/189q5xc/aitah_for_not_wanting_my_husband_to_give_his/",
 "comments": []
}