{
 "submission_id": "189q5xc",
 "title": "AITAH for not wanting my husband to give his Christmas bonus to my inlaws?",
 "selftext": "My husband and I both have professional careers, and despite being fairly young, we have made good choices that have allowed us to buy a home and build a modest savings account while also caring for our three young children. We have managed to avoid accumulating any debts, apart from our mortgage. This meant delaying purchases and saving up to pay with cash. Currently, we both drive cars that are over 10 years old, and we had hoped to replace one of them within the next two years without incurring any debt.\n\nOn the other hand, my husband's parents are financially irresponsible. For their anniversary last year, they bought matching Teslas, even though they own a new truck that cost them over $100,000 and had recently remodeled their home. Despite this debt, having 15 years before retirement, and no savings or retirement funds at all, my FIL decided to cut his hours to part-time work because he disliked his one-hour commute.\n Just a few weeks later, he and my MIL took a two-week vacation to the Bahamas. When they returned, he was let go from his job. Now, with my MIL only working three days a week as a receptionist in a doctor's office, they are facing financial struggles.\n\nTypically, everyone comes here for Thanksgiving, since we have plenty of room for everyone to stay without getting a hotel it's always worked nicely and saves us from  traveling with 3 children under 5 across the country. However, since my MIL used up all of her PTO on their Bahamas trip, we had to fly there instead. Airfare for the 5 of us was close to $3000, plus another $800 for the Airbnb since my inlaws only had room for my SIL, her BF and College roommate. It was hectic but we were not too upset over the cost since  my husband had just learned he'd be receiving a $10,000 Christmas bonus. My husband was excited but chose not to mention the bonus not wanting  to come across as bragging when they were struggling. However, my sister-in-law found out about the bonuses through a friend of hers who also works for the same company and brought it up during Thanksgiving dinner. Later that night, on our drive back to the Airbnb, my husband said his mom had approached him privately and asked if he would consider giving them his bonus as a gift since it was an \"unexpected blessing\" and he was torn. I understand that it's not my bonus, and that we should want to help family; however, I can't help but feel they partially contributed to their situation. I'm also upset that outside of my MIL letting us know that she will not be buying gifts this year (even the grandkids) my in-laws have not adjusted their spending habits. They still shop at Whole Foods and just updated both their iPhones. While we drive older cars, cook at home, and shop for sale items at Walmart. Outside of this Thanksgiving trip to her house, in the 7 years we've been married, never have gone on a vacation. I don't know what to do; I feel guilty because I know my husband hates to see his parents struggling, but I can't help but feel a little resentment and feel because they have made poor choices, our family will be further behind.\n\nUpdate: Thank you for all the responses. To answer a few questions I've seen. \n\n1. I heard them discussing that they are upside down on the vehicles moreso on the truck because they have put almost just under 80,000 miles on it between my FIL commutes as well as visiting my SIL at college over the past two years. I believe that was  their reason for buying the Teslas since they are in a rural area and the commute was taking a lot for fuel, also the reason they are not considering selling them. \n\n2. I do not believe they can get assistance due to their home. When they downsized 5 years ago due to the area they live in they bought it for 1.5 million. MIL was salty about the smaller house but FIL wanted to get out of the city. \n\n3. SIL has another year of college and plans to move in with her BF next semester, she doesn't work. Her BF graduated last year and works in IT. The person SIL knows at the company doesn't directly know my husband but knew some departments received a large bonus this year. My SIL thought it was his department and asked if he had received one too. \n\n4. It was taxed and is a little over $6,000 now. \n\n5. I have not said anything but I do feel that this would not help them since this is not the first time they have used money for other things. Part of my husband's recruitment package was student loan reimbursement up to $12,000. Pre- grad needed his parent's help and they took out a parent's loan for $6,000. He sent his parents a check for the full amount so it could be paid off. A year later they casually brought up it was due and needed to pay on it. When he asked about it they said they decided to use the money for something else and keep the loan because the payments were low.  I feel they do not know how to budget or have a desire to. Some people brought up Dave Ramsey, you are correct that is what our family uses. A few years ago my FIL tried to put my MIL on a budget,  I had just started doing my own hair, MIL noticed my products and started asking questions and said  \" I guess I need to learn how to do my own hair  because FIL told me I need to cut things out\". I brought up the program and their eyes glazed over. \n\n6. I am also worried about it coming down to the need for them moving in with us. We did buy a large house because we plan to build equity and wanted the kids to each have their own room as they get older. After we bought our home my MIL mentioned they never lived in a home this large. We paid a third of what they paid for their home and put almost 40% down. \n\n7. It isn't just his parents, I'm afraid SIL has the same mindset. She has maxed out credit cards and bought a new car when there was nothing wrong with her old car. She's not working and doesn't have a plan after college. She always calls us \"rich\" and for holidays requests gifts that we can't even afford to buy ourselves. Every single meal out while visiting either there or here it is always assumed he will pick up the check. It's sickening watching all of the unnecessary spending. \n",
 "created_utc": 1701596316,
 "permalink": "/r/AITAH/comments/189q5xc/aitah_for_not_wanting_my_husband_to_give_his/",
 "score": 1,
 "url": "https://www.reddit.com/r/AITAH/comments/189q5xc/aitah_for_not_wanting_my_husband_to_give_his/",
 "comments": [
  {
   "comment_id": "kbsqq45",
   "message": "They didn’t partially contribute to their situation, they 100% created it. No way should your husband give them any money. \nAlso I would have acted confused about the bonus as if I didn’t qualify for/get it.",
   "created_utc": 1701597771,
   "score": 175,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsuwix",
   "message": "Your MIL calling this bonus an \"unexpected blessing\" is a slap in the face of your husband, who earned it with hard, quality work. Not that these assholes would know what it means. \n\nI detest people who live beyond their means, buy expensive things and take fancy vacations, then demand help from people who work twice as much and live frugally. You have more than them because you work more and you don't waste your money on frivolous things. That doesn't mean you owe them your savings. That's not how it works.\n\nNTA, please try to convince your husband that this money would be better placed in your kids' college funds, than wasted on unnecessary expenses by people who can't even be bothered to work full time.",
   "created_utc": 1701601230,
   "score": 194,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbspgpz",
   "message": "Omg absolutely do not give the check to them. You already spent thousands for holidays. They need serious help for a shopping addiction. If he gives them the money now, what is it for or is it just to have spending money? He needs to tell them that they need to see a financial planner asap.",
   "created_utc": 1701596725,
   "score": 242,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbspz00",
   "message": "Oh come on. Why would he give them that?\n\nDo they starve? No. Do they have a roof over their heads? Yes. End of story.\n\nTell your husband absolutely not. If he does, he is just as irresponsible as his parents and I would disentangle my finances from his completely if I werw you, just to protect myself and the kids.",
   "created_utc": 1701597143,
   "score": 6,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt0t10",
   "message": "They have a $100,000 truck. \n\nThey have two Tesla’s. \n\nThey can sell one of those 3 things and have their very own “unexpected blessing.”",
   "created_utc": 1701605844,
   "score": 193,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbspv18",
   "message": "He should just say that you already have plans for this money. Unbelievable rude for someone to ask for money like that",
   "created_utc": 1701597055,
   "score": 171,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsyfsn",
   "message": "First of all that $10k won’t be 10k after taxes and 401k. Let the ILs know that most of the bonus is eaten up by taxes and the flights and ABNB. The rest is going to your family needs. It’s is your money too because the two of you are married. \n\nYou and hub can offer to help them with a budget and financial management",
   "created_utc": 1701604063,
   "score": 78,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsse5k",
   "message": "NTA. The biggest problem I see is that it isn't going to fix anything. If he gives them his bonus, it's going to be gone by the next month and they will be in the exact same financial situation they're in today, because their spending habits have not changed a bit. \n\nEven if that money bails them out of bills that are past due this month instead of being used to go shopping, who is gonna pay the next month's bills? I would worry that once that door is opened, they will keep coming to him for bailouts because it sounds like they are in a hole that is not going to go away cheaply/quickly. And in addition to the financial side, that's just going to cause more tension between you and your husband.",
   "created_utc": 1701599153,
   "score": 107,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbssuq1",
   "message": "Look\nAfter your own children ! What about their college funds",
   "created_utc": 1701599539,
   "score": 45,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbstu9g",
   "message": "NTA. \n\nBut you have a serious hubby problem.\n\nI get that he hates to see his parents struggle, yet they live way, WAY above their budget. \n\nWould they help you if the roles were reversed? I don't think so.\n\nIf he enables them now, it will just open the floodgates and the in-laws will leech off of you and your savings will be gone in no time.\n\nEdit: tell you SIL to keep her nose outta your buisness. Let her feed her parents through. Jmfc, what a cunt.",
   "created_utc": 1701600356,
   "score": 66,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt0ar7",
   "message": "They can sell the Teslas and the truck if they need money. Their situation is 100% of their own making. Giving them money is just enabling their irresponsible spending and lifestyle. Why should you sacrifice so they can avoid the consequences of their own actions?\n\nThey are selfishly stealing from their grandchildren's future and wellbeing......... NTA\n\nETA If the bonus is 6500 after taxes, you've already spent 3800 going to visit them for Thanksgiving which only leaves 2700. That's already spoken for with 900 per child in their college accounts. Done!",
   "created_utc": 1701605473,
   "score": 33,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt361s",
   "message": "Tell MIL it was spent on spending Thanksgiving with them and the money is already gone.",
   "created_utc": 1701607474,
   "score": 25,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsvbbz",
   "message": "NTA. You need to sit down and have a serious conversation with your husband about finances and family. \n\nYou and your husband are being very responsible with your finances to ensure you have no debt. You are living well within your means. His parents on the other hand aren't. You should not suffer for their financial irresponsibility. You shouldn't be punished for being responsible.  They don't need this money, they want this money. They could sell their Teslas. They could sell their truck. They could start spending responsibly. They are more concerned with keeping up with the Joneses. \n\nIf you give them this money, how long will it last? I'm thinking only a few months. They will then come back to your husband for more money. This is only enabling their poor financial decisions. This isn't giving a loan to help your parents with an unforeseen hardship, this is enabling their poor financial decisions. The only thing your in-laws should get from you and your husband is a session with a financial planner or accountant. Your husband should tell them no. \n\nWhy should you be paying for their holidays when you haven't had one?",
   "created_utc": 1701601565,
   "score": 49,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbst3d4",
   "message": "Offer to buy one of their new vehicles from them for 10k, and sell it for whatever you can get for it. Or keep it\n\nFIL doesn't need a car now he is not working",
   "created_utc": 1701599736,
   "score": 44,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsvn8t",
   "message": "NTA-this bonus will be around $6000-$6500 post taxes.  In the grand scheme of things, will this improve their financial situation and will they stop their lavish spending habits? No.  Will this go a long way in your household where it will be needed for a new vehicle or whatever surprise issue pops up needing financial resources? Yes.  I would tell your husband he needs to be mindful of his household first before giving money away to those who would not appreciate it and may come back for more.  I feel like it’s necessary to provide your input as he would be allowed to have an opinion if you were in a similar predicament.\n\nAlso, sister is a super AH for bringing it up!  Isn’t money a taboo topic at thanksgiving?!",
   "created_utc": 1701601838,
   "score": 24,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbssrvu",
   "message": "Better draw a hard boundary now as this will only get worse !!",
   "created_utc": 1701599475,
   "score": 17,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtjq36",
   "message": "NTA his parents are planning on y'all being their retirement fund. Don't start now",
   "created_utc": 1701616226,
   "score": 16,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbstwa1",
   "message": "NTA. That money will be gone fast. It’s a bandaid when the jugular has been severed.",
   "created_utc": 1701600403,
   "score": 10,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt3cze",
   "message": "Like sand through the hourglass, so is money in your inlaw's hands.  Your MIL was waaaay out of line to ask that of YOUR FAMILY!!  Because that it what it is, your family's money.  \n\nGive them, Dave Ramsey's books.  This is what they need, not more money to waste.",
   "created_utc": 1701607604,
   "score": 8,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsvb81",
   "message": "NTA. With spending habits like that, those $10k are gonna be gone within days. The issue is not a lack of money, it’s them being incredibly irresponsible with their financials. Giving them more money is just going to enable that.",
   "created_utc": 1701601562,
   "score": 7,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsyfnl",
   "message": "I can't believe she flat out asked him to give it to them, didn't even bother asking for it as a symbolic \"loan\" you know would never be repayed\n\nHow do people have the stones for this\n\nDefinitely NTA, he would be stupid to give away money he has earned to people who wouldn't be grateful for it. Treat your own family.",
   "created_utc": 1701604060,
   "score": 7,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbszvtc",
   "message": "NTA. First, I disagree that it isn’t your bonus. Both your incomes including bonuses are your immediate family’s money and you absolutely should have a say. Second, I would definitely not give them any money and instead offer to help them downsize, get new jobs and learn to budget.",
   "created_utc": 1701605162,
   "score": 6,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt0m7w",
   "message": "NTA  Ask your husband if he believes that giving them his bonus will truly help their struggles or will they continue to live as always have and blow through the money while your family struggles. If he gives it to them then you know that he is beginning to follow in their footsteps and not using it for your family's needs, which is what you've always agreed on doing. Separate your finances, including credit cards, leaving only a joint account for household finances. Downsize your home, when family visits they'll have to stay at hotel. Get the car you need. Have a postnup signed so when your marriage falls apart, not agreeing on finances is one of the main reasons for divorce, you are not left with debt that he accrued because he took care of his parents instead of his own family.",
   "created_utc": 1701605707,
   "score": 5,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt2gef",
   "message": "NTA. And the absolute *gall* of that woman. The language she's using. It's an \"unexpected gift\"? *No*. It's a bonus, a thank you for *hard work* that paid off. It's *income*, not a gift.\n\nYour SIL is an AH for bringing it up. Your MIL is an AH for even asking. \n\nTry to reframe this is your husband's mind. All those sacrifices you've made over the years, putting things off, making to with what you had. This is *his reward*. The opportunity to splurge a little. He can use his reward however he wants to, but what message is he sending if he just continues to sacrifice, knowing that his parents wouldn't do the same. Knowing what good the two of you could do for your lives with it, in both the immediate and long term. And what his parents would waste it on seeking instant gratification, knowing they will be back for more because their problems are only going to get worse.",
   "created_utc": 1701606994,
   "score": 6,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbuc6tb",
   "message": "Why don't they just sell one or 2 of those vehicles? That's a them issue. Not yours.\n\nNTA \n\nMy mom would NEVER ask me to gift her that kind of money.  \n\nHe should tell her, \"This was not an unexpected blessing. It was anticipated and already been allocated towards a new vehicle purchase next year.  I'm sorry you're in a bind.  Can I help you list that new truck for sale online?\"",
   "created_utc": 1701627238,
   "score": 6,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbszv02",
   "message": "Give them the bonus in exchange for one of their 3 new vehicles, otherwise they can go piss up a rope",
   "created_utc": 1701605145,
   "score": 4,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt3o66",
   "message": "Nta. They need to make changes in their decisions. They should sell their cars and get something that is more affordable in their range and be more frugal on grocery shopping. Your SIL had no right to mention the bonus money, and your MIL had no right to ask. Yes, it is his bonus, but you both are married and have to make decisions jointly. There will be a day when one of the cars goes, and while $10,000 won't buy you a new car, it is a nice down payment or a start to building up your car fund. \n\nQuestion. Do you get bonuses? Because if you do, you should start keeping them for yourself. \n\nAlso, here is the thing. Now your SIL is going to know every time your husband gets a bonus, and if he gives this bonus to his mother now, she will expect all future bonuses given to her.\n\nLook, it would be different if they were financially responsible and lived within their means. That maybe FIL lost hos job due to cut backs or an injury he sustained, so they just need help to get back on their feet. But that isn’t the case. They will blow through that money before the end of the year.\n\nMy father had a career change, and now he makes significantly less, though he has a few years till retirement. They are ready for retirement and have funds for it. But they still had to make changes to adjust to the new pay by making cutbacks. They look at it as a way to get ready for when they do retire. The only help I give them is I buy the food for the holiday meals, even though it is hosted at their house. They said no, but I told them I wanted to because I got a small holiday bonus. They never asked me for my bonus they were appreciative of what I did. \n\nInstead of giving them all that money, buy them gift cards to Walmart or Aldi's to buy food. They need to learn to change their habits now because what is going to happen when they do retire?",
   "created_utc": 1701607804,
   "score": 6,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt306f",
   "message": "JFC! Absolutely not! He is an idiot if he gives them a dime. If he helps them once you have 2 new dependents. They can sell their teslas.   \n\n\nwhat he can do is offer to pay for a financial advisor to help them but he will never give them money to bail them out of overspending crisis.\n\n🚩🚩🚩🚩🚩🚩🚩🚩🚩",
   "created_utc": 1701607365,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt46hy",
   "message": "$10k after taxes, after Thanksgiving costs, after saving some —- no money to give. \n\nSell the Teslas, sell the truck. \nI’d be livid.",
   "created_utc": 1701608125,
   "score": 4,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt4aen",
   "message": "Me at the title: eeeeeeeeeh probably. \n\nMe at the mention of their Teslas: ABSOLUTELY NOT.   Good lord.  You guys need to set boundaries NOW.  Their financial irresponsibility is going to become your and your husband's problem if you do not.  Say no, stay firm.   You'll be enabling their behavior and then supporting them in retirement since they have no savings to speak of.   And you'll be robbing yourself and your kids to do it.  \n\nIf you really want to do something for them, offer to pay for a visit to a financial planner or a course in financial planning/budgeting/etc. but DO NOT give them ANY MONEY.  EVER.\n\nThese are not people who have fallen on hard times.  These are people who used the world's largest shovel to deliberately dig themselves into a hole.",
   "created_utc": 1701608195,
   "score": 5,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbuemcz",
   "message": "Ask your husband to remind his mother you already spent most of the net money (because it will be taxed) to visit them. It may also bring a new perspective to your husband about the costs incurred by your own family due to your in- laws' poor choices.",
   "created_utc": 1701628078,
   "score": 4,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsxq11",
   "message": "NTA. Absolfuckingly not. They won't even buy you gifts, don't even TRY, don't even THINK about giving them $10k. Do not let your family suffer. When they say a sucker is born every minute, they're talking about kind ppl who let themselves get pushed around and guilted.",
   "created_utc": 1701603511,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsyee5",
   "message": "I don't think they will spend the money wisely. I'm sure they will burn through it as if it is a bonus to them (maybe a new tv?) and they won't use it to pay off parts of the debt. It will not help them. The sooner they realise that their spending habits don't match their income the better! Otherwise you and your husband have to do this in the next few years.",
   "created_utc": 1701604031,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt1ng2",
   "message": "NTA.  Him handing over that money won’t solve the long term issue.  Make sure he understands that.  His responsibility is to you and his kids.",
   "created_utc": 1701606438,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbte18u",
   "message": "NTA,  but if your husband does want to give the families bonus away to his parents, you should really go schedule a week trip for the family to the bahamas, I'm sure the mil can give recommendations. And think about getting a new car. There is no point in being frugal and living simply if the savings just go to someone living extravagantly.",
   "created_utc": 1701613591,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbte8a0",
   "message": "“I’m not cool with denying ourselves our wants so our needs are safely covered, and then  give money away for somebody else’s wants. Your parents can sell some of their vehicles, stop taking vacations and FIL get a new job.  \n\nNTA",
   "created_utc": 1701613688,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbth6ay",
   "message": "NTA!! And if he hands over that money, the he absolutely is! They aren’t going to use it responsibly. It’s not like they are doing everything right and need help. They are irresponsible and give zero F**ks.  How they’ve made it this far without losing their house or having a car repo’d is beyond me 🤯",
   "created_utc": 1701615078,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbthm6z",
   "message": "\"they partially contributed to their situation\" ??? Lol\n\nPartially?\n\nIf THEY aren't responsible for the situation they find themselves in, who is?\n\nUnder no circumstances would I give them a dime unless it was in the form of paying a house payment for them, so they aren't homeless. Paid directly to the mortgage, if you choose. One time. Once!\n\nMaybe I would pay for counseling to help them understand and learn how to change their behavior.  Maybe, depending on their readiness to change, which does not seem to be the case.\n\nI fully understand the desire to help. I think any of us would. But giving them money is NOT helping. It's enabling them to continue their poor habits. \n\nIf you give them money, you are contributing to their problems and wasting money that could do your family, your children, a lot of good. \nWhy not plan a vaca for yourselves instead? Make some memories with those kinds?\n\nI'd donate it to a worthy charity before I gave it to family. You'll be creating a new source of money, only for them to come wanting a handout more and more. Just don't do it...\n\nYou 2 may be doing well now, but things can change at any time. Save and invest and protect your family's future.",
   "created_utc": 1701615276,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbthwb7",
   "message": "The money should go towards your kids or your mortgage. Not his parents.",
   "created_utc": 1701615403,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbti6qr",
   "message": "They have made some very poor choices. That is totally \u0026amp; completely on them. We all make choices - I chose to get a job after my DH passed; I eat at home; I don't spend excessive amounts of money; I haven't been on a \"vacation\" in six years; I try to be frugal.\n\nYes, it's his money and he may hate to see his parents struggle, but their struggles are of their own doing. If he gives them the money, I bet they won't be using in order to live, but maybe another vacation.They will waste it on their wants \u0026amp; not their needs.",
   "created_utc": 1701615536,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbti7bp",
   "message": "NTA.\n\nCould just say 'no that's not possible for us to do'. Then suggest places they could get advice to turn things around. They have cars they can sell, they could down size.\n\nor if you feel you have to give excuses..\n\nStart by telling them how much it cost to visit them, so that most of the bonus has already been spent. Then remind them that you need to save for the children's education, that non of you have had a holiday in years, so the kids get what they need. Anything extra that comes in is needed. Remind them you don't have the latest cars, phones...you've gone without for your kids future. \n\nYour SIL is either dim or a stirrer.",
   "created_utc": 1701615544,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtie7o",
   "message": "Fuck that. Tell him put that shit right into savings. Its not his fault that they are in a bad position so he has no reason or obligation to get them out of it",
   "created_utc": 1701615630,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtiesp",
   "message": "NTA\n\nYour husband needs to realize giving them the money wouldn’t help. It would just enable their continued behavior.",
   "created_utc": 1701615637,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtkibs",
   "message": "NTA “I’m sorry the bonus is earmarked for a new car since ours are both pretty old. How are your new Teslas working out for you?”",
   "created_utc": 1701616576,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtlsnl",
   "message": "Your SIL sounds manipulative for bringing it up at dinner.\n\nIf I were in your situation and my husband gave his financially irresponsible parents 10K, I would consider extreme measures (separation, divorce, no contact). Your opinion should matter on this. That’s money that could be used for the kids since their grandparents won’t be getting them gifts.",
   "created_utc": 1701617128,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtpgis",
   "message": "I’m so glad my husband would never even bring this up to me because it would be an automatic no. You are your kids are should be his priority not helping people who WON’T help themselves. I hope he makes the right call. Also it is your bonus too, you’re married.",
   "created_utc": 1701618657,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtpj9k",
   "message": "NTA\n\nIf he continues to bail them out, his parents have no incentive to start being responsible for themselves.\n\nI would not give them the bonus.  That they would ask tells you just how entitled they are.\n\nYou also have a problem SIL who is nosy and a busybody.",
   "created_utc": 1701618687,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtpnhb",
   "message": "You can’t pour money down a hole. They need to budget, sell of any assets and downsize. They’ve lived the good life and are stopping you from living yours. They would need to show they were changing, but that’s not yet.",
   "created_utc": 1701618733,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtps7h",
   "message": "NTA and don’t encourage this kind of behavior (edit word). Depending on the state you reside in, your husband’s bonus (supplement income) might be heavily taxed. Kindly tell them the money already being accounted for. Shut that down immediately.",
   "created_utc": 1701618787,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtptxn",
   "message": "Put your foot down. A hill to die on.",
   "created_utc": 1701618807,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtx12d",
   "message": "The title of this post made me think that you are the asshole initially, however, once I read what a freaking mess his parents are, several thoughts entered my head, first off this has to be a troll post because I can’t imagine anyone doing what his parents did financially, secondly, the father should be checked for some type of Alzheimer or mental deficiency, thirdly, offer the $10,000 to them if they’ll swap one of the Teslas for the money, lastly, book a trip and tell them you wish you can give them the money but you spent it on a trip to the Bahamas since you heard they had such a good time there, and you wish you could help them, but it ain’t happening.",
   "created_utc": 1701621649,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbu9gf3",
   "message": "Don't give away your bonus. Pay down your mortgage or put it into a college fund for the kids. Maybe take a vacation , it sounds like you earned it.",
   "created_utc": 1701626264,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbuc50i",
   "message": "NTA why in hell would you want to give them your hard earned money when they do nothing but waste their money??? It might not be your bonus you absolutely should have a say in how to spend considering you have made many sacrifices for your family! What are you going to do when they can no longer work and there house of cards come tumbling down? Are you going to be expected to fund their retirement?😞",
   "created_utc": 1701627220,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbuc6mx",
   "message": "NTA.\n\n\"Sorry mom, it's going into the kid's college fund.\"\n\nPretty much ends the argument. What kind of grandmother would argue about that?",
   "created_utc": 1701627236,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbuc91b",
   "message": "NTA.  Your inlaws are greedy and financially irresponsible; don’t reward that behavior.  They are living beyond their means and once you start giving to them money they will keep asking.",
   "created_utc": 1701627260,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbucjmc",
   "message": "NTA tell husband he can use the bonus for your new cars, vacation, and renovations first then he can give the rest to his parents, so it’s equal.",
   "created_utc": 1701627363,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbucmn6",
   "message": "NTA and as someone who is fiscally responsible, I would feel exactly the same way that you do. If your husband gives them any of this bonus, he’s continuing to enable their poor financial choices. Time for FIL to find another job and actually work towards getting out of debt.",
   "created_utc": 1701627392,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbujf0v",
   "message": "Does your husband really not see through this? Parents or not they sound like a bunch of entitled turds. Put half in savings and half on a getaway with your husband and yourself.",
   "created_utc": 1701629756,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbujtoe",
   "message": "Fuck your in-laws. They really straight up asked for money, and not just that, the *entire* bonus. If there was something specific they wanted the money for - paying bills, etc. then *maybe*. But I bet they planned to blow it on something stupid. \n\nIf it is a blessing, it’s meant for you and your husband. If it was meant for your in-laws, FIL wouldn’t have been fired and one of them would have received their own bonus. \n\nNTA.",
   "created_utc": 1701629902,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbuk4jh",
   "message": "NTA\n\nIf they are strapped for cash they can start by selling one of their 3 cars.\n\nDon’t fund their financial irresponsibility.",
   "created_utc": 1701630009,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbv9ipd",
   "message": "I was raised that you Do NOT discuss or ask other people (family or not) about their finances....RUDE, RUDE, RUDE",
   "created_utc": 1701639170,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbv9tps",
   "message": "WTF. These people are a boat anchor...you need to put it in writing that they either right their ship or you will do nothing for them come retirement. The numbers that I read in this post are astronomical. The only places that I can think of that cost this kind of cash are ranches in Idaho, mansions in Georgia, or Utah. Jesus Christ these people are insane. How are they handling medical insurance? Dental work is hella expensive!",
   "created_utc": 1701639282,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbveh3h",
   "message": "Your husband should tell his folks he already put his bonus in a college fund for your kids.",
   "created_utc": 1701640972,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbveoto",
   "message": "I suggest putting that $6K into college accounts for your kids.",
   "created_utc": 1701641051,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbvkfnz",
   "message": "MARRIAGE COUNSELING NOW\nI didn't even read the whole thing because I was your husband. \nI was emotionally blackmailed into this same nonsense. We were \"gifted \" a car, and they would make payments. Until they couldn't. Then the if you loved me you would,  started. We couldn't afford the massive payments. ( we were young and pregnant). I took money out of my retirement to make a few payments. My husband found out and lost his shit. Rightfully so. We entered counseling, I learned to grow a back bone and told them no, and we went low contact. The car was not the first time they've asked for enough money to destroy us.",
   "created_utc": 1701643211,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbvq50h",
   "message": "If you're in a community property state, it is your bonus, half anyway.\n\nBut regardless, you're a couple with entangled finances, every financial decision affects both of you.\n\nAnd it's utterly crazy for the people driving old cars to give money to the couple that has three new cars.",
   "created_utc": 1701645454,
   "score": 3,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsvpd3",
   "message": "Sorry, NTA but don’t enable the weak!!",
   "created_utc": 1701601886,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbsvptu",
   "message": "It would be irresponsible to give them any money. Your husband is being very foolish.",
   "created_utc": 1701601896,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt0ead",
   "message": "NTA you would be if you don't talk to your husband. You 100% have a say",
   "created_utc": 1701605542,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt17vo",
   "message": "NTA,you can't control other peoples habits. But they are grown. They know where money comes from. \n\nYou may have a lot of money now but that doesn't last. You need go think of your kids first and put that money towards them. MIL/FIL can sell and downgrade what they have. \n\n\nAlso, unless you WANT them living with you it sounds like you and your husband need to sit down and have a frank conversation about what you will and won't do for them from now on.",
   "created_utc": 1701606135,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt1rj4",
   "message": "IF you and your hubby decide to give them the money, you should have them give you the bills to pay.  Better yet, make them going to a money planner part of the bargain.  That and giving up on two cars!",
   "created_utc": 1701606518,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt20ah",
   "message": "Omg no. And if he keeps giving money to them. Separate your finances",
   "created_utc": 1701606686,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt239f",
   "message": "NTA. Do not give any money to them. None. It is for your family. If he decides it is 'his' money  and gives it anyway, then I would be out the door.",
   "created_utc": 1701606743,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt2804",
   "message": "Totally insane. Given their spending habits it’s like an addict asking for more cocaine. No way should that bonus go their way. They have assets (or debts?) and they can sell/return their expensive cars rather than impose on you. Stand firm and say that the bonus was to be added to the college fund of your kids, at least that was your understanding - or to pay down your mortgage. NTA for keeping the bonus in your family and not squandering it on the in-laws!",
   "created_utc": 1701606834,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt2r4h",
   "message": "Wtf absolutely not, do not give them money.\n\nAlso, seeing your parents struggle is seeing them not afford healthcare, starving, being evicted… it’s not seeing them drive teslas and go on vacations. Like your husband will literally give money to them that could instead be put in a college account for his own children, so they can continue their lives of excess longer? I would seriously be livid",
   "created_utc": 1701607195,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt2u62",
   "message": "NTA. He can help out his parents without giving them the full 10k, (although obviously he doesn't have to give them anything). You guys should take a family vacation!",
   "created_utc": 1701607252,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbt31pv",
   "message": "#updateme",
   "created_utc": 1701607395,
   "score": 2,
   "submission_id": "189q5xc"
  },
  {
   "comment_id": "kbtln9u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "189q5xc"
  }
 ]
}