{
 "submission_id": "189rktc",
 "title": "AITAH for telling my bf that he can't control how I dress even though he pays for all our dates ?",
 "selftext": "So me and bf met through we went though middle and high school together. A year after we finished school we met coincidentally and we got talking. we dated on again and off again throughout high school and to give context he knew exactly how I dressed considering we knew each for about 5 years had mutual friends and went to a fair share of parties where he had no problem checking me out. Also we live in a south Asian country so the clothes we wore are not even fraction of the western standard and are generally more conservative cause uk brown aunty's at parties.\n\nwhen I met him a year later he seemed like a changed guy and not like how he was in school so I decided to give him a chance. We went on 2 dates and he paid for both of them without question.\n\nHe soon had to leave to go back to college this one week into the relationship I had to go spend the day at a mall with some friends for one of there birthdays and I wanted to wear a skirt it was probably 3 inches above my knee and he said no really rudely but I guess he felt bad so he texted and apologized said he wasn't comfortable with the skirt and he didn't care what I wore around but there will be guys at the mall and something might happen to me and he won't be around to protect me but the final decision was upto me and he'd respect that. \n\nso naturally because he was being caring I changed and literally sewed a whole new skirt for it in like 24hours below my knees . 2nd instance I was going out with my best friend for a movie and he thought the dress was too short and I wore jeans on top of it. To give context to the next bit his main issue was someone might do something to me and he won't be there to stop it.\n\n3rd instance was the breaking point for me he told me I couldn't wear anything short around my family. Which doesn't make sense to me because one its my mom and dad so was he suggesting they might do something to me which is insulting to be honest. Or he was saying if I was out with my family my father would fail to protect which is honestly equally insulting because he raised be for 18 years and I'm doing quite fine. Am I being too dramatic cause currently all is says is to dress below my knee or should I have stuck to my boundaries the first time he asked me to change We are also 2 weeks into the relationship.   \n  \nEdit : I didn't give context about the paying for dates situation properly. He insinuated he was the man and he paid for the dates he ran the relationship and I should do what he says as the women. Like more traditional I'd say\n\nEdit 2 : okay considering everyone's responses I'm gonna  talk this out with him and see if he can reach some level of compromise atleast or else the obvious option which I already knew is to break up ",
 "created_utc": 1701602632,
 "permalink": "/r/AITAH/comments/189rktc/aitah_for_telling_my_bf_that_he_cant_control_how/",
 "score": 33,
 "url": "https://www.reddit.com/r/AITAH/comments/189rktc/aitah_for_telling_my_bf_that_he_cant_control_how/",
 "comments": []
}