{
 "submission_id": "189sekr",
 "title": "AITAH for shoving a kid away after he tried ruining my birthday dinner?",
 "selftext": "I (15f) went out for dinner with three of my closest friends for my birthday. I had planned this for weeks and I was really excited since I had never done anything like this before. We go out and overall, the dinner was great and I was having a really good time. We decided for dessert to get a cake and the waitress put candles on it. While I was about to blow out the candles a little boy (about four or five) runs over and tries to blow them out. I awkwardly let him because I realise he’s just a kid. I was more annoyed at his mother who was just sitting there and watching the whole ordeal instead of intervening.\n\nAfter he blew them out, He looked like he wanted to eat the cake too. Which I was one hundred percent sure I would not let him do. It was my cake that I paid for that I wanted to share with my friends. I immediately put my army to block him but he doesn’t stop. Meanwhile, his mom does nothing. He keeps trying to eat the food. After a few minutes of this. I shove him away, and he hits his back on the wall. \n\nThat’s when he begins crying and screaming. The mom comes up to me and berates me for hurting her son. My friends try to defend me but the mom doesn’t listen and keeps yelling. At this point, I’m annoyed and just want to leave. So we pay the bill and we go to a park and eat the cake there. \n\nI don’t know if I’m the AH or not. My friends think that it wasn’t my fault but I do feel bad for shoving the boy that hard. So am I the AH?",
 "created_utc": 1701606025,
 "permalink": "/r/AITAH/comments/189sekr/aitah_for_shoving_a_kid_away_after_he_tried/",
 "score": 135,
 "url": "https://www.reddit.com/r/AITAH/comments/189sekr/aitah_for_shoving_a_kid_away_after_he_tried/",
 "comments": [
  {
   "comment_id": "kbt33dr",
   "message": "NTA\n\nIn the future, use your voice \"Hey! Whose kid is this? He is trying to grab our cake!\" Being loud is effective. You can also get quite loud with the kid. \"Hey! Go back to your mother! Does this kid have a parent around? Kid, do you need us to call someone? Are you okay?\" The last bit is a veiled threat to call the cops and should get her moving.",
   "created_utc": 1701607426,
   "score": 209,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt2z17",
   "message": "NTA. She was literally just sitting there and watching, how disrespectful. Shoving the kid in that situation, so long as you did not hurt him is fine, and actually positive if they learn some lessons from it.",
   "created_utc": 1701607344,
   "score": 85,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt3iah",
   "message": "Nta I assume you didn’t shove him on purpose for him to hit his head and you were trying to push him back. \n\nThe best bet next time is to yell at the mom and use your body to try and block him. Even trying to grab him and move him back to the mom could have ended badly. Better to try and shame the mom.",
   "created_utc": 1701607699,
   "score": 25,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt4jg1",
   "message": "NTA \n\nHere you are allowed to have your cake and eat it, too. \n\nMom is responsible for ensuring her child behaves. And the only party at fault",
   "created_utc": 1701608355,
   "score": 17,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt4ks8",
   "message": "NTA but mommy dearest needed to be shoved",
   "created_utc": 1701608379,
   "score": 12,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt5i1a",
   "message": "This mother was shamelessly using your birthday to get her kid the birtdqy experience on your- I guess meager because most 15 yr olds don't work- dime.\n\nNTA  but next time do it like this:\n\nShout: \"COME AND GET YOUR KID!!\"\n\nDon't be afraid to point with your whole arm at the parent either. This was all on her. \n\nCall out lousy/ oasdive/using parents like this no matter the situation.\n\nGood luck!",
   "created_utc": 1701608944,
   "score": 11,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt35ln",
   "message": "Nta. Id of grabbed a fist full of cake and woulda shoved it in the moms pie hole too",
   "created_utc": 1701607467,
   "score": 14,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt55hz",
   "message": "NTA. \nChildren behave how their parents allow. The mom is stupid neglectful. You should have shoved her dumb ass too.",
   "created_utc": 1701608734,
   "score": 8,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt5o7z",
   "message": "NTA- that mother and entitled crotch goblin are.\n\nI would have been mortified if it was one of my kids! You bet your bottom I would be ushering them out immediately for being so rude and disrespectful. \n\nGood on you for pushing him away. He didn’t back off when you used your arm to shield him away, so you used what force was necessary. \n\nStupid bitch of a mom. She has no business procreating if she refuses or cannot parent her child and instil boundaries.",
   "created_utc": 1701609050,
   "score": 7,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt64cm",
   "message": "NTA - There's nothing wrong with giving him a little shove.  Kid was being obnoxious and knew it wasn't his food.  His mother was the real ah in this one.  She's a lousy parent.",
   "created_utc": 1701609324,
   "score": 7,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt69tf",
   "message": "I would not have let him spit, I mean \"blow\" on the cake in the first place. NTA",
   "created_utc": 1701609413,
   "score": 7,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt3o2e",
   "message": "NTA.  Except you should've shoved him earlier.",
   "created_utc": 1701607803,
   "score": 12,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt2chl",
   "message": "NTA (unless u shoved him with the intent to hurt him) kids that do that are gross and they're set no boundaries by the parent",
   "created_utc": 1701606921,
   "score": 9,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt5td7",
   "message": "Also  get in touch with the restaurant. Explain the situation and ask for compensation since your birthdsy experience was ruined and it seems they couldn't keep the guests in order (,this is about her screaming at you. They should have intervened)",
   "created_utc": 1701609138,
   "score": 4,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt763i",
   "message": "NTA - blowing out the candles is the moment the mom or dad should have stood up and grabbed their kid.  Maybe you should have been more verbally assertive so you wouldn't HAVE to put your hands on someone else's kid but since you are a girl they left you little choice.",
   "created_utc": 1701609935,
   "score": 2,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt7bl0",
   "message": "So some rando lets her goblin spit on your food, and then gets annoyed when you push it away when it tries to eat your food? NTA.",
   "created_utc": 1701610021,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt4dvm",
   "message": "Sorry this ruined your birthday celebration.  Small child without boundaries could be autistic.  The child's parent is to blame by not controlling him.  And for berating you when you lost your patience.  That.said, the shove wasn't good either.  Work on your patience and have a better birthday next year.",
   "created_utc": 1701608258,
   "score": 249,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt2g8z",
   "message": "ESH you shouldn't have let him blow out the candles",
   "created_utc": 1701606991,
   "score": 247,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt4mja",
   "message": "ESH. \n\nA child that age should know better.\n\nTheir parent should know even better. There is no way I'd let my kid ever behave like that. She also should not have yelled at you. What a piece of shit mum.\n\nYou shouldn't have pushed a kid. I know they were in your space but ultimately, they were a little kid. You or your friends should have yelled at the mum to come and get her kid (or yelled to the waitstaff that you were being harassed and the parent won't get her kid, then they would deal with it). \n\nI hope you enjoyed your birthday apart from that!!",
   "created_utc": 1701608410,
   "score": 245,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt80j2",
   "message": "You shouldn’t have touched her kid. That’s crossing the line. You have a mouth and could have used it. “Hey mom, come get your kid he’s ruining my cake”.",
   "created_utc": 1701610416,
   "score": 0,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt1hkq",
   "message": "You should have done more to prevent this honestly. Why not have somebody go over to the mother and ask her to remove the kid? YTA for getting violent when there was no need.",
   "created_utc": 1701606323,
   "score": 230,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt1ked",
   "message": "ESH\n\nThat mom wasn't doing her job and it's completely unacceptable that her kid was bothering strangers and she was just watching.\n\nIt's also completely unacceptable to put your hands on other people's kids like that.  You should've told her to get hold of her spawn or talked to the restaurant's staff.",
   "created_utc": 1701606379,
   "score": 228,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt4i8v",
   "message": "YTA  You're old enough to know that you don't ever put your hands on a small child, especially someone else's child.",
   "created_utc": 1701608334,
   "score": 233,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt7iat",
   "message": "Yuck. Kid blew his germs all over your cake. Mom would have to buy me a new one.",
   "created_utc": 1701610128,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt7mqy",
   "message": "NTA.\n\nI would have stopped him from blowing the cake too. Kids spit. \n\nThe mother is a major AH for not controlling her child properly in a public setting. She wants a spoiled crazy brat? Fine. But don't subject others to it.",
   "created_utc": 1701610198,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt7oiq",
   "message": "NTA. Just get hold of the kid and say “whose kid is this whose parents can’t control it or pay for their meal?” Or “waiter, we have an abandoned child here, call CPS”. \n\nHonestly, you will find that many parents abdicate all responsibility when they go in a restaurant, to a party, or get on a plane. Always stop the kid mucking about or running around you and say whose kids are these and where are their abject failures as parents. You’ll never make friends with them but the shite will stop.\n\nWhat kind of f@ckwit lets their kid run up and blow out someone else’s candles and hang around for cake?\n\nKids do do things, parents drop the ball, but the decent ones will always apologise and proffer the social niceties.\n\nThe moral of the story is, don’t go where little kids are. Their parents are probably dicks.",
   "created_utc": 1701610225,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt7zj5",
   "message": "NTA. That is one mother failing parenting. She should stay home - she chose to have kids, doesn’t give her the right to inflict them on the rest of the public. \n\nI would have called the restaurant manager to deal with her",
   "created_utc": 1701610400,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt80ry",
   "message": "It was nice of you to let him blow out the candles in the first places I would have pushed him away back to his mum and said “put him on a godamn leash”\n\nNTA",
   "created_utc": 1701610420,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt83xw",
   "message": "NTA\n\nThe mom is though, for not controlling her child.",
   "created_utc": 1701610469,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt84jj",
   "message": "NTA. Two minutes of him grabbing for the cake?  I would have yelled \"waitress\" or \"help\".    The staff could have controlled the kid and berated the mom.",
   "created_utc": 1701610478,
   "score": 1,
   "submission_id": "189sekr"
  },
  {
   "comment_id": "kbt85av",
   "message": "No. Coz r/kidsarefuckingstupid",
   "created_utc": 1701610489,
   "score": 1,
   "submission_id": "189sekr"
  }
 ]
}