{
 "submission_id": "189sguv",
 "title": "AITAH for telling my MIL about our nonexistent sex life?",
 "selftext": "-Update in the comments-\n\nWe got married after a one year long distance relationship and during that period we’ve made out here and there but waited till marriage for sex (29F and 32M)\n\nIt’s been 7 months since I’ve been married now but my husband has never shown any interest in intimacy, not even kissing. In the beginning months it was always some excuse and now I don’t even expect intimacy from him and I’m not sure if he’s closeted or Asexual and he never acknowledge this issue between us.\n\nMy MIL is very old school and this was the third time she called me hinting for a child as she mentioned she needs a grandchild by next year. I usually just ignore this but this time, I just got super frustrated and mentioned that In order for that to happen we should be intimate first and she was mind blown by this and kept repeatedly asking if nothing had happen yet and I said nothing and by looking at her paranoid reaction I quickly said he could be just stressed at work and it’s not a big deal, I’m saying this to you so that you wouldn’t taunt me about a child yet. \n\nImmediately after this call she had called her son wailing if nothing had happened and if something is wrong with him, he convinced her that we are okay and then he comes to me and says that if I’m looking to kill his parents (meaning she might get a stroke by this shocking news) and if I have an issue to address it to him. I’ve tried to talk to him about it but he’s not willing to and he doesn’t believe in couple counseling/therapy so that’s a ‘no’ as well.\n\nAITA for taking it to his mom?\n\nUpdate- I’m very aware that there is a bigger issue in my marriage than this MIL issue. Even though we come from a conservative culture, people are very progressive these days including us but after marriage he is coming up with all kinda regressed opinion which is just a front for his underlying issues. I’ve been gaslighted and I know this term is used for everything these days but whenever I tried to have a discussion about our intimacy issue, he spin it like it’s always a mistake for expecting this. The last time I asked him about this, his response was that it’s just been 7 months and why all this pressure for intimacy, if it’s meant to happen it’ll happen in time and when I told him that’s not normal, he tells me that I’m trying to just compare my life with people. He’s asking me who set this rules that married people have to have sex right away, we can take our time and do it unlike every people in the world. When I asked him why there’s not even kissing as he did that before marriage, he says I’m talking like a sex addict and all I care about in this marriage is sex and not the care he gives. I legit was convinced maybe I’m expecting a lot and it was me who was insane as he was making it out to be but I needed this wake-up call, thank you guys. I’ll talk to my lawyer about the annulment procedure. ",
 "created_utc": 1701606260,
 "permalink": "/r/AITAH/comments/189sguv/aitah_for_telling_my_mil_about_our_nonexistent/",
 "score": 67,
 "url": "https://www.reddit.com/r/AITAH/comments/189sguv/aitah_for_telling_my_mil_about_our_nonexistent/",
 "comments": []
}