{
 "submission_id": "189tdxv",
 "title": "For telling my wife I don't want to live in her hometown",
 "selftext": "I (28M) am newly married in past 6 months to my wife (27F) and have been living near a major city for about 1 year now.\n\nI like bigger cities and she likes quite small towns. We've always known that and have made accomodations to each other on this. Recently out of seemingly nowhere she has decided she's buying land in her hometown that is about 2.5 hours away. She has not done much research but knows the area and knows the plot of land is good. so she's all in on buying it (90k for land) and building a home (over time) there as an \"investment\" for her. It's also part of her dream to own land.\n\nObviously, the issue is that I don't want to live in that hometown and I hate staying there when we visit. I can only handle short stays and she knows that. She asked if I wanted to help pay for the land and I said bluntly that it's her investment and her choice, I don't want live there or visit there all the time. \n\nShe was initially frustrated with that, saying all her family and friends from hometown are excited. She's saying I am the problem for not supporting her. I told her I think she is moving too rapidly and has not done research on how much everything will cost. I told her I will support her decision if it's what she wants but it's not something I want.\n\nShould I have supported her regardless of my preference? She has told me this is causing problems in our marriage and she wants my full support.",
 "created_utc": 1701609705,
 "permalink": "/r/AITAH/comments/189tdxv/for_telling_my_wife_i_dont_want_to_live_in_her/",
 "score": 222,
 "url": "https://www.reddit.com/r/AITAH/comments/189tdxv/for_telling_my_wife_i_dont_want_to_live_in_her/",
 "comments": [
  {
   "comment_id": "kbtznop",
   "message": "\u0026gt;She's saying I am the problem for not supporting her.\n\nso for right now, you're the problem for not supporting her in this purchase. once the house is built, you will be the problem for not supporting her wish to move back to her home town. she's trying to trap you and has probably been planning to get you to agree to moving back with her from day one of your relationship.\n\nif y'all had been married for 10 years living by the big city i could understand that she's homesick and maybe wanting to have a base in her home town. but it's only been a year. she's known that she is going to do this from the get-go and either she hasn't communicated this to you, or she purposely has been keeping this from you thinking that she'll \"get you to come around eventually.\"\n\n\u0026amp;#x200B;\n\nNTA",
   "created_utc": 1701622669,
   "score": 9,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbt9rsp",
   "message": "Ummm, this is a pretty big fucking issue and probably isn't entirely about land. I'm no marriage expert, but there's never been a big decision in my marriage that *she* or *he* decided on their own. There's no way someone can unilaterally buy land and build a home in a normal healthy relationship. Either were missing context or this is nuts.",
   "created_utc": 1701611381,
   "score": 93,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtev7p",
   "message": "I mean, she should maybe have talked to you about this before making a decision and breaking the news to friends and family, and BEFORE marrying you 6 months ago. From the outside it sounds like she might be expecting both of you to move in there in a few years when the house is finished, which is not a compromise between your two preferences at all.. To also expect you to chip in for this financially without even discussing it properly with you is odd, especially when she knows you prefer cities",
   "created_utc": 1701614000,
   "score": 71,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtupkc",
   "message": "She is fully buying and building a house to move there evebtually. No one would do that as an investment in a small town.",
   "created_utc": 1701620747,
   "score": 54,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtdghr",
   "message": "Dude if she gets a house built there, she’s gonna move to it.  You’re just along for the ride",
   "created_utc": 1701613308,
   "score": 55,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtru7i",
   "message": "You’re absolutely NTA, but she is for not discussing this with you, especially given you made it clear from the beginning that you aren’t interested in living in her hometown.  If she had just talked to you before making this decision, or at least not tried to manipulate you into being ok with it when you’ve been clear even before marriage that you won’t be, I would say N A H.  \n\nThe two of you need to have a frank discussion about your future and you need to do it today.  A quiet, respectful discussion about where each of you see your lives in 5 years, 10 years.  It sounds like your wife has changed her mind about what she wants for her future, and is hoping that since you are now married, she can force you to go along for the ride.  You need to be clear about your wants and needs, and if they don’t match up…well, that’s for you to decide. \n\nI adore my spouse, but love isn’t enough in a marriage; the biggest reason we married instead of just cohabitated was because we both had similar ideas for the future, similar goals and dreams, and we knew we could build a good life together (and we have).  If you both aren’t working towards similar or compatible goals (financial, residence, children, career, education, travel, etc.), your lives will be nothing but combat and resentment.  \n\nSit down with her.  Have this hard conversation before it spirals.",
   "created_utc": 1701619609,
   "score": 48,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbt8gwh",
   "message": "Assuming it's her money, she's free to do it. However, if your \"full support\" involves agreeing to live there, you shouldn't give it.",
   "created_utc": 1701610666,
   "score": 73,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtkewh",
   "message": "You’ve been married less than a year and she is already pulling a bait and switch. Cut your losses now, there is no compromise on this one. She is going to build and “hope” you change your mind.",
   "created_utc": 1701616534,
   "score": 60,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtx8ke",
   "message": "NTA Make sure you're using birth control. I'd go along like you are, you fully support her making her own investment decisions but  you are completely disinterested in moving there. Not only that, you're not interested in using this home as a vacation home. I'd send that to her by email so you have it in writing prior to her purchase of the land. Not like you're wanting it to stand up in court, it just makes it harder for her later to  say that you were wishy washy or that she didn't know how you felt.",
   "created_utc": 1701621729,
   "score": 15,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtvz6g",
   "message": "Not wrong. It sounds like her meaning of full support is to help finance buying a plot of land that you don't like the area of, then to help finance building a house in a place you don't want to live, then eventually moving to this place. Tell her that if she wants your full support then it will have to be an area and place that you both agree on living. Have you asked her how long she's been thinking about doing this? Wouldn't be surprised to hear it was planned before the wedding six months ago.",
   "created_utc": 1701621244,
   "score": 16,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtfhbn",
   "message": "Yeah, no...\n\nYou need to sit down and clear up where she sees this going, if she sees this as being the family home in the future and a deal breaker for her.\n\nFull support sounds like you pay for it and move there and fake a smile.\n\n\u0026amp;#x200B;\n\nGood fucking luck     NTA",
   "created_utc": 1701614297,
   "score": 24,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtr1of",
   "message": "NTA. It sounds like you both wanted fairly different things going into the marriage, but the fact that she never actually discussed wanting to move back to her hometown with you explicitly, and then springing it on you after getting married is not okay.  That's a bit of a bait and switch. You can't just yank people around like that and be upset when they aren't on board.",
   "created_utc": 1701619291,
   "score": 9,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtwxx0",
   "message": "nta, just leave her now, it’s heading south",
   "created_utc": 1701621617,
   "score": 9,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtplrk",
   "message": "You understand with this purchase and this building a house that she fully intends to move there right? You’ve not mentioned  anywhere that she’s doing this for an investment purpose to rent it. She’s hopeful by that you’ll change your mind and want to go there. Especially if you invest in it. \n\nI think you need to have a serious conversation with your wife about her future expectations of your married life sooner than later. I don’t think you’re on the same sheet of music. NTA.",
   "created_utc": 1701618715,
   "score": 16,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtci6w",
   "message": "Not agreeing on where to live is one of those deal breaker issues. NAH. The wife is right about this causing martial issues, someone is always going to be unhappy with the living arrangements in this situation.",
   "created_utc": 1701612830,
   "score": 16,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuk3si",
   "message": "By the end of this it's going to be a million+ dollar investment (especially if you have to have the city run water, sewer and electrical out to the property) How much y'all make that this wasn't discussed first.",
   "created_utc": 1701630002,
   "score": 8,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv6wig",
   "message": "NTA? Is this what new couples do these days? Drop $90K on property 2.5hrs away with a plan to drop hundreds of thousands more on an investment? I had no idea that new construction was so affordable. Sounds like this is going to be her hobby and life for years to come. Site plans, architects, pouring the foundation, framing, designing the bathroom and kitchen, picking out all the fixtures and appliances, paint colors, siding and roofing choices, porch design, being on top of the permits, sewer/septic, water, gas, electric connections. Sure the general contractor will handle most of it, but the top of conversation will be when all the materials arrives, the availability of the plumber, electrician, the chimney guy, the hvac guy, and on and on and on.\n\nSounds like you need a counter-investment somewhere...",
   "created_utc": 1701638213,
   "score": 7,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtd54l",
   "message": "NTA but did she ever mention this desire to move back to her hometown before you were married then she pulled the old bait and switch on you, but if she did mention it then you would have to have known this day was going to come.",
   "created_utc": 1701613153,
   "score": 13,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbts9vg",
   "message": "This is a decision that should be 2 yes and if there is 1 no then it doesn't happen. That's how grownups in long lasting relationships handle things.",
   "created_utc": 1701619779,
   "score": 6,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbttwxe",
   "message": "She can do what she wants if she is using her money to do it, BUT you have made it very clear you will not be living there.\n\nThe ball's in her court.  If she decides to build a house and move there, divorce her and hold the door for her as she leaves.",
   "created_utc": 1701620432,
   "score": 6,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuevkl",
   "message": "INFO: when you guys discussed your future you both agreed to live in the major city you’re in right? She didn’t mention anything about wanting to move somewhere else eventually?",
   "created_utc": 1701628166,
   "score": 6,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbt9v6s",
   "message": "Nta it sounds like by \"full support\" she wants you to help pay for it and agreeto move there. You don't want it, you aren't obligated to pay for it. But it sounds like this could be a long term challenge for your marriage and you two need to have some serious discussions.",
   "created_utc": 1701611431,
   "score": 20,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtx5qn",
   "message": "You’re not on the same page. Or even the same zip code. NTA but did you get married and then plan to get lay chicken on major life decisions? Wtf",
   "created_utc": 1701621698,
   "score": 5,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbu8g1z",
   "message": "NTA. Marriage is a partnership. For her to make these major unilateral decisions that effect your life with total disregard for any of your thoughts, wishes, opinions, etc. \nIt's just shocking...\nWhat's even the point of getting married if you're not willing to share your life with someone? Does she even respect you?",
   "created_utc": 1701625900,
   "score": 4,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbua0vl",
   "message": "If \"support\" she means pay for it then you 2 need to have a deep and serious discussion right now. Definitely NTA. This sounds like she's slow rolling you into a move back to her hometown.",
   "created_utc": 1701626463,
   "score": 4,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuedu5",
   "message": "It's her investment and her choice?\n\nBut what does her choice say about your marriage? How can she go ahead with this, knowing you won't live there?\n\nIf she insists on this, doesn't that mean you're not actually compatible? And isn't it better to break it off now before your lives become further entwined?\n\nI'm sorry, I know Reddit is famous for telling people to break up, but in this case how the hell can this be navigated? \n\nNTA, but I think you're misguided if you think this investment doesn't mean the eventual end of your marriage.",
   "created_utc": 1701627997,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbt8kpn",
   "message": "NTAH - Tell her you plan to buy land and move to your home town and see what happens.\n\nThere's a certain type of person who expects their partner to drop everything in order that they can move *\"back home\"*, it seems that you have found one.\n\nIt's ultimatum time - ask her what exactly she plans and tell her she'll need to find herself a new husband if she tries to make you move anywhere that you don't want to go.\n\nBoundaries are important and other women are available.",
   "created_utc": 1701610723,
   "score": 13,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtv6tr",
   "message": "Seems like you have differing definitions of \"full support\", and y'all should talk about that.\n\nIf you have told her that she can choose what she wants to do with her own money, what more does she want?  If she wants money from you as a gesture of your \"full support\", welp, you have made it clear that you have no interest in that, and your reasons for being uninterested are valid.  This may be a good investment for her, but it's not a good investment for you.\n\nAnd to be really blunt, if this issue is enough for her to question your marriage, then the last thing you want to be doing is entangling your finances with hers like this, because you may very well end up having to untangle them later.",
   "created_utc": 1701620935,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbu8cf9",
   "message": "NTA, but it doesn’t really matter because your marriage on the way to over.  Talk to her about going to counseling, find someone you both can work with, and see if your marriage can be saved.  If not, don’t drag it on.  It sounds like all of her family and friends are pushing for her return.  I wonder if they would want her to return at the cost of her marriage.",
   "created_utc": 1701625864,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbugw6g",
   "message": "NTA.  It sounds like she wants to incorporate you into her world, rather than build an independent life with you.  You don't have to support everything a spouse wants, especially if it doesn't work for the relationship.  Seems like these plans only work for her.",
   "created_utc": 1701628857,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbulcjc",
   "message": "What accommodations have you each made?",
   "created_utc": 1701630447,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbulv2g",
   "message": "You should have probably speak about this kind of things prior marriage....dreams, how you see the future, kids, religion, traditions, financial planning....these are things you both should have brought up in the table prior to the marriage.\n\nYou need to sit down and actually bring everything in the table and speak like 2 adults to see what else you have different views of.",
   "created_utc": 1701630629,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbum3yl",
   "message": "She should have discussed this with prior to anyone else.  Have you told her that under no circumstances do you even want to live there?  Large purchases like this will directly affect you and the family finances.",
   "created_utc": 1701630716,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbumixl",
   "message": "I think she should have made herself clear before getting married.  She didn't get this idea out of nowhere",
   "created_utc": 1701630863,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbut7wd",
   "message": "Funny how after marriage she’s making an investment for “her”",
   "created_utc": 1701633275,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuv7vi",
   "message": "NTA\n\nSo, she wants to drop hundreds of thousands on land and building a home knowing you have no desire to live there? \n\nAnd of course, you're now the bad guy for calling bullshit. Your new wife is out of her mind. \n\nTell her if she goes through with it, not a penny of your money will be used for any part of it. While any money she contributes to your current home MUST be maintained. \n\nAlso, her going ahead will probably be the end of your new marriage. \n\nGreat start to a marriage.",
   "created_utc": 1701634011,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv565v",
   "message": "NTA. She 100% wants to move back home and this is dropping an anchor. I suggest you both seriously talk this through. \n\nAlso, what are both of your thoughts on kids? My thought is that she wants to move back home and raise kids with her friends and family. True small town living.\n\nI had a serious gf that lied about the kid issue our entire relationship. I was clear on date 1 that I didn't want kids.. come to find out her dream was to be a stay at home mom.",
   "created_utc": 1701637586,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvc8vf",
   "message": "This is not about the land.  THIS IS NOT ABOUT THE LAND.  Please, PLEASE, sit down with your wife and talk about it.  Tell her you understand she likes the small town, and you know she knows you don't.  Tell her that as much as you love her, this is scaring you because you don't know how to solve this very, very big divide.  Ask her what she is thinking about this as a future plan.  Is she thinking this is an investment?  Is this a \"second/vacation home\"?  Is this a step in moving as a couple to her home town?  Where does she see YOU in all this?  Why did she think you'd support her in buying land somewhere you hate?  Why did she tell her family  and get them excited before you and her talked about it and had a plan to work with this together?  Why did you marry her if you hate her home and things she loves?  If you support her in making an investment in her small town, is she going to support you in investing in the big city?  Where does she want to raise kids (if you are planning on having them--and please for the love of god don't have kids till this is all sorted out)?  Why is her family excited if you aren't going to be moving there?  \n\nHonestly, did you guys not talk about how you would deal with this huge divide?",
   "created_utc": 1701640168,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvi8cw",
   "message": "NTA. For sure you should have discussed this even more in detail before the wedding.\nWould it be possible to use it as a vacation home or a place to stay when you visit and then Airbnb it when you are not?",
   "created_utc": 1701642375,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbt7gjd",
   "message": "Info: is this investment a marital asset?",
   "created_utc": 1701610100,
   "score": 5,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuhp0q",
   "message": "NTA.  \nHowever, both of you have a lot to talk about and you need to contact an attorney before you get screwed over.",
   "created_utc": 1701629141,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuqm5v",
   "message": "Why did you get married if you want different lives? NTA for not wanting to do the thing she knew you didn't want, but YTA for not figuring this out before getting married.",
   "created_utc": 1701632323,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuskw3",
   "message": "Just because she wants your full support doesn't mean she has a right to expect it. You've told her you don't like the area and don't want to live there - yet she still thinks you should be excited about it when she knows it's not what you want? She's not listening my friend.",
   "created_utc": 1701633038,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbustw0",
   "message": "NTA\n\nI would rather live under a bridge than move back to the small town I grew up in. If this is her plan keep your finances separate, this marriage isn't going to last long.",
   "created_utc": 1701633130,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbutpc7",
   "message": "Kids finances and location are 3 major things you need to be on the same page on in a marriage. If you cannot stand the country and she cannot stand the city that is a major issue. One of you will be unhappy. Or you can do the in between and move to the suburbs and both be unhappy.",
   "created_utc": 1701633454,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuuzvd",
   "message": "She doesn't care about what you think. She wants to buy it and she wants your help to buy it. She's going to move there nevertheless and what you say doesn't matter to her. \n\nNTA and I don't see this working out in the least.",
   "created_utc": 1701633931,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuwbht",
   "message": "NTA and I don’t see this marriage going the distance.  She has one agenda and you have another, this should have been sorted out before getting married.",
   "created_utc": 1701634411,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv0esw",
   "message": "NTA and very selfish of her that she would make a decision like that without mutual agreement. That's not how successful marriages work.",
   "created_utc": 1701635876,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv39bc",
   "message": "Might want to look into a lawyer as I’m predicting this marriage isn’t going to last very long",
   "created_utc": 1701636884,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv3kcz",
   "message": "NTA. WTF do people talk about in relationships before marriage since, according to Reddit, no one talks about where they want to live, if they want kids, money.",
   "created_utc": 1701636997,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv4gfc",
   "message": "NTA\n\nWe made a rule that anything over $500 has to be a joint decision. The fact that she is unilaterally deciding this and trying to strong arm you is absolutely a problem.",
   "created_utc": 1701637322,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv84p8",
   "message": "If it solely her money that one thing but to use your funds and coerce you into moving would be wrong. NTA. Too bad you married a manipulative woman. Don’t have kids soon.",
   "created_utc": 1701638659,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv8ak2",
   "message": "She made that massive important purchase and you guys are married? Did not discuss this future move before? Very odd\n\nIf I 100% did not want to move there and she bought land, I would just wonder when we will go through with a divorce.",
   "created_utc": 1701638718,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvfs82",
   "message": "The deeper issue here is that she's planning a future to live in her home town and is assuming you'll eventually agree to that. This is a huge incompatibility. I think it's best to ask her how she truly envisions her future and that plot of land. And sadly, you may want to bring up divorce before this issue becomes a resentment. NTA",
   "created_utc": 1701641459,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvhf96",
   "message": "This is a trap buy.  You can't win.  Either way you lose.  I would say this is the beginning of an end.  She clearly needs to be in her hometown, and you hate it there.  No middle.",
   "created_utc": 1701642076,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvhr9w",
   "message": "Sounds like you don’t work this out before marriage and the problem just got bigger.  You have decisions to make OP but NTA",
   "created_utc": 1701642200,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvkdjf",
   "message": "NTA you have voiced your thoughts to her. She has picked the fuck around and find out route, show her.",
   "created_utc": 1701643188,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvlryo",
   "message": "NTA, you can support someone without putting  out tens of thousands of money. It’s a major ask. It’s her investment not yours. She wants it she can pay for it.",
   "created_utc": 1701643728,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvlz6t",
   "message": "NTA. But I really feel for you. It's a conversation my partner and I are gonna have down the line. I've lived in the city nearly my whole life, but my partner is from and loves the country. I wish I had some advice, but just wanted to say you're not alone in this.  Wish you guys all the best.",
   "created_utc": 1701643806,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvm194",
   "message": "Sounds like she made a unilateral decision for both of you. 🚩",
   "created_utc": 1701643829,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvs9y2",
   "message": "This is a huge incompatibility issues. You two should have AGREED on where to live before getting married. if you two did, and she changed the plan, I sense a split coming up.",
   "created_utc": 1701646284,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw030y",
   "message": "NTA...but this may be the hill your marriage dies on.",
   "created_utc": 1701649373,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw0usf",
   "message": "I wonder if she’s considered the cost of septic tank, well drilling, propane, and electricity?   Also trying to get all of this done while living more than 2 hours away.  Maybe with the help of family it could be done??  \n\nNTA.  This is a huge decision on her part in which - it sounds like - you were not included.",
   "created_utc": 1701649682,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw3zlz",
   "message": "The parents are excited because this is a prelude to moving back to the area.  Have a very frank talk with your wife, that you will never agree to move back there and ask her about what her plans are.  Better to know now that this will be an issue.  Make it very clear it is never ever and you need to know.   Otherwise this will be a deal where you have kids and she needs help from her folks and she is moving there with or without you.  Make sure of the plan.  NTA.",
   "created_utc": 1701650968,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw9kfy",
   "message": "I suspect where to live isn’t the only thing y’all fundamentally disagree on.  Did you two discuss where you’d live/spend your lives before marriage?",
   "created_utc": 1701653367,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuj7mc",
   "message": "Why would you bet someone half your stuff that you'll love them forever...and not make sure that your lifestyle visions are in alignment? Not sure if there's any assholes here, just morons.",
   "created_utc": 1701629682,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kburt1c",
   "message": "NTA. Not only are you not the asshole, but you are not the problem- she is. \n\nI’ve read your post twice, and I’ve also read the comments you left when people had questions or wanted more information. Here’s what really stands out to me: 1) her family and her friends from back home are excited; 2) she suddenly sprang this on you, seemingly out of nowhere; 3) she hasn’t taken the time to fully research the details- such as the costs- for building a house on this investment land; 4) she knows full well, because the two of you have discussed it in the past, that you are not ambivalent about living in her hometown, you dislike it so much that you don’t even like *visiting* there; 5) this future house will be used as an investment, but will also be empty for whenever you both decide to stay/live there for a while.\n\nAdding up that information makes me call BS on the story she’s told you. \n\nI’m going to be blunt. I think that she has been planning this for a very long time, since before you got married, even. And by “this,” I mean to buy a plot of land in her hometown, build a house on it, for the two of you to go and stay there for long periods of time while the house is being built, furnished, decorated, landscaped, etc. It is her hope that as you spend time there, and become invested in the house by what we refer to as “sweat equity,” and grow to feel attached to the house and proud of how it is turning out, that you will eventually “come around,” learn to love her hometown, and will end up living there.\n\nI’m a woman, and I hate this, but… even in this day and age, there are some women who still cling to that old fairy tale that a ring and a piece of paper will miraculously change a man. That he will become more agreeable, and will blindly follow along with whatever his wife might want, even if that goes against his express wishes and desires. ‘Happy wife, happy life,’ and all that. I’m afraid that this is what is happening to you, my friend. This is not sudden, it’s been planned. She has had time, she has done her research- she simply hasn’t told you her full plan because it would be too much and you would immediately balk. This is like the ol’ ‘frog in a pot of water that keeps getting hotter, but he doesn’t notice he’s about to be boiled alive until it’s too late to hop out.’ She will keep revealing small details which don’t sound *too* bad, so you go along- until you wake up one morning, living in a house in her hometown. Her family and friends are well aware of her plan, and that’s why they’re so excited. She’s using that information to turn this around and make it *your* fault, *you’re* the problem. And I’m right back to where I started with my comment. *She* is the problem.\n\nLots of other comments are saying that this is a dealbreaker, something that can not be compromised on. You asked for advice; unfortunately I can’t give any, I can only give you my opinion on what’s going on here, and you can think about it, agree or disagree, and decide from there.\n\nI wish you good luck and happiness, no matter what.",
   "created_utc": 1701632755,
   "score": 3,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvb7ln",
   "message": "Why is it ok for her to make sacrifices to accommodate you but not ok for you to make sacrifices to accommodate her?\n\n*We've always known that and have made accomodations to each other on this.*\n\nwhat have you done specifically (other than a 2 day visit) to accommodate her? if that's your only compromise, then no wonder she's looking out for her interests since you don't seem like you will. Also, this issue isn't out of nowhere but it would make sense that you use the word 'seemingly' lol",
   "created_utc": 1701639784,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtbzrs",
   "message": "Let me know when the two of you divorce, your wife sounds like a keeper. \n\nOtherwise, NTA. you are allowed to be a city boy and hate nature and clean air. Nobody gets to dictate an individual's preferences.",
   "created_utc": 1701612562,
   "score": 2,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvqkdb",
   "message": "NTA. Are you going to operate your finances and investments separately or jointly. \n\nIf separately:\nShe should do what she wants as long as her income can float her half of joint expenses. However, if her investment decisions do not play out and she doesn’t have retirement assets would you make her keep working even if you retired? Probably not, so then you’re essentially running a joint investment strategy. See below for more. \n\n\nIf jointly:\nShe should consult you before implementing a huge shift in your investment strategy. \n\nLastly, if this a residential home it’s no longer a true investment. Investments are for a rate of return. Buying land that she hasn’t modeled out for growth is a personal use asset. It’s no different than buying a Rolex (which can be argued to be a better investment; it depends on this plots location). \n\nEither way, NTA. She did not discuss with you. \n\nAlso she’s trying to neg on your prior agreement. I suggest you model your investments separately.",
   "created_utc": 1701645615,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvdlgk",
   "message": "You’re not compatible, she’s probably sick of sacrificing and living in the city for you, and you clearly don’t want to live where she does.. nobody necessarily has to be TA in this situation, just unfortunately, you have different feelings about something pretty huge and no longer seem to be able to find common ground.",
   "created_utc": 1701640657,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbu8vrc",
   "message": "Why did this topic not get more throughly discussed before marriage?  \n\nLike, hash this stuff now before you have kids and actually before she buys the land because does she realize that even if she buys it in some places the fact your married you could end up with owning half?  \n\nESH",
   "created_utc": 1701626056,
   "score": 255,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbtu1dw",
   "message": "I think buying the land is probably a good idea from an investment standpoint (how often is land ownership not a good thing?). I don’t understand the separation of money (“She asked if I wanted to help pay for the land”). Since you’re married wouldn’t it become a joint venture by default? Does she want you guys to move there or just buy the land and build on it for use when you visit? If it’s just to have a place then it’s probably a good idea from a financial standpoint. I might want to be in on that investment if I were you. If she wants you guys to move there then that’s a relationship issue that probably should have been addressed before marriage. \n\nI’ve been married 24 years now and have been with my wife for 30. At some point you guys will probably be comfortable traveling separately, as in she can go visit her family without you so I wouldn’t let that concern stop you from a potentially good investment.",
   "created_utc": 1701620482,
   "score": 255,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuyezx",
   "message": "What accommodations have you made toward her preference of small town living when you live adjacent to a large city and you refuse to spend the night in her hometown?  To me, having a vacation home in a small town would be the compromise but you refuse to entertain that.  My parents were similar so we lived in the suburbs of a large city but we had a lake cottage so my dad could get his nature fix om summer weekends.  I don't see any compromise towards her interests.",
   "created_utc": 1701635170,
   "score": 0,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvkq83",
   "message": "She makes a life altering decision then announces it to her husband, sneaky and then the name calling. How magically vulgar this one is. Always interesting to watch the blame game start when people like her don’t get what they want.",
   "created_utc": 1701643323,
   "score": 0,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbugwqe",
   "message": "Divorce now, safe yourself from making the problem worse",
   "created_utc": 1701628862,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuh2vu",
   "message": "NTA, she is 100% planning on moving back there. With or without you. You should think about that.",
   "created_utc": 1701628922,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbup6pr",
   "message": "For me after 14 years it is an exile living somewhere I would have never choosen. Only the hope keeps me alive we will go back to the continent.\nIt's not fair and it's a very big issue. Sometimes there is no compromise, just sacrifice. I wouldn't do.",
   "created_utc": 1701631809,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuqks6",
   "message": "NTA. As soon as you have kids, it is going to be, I already have a house.",
   "created_utc": 1701632308,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbus3q5",
   "message": "This should have been decided before you got married, but if she wants to go thru with it she should be the one to pay for it. NTA",
   "created_utc": 1701632864,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbutyk9",
   "message": "Sadly young people should take about this sort of thing before tying the knot.  NTA",
   "created_utc": 1701633551,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuw6rc",
   "message": "NTA, but why wasn't this discussed before marriage? It's a pretty big deal.",
   "created_utc": 1701634364,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuxlg9",
   "message": "NTA. That is a decision the two of you should discuss together and come to an agreement over and she should not be making plans before doing that. Granted, if it's her money, it's hers to do with what she wants. One compromise I could see would be making it a vacation home, but your primary home should be decided on first.\n\nSounds like the two of you have a lot of things to talk over, because this will not be the only obstacle you stumble over.",
   "created_utc": 1701634876,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbuzczs",
   "message": "You guys don't sound like you're a good fit.  You didn't seem to talk about anything before getting married.  Those purchases should be done as a couple or not at all.  Both of ya'll are just dumb lol.",
   "created_utc": 1701635510,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv0alu",
   "message": "NTA.\n\nShe can make her choice(s) (if she isn't somehow being pushed by her side of the marriage to 'invest' in a way that'll make THEM rich), and accept that her choices can either strengthen or weaken the bond you both pled faithfulness to.",
   "created_utc": 1701635834,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv21je",
   "message": "NTA This is a big decision and probably step one in getting her way that you’ll move to her hometown at some point. My BIL’s wife is EXACTLY like this. Literally applied for a job in a different state (near her family, whom he didn’t like that much), accepted it, then told him about it and how it was too good to pass up blah blah. She’s been pulling this shit for decades. She wants something, she railroads him into it, convincing him it’s a  great idea or too late to back out or whatever. \n\nWelcome to the rest of your marriage.",
   "created_utc": 1701636451,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv3mmo",
   "message": "INFO: Is she planning to move there full-time? Or is the idea for her to have a place to go on weekends, or use as an air b\u0026amp;b?",
   "created_utc": 1701637020,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbv3yxh",
   "message": "Please update us. NTA",
   "created_utc": 1701637144,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvb054",
   "message": "It’s a setup for when she wants to move back there to be closer to family when you start having children. If that’s not what you want, make sure your ducks are in a row in regards to having a home and support structure in place so your children are NOT raised someplace you hate. This may be a divorce level issue.",
   "created_utc": 1701639709,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvhi7x",
   "message": "NTA. She is making a decision that should be done together, not on her own.",
   "created_utc": 1701642106,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvho74",
   "message": "Whatever you do, DO NOT IMPREGNATE HER!!! You will be locked into a life you'll hate and be resentful over.",
   "created_utc": 1701642168,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvk972",
   "message": "NTA. You’ve been clear. Continue to be clear. You will not be living there. You will not contribute to this and your household must not suffer for it either. \n\nThis will end your marriage eventually when she demands you give in.",
   "created_utc": 1701643142,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvlq7g",
   "message": "Work it out amongst yourselves. Christ.",
   "created_utc": 1701643709,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvm6b9",
   "message": "I mean technically NTA, but it does not sound like you actually make accommodations for her. She lives near a big city for you but you can only handle short visits out there? No wonder she is wanting land out there. She may not have this strong of a desire if you would suck it up more.",
   "created_utc": 1701643884,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvojve",
   "message": "You need to go to marriage counseling now, especially before you have children. She appears to be manipulative. She comes across that she will get what she wants no matter what but will not only never apologize but will blame you for not getting on board. Her actions are very troubling.",
   "created_utc": 1701644828,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvqows",
   "message": "shes moving back to her small town with or without you. you need to consider the possibility that this marriage is on notice.",
   "created_utc": 1701645662,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvqw01",
   "message": "This is not an after marriage decision. Y’all are out of order.",
   "created_utc": 1701645739,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvrrs8",
   "message": "Your marriage is in deep trouble. She is making major decisions without consulting you. If you go along with this then you will resent her.",
   "created_utc": 1701646080,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvshez",
   "message": "Why did you both not discussing location and residence prior to getting married?\nI feel like you've left this part out on purpose in which both of you are to blame here because you refuse to live anywhere except for a large city and she for not saying that she will be eventually heading back to her hometown at some point.\n\nStill co fused why you both got married to each other.",
   "created_utc": 1701646362,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvtszc",
   "message": "NTA. It seems you don't want to accommodate each other but that is a part of marriage so I think you rushed into that even if you've been together for years.  She's trying to change you and drag you back home and you're trying to change her and keep her in the city.\n\nAs others have said, don't get pregnant and have a long, hard discussion about what you want going forward.",
   "created_utc": 1701646876,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvukpt",
   "message": "\u0026gt;Should I have supported her regardless of my preference? She has told me this is causing problems in our marriage and she wants my full support.\n\nI told my wife pretty much the same thing. There's nothing in her home town for me.\n\n\u0026amp;#x200B;\n\n\u0026gt;I (28M) am newly married in past 6 months to my wife (27F) and have been living near a major city for about 1 year now.\n\nYou should have really gone over this before you married.  You might want to re-consider being married to her if she's planning in bailing on you.\n\nMarriage doesn't mean she can tell you what to do. It means you figure out what the two of you want together. If you can't work things out,  I don't see the marriage lasting.\n\nWe never moved back to wife's home town.\n\nEdit: NTA.",
   "created_utc": 1701647184,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvvmhm",
   "message": "NTA, she’s kinda the AH",
   "created_utc": 1701647595,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvvqwm",
   "message": "A unilateral decision on a 90k investment is not a good sign of a partnership....",
   "created_utc": 1701647645,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvvsjs",
   "message": "NTA.\n\nShe waited until you were married to mention it, because you'd be more likely to go along.\n\nReally, something like that should have been mentioned BEFORE getting married. Enjoying small towns or not is a pretty big deal if you're going to live with someone and it can only work if you both agree.\n\nGood luck OP but I can't see how your relationship is going to work long term.",
   "created_utc": 1701647664,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvwhl0",
   "message": "So you’re the problem for not supporting her but she isn’t supporting you when she knows you have no desire to live in a small town. It goes both was.  Besides, as you have been married 6 months, she was planning this.",
   "created_utc": 1701647932,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvwury",
   "message": "NTA.\n\nBut you'd best prepare yourself for the fact that either this is the beginning of the end of your marriage or the beginning of this marriage being done exclusively on her terms.\n\nEither way, you had the rug pulled out from under you. It happens this way sometimes, and it's a shame.",
   "created_utc": 1701648081,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvxntm",
   "message": "She unilaterally made a life changing decision for both of you and wants your financial support. You can’t make this shit up. This ends either with you bending the knee or annulling this whole thing",
   "created_utc": 1701648406,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvy02y",
   "message": "r/AmITheEx",
   "created_utc": 1701648538,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbvy1bn",
   "message": "Deciding where to live is a big thing. Why did she do it without consulting you? The non supportive is your wife.\n\nIf that was my husband, I would resent the idea of living there just because he decided on it without me.\n\nYou should both sit and discuss your preferences. Create a list of pros and cons for each of the places you’re interested in and talk about it. Unless both of you are on the same page, there shouldn’t be any discussion about buying land or houses.\n\nNTA",
   "created_utc": 1701648553,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw01y1",
   "message": "You have to be careful marrying someone like this! She probably thought she could convince you to move after you got married! Just like when one doesn’t want kids and they think they can convince their spouse after marriage. It really sucks but I would sit down and talk about where you want to live long term because it already seems like this won’t work out. It sucks people change after marriage but it’s better to see if early on rather later. I hope you can work it out but it seems she may just expect you to go with what she wants and if that’s the case there will be other things she won’t bend on.",
   "created_utc": 1701649361,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw132e",
   "message": "Your wife is the ahole.",
   "created_utc": 1701649772,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw3uwy",
   "message": "NTA. since when did only SHE get to dictate how y’all live your lives?",
   "created_utc": 1701650912,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw5qqe",
   "message": "It's not an investment, she is trying to move you there. It is best to be honest so you know where you both stand. I would sit her down and make it clear you will never move there, ever. If she chooses to buy land and build, she can do that but you will never move there and have no intention of visiting. She doesn't have to like it but if she expects you to respect her choices, that has to go both ways.",
   "created_utc": 1701651715,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw6fsy",
   "message": "You are leaving out part of the story. If this is an “investment”?  Or is this building the future home she wants to live. \n\nYou use the word investment but you write like she wants to live there. Which is it?  \n\nI get the feeling that the wife is the AH. If the wife is not treating it as an investment she is. If the wife is treating this as an investment and has told OP she has no desire to live  there then OP is the AH.",
   "created_utc": 1701652015,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw7i83",
   "message": "You knew that she wanted to live in her small hometown. You wanted the big city. It sounds like neither one of you care what the other wants. You have your way at the moment. She doesn't like the big city the same as you don't like small towns. Just trying to understand",
   "created_utc": 1701652479,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbw8vam",
   "message": "It all takes time to get in the position to be able to move there. It won't be next month or even next year. Meanwhile she is living in a big city like you want.",
   "created_utc": 1701653063,
   "score": 1,
   "submission_id": "189tdxv"
  },
  {
   "comment_id": "kbwa40r",
   "message": "Sounds like y'all didn't think through this whole \"marriage\" thing. Divorce before you have kids to damage. ESH.",
   "created_utc": 1701653602,
   "score": 1,
   "submission_id": "189tdxv"
  }
 ]
}