{
 "submission_id": "189up81",
 "title": "AITAH for not letting a girl dressed as a “slutty elf” who ended up at my house borrow some sweats after she was uncomfortable and cold?",
 "selftext": "I posted this yesterday on another sub but they removed it because “there was no interpersonal conflict” so no one got to vote. I mean the conflict was between me and the girl and me and my sister. There’s a small update since I did the original while I was breakfast with my sister.\n\nNot sure where to begin with this. I guess last night one of the more popular frats on campus was having a “Christmas on the beach” themed party so all around the bar area were girls dressed in bikinis with vague Christmas themes.\n\nMy roommate is dating this total nut job named Sydney and as far as I knew they were broken up. Well at like 2am he bombs through the door with Sydney and her friend in tow, both dressed like “slutty elves” with way too much skin showing. My roommate and Sydney went to his room and still haven’t come out. I was playing Fortnite and the other girl said she was the designated driver and was stuck would she mind if she charged her phone and hung out until she knew what Sydney was doing. I said fine.\n\nMaybe 15 minutes later she said something like “I know this is so weird for both of us but I’m not here by choice, I just don’t want to bail on my friend but sitting here with a guy I don’t really know in a bikini is weird and I’m cold. Do you have some sweats I can borrow? I see you every Monday and Wednesday and I promise I’ll give them back.”\n\nI told her no I wasn’t comfortable with that. She asked if I at least had a blanket. I found one in my roommates spare room but it was really small and said I was sorry it’s the best I could do. She fell asleep on the couch and i went to bed.\n\nMy older sister came to pick me up for breakfast and she saw the girl sleeping on the couch and asked why a half naked girl is sleeping under a baby blanket. In the car I told her what happened and she basically got so mad at me saying I had about 30 opportunities to be a really decent guy and I blew it. She said it sounds like the girl was trying to do the right thing by her friend and I could have let her use sweats, I could have let her sleep in my bed while I took the couch, I could have said that she should go home and I’d drive Sydney home…but basically I was an asshole because I left an apparently nice girl in a vulnerable position and I didn’t even care.\n\nShe said that I need to grow up if I want to have friends and have some empathy if I ever want girls to like me. She has no idea if that girl was into me or not but I missed a great “practice round” of treating someone in a nice way that they may reciprocate.\n\n\nWhen we got back to my house my roommate, Sydney and the girl were gone. There was a sticky note on my door that said “thank you for letting me stay here, sorry it was weird. Please say hello sometime. -Nat”  my sister said this was even more proof that I acted like an “anti-social weirdo” and she was just being nice and the reason I have never had a girlfriend is the way I acted last night. \n\nAITAH?",
 "created_utc": 1701613992,
 "permalink": "/r/AITAH/comments/189up81/aitah_for_not_letting_a_girl_dressed_as_a_slutty/",
 "score": 240,
 "url": "https://www.reddit.com/r/AITAH/comments/189up81/aitah_for_not_letting_a_girl_dressed_as_a_slutty/",
 "comments": [
  {
   "comment_id": "kbthljp",
   "message": "Dude, an overwhelming amount of people were saying YTA. Were you obligated to help her? No! Technically, you're not obligated to help **anyone.** But this line of thinking is very selfish, and that's what made you an ah. It would've been very easy to help, and you didn't. Hopefully you can learn from this for the future.",
   "created_utc": 1701615267,
   "score": 175,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtv43g",
   "message": "Hi OP, I'm an astrophysicist. Hopefully, I make the cut of people you'll listen to. I'm also autistic and have struggled with social situations. \n\nHelping others isn't a transaction. It's how our society functions. One reason to help others is that one day, you'll need help from someone who won't personally benefit from helping you. This situation isn't a problem for you to put in a spreadsheet and analyse. You can't treat real life as an equation to be solved or a philosophical debate. The fact that so many people are voting YTA already tells you that you were wrong in this situation. \n\nPlease get some support to help you learn how to navigate social settings. It sounds like you need therapy and to be screened for neurodivergent conditions. You're going to need social skills to live a good life. They'll help you find people to collaborate with, as working with someone with no social skills is a nightmare. \n\nLearning social skills takes effort, but it will improve your life and help you get the things you want. It's not easy, but it's worth it.",
   "created_utc": 1701620906,
   "score": 88,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtlsco",
   "message": "Ok technically and in a mathematical way, where 2 + 2 = 4, you do not have the obligation to offer this person any courtesy. \nI understand your discomfort, but now put yourself on the other person’s shoes?  \n\nThis person was openly vulnerable with you and asked you for help. \nIf you were in a situation where if someone extended you a courtesy, wouldn’t this be nice? \nIt wouldn’t hurt you to lend her a pijama, sweat pants and a tshirt. And even provide comfortable sleeping arrangements. \n\nDo you have to do this? No.\nBut would you have been the nice guy for doing it? Definitely yes.\n\nThe way you talk about her outfits or anything, is not a very nice way, and this is where I rate you YTA. Let’s not slutshame people. It’s just skin.\n\nBeing kind has nothing to do with obligation or even “what can I gain from this” mentality, it simply is how we, as a society, will work better for the greater good.",
   "created_utc": 1701617124,
   "score": 227,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtonj3",
   "message": "YTA (and judgmental to boot). I love how you mention it was a beach party so all the girls were in bikinis, but Sydney and her designated driver friend were the only ones you called slutty and said had too much skin showing. Dude. Everyone was in bikinis! Secondly, your sister was right: you were neither empathetic or a gentleman. Third, she wasn't asking for a name-brand ski jacket; she was asking for *sweats!*",
   "created_utc": 1701618327,
   "score": 77,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtmmtl",
   "message": "YTA, It's nice that she was considerate and tried to be a good guest, it sucks that you're only interested in someone's well-being if they're also a math major who can help you out. Lending someone you see twice a week, who's currently trapped in a room with you, some clothes and a blanket isn't really a weird request. You admit in the comments that \"your brain isn't wired that way\", which is just a cop out to say you're content being an unempathetic selfish drone that only does what he wants, too bad it's a brain wiring issue.",
   "created_utc": 1701617475,
   "score": 36,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuasng",
   "message": "Your post was up long enough for you to be called the AH universally. Removing some of your cringy language and details of your weirdness isn’t going to change the verdict. YTA in every way.",
   "created_utc": 1701626740,
   "score": 59,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtgci7",
   "message": "Definitely Y t a. \n.pretty sure that was most of the votes on the last vote too soo.",
   "created_utc": 1701614702,
   "score": 189,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu7xyj",
   "message": "You were TA yesterday, and you’re still TA today, and there were PLENTY of votes to tell you so.",
   "created_utc": 1701625721,
   "score": 71,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtjfcd",
   "message": "YTA. Regardless of whether or not the girl likes you, it takes very little out of you to be kind. She effectively communicated her needs (needs you could’ve easily met) and you blatantly ignored them. Sure, you got her a baby blanket. You could’ve gotten her some pants. \nIdk why it takes so much out of you to extend kindness to a stranger.",
   "created_utc": 1701616093,
   "score": 3,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtfgfx",
   "message": "Here are some more responses if you need.\n\nhttps://www.reddit.com/r/redditonwiki/s/0ZvlKZbz6f\n\nDefinitely YTA",
   "created_utc": 1701614284,
   "score": 245,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtg29c",
   "message": "Yta what would the harm have been to give her some clothes?",
   "created_utc": 1701614567,
   "score": 23,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtf3a8",
   "message": "I think you got a plenty of responses over there heh. Unanimous YTA!",
   "created_utc": 1701614112,
   "score": 58,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtyjhf",
   "message": "Based on your description and your replies, it seems to me like you are somebody who thinks very literally, and linearly, so maybe taking subjective cristism isn't very helpful for you. Especially because people are giving you an overwhelmingly unanimous opinion and you're still arguing against it.  To put it simply, you had the ability to do something nice for somebody, and it would have taken very little effort on your part.  So just think about this, if your options are: do something nice with very little effort, or not do something nice.  And you choose the not nice option, why might people think you're being an asshole ?",
   "created_utc": 1701622233,
   "score": 102,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuilx5",
   "message": "I could be wrong here, but seems like you had a problem with the way she was dressed. maybe a subconscious thing on your part to not help her get covered up. “oh well if you were gonna be uncomfortable maybe you should have worn more clothes, that’s not my problem!” but yeah straight up regardless of how you felt about her, you should have done the right thing. you certainly weren’t obligated, and you made that very clear. but every man should be trying to make a woman more comfortable in that situation. \n\neven the fact that she worked up the nerve to ask you for help, and you straight up told her no. that would make me feel so incredibly uncomfortable and self conscious from that point forward, and also make me feel guilty for being in this guy’s space who clearly doesn’t want me around. but i also would never ditch my friend in a situation like that, so i would just take it and deal with it. \n\nbut yeah, YTA. like, hugely. and get over your issues with women being scantily clad, cuz i really and truly think this is the issue here. if she had been caught in the rain, and was soaking wet, but wearing clothes that you deemed appropriate, i feel you would not have hesitated to give her some dry sweatpants and a hoodie just to make her more comfortable. maybe think about that for next time?",
   "created_utc": 1701629466,
   "score": 50,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbth1b3",
   "message": "YTA- what harm would it be to give someone that you see twice a week some sweats when they are cold?",
   "created_utc": 1701615016,
   "score": 203,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu0dhv",
   "message": "I'll just copy and paste my response on the original:\n\nYTA\n\nLet me paraphrase this for you:\n\n\"AITA because my buddy came home with 2 girls who were dressed for a beach party, but I THOUGHT were dressed like sluts, took one to his bedroom, left their DD in the room with me, and i wouldn't help her out because i didn't like that she was dressed like a slut?\"",
   "created_utc": 1701622949,
   "score": 129,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu7v1x",
   "message": "If you were hoping for different results by posting this here, clearly you’re not getting them. Just accept that YTA and learn to be a less shitty person.",
   "created_utc": 1701625692,
   "score": 24,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu2ryj",
   "message": "Would you want your sister or mother stuck in a situation like this?",
   "created_utc": 1701623862,
   "score": 91,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtkfin",
   "message": "YTA it wouldn’t have killed you to let someone who was half-naked, cold, and told you she was uncomfortable borrow some throwaway clothes you didn’t care about. You didn’t have to give her your bed or anything like that, but you definitely could’ve done more than give her the tiniest blanket you guys own. Come on now.",
   "created_utc": 1701616541,
   "score": 73,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbubmfq",
   "message": "Dude.  You were a jerk for no reason other than you felt like it.  What a gross way to live.\n\nListen to your sister.\n\nIf you keep treating people this way, you’ll eventually have worse consequences than a post it note and being yelled at by your sister.\n\nYTA",
   "created_utc": 1701627038,
   "score": 31,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuc1m7",
   "message": "I'm just curious why you were uncomfortable with lending her sweatpants on the first place? Do you only have one pair? Are all your clothes super expensive? Were you afraid she wouldn't wash them before she returned them? It's just such an odd thing to be \"not comfortable\" with.",
   "created_utc": 1701627186,
   "score": 30,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtgucg",
   "message": "“I see you every Monday and Wednesday” do you have a class together?\nEdit: getting downvoted lol what I meant to say was have you had a class together this entire semester and you never noticed",
   "created_utc": 1701614929,
   "score": 73,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuik1z",
   "message": "YTA. Why you even bring up whether or not the girl likes you, as though you’re only obligated to help women who are into you, is gross. You also blaming her for having too much skin showing is pretty telling on your misogynistic self. She apparently had too much skin showing but you were happy enough to keep her in that level of undress in your house. \n\nLooks like you liked looking at her which is the actual reason you didn’t help her out here, otherwise you would have gotten her a proper sized blanket or clothes. Especially since you were quick enough to form a negative opinion on how little she was wearing yet…. Didn’t offer up clothes so she didn’t “disrespect your eyesight” any longer.",
   "created_utc": 1701629448,
   "score": 46,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbudsq7",
   "message": "What, didn't like your answers from yesterday?",
   "created_utc": 1701627795,
   "score": 15,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuj25x",
   "message": "I'd be interested in understanding what was behind OPs discomfort in sharing sweats or a blanket?",
   "created_utc": 1701629627,
   "score": 17,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu3fmb",
   "message": "Didn't you post this yesterday?",
   "created_utc": 1701624106,
   "score": 16,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu9ays",
   "message": "YTA \n\nYou wouldn’t give a stranger who’s cold something to be warm in when you had something? That’s kinda bonkers to me.",
   "created_utc": 1701626208,
   "score": 14,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbupozr",
   "message": "This behavior is textbook  assholery. If you were even in doubt for a moment, you border on sociopath as well.",
   "created_utc": 1701631988,
   "score": 12,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuqi0i",
   "message": "I’m sorry, YTA. She didn’t even want to be there, her friend probably forced her to dress like that and you couldn’t give her some old navy sweats? If she’s on campus then what’s the problem. \n\nYour lack of empathy is showing. Yikes.",
   "created_utc": 1701632281,
   "score": 13,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuum0m",
   "message": "You had a woman in your room and you ignored a basic request of being nice...\n\nTo play fortnite?\n\nYeah, totally the asshole. And likely single too",
   "created_utc": 1701633788,
   "score": 14,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbunt93",
   "message": "YTA,  Of course you should have lent the girl sweat pants if she was feeling weird and uncomfortable in a bikini.",
   "created_utc": 1701631318,
   "score": 13,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuplcf",
   "message": "YTA - Also ever time your name is mentioned in any social situation she will mention to her friends how you could not be put out to get her something to help cover up and be warm. You need to really have some deep conversation with your sister to help you understand the bare minimum of human interaction, because it appears you missed some lessons on basic empathy.",
   "created_utc": 1701631952,
   "score": 13,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu9h6r",
   "message": "LMAO, you're posting here because you got voted the mega asshole in the last round. \n\nDid you know you also got voted the Devil is amithedevil as well?\n\nYeah, YTA. Your sister is a real one, common sense, and trying to beat some of it into you. If you hadn't realized yet, you get what you give.\n\nYou refuse to help people in trouble, even a tiny iota. You're going to find that nobody has the time of day for you in return. \n\nHope you learn this!",
   "created_utc": 1701626271,
   "score": 26,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbudpmd",
   "message": "Lots of people got to vote and the vast majority of them told them YTA, don’t lie to try and make yourself sound better.\n\nEdit; when you make your “spreadsheet” make sure you count all the upvotes on the YTA votes and subtract the downvotes on the smattering of NTA votes.",
   "created_utc": 1701627765,
   "score": 12,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuhf1l",
   "message": "Info: if it were a guy in his tighty whities would you have let him borrow a pair of sweats?",
   "created_utc": 1701629044,
   "score": 11,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuij0m",
   "message": "Yikes, not only are you slut shaming these girls with \"way too much skin showing\" because of a themed party, but this young girl (who sounds VERY sweet by the way) asked for a simple favor and you said no?? Obviously you don't have to help her but you sound miserably selfish and didn't even acknowledge that she was having to deal with a drunk girl and her boyfriend as a designated driver. \nYou sound really obnoxious",
   "created_utc": 1701629438,
   "score": 10,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu2gtb",
   "message": "YTA... Seriously... You couldn't let her borrow some sweats??? First you think \"too much skin\" at the party showing and later you can't be a decent person and give her clothes or a normal sized blanket.  Surprised she left a note. You're not a nice person and your sister is 💯% right.",
   "created_utc": 1701623745,
   "score": 41,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtkmsi",
   "message": "YTA - she was just trying to be a good friend to her friend, she obviously felt awkward being there too, she was cold and you gave her the bare minimum.",
   "created_utc": 1701616631,
   "score": 28,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtjh1g",
   "message": "YTA!!!",
   "created_utc": 1701616114,
   "score": 19,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtqx0i",
   "message": "How could you not be the AH?\n\nOMG YTA\n\nYour emotional detachment seems clinical, gawd.",
   "created_utc": 1701619239,
   "score": 18,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu88ct",
   "message": "Yeah.. YTA. Damn, I was definitely lucky being around good people when I used to party like this in my late teens and early 20s. You do seem very anti social.\n\nPlans easily change when you're out like this and sometimes we ended up in the house of a friend of a friend of a friend, who was a stranger to me. These strangers were always kind and it was common for the host or their roommates to offer a shirt or pants to anyone who needed it, for reasons similar to what this woman gave you. I did the same when people came to my place.\n\nIs it an inconvenience? Sure. Is it uncomfortable to have strangers wear your clothes? Sure. But it's just kind. Doesn't matter if she was into you or not. It's just a kind thing to do and doesn't hurt anyone. Basic empathy. Especially after she asked even though she didn't want to.\n\nAlso why the unnecessary details? Why do we need to know Sydneys a \"total nutjob\"? Couldn't have described the clothing better than \"slutty elves” with way too much skin showing\"?",
   "created_utc": 1701625825,
   "score": 23,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbukvtt",
   "message": "YTA. I agree with every word your sister said. If I was your sister I’d be critically embarrassed to have you as a brother.",
   "created_utc": 1701630282,
   "score": 18,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu42hm",
   "message": "How old is OP. Is it said anywhere?",
   "created_utc": 1701624347,
   "score": 9,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbujxcj",
   "message": "What if that was your sister, mom, niece, aunt, grandma, daughter, friend? YTA.",
   "created_utc": 1701629938,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbunkps",
   "message": "I think your sister phrased it perfectly: you're not an asshole but \"you missed about 30 opportunities to be a really great guy.\" \n\nYour handling of the situation was...unimpressive. I'd rate it a C+",
   "created_utc": 1701631233,
   "score": 9,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbupywd",
   "message": "You are so full of sht. This post was up for long enough to get hundreds of comments, and you were voted TA.\n\n*Then* screen shots were posted on r/redditonwiki where you were once again voted TA.\n\nHow many times are you going to seek judgement for this?. YTA.",
   "created_utc": 1701632090,
   "score": 9,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbv832z",
   "message": "OP, I'm going to put this as kindly as I can, especially since many others have been nasty enough for me. You are most definitely the AH. As others have said, including your own sister, there were many opportunities for you to help another human being, and you refused them all. Regardless of your own personal feelings, regardless of how she dressed, you refused to help someone else.\n\nIs there any obligation, any need to help someone? No, you could live your whole life without helping a soul, if you wanted. What kind of life is that, though? I'm sure if the situation were reversed, and you found yourself in her shoes, you'd want help, especially more than whag you offered. You don't need to help anyone, but if that's how you're going to live, I hope you're prepared for others to never help you.\n\nAnother thing is, you're very obviously slut-shaming this girl, who you, first off, don't know, about an outfit that everyone who was at the party would be wearing. She even asked if she could BORROW some sweats so she could be less cold and more comfortable, and, by the sounds of it, it would've been a win-win for you, as you obviously weren't comfortable with her dressed like that either, so the fact you said no still blows my mind. She even said a time she would be able to return them (more than likely washed too, as that's what decent people do. They help.).\n\nThe fact that \"the best you could do\" is find the equivalency of a baby blanket also shows me that when you ARE willing to help, it's the bare minimum amount of effort you could put in for your own convenience. You're telling me, in your entire place, you couldn't find ONE full size blanket? EVERY ONE of my friends' places have at least two or three spare blankets in case of company/someone spending the night/if it just gets cold and they don't want to get up to go to the bedroom. I really don't want to drag you through the mud, but this just SCREAMS laziness and selfishness to me.\n\nAs I've said, I'm putting this as nicely as I can, but it's hard when you post this, not seeing the issue here. You wrote this, probably reread it a few times for any spelling errors/to make sure you put down everything correctly, and it never once clicked to you how bad this looks. I completely agree with your sister here, and, to be honest, if I was your friend, and I heard about this, I don't know how much longer that friendship would survive. Between the slut-shaming, the laziness, and the lack of awareness/empathy shown both in that moment and when you wrote this up, it's very clear to not only me, but 99% of the people here, you are most definitely the AH.",
   "created_utc": 1701638643,
   "score": 15,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbununt",
   "message": "YTA based on your mentality \n\nThe lack of empathy and name calling is absurd. I’m so happy I probably never see you in my life. Inconsiderate to the boot and next life.\n\nTry to learn from the Social Science class, seems that you are antisocial because of how judgmental you are. Insufferable.",
   "created_utc": 1701631332,
   "score": 9,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuo6aj",
   "message": "Yta. Youre mean",
   "created_utc": 1701631446,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbup8nr",
   "message": "Would it have killed you to play nice with someone, just to be a nice person?\n\nYTA",
   "created_utc": 1701631828,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbupm7e",
   "message": "YTA\n\nA gentleman(or just a decent adult) would have accommodated the friend with some sort of basic cover, especially when it became clear she was stuck sleeping in your residence. \n\nDo better next time.  You sound like a prick.",
   "created_utc": 1701631961,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuq31u",
   "message": "Lol I don’t think asshole is the most appropriate word to describe you, you’re just weird actually, in an unpleasant way. For some reason you just ring off alarm bells just by reading your post? Idk bad vibes",
   "created_utc": 1701632132,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuq8ir",
   "message": "YTA. She just wanted to be warm and protect her friend.",
   "created_utc": 1701632186,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuqav8",
   "message": "YTA, absolutely. WTF is wrong with you, she was just looking out for her friend and you treated her like trash. Like it was no effort for you to help her, and you couldn't even do the minimum.",
   "created_utc": 1701632209,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuqh91",
   "message": "Why won't you give a blanket or a sweat to somebody that is cold? would you like to have the same treatment if you were in the same position?\n\nDamn you're so an ahole, poor girl",
   "created_utc": 1701632273,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kburbv8",
   "message": "YTA. dude what?? you’re not comfortable with her being dressed decently? I agree with your sister 100%. If you ever want a woman to find you like able, start acting like a man.",
   "created_utc": 1701632582,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbusawv",
   "message": "YTA\n\nYour sister was right. Missed opportunity to be a decent person.",
   "created_utc": 1701632936,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbusl81",
   "message": "Your sister hit the nail right on the head dude lol",
   "created_utc": 1701633042,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu7qsw",
   "message": "YTA. There was a very “inexpensive” way to make someone’s evening better. I also bet that girl is actually into you a bit. Since it seems she saw you on campus before and noticed you. I bet her friend thought that by “stranding” there, there could be opportunity for you two to connect. And her note confirms it. Instead of saying “thanks a$$hole for giving me a napkin of blanket” , she is actually still being nice to you. Your sister is 100% on point.",
   "created_utc": 1701625649,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbub1ht",
   "message": "I think the biggest AH’s here are actually her friends as they just dumped her with a stranger, cold and alone. They should have been the ones to get her clothes, blanket, etc. I don’t blame you for not wanting to deal with a stranger in your space; sometimes you just don’t want to deal with other people, but your post reads as pretty judgmental and cold towards her. And she didn’t do anything wrong so she’s def n t a in this situation.",
   "created_utc": 1701626828,
   "score": 5,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbulut9",
   "message": "YTA. You were the AH over there and you’re still the AH over here. If that “slutty elf” was your sister, waiting to make sure her friend was okay, and she asked for a sweater or something from the friend’s BF’s roommate, and he replied as you did, how would you feel?  Would you be okay with it and tell your sister it was her fault? Or would you be pissed that she was treated that way?\n\nHonestly, if your answer is the first one you need to learn some empathy because you’re an even bigger AH if that’s your answer.",
   "created_utc": 1701630627,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuoavv",
   "message": "I mean this goes beyond just you being the asshole in that present moment.  If you can’t understand why you were an asshole in this situation, you’re going to have a very tough road ahead in life.",
   "created_utc": 1701631492,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuq8y6",
   "message": "YTA. You know you’re wrong because everyone said YTA in your last post, but you keep posting in the hopes you’ll find some other incels that will back you up. Your sister is an asshole too, because you should never help someone with the hope that they’ll “reciprocate.” That’s gross, especially in this case where she makes you think a girl will “do something for you” for helping her. You should do nice things for people because it’s the right thing to do, not because you want something in return.",
   "created_utc": 1701632191,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbur8mu",
   "message": "YTA, but at least it sounds like you have a good older sister, you should just listen to get moving forward and you have a pathway to how not to be an ass hole.",
   "created_utc": 1701632550,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbushrx",
   "message": "YTA.  You could have been nicer. Also could have used this opportunity to make a friend. Someone who eventually could be more than a friend if you two made a connection. Your sister was correct.",
   "created_utc": 1701633006,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbusnv7",
   "message": "YTA OP, not for being an introvert, not for being socially awkward. Those aren't things we choose, though we can work on our social skills without being forced to go too far outside our personal boundaries.\n\nYou're TAH for shaming someone based on their attire, making derogatory remarks about said style of dress and using that as a reason to then decide she didn't deserve basic human kindness,  except for a tiny children's blanket. So, because she was dressed in a very revealing way that somehow made her undeserving of warmer clothes?\n\nI get lending clothes to a stranger might have been awkward, but it was the kind thing to do. It can't have been more awkward than letting her sleep over with just a baby blanket. \n\nAre you neurodivergent? If you aren't sure, maybe it's something you should look into. It's still not an excuse, merely a potential explanation.\n\nTo all the pearl clutching, purity-culture slinging, \"mahdesty\" touting nerds claiming \"well she CHOSE to dress like that so CONSEQUENCES\" please do shut up. Yes she should have taken a change of clothes, that would have been the smart thing to do, but so what? Have none of you ever made a stupid mistake like that before? \n\nReign in the outrage. It's 2023, not the 1950s.",
   "created_utc": 1701633069,
   "score": 8,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbusr8e",
   "message": "YTA\n\n\nDude, touch grass and this from a terminally online nerd. You could have been a nice guy but your issues with Sydney and your roommate led you to treat this poor girl like a dog",
   "created_utc": 1701633103,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuugqk",
   "message": "YTA dude. She was trying to help her friend who is clearly rude and selfish.",
   "created_utc": 1701633735,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuuhky",
   "message": "\u0026gt;My roommate is dating this total nut job named Sydney and as far as I knew they were broken up. Well at like 2am he bombs through the door with Sydney and her friend in tow, both dressed like “slutty elves” with way too much skin showing.\n\nI didn't need to read any further than this, tbh. It sounded so slut-shamy and judgemental. YTA.",
   "created_utc": 1701633744,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu5rsz",
   "message": "Hey OP here's another vote for your spreadsheet: YTA",
   "created_utc": 1701624945,
   "score": 11,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbudnsi",
   "message": "YTA.  \n\nShe was trying to do right by the girl she was with.  You were inconvenienced by her presence, yes.  But, she’s a person who was cold and tired and while you didn’t want to share your clothes/sweats, you could have given her a blanket to use.",
   "created_utc": 1701627747,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbueib3",
   "message": "Ahahaha I saw this on r/AmITheDevil yesterday. Yes yta.",
   "created_utc": 1701628040,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuessq",
   "message": "By your behavior and what your Sister said, I have to ask, are you on the spectrum?  Ever sexually or otherwise abused, causing PTSD?  Phobic?\n\nI'm trying to find you a way out of being a complete assholic moron.  If none of the above are true then, my friend you are well on your way to incelville and might be able to run as George Santos for office there!\n\nChange your ways and at least have some empathy for other humans.",
   "created_utc": 1701628139,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbueyrj",
   "message": "Even an old tshirt would have been something, Jeesh.",
   "created_utc": 1701628197,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuf2tt",
   "message": "Sweatpants don’t mean anything. They’re pants. She was cold. Pants make warm. \n\nEmpathy for another person is essential if you want any in return.",
   "created_utc": 1701628235,
   "score": 7,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbujtey",
   "message": "YTA. I get that you may find it all odd or a bit uncomfortable but it's really not that hard to help someone out.",
   "created_utc": 1701629900,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuk6iy",
   "message": "Damn I get she wasn't there with you or your friends but bare min would have been a bigger blanket that poor girl trying to be a good friend got screwed. Did you feel nothing about her being cold and stuck like that? I agree with your sister the decent thing to do would have been to help someone in a crap position it's just called being decent",
   "created_utc": 1701630029,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbum7ol",
   "message": "Not going to call you the AH, if you are neurodivergent, but take this as a learning experience.  It would have been nice to lend her the sweats or an old t-shirt or something.  Maybe you didn’t have extra pillows or blankets, but maybe you could have shared your comforter.  It’s just polite and empathetic.",
   "created_utc": 1701630752,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbum7y1",
   "message": "YTA\n\nA designated driver (aka responsible kind person beingba great friend) said she was cold and asked for help.\n\nAnd you couldn't even help her??!!\n\nThen you gave her a blanket that wouldn't even cover half of her. \n\nYou're such an asshole. It's so bad I actually have to spell it out here.",
   "created_utc": 1701630755,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbumn68",
   "message": "\u0026amp;#x200B;\n\n\u0026gt;she basically got so mad at me saying I had about 30 opportunities to be a really decent guy and I blew it.\n\nThis is correct.\n\nThat friend, not only being the DD, but staying over to make sure her friend is safe--she's a real one.\n\nThen you give her a fucking baby blanket to cover up. What a dweeb.\n\nAnd the contempt in your tone for these women.",
   "created_utc": 1701630903,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbumpim",
   "message": "YTA bro.\n\nMajor YTA.\n\nI hope this doesn't become one of those stories about \"that's how I met your mother.\" You don't deserve that kind of story. I hope Nat does not ever take an interest in you. Sorry, but I just don't get how you could have let that poor girl freeze bro.",
   "created_utc": 1701630926,
   "score": 5,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbumzwr",
   "message": "She was trying to do the right thing by being the dd and making sure her friend got home safely and was all settled in. She made an impractical choice for an outfit, but it fit the theme of the party she went to. She obviously didn't plan on sleeping over, but shit happens. \n\nYou found the smallest blanket (which you didn't ask your roommate to borrow) and gave it to her. Does that sound like the kindest choices?",
   "created_utc": 1701631027,
   "score": 5,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbunotg",
   "message": "Yeah, your sister is right. The least you could've done is to give her some clothes to wear. Imagine the courage she needed to even ask a somewhat stranger for some clothes because she was uncomfortable there. \n\nAnd the blanket? Really? You didn't have anything better?",
   "created_utc": 1701631273,
   "score": 5,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbunuu7",
   "message": "I don’t usually comment on these, but since you’re keeping score: YTA. \n\nYour sister is right, it was an incredibly low effort opportunity to help someone -someone who told you exactly what they needed and why, no empathy required - and you still couldn’t be bothered. \n\nEven if you were worried about never giving your sweatshirt back or having it forever sullied by “too much skin,” you’ve now wasted time and energy seeking validation on Reddit. That time and energy is worth more than the possibility of a lost sweatshirt.",
   "created_utc": 1701631334,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbupsp0",
   "message": "You were voted YTA in that post.",
   "created_utc": 1701632026,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuqhp4",
   "message": "Yes, YTA, whether you’ve ever had a girlfriend or not, you probably have been around humans before \u0026amp; know this was completely rude.",
   "created_utc": 1701632277,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbuqpzh",
   "message": "Your sister is dead on the money.",
   "created_utc": 1701632361,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbus1g9",
   "message": "Your older sister is right and this was despicable behavior on your side. Its really disgraceful, yta.",
   "created_utc": 1701632840,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbv43nz",
   "message": "YTA. You judge her for having “too much skin showing” but then won’t give her something to cover up? Sheesh.",
   "created_utc": 1701637193,
   "score": 6,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbth5xo",
   "message": "YTA man. You had the opportunity to act like a decent human being and you fucked it up.",
   "created_utc": 1701615074,
   "score": 17,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbtwcq2",
   "message": "I never vote on these. \n\nBut \n\nYTA",
   "created_utc": 1701621391,
   "score": 20,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu4oxn",
   "message": "This guy posted on AITA and tried to argue with people when he got put in his place, so now he's trying to find validation here, lol. \n\nBuddy, no matter where you post it or how you spin it, YTA. It doesn't take much to lend someone an old shirt and sweatpants. If you needed food, clothing, etc. You'd appreciate it if someone extended that kindness to you, so pay it forward.\n\nYou clearly wanted to punish her for not dressing how you think a women should dress, that's why you refer to her as a \"slutty\" Christmas elf. Honestly, this dude gives off massive incel vibes.",
   "created_utc": 1701624566,
   "score": 15,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu5ali",
   "message": "ESH except for that poor girl.  Your roommate and Sydney suck for just leaving her to fend for herself. You suck for not being kinder to her.  Your sister is 100% right about that.\n\nShe should have just left and let Sydney fend for herself.\n\nOh, and here's a pro tip for you:  If you ever want to find a girl who wants to actually date you, you'd do well to drop the word \"slutty\" from your vocabulary.",
   "created_utc": 1701624778,
   "score": 17,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbu5l77",
   "message": "It’s always sad to see when someone is a victim of mental conditions they don’t have control over. A complete lack of understanding of basic social etiquette and decency, combined with a profound lack of empathy, And the inability to realize and admit your error. You also said in one of your replies that you’d like a girlfriend and friends IRL too. My heart breaks for you but you need to get some therapy to change your mindset or you will go through life miserable and alone, driving off everyone around you and not understanding why. I’ve seen it happen a million times before. Get. Help. YTA",
   "created_utc": 1701624881,
   "score": 10,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbunnme",
   "message": "YTA people threw a party in winter w a theme that “required” women to wear inadequate clothing. \n\nThe girl was polite and was being responsible looking out for her friend and you made her uncomfortable for no good reason other than what? To slut shame her?",
   "created_utc": 1701631261,
   "score": 10,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbthuih",
   "message": "YTA. \" The best you could do\" Really? What a manchild.",
   "created_utc": 1701615381,
   "score": 27,
   "submission_id": "189up81"
  },
  {
   "comment_id": "kbukh5u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "189up81"
  }
 ]
}