{
 "submission_id": "189urb3",
 "title": "Aitah for telling my sister her daughter deserved to get bit by my dog?",
 "selftext": "I'm (15F) and I was gifted with a baby husky, it's a girl and she is turning 2 next week. She's the cutest thing but she is very small and fluffy, ok let me hurry up and not waste time. Yesterday my sister came over with her kids just to see the fam and gossip, my sister and I have a good relationship but one thing I don't like about her is that she allows her kids to do anything.\n\nI was sitting on the couch doing my late assignments because I was moving behind in school, I was hearing little squeak noises and I knew it was from my dog. My niece (4F) was dragging my dog by it's arm as my dog screamed in pain, I swear I jumped up so fast. I told my niece not to do that again but did she listen? I left my dog in my room and told her not to go in there.\n\n20 minutes later I heard screaming, my niece ran out the room with a bit mark on her hand that was bloody.  MY sister was so upset at me and said I should put down my dog, I felt insulted because I told her daughter multiple times not to harm my dog but kids just have to learn the hard way, I told my sister she deserved it because I gave her many warnings but she provoked my dog. After they left, so happy they did I realized my dog was limping every time she walked and that's how I know she had a broken arm. I told my sister she needs to pay for my dog surgery.\n\nEdited: I see everyone comment on the \"deserved\" part and I totally agree that I used the wrong word because my niece is still a child so I take accountability for that.",
 "created_utc": 1701614168,
 "permalink": "/r/AITAH/comments/189urb3/aitah_for_telling_my_sister_her_daughter_deserved/",
 "score": 145,
 "url": "https://www.reddit.com/r/AITAH/comments/189urb3/aitah_for_telling_my_sister_her_daughter_deserved/",
 "comments": [
  {
   "comment_id": "kbtgfxj",
   "message": "NTA\n\nYour sister is the AH! \n\nSister \u0026amp; kids will definitely pop over again to visit Family. Next round... lock puppy in your room to protect the pooch. Carry the key around your neck/wrist with full visibility. Hopefully the AHs ask about the husky. You can prepare various responses.\n\nAHs who hurt animals in are the WORST!",
   "created_utc": 1701614745,
   "score": 181,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtgk6a",
   "message": "NTA- the only thing different that I would have done is when I saw your niece dragging the dog by its arm. I would have called in your sister and parents to tell them what happened and demand they supervise niece better.",
   "created_utc": 1701614800,
   "score": 77,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtgkn2",
   "message": "NTA, But…. Since the four-year-old was being abusive towards the dog, you should have spoken to your mother and your sister. Telling a four-year-old not to hurt a dog simply was not going to work. You need to know that if your sister takes her child to the doctor for the bite,  and she reports your dog, it goes on the dogs record so it’s best to prevent this type of thing before it happens. Did you take the dog to the vet? Not all brakes require surgery but all Vet bills are extremely expensive. So once again, it’s better to prevent injury. Huskies are high energy dogs, and require training and lots of exercise. It’s part of your job as a pet parent to ensure they get the mental and physical stimulation they need.\nYour sister is the  AH for not adequately, monitoring her children, and for not teaching her children to treat animals with respect.",
   "created_utc": 1701614806,
   "score": 30,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtg7dw",
   "message": "I don’t know if, “deserved,” is the right word because she’s a young child and should have been overseen by your sister. It is your sister’s fault though. How does a 4 year old go unnoticed entering a closed bedroom door to torment an animal she has been explicitly told not to? Your sister should have had eyes on her to prevent her going into the room. \n\nNTA and your sister should definitely pay for vet costs. Being mad that your puppy bit her in this situation is absurd.",
   "created_utc": 1701614635,
   "score": 73,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtvbs6",
   "message": "Your sister absolutely needs to pay your poor dog’s vet bills and I hope your parents are standing with you in this.",
   "created_utc": 1701620989,
   "score": 12,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtho5k",
   "message": "Nta and sis is the entitled ah\nIve seen a cat go on rabies observ because kid  pulled on tail\nYour ah sister  was negligent in supervision of her child and i think that may negate it\nYour vet bill is proof",
   "created_utc": 1701615300,
   "score": 10,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbthz63",
   "message": "NTA  \nYou told your niece not to drag your dog by its arms but she didn't listen and the dog bit her. I won't say she deserved it as she's just 4yo and i don't think any 4yo is going to listen when they're told not to do a specific thing. She faced the repercussions of her actions. Your sister should've kept a watch on her 4yo as leaving a baby alone with a dog is not at all advisable.  \n\nAlso, it is only fair for you to ask your sister to pay for the vet as it was her daughter who hurt the dog even after she was told not to drag the dog by her arms. Although the 4yo won't understand, your sister could've prevented any of this from happening.",
   "created_utc": 1701615440,
   "score": 14,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtjmtc",
   "message": "NTA and deserved is the right word .. your sister should’ve told her daughter to stop as well she’s four she’s old enough to know what stop means",
   "created_utc": 1701616186,
   "score": 7,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbuubtp",
   "message": "4yo dragged the dog until its leg BROKE?!\n\nNTA and 'deserve' is the correct word",
   "created_utc": 1701633687,
   "score": 6,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbuvgja",
   "message": "I don't know why people are questioning the \"deserved\" part. Your niece, whether she was 4 or not, was told not to do something and deliberately went against all warnings and reprimands. It's like a child wanting to touch the pretty red metal on the stove top even though mom and dad said no, and they still touch it. The pain is a lesson, and it's well earned. Your niece is **lucky** she received temporary scars, because not all animals would give *just* a warning nip like that.\n\nMy warning is to lock your dog up when your sisters around, not because the hound can't be trusted, but because your niece can't and it's likely your dog will remember not to trust her safety around your niece in future.\n\nNTA",
   "created_utc": 1701634098,
   "score": 5,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtsh03",
   "message": "NTA\n\nThe kid didn't deserve to be bitten.  What she deserved was her mother actually discipling her.\n\nOf course, the idea that a parent discipline their children has gone the way of the dinosaur.\n\nAnd yes, the mother SHOULD pay for the vet bill.",
   "created_utc": 1701619857,
   "score": 11,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbud65g",
   "message": "Make sure you go to the vet and get records and proof of the broken arm.\n\nLast thing you want is your sister bullshitting that you have an aggressive dog and getting the law involved forcing you to put it down.",
   "created_utc": 1701627581,
   "score": 5,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbus2xz",
   "message": "NTA and yes she did deserve it.",
   "created_utc": 1701632856,
   "score": 6,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtgtqb",
   "message": "NTA\n\n\"deserved\" isn't really the right word, in my opinion, the fault lies with your sister for not parenting the kid correctly or watching her closely around the husky if she knows the kid doesn't listen.",
   "created_utc": 1701614921,
   "score": 8,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbty367",
   "message": "They can be amazing dogs, but everything has a breaking point,",
   "created_utc": 1701622057,
   "score": 4,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbu3xe4",
   "message": "I agree with you she deserved it. Doggo is in the right",
   "created_utc": 1701624294,
   "score": 4,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbul7f5",
   "message": "Where are your parents in all of this? Why are they okay with your niece breaking the dog’s arm?",
   "created_utc": 1701630396,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv1l30",
   "message": "NTA, I have a 4yo myself and I tell her often that she HAS to ask before she is allowed to pet someone’s dog. And if they say no, she can’t then no crying. Their momma said no and that’s okay, so far no issues",
   "created_utc": 1701636290,
   "score": 4,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbuc9h4",
   "message": "She really said put down a 2 weeks old dog? That is crazy NTA.",
   "created_utc": 1701627264,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv0zwx",
   "message": "How is a 4 year old able to drag a full grown husky by its arm? 2 years old is not a baby for a husky. Also, your sister is TAH for not watching her child around an animal.",
   "created_utc": 1701636084,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv1eyp",
   "message": "NTA\n\nYour sister and her niece should never be allowed near your dog for the forseeable future, she'll try that with a pitbull and it won't end well for her.\n\nIf your sister refuses to pay the vet bill, bring it up everytime you see her.",
   "created_utc": 1701636230,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv5igf",
   "message": "NTA\n\nI had a very similar experience with my dog and my niece. He is a Jack Russell terrier and my niece grew up with big dogs so she always thought my dog was a puppy and wouldn’t leave him alone. \n\nOne day she was chasing him and he kept trying to hide from her. So I put him in my room only for her to let him out the second I walked away. \n\nHe came and hid under the chair I was sitting on and I warned my niece again to leave him alone (cue the “but I wanna playyyyyyy with the puppyyyyy”). So I took him outside with me. \n\nOf course, she followed. Well when he sat under the chair I was in again she tried to sneak around the back and pull him out by his tail. He yelped and then bit her. Not hard, but hard enough to break skin with no bleeding. \n\nMy sister reacted exactly the same as yours. So I told her that until she can get her kid under control I didn’t want them anywhere near my dog in future. \n\nNiece was 7 at the time too. \n\nYour sister needs to be held accountable here. She should be teaching her own child about being respectful to animals. And even then she should still be supervising the kid around animals at all times.",
   "created_utc": 1701637710,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv6w5k",
   "message": "NTA.  And re:  the people taking issue with the \"deserved\":  fuck that and fuck them.  If that little monster broke your dog's arm (and really even if she was just fucking with it after you told her not to and put it in your room and told her to stay out) she absofuckinglutely deserved it.  I'd have bitten her myself if that was my dog.",
   "created_utc": 1701638210,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvcxr2",
   "message": "Your sister is raising her kid to be a psychopath.\n\nBe ready to hire a lawyer to go after sister for the cost of the vet.",
   "created_utc": 1701640416,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbthtfk",
   "message": "Yea you are NTA and this is why I never allow my friends to bring their kids around my dogs. I had an older dog (pitbull) he was a shelter dog and I never knew how he may react to children so I never really let kids around him period. During the time he was alive my friends started having kids and wanted to bring them over. I emphatically said no because I didn't know how the kids would treat him (older had arthritis and other issues due to age) and I never really knew how he would react. The same after he passed and my parents got two bulldog puppies, my friends want to meet the puppies (bring their kids over to meet the puppies) and I just say no as I am not being responsible if anything happens (they are littermates, one is a bruiser and your classic broad English bulldog build and her sister is a little smaller and a cuddler who just wants to sleep). It's better to just keep kids away until they understand how to treat animals. Your sister should pay for the vet bills though.",
   "created_utc": 1701615367,
   "score": 4,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbukaki",
   "message": "Your neice was allowed to 'play' with your dog so roughly that your dog's leg is now broken?  So not the AH!  You poor pupper!  I hope that she is feeling better soon.  Please never traumatise your dog again by allowing her near your sister or neice.  Also, she might need puppy training so that she overcomes any fear she has of children due to the trauma she was under.  She could become a danger to children if she doesn't get some special training.  I'm so sorry for this situation - your poor pupper!",
   "created_utc": 1701630070,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbuyvin",
   "message": "NTA\n\nKids that hurt animals deserve to be taught by the animal why that isn't a good idea. The premise that any bite should equal death needs to apply to humans as well if that is what society deems appropriate for other mammals IMO, I have had far worse human bites than animal bites.",
   "created_utc": 1701635336,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv0p2g",
   "message": "I had a dog that felt guilty eating a fly. She never bit anyone. \n\nBut she did have a loud voice. If a child was bothering her she would bark loudly and jump away from the child. It was her “Fuck off, I have had enough of your shit” moment. It was enough to scare the little monster. \n\nKeep your kids away from my dog if the child needs training, it’s not the not the dog’s fault they protect themselves.\n\nEdit: WTF? Your niece broke your dog’s leg? I’d ask for the vet bills to be paid by your sister.",
   "created_utc": 1701635977,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv7o7e",
   "message": "It’s not any different from telling a child not to touch a hot stove, and then they do it anyway. It’s on the child, or it’s on the parent—but it’s not the stove’s fault.",
   "created_utc": 1701638494,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv8jom",
   "message": "NTA. Your choice of words could've been different, but people need to control their damn kids.",
   "created_utc": 1701638811,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv8zxs",
   "message": "NTA; you took the dog out of the situation, and told your niece no. Niece went out of her way to access and injure the dog AFTER BEING TOLD NO. She’s lucky the dog was a puppy and not big enough to do major damage.  Mom’s behavior says a lot about why her kid feels okay disregarding rules. And yes, she is old enough to understand ‘no’.",
   "created_utc": 1701638976,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv9w2k",
   "message": "NTA. I think \"deserved\" was the right word. What a little psychopath!",
   "created_utc": 1701639305,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvggab",
   "message": "NTA. Your niece deserved it. I went near my stepdad’s Shiba after they first got him, this was years ago, and I reached out to pet him and he bit me right on the hand. Same thing with my husky. She was up in her years when we had her and I was brushing her (in my early 20’s) and I must have hit a few sensitive spots because she bit me in the face twice. Learned the lesson the hard way (second time was almost near my throat towards the artery). Sister needs to teach her kid to respect animals because next time she does that someone else’s dog and if it’s a senior dog this and not a puppy, it’ll end much worse for her kid. If the vet asks what happened, tell them that your sister allowed it to happen. Don’t allow them near your puppy again because they clearly don’t care on what happens to her.",
   "created_utc": 1701641713,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvgu5o",
   "message": "NTA \n\nDo your dog a favour and keep those kids away from her. If your sister cant control her children and they are torturing the dog and injuring it then ban them all from your home.\n\nYour dog relies on you to fight her corner; your sister should also be paying that vet bill.",
   "created_utc": 1701641861,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvmg3p",
   "message": "NTA.  Tell your sister you will put down your dog AFTER she puts down her daughter. Niece deserved a spanking the first time, and had she received what she deserved,  likely wouldn't have been bitten. Sister needs to parent.",
   "created_utc": 1701643990,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbw1471",
   "message": "That kids a psychopath in the making lol. I laugh but I'm not even kidding.",
   "created_utc": 1701649784,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbw4a9k",
   "message": "NTA, tell your sister if she doesn't pay for the dogs surgery you'll call CPS and inform them that her child deliberately hurt a dog despite being told to leave the dog alone multiple times. Honestly her kid needs to see a therapist and be investigated because harming animals is a huge, huge red flag in troubled kids who grow up to do bad things.",
   "created_utc": 1701651093,
   "score": 3,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtswde",
   "message": "Wording was wrong but sentiment was right. Niece crossed your boundaries and the dogs. Dog was only protecting itself.",
   "created_utc": 1701620027,
   "score": 4,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbu410l",
   "message": "“Deserved” is the perfect word. Tell your sister to keep an eye on her menace.",
   "created_utc": 1701624332,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv1rdy",
   "message": "Nta nd ur right her child did deserve it. Her ass learned a lesson that day",
   "created_utc": 1701636351,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtj26k",
   "message": "You failed to protect your dog from your niece. Your sister failed to protect her 4 year old from your dog. Both of you need to take more responsibility for the living beings under your care.",
   "created_utc": 1701615930,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbu11p2",
   "message": "This needs to be a learning experience for you in pet ownership for you,",
   "created_utc": 1701623206,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbubw4j",
   "message": "NTA, the child was not properly supervised. It's your sister's fault, but you're kind of dumb for expecting a four year old to listen.",
   "created_utc": 1701627133,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbu17g8",
   "message": "You were wrong, but not necessarily TA. Your sister is the reason her daughter got bit because she’s the adult in the situation. A four year old cannot really understand this situation but her mother should have been supervising her and keeping her from going near the puppy.",
   "created_utc": 1701623265,
   "score": 0,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbw4njz",
   "message": "Yta cannot imagine thinking a 4 year old deserved any of this",
   "created_utc": 1701651249,
   "score": 255,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbutw0z",
   "message": "YTA.  It was *your* responsibility to protect your dog from being abused by that child.  You could have prevented this.  You know the child is disobedient, so why did you expect her to do what she was told this time?  You should never have left your dog alone while the child was running around unsupervised.  Do better.",
   "created_utc": 1701633524,
   "score": 254,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbtmz1m",
   "message": " No child deserves to get bitten by a dog",
   "created_utc": 1701617618,
   "score": 246,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbub4ug",
   "message": "You NEVER leave dogs unsupervised with children. This is on you and your sister.",
   "created_utc": 1701626862,
   "score": 255,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbuvrsy",
   "message": "You don't think it would've been smart to not leave the kid alone with the dog after you caught her mistreating it? I don't think you're mature enough to own a dog.",
   "created_utc": 1701634211,
   "score": 255,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbv95ix",
   "message": "Dog bite, if you're the owner you're 100% at fault, even though the dog was provoked. Your niece should never be allowed to be around your dog ever again, but in a situation like this I probably wouldn't give the dog a death sentence.  Unfortunately you can't  expect anyone else to pay the vet bill either, it's completely  understandable that the child got bitten, hopefully she has learned something too. But the dog can NEVER bite, that's the law everywhere.",
   "created_utc": 1701639033,
   "score": 255,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbuc52m",
   "message": "NTA - well at least not in the sense that it was really your sisters fault, not her 4 year old, who doesn't know any better because she isn't being disciplined by her mother. \n\nYou are very lucky to not be living in the UK. Had it been over here, your Husky would have been summarily euthanized by law, whether it was provoked or not.",
   "created_utc": 1701627221,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvr2jt",
   "message": "NTA. Take your dog to the vet and get a copy of the x-ray and report. Sis likely will not pay the bill but if she tries to press charges against *you and your dog* for the bite, you can show there were extenuating circumstances and the dog was defending herself against extreme abuse/danger",
   "created_utc": 1701645812,
   "score": 2,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvrycr",
   "message": "Deserved is the right word🤷🏼‍♀️ I didn't hurt animals at 4. That's bizarre af behavior even for a kid",
   "created_utc": 1701646153,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvs0dq",
   "message": "NTA, your sister is an idiot and her children will probably experience all kinds of unnecessary injuries because of her bad parenting. I’m sure your niece is fine and I hope your puppy is okay.",
   "created_utc": 1701646176,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvvdic",
   "message": "Tell her she should put her fucking brat down. Ask her how it feels to hear that. You are NTA but your damn sister sure is. And yes, you are right -- your sister owes you for that surgery. Your poor pup. I would not let that little brat around your dog again.",
   "created_utc": 1701647498,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvx9qp",
   "message": "Your sis is definitely the AH. Kids don't down boundaries and think dogs are objects to play with and get all in their faces/space. Secondly, I'm curious about you having a small husky lol is it an actual husky or a pomsky? Or maybe pom mix? Just sounds cool looking",
   "created_utc": 1701648249,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvytnn",
   "message": "NTA.  The kid broke your dog’s leg?! I’d be furious, especially after having removed my animal from the child’s access.  Your sister is a major AH, and unfortunately, your niece paid the price for your sister’s unwillingness to discipline and watch her kids.  The child didn’t deserve it, but there are consequences for actions, and a 4 year old is capable of understanding “no.”  If the adults in the child’s life refuse to set rules and to enforce them, the child can’t learn.  Behaving respectfully towards animals is something all children need to learn.  It’s not your job to police the children. Your dog tolerated the behavior until she was injured, and she reacted the only way dogs know how. It wasn’t a vicious or aggressive attack.  It was defense.  And it was 100% avoidable. \n\nIn the future, I suggest that you remain in your room with your dog when/if your sister and her children visit again.  Since your sister refuses to teach her child to behave, the responsibility of keeping your dog safe and out of a situation where your dog deems a bite necessary falls on you.  Huskies in general are not a good breed to have around children, and children who have no learned to respect animals should never be left unsupervised around any animals.  \n\nI hope your sister pays for your dog’s surgery. I feel bad for your niece that her mother set both her child and your dog up for failure. The bite could’ve been a lot worse.",
   "created_utc": 1701648876,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbvzr2r",
   "message": "Your niece is lucky she just got a bite on the hand!  That poor pup!  Please let us know how she makes out after her surgery.",
   "created_utc": 1701649242,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbw0u9w",
   "message": "NTA. She actually broke your dogs leg??",
   "created_utc": 1701649676,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbw2da4",
   "message": "Both sisters are AH",
   "created_utc": 1701650283,
   "score": 1,
   "submission_id": "189urb3"
  },
  {
   "comment_id": "kbw8gcd",
   "message": "NTA I'm so sorry about your poor pup",
   "created_utc": 1701652885,
   "score": 1,
   "submission_id": "189urb3"
  }
 ]
}