{
 "submission_id": "189y9zx",
 "title": "Aita for only eating a plate of fries at my friends dinner party",
 "selftext": "So I’ve had a bad relationship with food since I was a teenager, I’m 25 now and when I hit 18 my relationship with food turned from bad to worse and instead of only eating a little bit everyday I went days eating nothing, would eat a little bit again and go days again without eating. Long story short I started to get help but I’m still a little rocky, I have foods I’m able to eat a good portion of and foods that straight up terrify me. My friend Crista knows this and she invited me to a dinner party at her place (she’ll be cooking) and at first I politely declined and said I’m sorry but I just don’t feel comfortable with eating around people at the moment and I don’t know if I even will be able to eat whatever you cook. She said don’t worry I’ll cook something you can eat and she asked what I can eat and I said at the moment I can pretty much only eat fries and bananas. She said okay I’ll do that for you, so I accepted in the end. \n\nI was really nervous to go to this dinner party as I didn’t know anyone going except crista, but when I got there all her friends were actually really nice. It came time to eat and I had my plate of fries and crista cooked some sort of creamy pasta for everyone else, it did look nice but I knew I wouldn’t have been able to eat any. I had a couple of questions from her friends like “oh do you not like pasta?” “How come you’re only having that are you fussy hahaha”. I just answered with yeah hahaha I’m quite fussy with food. I got the feeling crista didn’t tell anyone I have an eating disorder, which I didn’t really expect her to so that’s fine, but every time i got a question crista looked mad. \n\nAfter the dinner party I got home and crista called me, she said I should have at least tried some of the pasta as she’s offended I didn’t want any as she slaved away in the kitchen to make it and me just sitting there with my plate of fries took all the attention away from her and her hard work and made it look like she’d invited a child to the dinner party. She said she had multiple questions about it and me afterwards and she was extremely embarrassed. I said I’m sorry I didn’t mean to embarrass you but you knew I wouldn’t be eating what you cooked and you told me originally it was fine. She said I should have at least put a bit on my plate and tried some to take all the attention off me, I feel bad now. I feel like I shouldn’t have went, aita?",
 "created_utc": 1701624246,
 "permalink": "/r/AITAH/comments/189y9zx/aita_for_only_eating_a_plate_of_fries_at_my/",
 "score": 232,
 "url": "https://www.reddit.com/r/AITAH/comments/189y9zx/aita_for_only_eating_a_plate_of_fries_at_my/",
 "comments": [
  {
   "comment_id": "kbu57ke",
   "message": "NTA.\n\n“took all the attention away from her and her hard work and made it look like she’d invited a child to the dinner party”\n\nWow, started out with a narcissistic comment and ended on straight bashing you. She’s an asshole. If she knows you have an eating disorder, she should not be making on comments on the food you eat, ever (unless it’s if she’s worried about your health, which she clearly was not).\n\nYou told her beforehand what you were going to do. And she accepted it. So how on earth can she get mad when you did exactly what you said you would do??\n\nShe’s a bad friend.",
   "created_utc": 1701624749,
   "score": 196,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbu40zu",
   "message": "Absolutely NTA this is clearly someone who doesn’t understand an ED",
   "created_utc": 1701624332,
   "score": 188,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbu5wep",
   "message": "NTA you declined exactly for that and she said it is fine. Not sure what she thought would happen when you made clear what you only can eat right now.",
   "created_utc": 1701624991,
   "score": 135,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbunq9q",
   "message": "I don't understand these friends who care that much about what someone is eating - what sort of idiots expend that much energy on something so inconsequential?\n\nOP, you're better off without all of these fools.",
   "created_utc": 1701631287,
   "score": 100,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbut1ou",
   "message": "NTA. She is though.",
   "created_utc": 1701633210,
   "score": 35,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbutx9i",
   "message": "You're surrounded by assholes!  Every one there was an asshole but you.  I never thought I'd say that in a comment but here we are.",
   "created_utc": 1701633537,
   "score": 34,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbuw8qk",
   "message": "NTA I get frustrated with picky eaters who don’t tell me in advance; it’s demoralizing to make a meal for someone only to have them refuse to eat it.\n\nHowever, you politely declined her dinner party invitation only to have her insist that you attend and assure you that your food restrictions would be accommodated.\n\nIt sounds like she didn’t predict that other guests would be focused on you not eating to the point of not praising her efforts. Even worse, other guests might have believed that you weren’t eating the pasta because you knew something about it that they didn’t such as that your friend doesn’t observe food safety protocols.\n\nNone of this is your fault.",
   "created_utc": 1701634384,
   "score": 24,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbu82q0",
   "message": "NTA. You told her, she decided your feelings don't matter \u0026amp; she thought she'd guilt trip you into eating her food. You did what you'd said you would do. She's the A. For yourself, I hope you get the help you need to be able to eat a more varied diet.",
   "created_utc": 1701625769,
   "score": 20,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbum632",
   "message": "Your friend's concerns were all narcissistic. \"You took attention away from me\" is one of the most obnoxious attitudes out there.\n\nNot to mention you both had it out before you agreed to go.\n\nNTA, but your \"friend\" sure is.",
   "created_utc": 1701630737,
   "score": 16,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvcn03",
   "message": "So, she planned the whole menu. She could have planned it around things you can eat. It could have been burgers and fries or themed around \"fast good at home\" or something. SHE planned this menu, SHE pressured you into going, SHE is the only one to blame for all of it.",
   "created_utc": 1701640309,
   "score": 18,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv9nnv",
   "message": "Well if it isn't the consequences of her own invitation! NTA. She knew full well what the deal was when you agreed to come. If her expectations were different from what she explicitly said to you, that's on her for failing to communicate.",
   "created_utc": 1701639220,
   "score": 7,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv6grm",
   "message": "Oh my goodness, NTA NTA NTA.\nAnd you did really well going out to dinner, you had the right to expect Crista to behave like a supportive friend, I am sorry she behaved like an idiot.",
   "created_utc": 1701638055,
   "score": 8,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbuckwx",
   "message": "NTA, and that isn’t your true friend",
   "created_utc": 1701627376,
   "score": 6,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvq4ml",
   "message": "Don't you dare apologize. She knew about your disorder. You declined the Invitation and she fkn insisted. So she knew a he a d of time you wasn't eating her food just the fries.....she embarrassed herself for insisting its ok for you to come when she knew you weren't going to be able to eat her food. NTA.",
   "created_utc": 1701645450,
   "score": 7,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvsw6e",
   "message": "NTA. If I’ve spent a long time cooking a meal for everyone but made something separate for a picky eater, anyone who makes comments would be shut down by me saying, “leave X alone, they’re not eating the same food, I made something separate for them, so now there’s more for you to enjoy.” Simple.",
   "created_utc": 1701646522,
   "score": 6,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwupjh",
   "message": "NTA. She's just upset because you were getting lots of attention instead of her. The thing is though, that she very easily could have stopped this in the moment with something like \"Hey everyone, let's stop bothering OP about what she's eating. She's eating what she wants and it's not a big deal, so let's not make it one, okay?\" And then redirected the conversation to something else. This is what good hosts do, and not generally because they want all the attention but because it was clearly something that was upsetting you/their guest so she should stop her other guests harassing a different guest.",
   "created_utc": 1701662869,
   "score": 5,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv9y14",
   "message": "NTA. You did the best you could. It's a little weird she started out accommodating and then got really not, she clearly doesn't get it, but that's not your fault. \n\n(And no, you definitely should *not* have pretended to eat some to make her happy. Falling back into disordered eating habits to make random people more comfortable is a terrible idea.)",
   "created_utc": 1701639325,
   "score": 4,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbx0qnh",
   "message": "First of all - I don’t know you but I am proud of you. It is hard to get to that point where you are and I hope this doesn’t turn into a setback for your recovery. \n\nthat said, NTA. you ate what she offered to make for her. she probably thought you would “suck it up” to be polite. but she was the one who was impolite",
   "created_utc": 1701665819,
   "score": 2,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbuis94",
   "message": "No, you probably should not have gone.  Not because *you* did anything wrong, but because these people, including Crista, are all gigantic asses.\n\nYou have nothing to feel bad about.  You warned Crista and she told you that she would be happy to accommodate you.  She lied.",
   "created_utc": 1701629529,
   "score": 2,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbuzj80",
   "message": "NTAH You were open, honest, and clear when I accepted the invite after she said she would accommodate your needs. After that, she should have stuck up for you. She's the AH at this point. I do hope you get better. ED can be very hard without proper support systems. A friend of mine was dealing with it for years by themselves and finally got help. None of us even knew until they came out that they were eating better. But be proud of yourself for even getting out there. Evetging happens for a reason now you know this \"friend\" isn't supportive.",
   "created_utc": 1701635568,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv6545",
   "message": "Nta, as someone with an ED as well, the only one to ever comment on it was my AH MIL, who is a witch. It's not normal to be that hung up on what others eat. Drop the whole friend group, they sound exhausting.",
   "created_utc": 1701637939,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv76ti",
   "message": "NTA - She knew and now wants you to feel bad. Turn down any invites in the future.",
   "created_utc": 1701638318,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv9c1f",
   "message": "I have the same type of eating disorder. I have brought food to friends houses to nibble on. A person caught me almost puking after taking a bite of food and I was like this is really delicious and I am really hungry, but I have an eating disorder. Guess it’s crackers for dinner again. Yay! I don’t look like someone with a food disorder so not everyone really believes it is real and not just “oh look at me!”",
   "created_utc": 1701639101,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvgp00",
   "message": "Oh hell no!!! If she called saying that crap, I would 100% come back with, “excuse me?!? I didn’t want to come to your Di-nner party! Remember?!? I said that I wasn’t yet comfortable in that situation, but you insisted.  Then others started asking and you didn’t do anything to stop the comments. You knew I didn’t want to come for that very reason. I should be upset that you didn’t come to my defense. I thought you were a better friend. I have enough going on, so yeah, I’m not going to worry about your pettiness. Okay. By-bye”. \n\nObligatory NTA.  And good luck with continuing to work on your ED. Don’t let this thing be a set back.",
   "created_utc": 1701641807,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw1b0g",
   "message": "NTA. \"You made fucking pasta Christa. The attention was probably on me because your guests wanted fries over that slop you served Ms. Chef Boyardee.\" All you have to say. She isn't a friend and she literally badgered you into going and knew what to expect. FOr your own health, drop her.\n\nYou politely declined, she didn't accept. You told her your diet and limitations, she acknowledge them, but didn't accept. Now she has the audacity to blame you and act \"blindsided\" you refused to touch the very food you said you wouldn't pre get together.",
   "created_utc": 1701649858,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw8r4z",
   "message": "NTA. \n\nShe’s not a good friend. \n\nAlso props to you for getting out of your comfort zone. I really hope you continue to heal OP and find happiness.",
   "created_utc": 1701653013,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwm1r5",
   "message": "NTA. She pushed you into going and then didn't like it when you did exactly what you had told her you were going to do. It's not like you can help it. \nI hope your recovery goes well. Sending all the good vibes your way 🩷",
   "created_utc": 1701658873,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwnt40",
   "message": "NTA. Your friend knew of your eating disorder and consented to you eating just fries in advance. She doesn’t sound like much of a friend tbh.",
   "created_utc": 1701659658,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwu0uk",
   "message": "NTA at all.",
   "created_utc": 1701662550,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwzpnn",
   "message": "NTA. \n\nSo you invited a person who has an eating disorder to a dinner party, agreed to cook the only dish she can eat and you're angry because she ruined the party. \n\nSo do we invite the kid with the peanut allergy to the house for peanut butter sandwiches? \n\nDo we invite the alcoholic over for a wine tasting and get mad when he only drinks Kool aid?\n\nYou see what I'm getting at? Nice friend.",
   "created_utc": 1701665271,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbuijta",
   "message": "Well that was a crappy experience for you and your friend. That said, sit down dinner parties are a normal thing among friends and people notice if you aren’t able to enjoy a meal. For yourself and your future social life consider counselling about your food issues. Use this as an opportunity to make your life better instead of an excuse to isolate yourself from friends.",
   "created_utc": 1701629446,
   "score": 246,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbu6x4l",
   "message": "[removed]",
   "created_utc": 1701625355,
   "score": 226,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv257q",
   "message": "very very much NTA",
   "created_utc": 1701636488,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv3rkm",
   "message": "NTA. She sounds like a shitty friend.",
   "created_utc": 1701637071,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbv6y7f",
   "message": "NTA, and she does NOT, in fact, understand your struggles with food if she behaved like this. In fact, in her shoes, I would have let you know about the party, if you wanted to go, but stressed there’s no pressure to attend. Mostly because I’d want you to know you’re always welcome. She’s not a good friend if she puts you in this position, assures you that your needs will be accommodated, then attacks you over it after the fact.",
   "created_utc": 1701638231,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvcnxy",
   "message": "NTA\n\n\" took all the attention away from her\" this is the real issue here, not what you ate. She's pissed because she wasn't the center of attention.",
   "created_utc": 1701640319,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvfe85",
   "message": "NTA - no one should care, question, or discuss what someone else is or is not eating at a social function. As someone who battled multiple ED in my twenties, I am sorry you are dealing with this",
   "created_utc": 1701641313,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvhah8",
   "message": "Well, you tried to tell her...",
   "created_utc": 1701642028,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvi0j1",
   "message": "NTA. I also have a similar issue. My friends are much nicer, if we go out I always say as long as there's chips on the menu, I don't mind where we go. \n\nEating at people's houses, I always offer to bring my own or pay towards any separate meal, all my friends are nice about it and there's zero pressure to try anything. \n\nWhen I went for dinner with my friends and her friends, she made sure I was not alone as I didn't know them, my chips and rice were mentioned once and dropped instantly when I said I'm a really fussy eater, I'll be sick if I try new foods. \nShe doesn't sound like a real friend at all, real friends are supportive.",
   "created_utc": 1701642295,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvjhq5",
   "message": "NTA, I'm just like you and would have been perfectly happy with a plate of fries. You communicated to her how you feel and she was OK with it. She's TA for not honoring her promise!",
   "created_utc": 1701642851,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvjjj0",
   "message": "NTA. I'm glad you were able to eat something. I used to be really anxious at the thought of eating around people, especially people I didn't know too well. And I remember feeling pretty damn proud of myself when I could finally eat around acquaintances and strangers without being anxious. Your friend sucks.",
   "created_utc": 1701642870,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvmdmk",
   "message": "Dude fuck her wtf",
   "created_utc": 1701643963,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvme3q",
   "message": "NTA \n\nShame on her for not turning the conversation away from the food to more neutral ground. She was a horrible hostess.",
   "created_utc": 1701643968,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbvsbj2",
   "message": "NTA bro Crista seemed great... had me in the first half ngl. I guess she couldn't handle you getting all the attention? Which is laughable when I doubt you wanted that kind of attention anyway!",
   "created_utc": 1701646300,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw13ux",
   "message": "NTA, and I'm a be honest that's not a good friend. Do yourself a favor and leave her alone. She is an AH.",
   "created_utc": 1701649781,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw15yu",
   "message": "Completely, totally, 100% NTA. Clearly, your friend never learned any manners. There should never be any comments on what a guest in your home is eating any more than there should be any comments on what they're doing in the bathroom. I don't care if you sat down and enjoyed a plate full of wood chips and Legos, the host's job is not to draw attention to your eating habits, other than to cheerfully offer seconds. This was a big step for you, and instead of being proud of you and making sure you had a good time, she decided to be mean about something that isn't even your fault. Your friend is not a safe person.",
   "created_utc": 1701649804,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw3j9q",
   "message": "Very much NTA\n\nFrom the sounds of this friend, if instead of a eating disorder, you had something like a deadly allergy to one of the ingredients in her dish, then she would probably have this exact same reaction.\n\nThis seems like one of those situations that can set you back on any of the progress you've made, this is 100% not your fault, so please don't let this be anything more than just someone not really grasping what your issues are.",
   "created_utc": 1701650774,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw6sm5",
   "message": "NTA. You communicated very clearly in advance and she insisted that you would be welcome, so she doesn't get to complain if you handled it exactly how you said you would. If she doesn't like it, she can quit pressuring you into situations that make her feel awkward.",
   "created_utc": 1701652168,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw819v",
   "message": "While you're NTA, you should have at least told the host your reasons.  They're not going to see this as a hard boundary for you with zero context, so that boundary will be pushed as you're among friends.  Someone there needed to know it wasn't a preference, but a trigger.  Your pride made you an object of interest.",
   "created_utc": 1701652707,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbw9mft",
   "message": "Okay, I agree that she's NTA, but dinner party etiquette requests that guests \"show interest in the food.\" I know that we don't train people in formal etiquette anymore, but if you have had some lessons, one of the first rules is that rejecting your host's food is considered rude.   \n\nThis is a special situation, but she could have done what I do with my MIL'S horrible pistachio lime congealed salad, which is to take a little on my plate and find creative ways to push it around until it looks like I've eaten some.   \n\nOP is still NTA because she has an ED. But it's never a bad look to follow the rules of etiquette.",
   "created_utc": 1701653392,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwat5j",
   "message": "NTA. Could be a few things. She may be deflecting her emotions onto you. It’s hard not being able to help someone you care about. You just eating the fries, it puts it in the forefront and is seeing it for herself rather than denial or out of sight out of mind. Her anger may be fear. Still not right what she did.\nOr maybe she felt she could be the “savior”. If you would have tried the pasta, it’s essentially a pat on her back even if it set you back. Some ppl only care about themselves. If she was so worried about how others would feel then she shouldn’t have pushed you to go. She could have asked her friends to leave it be also. Regardless, you need better friends bc she isn’t one",
   "created_utc": 1701653901,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwdasa",
   "message": "I don’t even have a diagnosed ED just a bunch of neuroses about food and texture and no gallbladder. My amazing friend group remembers them better than I do. “Carinne, remember last time you thought its be a good idea to try that and your guts exploded all over my toilet?” They’re always going the extra mile for me without even thinking about it. As I do for them. Thats how friendships work. NTA, you need better friends.",
   "created_utc": 1701654973,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwh7ab",
   "message": "As someone who struggles with fiid myself and even though I've gotten better still hate eating with unknown people, or large groups and feel anxiety about it. It's not your fault. You guys had an agreement. She wasn't happy. That's on her not you",
   "created_utc": 1701656689,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwxqmj",
   "message": "She shouldn't have been persistent on you coming of she knew this was a possibility. She's the asshole.",
   "created_utc": 1701664282,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbwxyia",
   "message": "Why do people find it necessary to comment on what someone else is eating? These days there are soooo many different dietary needs. It doesn’t hurt a single other person at the table. People should just shut their trap. \n\nAs a hostess, your friend should have redirected the questions. She certainly doesn’t get to berate you, especially because the two of you had discussed it before! \n\nI’m glad you’re seeking help. I hope that one day it will stop being such a problem for you. I wish you peace!",
   "created_utc": 1701664382,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbx20av",
   "message": "Awe, not the asshole. I'm sorry you were put in that situation.",
   "created_utc": 1701666519,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbx4i27",
   "message": "There’s a point in healing from an eating disorder means trying new foods that aren’t safe. If you’re not at that point, then forcing it won’t do anything but harm you and make you more averse to foods. \n\nYour issue was explained to her. If she was that embarrassed she could have made up literally any other excuse. Ie: you didn’t know you could make it till last minute and wanted to eat light. You’re allergic to the cheese and she didn’t know. \n\nHer embarrassment is her problem. NTA.",
   "created_utc": 1701667966,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbx4z1m",
   "message": "You tried not to go and crista talked you into it. You did exactly what you said you were going to do….what is her problem? I’d tell her that she’s being unreasonable and you don’t need this shit in your life. So she can either drop it or your friendship is over. NTA",
   "created_utc": 1701668251,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbx558z",
   "message": "NTA. You flat out told her up front.",
   "created_utc": 1701668358,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbx6dyl",
   "message": "NTA. She's just upset all the attention wasn't on her. I mean you literally declined the invitation and she went out of her way to ask you what she could make you. She's just petty and jealous.",
   "created_utc": 1701669133,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbxfly7",
   "message": "r/amitheangel",
   "created_utc": 1701675660,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbxr33x",
   "message": "No, eat whatever you want.",
   "created_utc": 1701685228,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbxshxq",
   "message": "NTA. You declined, she insisted despite knowing it was putting you in a really difficult situtaion. \n\nShe probably thought she could cure your eating disorder with her incredible cooking. Unfortuantely the food is likely not the main issue though. This is like trying to fix a broken leg by signing them up to half marathon.",
   "created_utc": 1701686390,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbxxm6l",
   "message": "NTA.\n\nShe was rather rude for chewing you out about it, and at the same time, you could have handled it perhaps slightly better: when you sit down to eat and people start to question, you could announce, so everyone can hear, \"I'd like to thank Crista for accommodating my weird dietary needs. It has been really nice to meet everyone and to be able to have a meal outside my home without having to worry about it. I hope you will all enjoy your beautiful food and not be concerned with what I am eating: Crista and I talked it over, and I don't like to discuss it.\"\n\nThis serves three purposes:\n\n1. It discourages them from prying into your dietary concerns because you said outright that you don't like to discuss it.\n2. It makes clear to Crista that you did indeed observe the food and you are standing by your statement that you are unable to eat it.\n3. By thanking her, this not only makes clear that you are grateful for what she has done for you, but also puts her in the position that she is uncomfortable criticising you about it.",
   "created_utc": 1701690250,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kbxzjju",
   "message": "NTA. She reassured you she would cook what you could eat because she wanted you there. She should have given the others a heads up instead of berating you like that. She was way out of order saying what she said. Don't talk to her again. That's not a friend. A true friend would be very understanding and would explain to her friends what's what and defend you.",
   "created_utc": 1701691532,
   "score": 1,
   "submission_id": "189y9zx"
  },
  {
   "comment_id": "kby15lc",
   "message": "NTA. She is your friend, she knows your history and she should've had your back instead of worrying about her dinner party not being perfect. \n\nThere have been different times in my group of friends friendship where we have all been able to eat or not eat different things. We always make sure to have food everyone can eat and we leave people alone to eat whatever they want. Like when one friend got braces, we had soft foods. When someone was pregnant we didn't get foods that made her feel ill. When someone had weight loss surgery we got foods with lots of protein for her.",
   "created_utc": 1701692556,
   "score": 1,
   "submission_id": "189y9zx"
  }
 ]
}