{
 "submission_id": "189y9zx",
 "title": "Aita for only eating a plate of fries at my friends dinner party",
 "selftext": "So I’ve had a bad relationship with food since I was a teenager, I’m 25 now and when I hit 18 my relationship with food turned from bad to worse and instead of only eating a little bit everyday I went days eating nothing, would eat a little bit again and go days again without eating. Long story short I started to get help but I’m still a little rocky, I have foods I’m able to eat a good portion of and foods that straight up terrify me. My friend Crista knows this and she invited me to a dinner party at her place (she’ll be cooking) and at first I politely declined and said I’m sorry but I just don’t feel comfortable with eating around people at the moment and I don’t know if I even will be able to eat whatever you cook. She said don’t worry I’ll cook something you can eat and she asked what I can eat and I said at the moment I can pretty much only eat fries and bananas. She said okay I’ll do that for you, so I accepted in the end. \n\nI was really nervous to go to this dinner party as I didn’t know anyone going except crista, but when I got there all her friends were actually really nice. It came time to eat and I had my plate of fries and crista cooked some sort of creamy pasta for everyone else, it did look nice but I knew I wouldn’t have been able to eat any. I had a couple of questions from her friends like “oh do you not like pasta?” “How come you’re only having that are you fussy hahaha”. I just answered with yeah hahaha I’m quite fussy with food. I got the feeling crista didn’t tell anyone I have an eating disorder, which I didn’t really expect her to so that’s fine, but every time i got a question crista looked mad. \n\nAfter the dinner party I got home and crista called me, she said I should have at least tried some of the pasta as she’s offended I didn’t want any as she slaved away in the kitchen to make it and me just sitting there with my plate of fries took all the attention away from her and her hard work and made it look like she’d invited a child to the dinner party. She said she had multiple questions about it and me afterwards and she was extremely embarrassed. I said I’m sorry I didn’t mean to embarrass you but you knew I wouldn’t be eating what you cooked and you told me originally it was fine. She said I should have at least put a bit on my plate and tried some to take all the attention off me, I feel bad now. I feel like I shouldn’t have went, aita?",
 "created_utc": 1701624246,
 "permalink": "/r/AITAH/comments/189y9zx/aita_for_only_eating_a_plate_of_fries_at_my/",
 "score": 2,
 "url": "https://www.reddit.com/r/AITAH/comments/189y9zx/aita_for_only_eating_a_plate_of_fries_at_my/",
 "comments": []
}