{
 "submission_id": "189zcyk",
 "title": "AITAH: She's pregnant and i kicked her out",
 "selftext": "TLDR: girl is a abusive mooch who doesn't know which guy got her pregnant. And i decided i owe her nothing and I'm not going to sacrifice my mental well being for her so i kicked her out regardless of her situation.\n\nAnd about a year ago, I met a girl. We started hanging out and having sex. Eventually we realized that we were not going to work out because of our differences. \n\n   Sometime passed and we started hanging out again, but we really started hanging out when I needed help for my rent. The rest is just shitty. She has probably lived in my house for about nine months now, and out of that nine months she has paid me for one month of rent. \n\n   I have covered every bill and expense. We tried to have a relationship but things were not going well. I tried to give her all of me. All of my dedication. I genuinely wanted to take care of her and provide for her and love her.\n\nI found out that a man has been sending her large amounts of money As when I met her she was a stripper and apparently continuing To collect money from this guy after she got pregnant. I thought about contacting the guy and beating his ass or apologizing for her behavior because that man shouldnt spend money on some girl Who is manipulating him. But I couldn't bring myself to it. \n\n\nIn the 9 or so months that she staying here, she only paid one month of rent. The month of rent that she paid was money that just came from some dude. the entire time Shes never actually provided anything her self. When she got pregnant was really when she started to dig her claws in to me. She played on the fact that i want to be there for my child but after everything and all my efforts. spending thousands on baby stuff, letting her live in my house rent free, taking her out to eat She continue time after time to get Abusive with me. I have been In abusive relationships for quite some time so this isn't my first rodeo. I saw the warning signs, destruction of my property, physically hitting and hurting me, screaming and telling me things like how she wishes I would just die or kill myself.  Getting in my face and saying what are you gonna do about it? She's been arrested twice on domestic violence charges. When I found out that she was collecting money from other guys I ask her is that baby even mine? Her answer? \" im 99% sure its yours\". \n\nWe separated but not for too long. I really want to be the father of that boy but its eating me alive. she says pregnant with my kid, so naturally on Thanksgiving when she asked if we could spend it together and I was already alone I said sure. \n\nShe showed up with a positive attitude, and you can tell she's trying to kiss my ass. But, she never left, She never even asked to stay, she just assumed that it was my responsibility to take care of her because she's pregnant. I can be honest that today nothing in particular Really set me off, it's just been her presence in my household that has sent me into a downward depression. I screamed at her today And told her that I am not comfortable with her in my house, that I thought she was using me, that I know she doesn't actually want to be with me, She just wants a place to live. Her attitude hasn't been nearly as bad as it has been but I can't seem to forgive her for the way that she treated me when I tried to give her everything.\n\nIf that is my son, I will inherently Feel guilty as I'm not just kicking her out I'm kicking him out too. But he might not even be fucking mine ! \n\n\nToday I kicked her out. Sent her packing. 7 1/2 months pregnant. \nWith no place to go, no money, And her own family who wont help her Because of her attitude. I have spent time on the streets being homeless. I know what it's like. But what am I supposed to do? Put up with the abuse, Because she's pregnant? I told her that I will pay her child support, that I want to see my son, but her and I cannot live together.\n\nShe's already gone And I am already feeling sick about. So just tell me, am I the asshole?",
 "created_utc": 1701627197,
 "permalink": "/r/AITAH/comments/189zcyk/aitah_shes_pregnant_and_i_kicked_her_out/",
 "score": 127,
 "url": "https://www.reddit.com/r/AITAH/comments/189zcyk/aitah_shes_pregnant_and_i_kicked_her_out/",
 "comments": [
  {
   "comment_id": "kbugroh",
   "message": "NTA\nGet a DNA test and if the child is yours, be there for the child.\n\nAlso - condoms",
   "created_utc": 1701628814,
   "score": 11,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbulzzw",
   "message": "Get a DNA test if it yours step up but be co-parents and send some child support, otherwise go NC with her",
   "created_utc": 1701630677,
   "score": 84,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbuix5w",
   "message": "She's been lying, conning you, and abusing you. I don't think anyone would expect you to continue allowing her to live with you, especially without paying rent. Whether she was paying rent or not, in her mind she'd probably see it as a reason to continue using/abusing you. \n\nI hope you do get a DNA test before you decide to start paying child support.",
   "created_utc": 1701629577,
   "score": 62,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbuqgv7",
   "message": "The guy who keeps sending her money can take her in. Get a dna test",
   "created_utc": 1701632269,
   "score": 14,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbudvfl",
   "message": "Find out if it’s yours. I know being attached to this woman for 18 years would suck but if the kid is yours, it’s the right thing to do and support the kid. \n\nOutside of that, disengage entirely.",
   "created_utc": 1701627822,
   "score": 24,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbv2uyb",
   "message": "She can do a DNA test now. Don't let her back in, even if it is your kid. You can file for custody, if it is your kid.",
   "created_utc": 1701636741,
   "score": 9,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbuwgz9",
   "message": "NTA\n\nBelieve it or not, and this is potentially contentious to say as there are self-indulgent twats on both sides of the political pond, but just because that might be your child doesn't mean that has to be your girlfriend. You aren't obliged to a psycho abusive bitch just because she's having your kid, and frankly if you're more stable than her than document her behaviour, get a DNA test, and file against her if you can manage. Put no name on the birth certificate unless you have a positive DNA test handed to you by a professional.",
   "created_utc": 1701634465,
   "score": 8,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbv6qyd",
   "message": "You can get the DNA test now, don’t wait until the baby is born.",
   "created_utc": 1701638157,
   "score": 4,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbueqom",
   "message": "Take a DNA test, find out if the baby is yours. If not, then wish her good riddance. If it is yours then you should do everything in your power to be near that child, but not near that woman. Lawyer up.",
   "created_utc": 1701628119,
   "score": 5,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbvfnri",
   "message": "NTA  If DNA test shows baby is yours the chances are high from the type of person she sounds like she is she may let you have full custody. If she does get her to sign her rights away so she can't come back and try to take baby.",
   "created_utc": 1701641412,
   "score": 3,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbvsdny",
   "message": "NTA. Don’t let her use the pregnancy against you. Pregnant or not, she’s abusive and toxic. SHE put herself AND the baby in this mess. Not you for refusing to take her BS. 1000% start by getting a paternity test. If he’s yours, you can be there for the baby without being with the mother. Otherwise, the men sending her money can take her crazy a$$ in.",
   "created_utc": 1701646322,
   "score": 3,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbvccu3",
   "message": "What a mess to bring a child into. ESH. #1 Get therapy to deal with your emotional issues. #2 Get the courts involved to order a paternity test.  A noninvasive, low risk test exists that can be done prior to birth. #3 Get a lawyer and get custody of your kid, if he’s yours, and take a parenting class or two before he’s born.  Again, and I cannot stress this enough, therapy.  Yikes.",
   "created_utc": 1701640208,
   "score": 2,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbvmrkf",
   "message": "NTA\nGet tested for STI and a dna test.",
   "created_utc": 1701644115,
   "score": 2,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbvnkxl",
   "message": "Get a DNA test and get full custody if its yours",
   "created_utc": 1701644440,
   "score": 2,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbvztna",
   "message": "DNA test before anything else",
   "created_utc": 1701649270,
   "score": 2,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbw4vb4",
   "message": "You can get a dna test now, easily, from blood draw, you can get a paternity test somewhere around the 11 week mark iirc. But even if you are the father you have no responsibility to house her, let alone for free.\n\nNTA.",
   "created_utc": 1701651340,
   "score": 2,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbunmoq",
   "message": "NTA, you need to have some space and she needs to grow TF up. Get a DNA test, if it's yours you, given what you've said about her capabilities, you may want to lawyer up and push for primary, if not sole, custody of the child",
   "created_utc": 1701631252,
   "score": 3,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbug08i",
   "message": "[removed]",
   "created_utc": 1701628551,
   "score": 1,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbulzbc",
   "message": "Your a cuck and seem to enjoy it",
   "created_utc": 1701630670,
   "score": 240,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbw29ji",
   "message": "Don’t bother to feel that. You tried to help but she refused. She’s too dumb player. Stop helping her.  She has to hit herself until she gets to wake up and realize it’s real life. She has to work on her ass. Stay away from her.  \n\nYou wonder why her family don’t help her. This is why she is crazy girl!",
   "created_utc": 1701650241,
   "score": 1,
   "submission_id": "189zcyk"
  },
  {
   "comment_id": "kbw68hi",
   "message": "NTA but you'll be the asshole to yourself if you let her come back in.\n\nIf you have a history of getting into relationships with abusive women, you probably need some type of therapy to sort it out so you don't keep on falling into this trap.",
   "created_utc": 1701651927,
   "score": 1,
   "submission_id": "189zcyk"
  }
 ]
}