{
 "submission_id": "189zu5w",
 "title": "AITAH My husband asked me if he could watch porn while I was pleasuring him.",
 "selftext": "We(37M +46F) recently got married and l noticed we both watch a bit of porn since we had no recent sexual partners before marriage. It became more obvious when he started watching porn as I gave him handjobs and BJs.  I didn't say anything because it was a quieter and quicker way to cum.  We live with his mom and now have long term guests.  For him, he said it gives him that extra 'motivation' to cum.\nI then noticed he preferred handjobs and BJs than penetration. When I asked him he said he prefers penetration but he can't really cum that way.  So I finish him off with BJs. And he has started to watch porn while we have intercourse.\nSo I proposed we watch less porn and not have sex everyday.  Every other day or just a bit of teasing and fondling on the inbetwern days.  He agreed and seemed fine.\nThat same day but at night we had fallen asleep but in the middle of the night we wanted to do it.  I was giving him a BJ and it seemed like he was really enjoying it.  He does every time.  But he asked if he could watch \"a video\"(porn).  I stopped and cleaned my face off.  And rolled over, cried(silently) mysekf to sleep.  He was silent.  He had spooned me but then turned around to sleep.  \nSo AITAH for stopping as soon as he asked to watch porn on the same day he agreed we should stop?\nHow would you handle this?\n\nUPDATE: My husband has read the post and comments.  We have discussed the issues and will work together.  We will both stop watching porn and have more quality over quantity time in the bedroom. If things need to be talked over with a therapist, we will.  Thank you for the comments, advice, support, and opinions.  You were all very polite and I greatly appreciate how much this has enlightened me and given my insight from different perspectives.  Bless you all. May your sex life flourish. Thank you from the heart. ",
 "created_utc": 1701628493,
 "permalink": "/r/AITAH/comments/189zu5w/aitah_my_husband_asked_me_if_he_could_watch_porn/",
 "score": 253,
 "url": "https://www.reddit.com/r/AITAH/comments/189zu5w/aitah_my_husband_asked_me_if_he_could_watch_porn/",
 "comments": [
  {
   "comment_id": "kbvrq4y",
   "message": "The fact that he is not at all concerned about your enjoyment of sex is very problematic. I guess in porn the women act like it’s the greatest sex they’ve ever had no matter what they’re doing, so he is totally warped about what real women actually want. You owe him nothing until he addresses his issue.",
   "created_utc": 1701646062,
   "score": 38,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvcw41",
   "message": "I’m just saying, why can’t he play with your boobs during the oral acts? Why use porn when the real deal is right in front of you?",
   "created_utc": 1701640401,
   "score": 16,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuuou0",
   "message": "NTA. he needs some kind of detox. Not sure how to make it work but he definitely needs to figure out how to be as aroused with his partner as he is by visual stimulation from random stuff.",
   "created_utc": 1701633817,
   "score": 174,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbujw3l",
   "message": "NTA. right now he has his brain rewired for dopamine hits from the porn. it happens. no big deal unless he doesn’t want to change. it will take probably 6 months to undo.  he probably doesn’t even know or understand the responses.  do a little research together and he needs to concentrate and sexual excitement with you. neither of you be discouraged but it won’t turn around overnight.",
   "created_utc": 1701629926,
   "score": 138,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvjm8n",
   "message": "He can’t cum through intercouse with you because his dopamine has become desensitized. He’s basically developed an addiction to hardcore stimulus. You put a VR head set on him and have him penetrated you and I bet he would cum. He can no longer ejaculate without hardcore material. \n\nThis is a problem.",
   "created_utc": 1701642899,
   "score": 100,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvqa3u",
   "message": "NTA. His porn usage is a problem, and if he's struggling to come from penetration and can only do so through hj/bj AND watching porn he has an issue.\n\nHe needs to stop using porn, full stop, for a decent amount of time and get out of needing it. It's absolutely not cool to need porn to cum while with your partner.",
   "created_utc": 1701645507,
   "score": 44,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvxlc2",
   "message": "I stopped watching porn, back to normal arousal. Porn is a sick addiction.",
   "created_utc": 1701648379,
   "score": 36,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvizgb",
   "message": "I'd pretty much cry forever if my husband asked this. I'd feel like a flesh light",
   "created_utc": 1701642657,
   "score": 74,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbve95z",
   "message": "NTA. Although, I will say that I couldn't be with someone who behaved this way. It makes you feel small and insignificant. I personally have no desire to ever feel like a vessel again. It's painful.",
   "created_utc": 1701640891,
   "score": 112,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuxep9",
   "message": "NTA. I’m sorry you had that situation happen to you! My man sounds like he needs a little help. As addictive as it is, he’s got some wonky wiring in his brain from porn.\n\nIf he wants any resources to help work on things, visit r/pornfree. The people are kind and there are lots of ways to help him work on himself over there.\n\nAs a note, if the idea of just using your partner as your form of arousal and starting to stop watching porn interests you too, there’s a sub dedicated to women at r/pornfreewomen.",
   "created_utc": 1701634808,
   "score": 77,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvqnln",
   "message": "Literal porn addiction.",
   "created_utc": 1701645649,
   "score": 23,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuxkwf",
   "message": "Am I reading correctly that this lunatic receives blowjobs almost on a daily basis? Videos on a systematic basis is insulting, he needs counceling to get off of it",
   "created_utc": 1701634871,
   "score": 8,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvohfs",
   "message": "Another huge problem might be that he needs more deviant porn to get off as well. As the brain can become desensitized and need more and more for a thrill. Just to protect myself I would check his search history and see what he’s watching when you are not there",
   "created_utc": 1701644801,
   "score": 19,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvz93u",
   "message": "NTA. Your husband is pornsick and needs therapy.\n\nYou mentioned you live with his mom. Would you have somewhere to go if you needed to leave? It's really important that you aren't stuck/trapped living with him, *if* you decide you don't want to be.",
   "created_utc": 1701649051,
   "score": 20,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvk3qf",
   "message": "I spent 14 yrs with a man who couldn’t have a good time without porn, even to the point of having it on his phone and putting it on my chest. Y’all need a sex counselor or to call it quits",
   "created_utc": 1701643084,
   "score": 17,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuz53c",
   "message": "NTA you both need couples counseling. Sexual dysfunction kills relationships if not addressed.",
   "created_utc": 1701635433,
   "score": 143,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbv050x",
   "message": "Porn will do messed up shit to your brain.\n\nLet him know that it hurts your feelings to use porn to finish literally right there as you blow him, and while you’re generally ok with porn usage as a whole, his addiction seems to have gotten to the point that he needs to go cold Turkey on it because it’s not under control.\n\nThat doesn’t mean stop for a few weeks and then hop back on; he doesn’t need to use pornography again, ever, because once you let an addiction control your actions this much, you can’t ever get to a healthy level of usage of that thing again. An alcoholic can’t return to having “just a cold one with the boys”. He’s done, or you need to move on.",
   "created_utc": 1701635779,
   "score": 53,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvqvl9",
   "message": "ok all the top comments are right but also he is an AH for not comforting you. He knows its something you don’t like and his request clearly upset you and he completely ignored it. That’s fucked up",
   "created_utc": 1701645735,
   "score": 29,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvyi3e",
   "message": "In my experience when my partners only wanted bjs and didn’t want mutually pleasurable sex, it lead to a dead bedroom or the demise of the relationship.  He has porno brain where he has been trained to be selfish and because of your attention and affection, he doesn’t have to put in any effort at all to get off or to be with you sexually. I’ve found it wasn’t worth trying to fix at the point where, I said how I felt and things were good for a little while then right back how they were. Maybe he shouldn’t have a wife, maybe he should have a masturbator toy. He’s giving you no effort at all.",
   "created_utc": 1701648745,
   "score": 30,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvsm1n",
   "message": "I would die inside if someone asked to watch porn while having sex or receiving  pleasure from me. He is pretty much using your body to masterbate to other women… yuck. I am so sorry he is like that and you have every right to be hurt. He has a porn addiction and he needs to figure it out and cut it out if he wants to be with you. Your pleasure and intimacy matter. I’m glad you posted bc I noticed others commenting about porn addiction and I hope that you both can read about it’s effects on dopamine and it helps :)",
   "created_utc": 1701646411,
   "score": 40,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbviptg",
   "message": "I encourage you to join the loveafterporn sub for support, understanding and resources.",
   "created_utc": 1701642556,
   "score": 11,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvkw4q",
   "message": "God he sounds like a genuinely exhausting lay.",
   "created_utc": 1701643386,
   "score": 11,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvw9lg",
   "message": "Nta.  He's addicted to porn and it's affecting your relationship.  Nip it in the bud now.  Like. He's legit showing signs of addiction.",
   "created_utc": 1701647846,
   "score": 11,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvdmds",
   "message": "Nta, porn fries dudes brains.\n\nHe needs to want to change, or nothing else will matter. He should be ashamed that he has a willing partner and he'd rather watch cyber crap than be present with you",
   "created_utc": 1701640666,
   "score": 30,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuxuo1",
   "message": "Do what my I did.  Hexwhined, begged, and pleaded. I pick up a porn video while at the rental store.  I returned with gay porn and handed it over.",
   "created_utc": 1701634967,
   "score": 18,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw4ojf",
   "message": "Why are you 46 in one post and in your 30’s a few days later?",
   "created_utc": 1701651260,
   "score": 8,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw15zp",
   "message": "This is why everyone needs to stop watching porn. A literally human woman is currently sucking your dangler and that isn’t enough on its own. It’s sad.",
   "created_utc": 1701649804,
   "score": 12,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvodgl",
   "message": "He can’t cum otherwise because he’s overstimulated from porn and rubbing himself too hard. If he stops watching porn and touching himself so hard and often it would feel completely different.",
   "created_utc": 1701644757,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvwdrf",
   "message": "I personally wouldn't allow porn during sex unless its in the background for both of us.",
   "created_utc": 1701647890,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvxlaz",
   "message": "NTA. This sounds like he has a porn addiction or is developing one.",
   "created_utc": 1701648378,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw1682",
   "message": "Bro is addicted",
   "created_utc": 1701649806,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw1rxt",
   "message": "NTA, this is a porn addicted man",
   "created_utc": 1701650047,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw8w2n",
   "message": "pretty sad. I can't imagine preferring to watch porn when  there is someone right in front of you. your self esteem deserves better.",
   "created_utc": 1701653073,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvac6i",
   "message": "NTA\n\nAlso, can we all celebrate how healthy your libidos are? You’ll have a lot to work with once you find some strategies for the porn.",
   "created_utc": 1701639466,
   "score": 16,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw6fvq",
   "message": "dear god this is so pathetic to read... porn addicted loser that lives with his mom lmao get some self respect",
   "created_utc": 1701652016,
   "score": 12,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kburgek",
   "message": "Turn on a porn for him, but the surprise will be a porn of you BJing another guy. Then sit back, grab some popcorn  and watch the reaction",
   "created_utc": 1701632628,
   "score": 82,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvmziv",
   "message": "NTA. Porn can really affect a sexual relationship.",
   "created_utc": 1701644205,
   "score": 4,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvokpc",
   "message": "Yeah, it sounds like he has a pretty serious porn addiction. Not so much a moral failing as a neurochemical issue to work through, ideally with some professional help \n\nThe most generous take I could give, is that he might have been starting to go soft/was worried he wouldn't be able to cum at all without video + physical stimulation, and that he might have thought *that* would upset you more/make you feel more insecure than asking to watch porn during the bj. \n\nHonestly, that wouldn't surprise me one bit. It might be helpful to tell him clearly, openly and lovingly, using slightly more choice words than these, that you would rather he go soft/not be able to cum and just have a nice time, rather than watch porn to be able to finish. ♥️",
   "created_utc": 1701644837,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvxyg3",
   "message": "NTA. he has rewired his brain for porn. this is a nasty addiction! i’m like you, i love pleasing my husband! sex anytime anywhere. i love giving bj’s and hj’s! but we cannot compete with the screen. dopamine hit is higher than actual sex. my husband is one of the most loving sweet men, but he had lost himself to this addiction. he decided a couple months ago he needed help. just today he has decided to get blockers! like i said, this addiction is no joke and like you i was in the dark. i had no idea what i was in for, it was a lot of hurt. your husband seems to be very addicted, intimacy is supposed to be special and focused on you two. im so sorry. bring this up and have conversations with him. from experience and what i know, he WILL need help. whether that’s a therapist, accountability partner, blockers, 12 step program etc. mine has an accountability partner, he is getting a therapist and of course now as of today blockers. this destroys marriages, i think its 56% of divorces one partner has an obsession with pornography. this is a lot, but please have that conversation with him. see what he says. is he interested in recovery?",
   "created_utc": 1701648519,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvzwlh",
   "message": " No, that’s absurd.  That’s the exact opposite of intimate.  Hell no.  if anyone is the asshole here it’s me,  I’m giving you permission to tell him absolutely not.",
   "created_utc": 1701649302,
   "score": 4,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwjx4i",
   "message": "Porn is a tough mistress to deal with. On the one hand you have to understand that habit is hard to kick and it messes with your reward system. Normal sex might be hard if you're hooked up to porn like that. Porn also messes with your expectations of sex. People don't look that great naked without a full lighting rig and tons of makeup. Getting aroused with normal people after consuming a lot of porn can be challenging. Your current setup, with MIL and guests around doesn't sound too exciting either! \n\nBut you're not a fleshlight. You need to connect with him during sex and him being glued to the screen isn't it. It doesn't help that he's not respecting boundaries and not sharing your goals for better sex, either. Please go through some educational material on porn addiction with him and consider one visit to a couples or sex therapist.\n\n\u0026amp;#x200B;\n\nedit: Of course NTA.",
   "created_utc": 1701657919,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbunaao",
   "message": "it sounds like you're both viewing sex as a chore. Have y'all ever thought about doing therapy? Either apart or together?",
   "created_utc": 1701631131,
   "score": 13,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvenwx",
   "message": "NTA. Your husband seems to really have a porn problem. As far as I'm concerned, if his mind isn't focused on your during sex, that's an issue. Please know that this has nothing to do with you. It's 100% his problem and doesn't reflect on you at all. If he can't (or won't) cut back on his own (or if it doesn't help) it may be necessary to seek the help of a therapist.",
   "created_utc": 1701641042,
   "score": 10,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbv79ey",
   "message": "You are NTA, he’s likely addicted to it. Porn rewires the brain, causes memory issues, creates anger/temper, and just escalates. There’s information out there to give you a better understanding. Fightthenewdrug.com has some good information and resources.",
   "created_utc": 1701638345,
   "score": 18,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuw9nu",
   "message": "This man is weird as hell, NTA",
   "created_utc": 1701634393,
   "score": 13,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvi5p1",
   "message": "A sex therapist would probably be helpful. He likely has a porn addiction. Nta.",
   "created_utc": 1701642349,
   "score": 4,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvnudk",
   "message": "definitely NTA! I was having trouble with finishing with my partner as a result of consuming too much porn. porn addiction and its impacts on peoples' sex lives is super common but not widely discussed because there is so much stigma about it. I felt like I couldn't talk to anyone but my partner about it, who thankfully was super supportive and receptive. What I ended up doing was blocked porn websites from my computer, and every time I had the urge to masturbate, I relocated to my bed and just got off by using my imagination and/or just being present in the erotic experience. I also made sure to masturbate with plenty of lube, because I would often masturbate without it and end up desensitizing myself, making it harder to cum while having penetrative sex. What i found was that in less than a month my sex with my partner and my ability to cum had improved, and some body image issues I had been experiences pretty much went away. plus, the orgasms I was having while masturbating without porn or any other external stimulation were waay more intense and pleasurable! everyone's journey is gonna be different but I think the most important thing is communication, acknowledging there is an issue and that y'all will need support and what y'all are going through is completely normal!",
   "created_utc": 1701644545,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvyvp4",
   "message": "This is an incredibly sad situation, I can understand why it would be hurtful.  Your husband has an addiction to it (obviously).  It's not your fault but he's going to need your help to get through it.  Porn has never helped my relationships. When I'm not in a relationship it does not help my psyche but rather ruins it.  I don't know that I'd say I was addicted but I used to look at it a LOT.  When I gave it up my life got better.  It was difficult to quit but I eventually did.  I wish you luck.\n\nNTA",
   "created_utc": 1701648899,
   "score": 4,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw6c7z",
   "message": "NTA. He is though.",
   "created_utc": 1701651972,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbxdry2",
   "message": "so you’re telling me he’s 37, lives with his mom, has a wife but can’t finish without porn. good god, that’s enough reddit for today.",
   "created_utc": 1701674242,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvesh9",
   "message": "*porn addict*",
   "created_utc": 1701641089,
   "score": 7,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvjxbv",
   "message": "NTA. Porn is an addiction though and isn't a simple \"stop doing it\" thing.\n\nI think I would suggest no one watches porn and no sex or fooling around for two weeks for either of you.\n\nI actually went through this as a male when the wife and I were trying to get pregnant. You have to get away from the porn. 30 days would be best but 2 weeks could be enough.\n\nI wouldn't pleasure him while he watches porn as it is contradictory to what your goals are.",
   "created_utc": 1701643015,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvm96g",
   "message": "NTA Wow i am so sorry…… you are young please remember you are young this doesn’t have to be permanent 😳.. tbh you should have been an AH because he deserves it",
   "created_utc": 1701643914,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvzpgc",
   "message": "Guy on wife's account. I started a big fight one time like this because when confronted she didn't believe me but then I remembered I have proof an showed her weeks back where I did it that I left comments on the Google drive and I really was watching our clips not porn lol. I truly enjoy my wife and that's all I watch I don't really see the point in looking at girls an fantasizing about something/someone I'll never do. So shes more eager with the filming an once it was clear I only watch what we do things are so much nicer. Saying as maybe a solution? Not tryna be weird but it's pretty nice watching her while we are being sexual it may be dumb but just a compromise we've done. Hope get it figured out porn sucks creates unreal expectations when seems like women are pretty simple when u finally realize what u do before sex determines the sex with them. As in if I'm super nice lovable trusting husband an she's my queen u get way waaayy further then could ever dream of normally and its damn sure alot more fun than some fake porno girl.",
   "created_utc": 1701649225,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw0eho",
   "message": "He's becoming dependent on porn right now and could use a break from it. It will eventually take over and your sex life will suffer.",
   "created_utc": 1701649503,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw3h4h",
   "message": "NTA, but it doesn't mean he's an asshole either. Just have the talk with him about what him doing that means to you, and maybe try to make him understand he may be a porn addict.",
   "created_utc": 1701650749,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw3sog",
   "message": "NTA, \nsounds like he has an addiction :/",
   "created_utc": 1701650885,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbw57zq",
   "message": "NTA - one of the best reasons to have sex is to have a closer connection with another human being.  You need counseling.  This could go beyond a psychological addiction to more and more visual stimulation.  There may be an element of fear that he has of being more intimate with you emotionally.  The porn puts a distance or barrier here so he doesn't have to connect as much.",
   "created_utc": 1701651490,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwgeca",
   "message": "Desensitized from all the porn. I’m so sorry and you’re NTA, he didn’t even try.",
   "created_utc": 1701656331,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwgs55",
   "message": "NTA. Your husband needs help. I sometimes watch a video of my wife giving me a bj while she gives me a bj but I certainly don't need it. Maybe try that to wean him off the porn.",
   "created_utc": 1701656499,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwjl3u",
   "message": "You both need therapy.",
   "created_utc": 1701657766,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwllrr",
   "message": "I’m not against porn, unless it’s a problem like this. He needs professional help at this point. Sounds like he needs to stop jerking off and stop watching porn for a while. Like until he’s DESPERATE to cum, and then he can re-teach himself to cum with a partner instead of with videos and a death grip.",
   "created_utc": 1701658672,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwujfj",
   "message": "It’s not something that most people do - but when my husband and I got married we decided to stop watching porn and only do things together, no masturbation, just the two of us together. It’s not for everyone but it’s brought us closer together in feeling wanted by each other and not desiring others sexually.",
   "created_utc": 1701662794,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwvhhk",
   "message": "NTA. It’s great that you’re communicating about this so openly. That would hurt my feelings a lot and make me insecure. Like I’m not good enough.",
   "created_utc": 1701663251,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwwzrc",
   "message": "Hey I saw your update but just wanted to say that my hubby had an addiction to porn to for a few years of our nearly 20 years together. It was rough, he had to quit cold turkey for a while to start enjoying sex with me again. Once you have that intimate connection with a physical person, it's so worth it. Nothing compares but it takes work to get there from where you are now. Good luck",
   "created_utc": 1701663941,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx2m4b",
   "message": "Google \"fight the new drug\" and you can find a lot of resources or information to help you out.",
   "created_utc": 1701666864,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx7xio",
   "message": "If you want to research with him, read the porn trap. That helped me a lot.",
   "created_utc": 1701670125,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx8hsz",
   "message": "Yea. He has a problem. Period. Your needs are just as important as his and obviously he is either to blinded by the porn and can no longer have sex without it or he don’t care. I don’t know, but I wouldn’t be able to handle that. Best of luck to you girl. I hope it turns around because you deserve happiness too.",
   "created_utc": 1701670499,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx93me",
   "message": "I know I’m a little late to the post but I am a porn addict in recovery, I have experienced exactly the same thing with my partner where I struggled to enjoy penetrative sex and could only ejaculate when viewing porn. Porn is extremely addictive and has the potential to rewire neural pathways liked to dopamine. I’d recommend at least a 90 day detox, and I would STRONGLY recommend your husband think about joining a SLAA (sex and love addicts anonymous) meeting. I know this may seem drastic, or threatening. I wasn’t thrilled about the idea when my couples therapist recommended the organization to me. But a support group helps when trying to break any addiction - having a sponsor who you can talk to when having urges, speaking about your experiences with other people who have shared them, these things help a TON. Through several months of SLAA and couples therapy I’ve been able to curb my porn addiction, but it’s not been without cycles of relapse, and my partners support has been immensely helpful through it all. One thing to know is that your partners porn use is NOT any indication of their attraction to you - porn misuse and addiction usually stems from trying to fill an emotional gap that may have to do with literally anything. Personally, I have used porn to deal with feelings of low self esteem and insecurity. \n\nI’d suggest a book called “Your Brain On Porn,” it’s a very scientific look at porn addiction and it helped me a ton",
   "created_utc": 1701670902,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbxe7ea",
   "message": "Didn’t you ask your husband for a divorce days ago because of the MIL? We can see your other posts, this has to be fake.",
   "created_utc": 1701674566,
   "score": 3,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvt3d8",
   "message": "Tell him that unless he starts watching less videos and forcing on YOU more, then no more blow jobs. This situation isn't fair to you. He needs to chill.",
   "created_utc": 1701646599,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwe3km",
   "message": "Porn will destroy your relationship. Best thing to do is quit Porn if you value your relationship. It will leave you with unrealistic expectations of your partner.",
   "created_utc": 1701655321,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvo3jp",
   "message": "NTA but you can also see he didn’t mean to hurt you. That’s why the spooning and not getting angry at you. As others said, porn gives a dopamine hit and he’s currently seeking to maintain it. Discuss it and figure out ways to make the sex between just the two of you.",
   "created_utc": 1701644649,
   "score": 4,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwi7lr",
   "message": "Please, please, please, stop the porn.  It is far worse than any drug or alcohol addiction (in my opinion) because it seems harmless especially if you are both into it.  \n\nLike someone said earlier, his brain is wired to it now.  He probably can get an erection easier by watching it too.  \n\nThis is not a reflection of you or his love and desire for you.  \n\nBeen there, done that.  I'm 47 and wish I had never seen my first magazine at 9 years old.  \n\nBe supportive and help him help himself.",
   "created_utc": 1701657144,
   "score": 5,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvvc79",
   "message": "Don’t have kids, live with his mom, doesn’t appear to give a fuck about your pleasure, can’t get off without watching porn…\n\nGirl, get out! He’s a selfish man child. You would be better off on your own. I know it’s a Reddit cliche, but seriously. Maybe this marriage can be saved, but why would you even want to? I am sure he is a selfish turd in other areas, too.\n\nEDIT: and I am a happily married 40-something, HE AINT WORTH IT",
   "created_utc": 1701647483,
   "score": 6,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvivqy",
   "message": "That's a tough one.  I know you are hurt by what happened.  I think you both should get to the real reason he is needing to watch it.  It may not have anything to do with him not wanting you or being less attracted to you.  It may have more to do with him.  Try not to be too hurt until you get to the bottom of it.  NAH",
   "created_utc": 1701642617,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvlzl1",
   "message": "What kind of porn is he looking at? If it’s guys then you have a bigger problem. 😂",
   "created_utc": 1701643811,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvsyiw",
   "message": "How come OP was 46 in this post - https://www.reddit.com/r/TrueNarcissisticAbuse/s/JftrfinezE a few days ago but now is in their 30’s?",
   "created_utc": 1701646547,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvu0st",
   "message": "NTA",
   "created_utc": 1701646962,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbvx95q",
   "message": "I think it’s hard to try to undo something you are so used to doing \n\nIt’s like asking a smoker/drug addict to stop immediately, I doubt they can do it unless you physically prevent them from doing it (I.e locking them up)",
   "created_utc": 1701648243,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwb3iq",
   "message": "Back in the day, before our DB, my partner and i did this.  We almost made a game out of it.\n\nGoing down on me, I distract her by being like, \"oh damn, that's hot.\" And when she goes to look, I take over. \n\nMan... stuff changed a LOT.",
   "created_utc": 1701654022,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwbcrw",
   "message": "I read that people who masturbate a lot can find it hard to to cum with penetration because the vagina is much softer than hands. So if he’s used to you or him doing hand jobs he needs to abstain for a week so let his penis get sensitive again.",
   "created_utc": 1701654132,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwc122",
   "message": "NTA. My partner and I both watched porn together sometimes \u0026amp; we would try coming with it on the background. But the need to watch porn to come for him seems unhealthy. You were already being extremely generous by giving daily hand/blow jobs.",
   "created_utc": 1701654427,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwf1a3",
   "message": "ya’ll need to get your own place asap",
   "created_utc": 1701655723,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwfiav",
   "message": "Husband is what the internet would call a cummer. Someone who can only cum by yanking it and watching porn.",
   "created_utc": 1701655936,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwfl9y",
   "message": "He’s got the death grip",
   "created_utc": 1701655973,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwh6at",
   "message": "It's awesome that he recognizes that there is a problem and is willing to work on it. That's usually the most difficult step. Good on both of you!",
   "created_utc": 1701656676,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwhbaw",
   "message": "I am glad you both are communicating. Sending you both positive vibes",
   "created_utc": 1701656739,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwjjy0",
   "message": "That's clown behavior, if you don't arouse him then he isn't attracted to you.",
   "created_utc": 1701657751,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwmmlb",
   "message": "I think first off, its important to understand that just because he wants to watch a video, does not necessarily mean that he does not find you attractive or that he prefers the women in the video more than you. Unfortunately, when you are used to watching porn to please yourself, it becomes difficult to get away from it. After doing it long enough, your brains starts to get wired for it. For the variety, for the quantity, etc. And he quite literally just will have problems getting off without the use of porn because he is used to that kind of dopamine loop.\n\nThe best thing you can do is talk to him, and the best thing he can do is to stop watching porn, by force. Even if he cannot get off at first, if he stays away from it long enough, he eventually WILL start getting used to normal sex again and begin finding it pleasurable. And he also will lose to the desire to look at porn. It could take a while, but he just has to stay away from it and let his brain learn to rewire its pleasure loop again. You can probably speed the process up by literally avoiding all sexual pleasure altogether for as long as possible for a while.",
   "created_utc": 1701659134,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwvvpp",
   "message": "Your post history states that you’re 46, here you say that you’re in your 30s. Which is it?",
   "created_utc": 1701663444,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbwxmmg",
   "message": "22 days to form new habits",
   "created_utc": 1701664232,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx17ei",
   "message": "So I’m not gonna lie. I didn’t read everyone else’s comments before putting my comment lmao however, I currently have a partner who actively watches porn on his phone while I give him a Bj. I  am someone who finds BJ’s very hot so it’s definitely not like I’m doing a terrible job. In fact he almost always stops me early so I can make it last. Because of it being a submission thing, it’s not always an amazing feeling looking up to seeing the back of a phone screen instead of him actually paying attention to you, it sucks and I’m sorry.",
   "created_utc": 1701666075,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx3zp1",
   "message": "Also a grip issues from over masturbation",
   "created_utc": 1701667661,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbx5fi4",
   "message": "good luck",
   "created_utc": 1701668533,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbxcivn",
   "message": "NTA. Porn culture is ruining men lol",
   "created_utc": 1701673309,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbxjlhb",
   "message": "I’m glad the two of you were able to deal with this sooner than later. I hope everything goes well, as I know from experience the harm that waiting to address things can do to a marriage.",
   "created_utc": 1701678881,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbxtzp2",
   "message": "he has a porn addiction",
   "created_utc": 1701687578,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbxvi2w",
   "message": "The ex gaslit me constantly for not wanting to watch porn with him during sex.  It was only one of the reasons leaving him behind was such a relief.  It made me feel  I was just the vehicle of convenience for him and he just didn't care that what my feelings were about it.\n\nAnd porn did not teach him ANYTHING about making love.  He was so inept in bed it was almost humorous. It is pitiful that men think they need porn on their own, but dispicable to want it during so-called love making.",
   "created_utc": 1701688728,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kby3u8w",
   "message": "I read your \"edit\". I'm glad that y'all have decided to work on this as a team. My wife and I have gone through this and I promise you it's well worth the effort. 27+ years now. It's crazy how similar the suctions are. Best wishes \u0026amp; prayers.",
   "created_utc": 1701694151,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kby50lz",
   "message": "If he prefers to focus on porn instead of you, tell him he can do that alone.",
   "created_utc": 1701694805,
   "score": 2,
   "submission_id": "189zu5w"
  },
  {
   "comment_id": "kbuwamq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "189zu5w"
  }
 ]
}