{
 "submission_id": "18a2dqy",
 "title": "AITA for not ordering food for a guest at my apartment?",
 "selftext": "I 20m, and my best friend 20m share an apartment near our college campus. The other day he had a classmate over that he got randomly assigned to work on a project with. The thing is, my friend is a great student, and his classmate on the other hand is not. He noted that his classmate skips most lecture and only shows up on exam days. We think the professor put them together in order to help classmates grade.\n\nAnyways, my girlfriend was also over. Her and I are hanging out watching tv with the cats while they are sitting at counter doing their work. It was clear my friend was doing all the work, while the classmate was scrolling through his phone half paying attention to what is going on. He than completely gets up and starts to sit with us. I asked him what he was doing since they need to get the project done. He said \"I need a break.\"\n\nMy friend looks visibly annoyed, he had only been over for a half hour at this point. Me (being a little antagonistic I admit) ask him what his role in the project was. I shit you not the dude told me \"I like to plan it and (friend) is the guy to execute my plan\". I ask him what that plan is and he told me that he still needs to work that out. So basically he was b'sing me. For some context, its a human resources class, and they have to do a presentation about workplace culture. I dont know much about it since im a engineering student, but they have a rigid rubric to follow that requires multiple sources that are provided, so I think he was just trying to take easy street.\n\nLucky than my friend calls him back over to look at something. He gets annoyed but gets up start to act like the boss of my friend. Him and I both suck at confrontation, but my gf says something to the effect of \"its a group project that means that you work together, not tell someone what to do.\"\n\nI guess that calmed him down some, but he clearly was still not putting much effort into helping. His laptop was closed, he had a ear bud in and was on his phone. Its about 6pm at this point, and we are hungry. I decide to order chipotlte for my gf, best friend and I. (the three of as as well as his gf all take turns ordering each other food when we all hang out) I was fully intent on ordering it for his classmate too, but I did not like his attitude so I decided not to. I asked him if he wanted anything, but told him he would have to just give me the cash for his order. He got pissed and told me I was a bad host for not providing him food, despite ordering it for others. I straight up told him that he should not expect food to be provided, and that I was going to pay for him until I saw him being rude to my friend. He got pissed off and left basically saying \"we can work on this over zoom.\"\n\nHe later texted my friend saying that he never wants to deal with me again. He was going to defend me but I told him its not even worth the argument, since he has the right to not like me. My friends pissed at him since they have to do the presentation together, but he said he will manage.\n\nI feel like kind of a dick, but my friend said I did the right thing and he will email the professor about his partner hardly working on the project. He finished it on his own and had his girlfriend look over it since she is also a business student, and she said it looks golden! so AITAH for not paying for his food?",
 "created_utc": 1701635089,
 "permalink": "/r/AITAH/comments/18a2dqy/aita_for_not_ordering_food_for_a_guest_at_my/",
 "score": 101,
 "url": "https://www.reddit.com/r/AITAH/comments/18a2dqy/aita_for_not_ordering_food_for_a_guest_at_my/",
 "comments": []
}