{
 "submission_id": "18a2dqy",
 "title": "AITA for not ordering food for a guest at my apartment?",
 "selftext": "I 20m, and my best friend 20m share an apartment near our college campus. The other day he had a classmate over that he got randomly assigned to work on a project with. The thing is, my friend is a great student, and his classmate on the other hand is not. He noted that his classmate skips most lecture and only shows up on exam days. We think the professor put them together in order to help classmates grade.\n\nAnyways, my girlfriend was also over. Her and I are hanging out watching tv with the cats while they are sitting at counter doing their work. It was clear my friend was doing all the work, while the classmate was scrolling through his phone half paying attention to what is going on. He than completely gets up and starts to sit with us. I asked him what he was doing since they need to get the project done. He said \"I need a break.\"\n\nMy friend looks visibly annoyed, he had only been over for a half hour at this point. Me (being a little antagonistic I admit) ask him what his role in the project was. I shit you not the dude told me \"I like to plan it and (friend) is the guy to execute my plan\". I ask him what that plan is and he told me that he still needs to work that out. So basically he was b'sing me. For some context, its a human resources class, and they have to do a presentation about workplace culture. I dont know much about it since im a engineering student, but they have a rigid rubric to follow that requires multiple sources that are provided, so I think he was just trying to take easy street.\n\nLucky than my friend calls him back over to look at something. He gets annoyed but gets up start to act like the boss of my friend. Him and I both suck at confrontation, but my gf says something to the effect of \"its a group project that means that you work together, not tell someone what to do.\"\n\nI guess that calmed him down some, but he clearly was still not putting much effort into helping. His laptop was closed, he had a ear bud in and was on his phone. Its about 6pm at this point, and we are hungry. I decide to order chipotlte for my gf, best friend and I. (the three of as as well as his gf all take turns ordering each other food when we all hang out) I was fully intent on ordering it for his classmate too, but I did not like his attitude so I decided not to. I asked him if he wanted anything, but told him he would have to just give me the cash for his order. He got pissed and told me I was a bad host for not providing him food, despite ordering it for others. I straight up told him that he should not expect food to be provided, and that I was going to pay for him until I saw him being rude to my friend. He got pissed off and left basically saying \"we can work on this over zoom.\"\n\nHe later texted my friend saying that he never wants to deal with me again. He was going to defend me but I told him its not even worth the argument, since he has the right to not like me. My friends pissed at him since they have to do the presentation together, but he said he will manage.\n\nI feel like kind of a dick, but my friend said I did the right thing and he will email the professor about his partner hardly working on the project. He finished it on his own and had his girlfriend look over it since she is also a business student, and she said it looks golden! so AITAH for not paying for his food?",
 "created_utc": 1701635089,
 "permalink": "/r/AITAH/comments/18a2dqy/aita_for_not_ordering_food_for_a_guest_at_my/",
 "score": 9,
 "url": "https://www.reddit.com/r/AITAH/comments/18a2dqy/aita_for_not_ordering_food_for_a_guest_at_my/",
 "comments": [
  {
   "comment_id": "kbuzekm",
   "message": "NTA\nHe’s a study partner, project partner.  Not your guest in the sense that you invited him over yourself.\n \nYou’re not responsible for paying for his food.\n\nYou asked if he wanted anything while you were ordering, which was polite of you.\n\nNot ok you to buy him dinner.",
   "created_utc": 1701635525,
   "score": 31,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbuzg91",
   "message": "NTA. You have no obligation to feed strangers. Especially those who act like dickheads. Besides, you weren’t the one hosting him anyway.",
   "created_utc": 1701635540,
   "score": 116,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbv0nr6",
   "message": "NTA pretty standard that you pitch in some money when someone is ordering food.  But since he was being a lazy mooch on the project it's not surprising he didn't.",
   "created_utc": 1701635964,
   "score": 57,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbv1c7d",
   "message": "NTA.  He was looking for a free ticket in every possible avenue.  Your friend wad screwed because  he had to look after his grade but you didn’t need to provide this person a free meal.  A host?  Really?  If he wanted food, he could’ve paid for it.",
   "created_utc": 1701636204,
   "score": 52,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbv462w",
   "message": "NTA- you offered to put an order in for him with payment up front which is 100% appropriate. He’s not your friend so why would you pay for him?! You are also not “hosting” him as he’s there to work with your roommate",
   "created_utc": 1701637216,
   "score": 16,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbv83aw",
   "message": "NTA\n\nYou didn't volunteer to host him, he came over to work with your roommate. You had zero obligation to offer him any food or beverage IMO.  You asked if he wanted to order something, he decline and was rude. \n\nI am petty enough to send an email to the instructor of that class letting the teacher know just how much of the group project that little AH was involved in.",
   "created_utc": 1701638645,
   "score": 14,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbv0v8w",
   "message": "You handled that perfect and the other guy just is a huge dick.",
   "created_utc": 1701636038,
   "score": 7,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbv7h5k",
   "message": "Nta you're not obligated to feed your roommate's guest",
   "created_utc": 1701638423,
   "score": 5,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvc07q",
   "message": "If he is planning and expecting the other person to execute his plan, then he is acting as a manager.  The manager provides the resources for their team to do their job.  If it's an unusually difficult thing, they often provide food.  So his role in the project should have been paying to feed everybody, and since it is a human resources class, he should have known that.\n\nOkay, obviously I am being snarky here, because it is worse than that, but, seriously, if he HAD come over and fed everybody, he would have at least been providing some value.\n\nNTA",
   "created_utc": 1701640077,
   "score": 4,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvaqz0",
   "message": "I wouldn’t have paid for food either.",
   "created_utc": 1701639614,
   "score": 3,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvglne",
   "message": "Sometimes it's ok to be the asshole. Dude had it coming. Fuck that guy.",
   "created_utc": 1701641771,
   "score": 3,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvrp8d",
   "message": "You aren't a host. You didn't invite him over and your roommate doesn't even want him there, he's being forced to interact with him. There's no reason for you to pay for him. He's just a full scale leech.",
   "created_utc": 1701646052,
   "score": 5,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvfn8q",
   "message": "NTA. This dude sounds like a cockroach. Live your best life and let this guy dig his own grave with school.",
   "created_utc": 1701641406,
   "score": 2,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwhagn",
   "message": "NTA. I can't believe they are still making people work in groups in college. I hated it when I was in college 30 years ago. Once, I was partnered up with a frat dude who didn't do a damn bit of work. It was a huge project, and I had to do all of his work as well as mine. When I went to my professor to complain, she told me that we needed to learn to work as a team in college. It sucked so much. \n\nLater I saw him at a huge party, and as usual he was totally drunk. I ignored him, and he completely lost his mind and started screaming at me, then pushed me (I am a woman and weighed probably 50 pounds more than me and at least 4 inches shorter).  Then some of my friends started fighting with him, and he ended up throwing up on the living room floor. \n\nI told my professor what had happened, that I was not going to work with him again, and that I had done all the work.",
   "created_utc": 1701656729,
   "score": 2,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwiqvp",
   "message": "NTA. You weren't even his host. On top of that he is just a lazy piece of shit.\n\n\u0026gt;We think the professor put them together in order to help classmates grade.\n\nIn words of a friend of mine who was in the exact same situation \"The teacher isn't helping him (the lazy student), he is fucking me\" \n\nLeech people are the worst, regardless of place.\n\nHope your friend pass the class,and you 3 never have to deal with that asshole",
   "created_utc": 1701657386,
   "score": 2,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwkp08",
   "message": "You aren't the asshole.  The three of you take turns ordering, and paying for, each other's food.  None of you are getting free food.  You offered to order if the guy paid for his own and he declined. He hasn't ever treated you to a meal while the others have.  Why should he get special treatment?",
   "created_utc": 1701658264,
   "score": 2,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwovzw",
   "message": "Good for you calling him out on his behavior. I really hope the roommate does talk to the professor about it (before lazy partner spins a story and goes to him) and the professor is good about it.",
   "created_utc": 1701660151,
   "score": 2,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvm5ke",
   "message": "YTA.  It is your friends project, not yours. So you had no business getting involved and antagonizing his partner and then purposefully pissing them off.  Try embracing them and being kind, not an AH.",
   "created_utc": 1701643875,
   "score": 239,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvbu4o",
   "message": "NTA.\n\nGood for your friend for letting the professor know how the project is going. If it's a human resource class, perhaps the topic should be \"When one team member won't do their share but expects full credit.\"",
   "created_utc": 1701640015,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvgr7u",
   "message": "NTA - That guy is an AH. I hope he fails and your roommate gets a great grade.",
   "created_utc": 1701641830,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvshd3",
   "message": "NTA.\n\nAnd professor needs to know bad student did NONE of the work, so friend's grade isn't harmed.",
   "created_utc": 1701646361,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbvv8ns",
   "message": "NTA. And also, you weren't a host. He was there on behalf of your roommate, not you.",
   "created_utc": 1701647445,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbw1p9v",
   "message": "I would have told him he only gets food if he does the work and stops messing with his phone. Zero effort means zero food",
   "created_utc": 1701650017,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbw784n",
   "message": "You weren’t hosting him; you hadn’t invited him at all\n\nYour roomie wasn’t hosting, because he didn’t invite him to a social occasion; it was just a meeting place.",
   "created_utc": 1701652356,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbw8w8s",
   "message": "Nope NTA \nGawd I hope that pos doesn’t go into HR bc he sounds like the wooorrrrrst",
   "created_utc": 1701653075,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbw9cro",
   "message": "NTA\n\nFirst he wasn’t your guest so you are under no obligation to get him anything on your dime. \n\nI hope your bf does email and then discuss with his professor that ad he put in 100 % of the Brito he should get the full grade.  \n\nIf it’s a joint presentation when his ‘partner’ gets up to join him he should tell him to please sit down as he put no effort into the project so him helping to present is not required.",
   "created_utc": 1701653275,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwan5t",
   "message": "NTA. This guy has literally nothing to do with you and sounds like a disgusting mooch.",
   "created_utc": 1701653829,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwbjag",
   "message": "NTA.",
   "created_utc": 1701654211,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwd3p1",
   "message": "He wasn't your guest, OP, he was the roommate's guest.  According to etiquette, if anyone was obligated to feed him it was your roommate, but if the roommate didn't want to eat while stuck with an obnoxious guest, then I'd feel the same.\n\nAnd BTW, group projects are only assigned by teachers who are lazy or stupid. They're either trying to offload the work of teaching the idiots off onto the brighter students, as seems to be the case here, or they're too dumb to realize that group products always involve one person doing the vast majority of the work and are a shitting teaching technique.",
   "created_utc": 1701654887,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwdehd",
   "message": "NTA the classmate is a user, wants free food and someone to do all his work for him",
   "created_utc": 1701655017,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwdun3",
   "message": "NTA. He’s essentially a stranger. He shouldn’t expect free food.",
   "created_utc": 1701655213,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwoz86",
   "message": "And he's a *business student*? He's either going to succeed wonderfully or fail spectacularly - please help him do the latter.",
   "created_utc": 1701660191,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwpk6f",
   "message": "NTA.",
   "created_utc": 1701660461,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbwq0np",
   "message": "NTA. He was not a guest you invited to hang out with. You don’t owe him anything. He was using your space for “school work” not a social visit.",
   "created_utc": 1701660675,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbx02rn",
   "message": "NTA. Sounds like this guy’s got a few years until he realizes what it’s like in business when he gets a job and expects everybody else to execute his plans",
   "created_utc": 1701665464,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbx035i",
   "message": "NTA\n\nThat guy is a lazy, entitled shithead.",
   "created_utc": 1701665470,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbx0cau",
   "message": "Tell your friend to tell the professor that if there was any doubts on the professor's part to ask the guy questions about the project since he probably knows next to nothing about it.\n\nEdit: NTA (forgot this part)",
   "created_utc": 1701665604,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbx2syh",
   "message": "NTA.  Why should you feed a random stranger in your home? Especially one that is an asshole..",
   "created_utc": 1701666973,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbx4g46",
   "message": "NTA\n\nYou were never his “host.”",
   "created_utc": 1701667934,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbx8fgn",
   "message": "Even if he wasn’t acting rude, you have no obligation to pay for him. He wasn’t your guest. He was your friend’s guest. It was kind to offer to add his order. Lots of people often pay their own meals as friends. \n\nI think the rude part would be the way you told him you didn’t pay for him was because he was being rude. It sounds like you’re retaliating or singling him out. Although he might’ve deserved it, it wasn’t very nice. Calling people out isn’t productive and will only fuel the fire.",
   "created_utc": 1701670455,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbxb20v",
   "message": "Haha, the stupid mooch wanted to steal food while he was already stealing your roommate’s work. What a waste of skin.",
   "created_utc": 1701672253,
   "score": 3,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbxeky9",
   "message": "You offered to order for him if he paid you back. \n\nThat’s the socially acceptable thing to do. \n\nNTA",
   "created_utc": 1701674857,
   "score": 2,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbxtnlh",
   "message": "NTA",
   "created_utc": 1701687313,
   "score": 1,
   "submission_id": "18a2dqy"
  },
  {
   "comment_id": "kbxu27c",
   "message": "NTA, you weren't hosting his entitled ass",
   "created_utc": 1701687632,
   "score": 2,
   "submission_id": "18a2dqy"
  }
 ]
}