{
 "submission_id": "18a20v1",
 "title": "Am I the AH for calling the bride on her wedding day to tell her that her groom was trying to get with me?",
 "selftext": "I am 25 (F) just finished college, in 2017, is when I started with a group of other friends including the bride and the groom. We were not close just acquainted, the following year I did not return to school because of fees issues so I got a jobs most of them temporary. The groom, let us call him Tim, could text me once in a blue moon, but last month the tone changed and invited me to hand out, I agreed did not think much of it because our college is an IT not a lot of female students, it is normal for to have guy friends without the awkwardness. And we hang out normally. The following weeks he texted me constantly, including a confession, saying he likes me and wishes to pursue a more than friendship type of relationship, I did not reciprocate coz I was busy with my studies, I had to finish my assignments and final project, I did not want to be bothered with relationship issues at the moment. Tim stays in a different district meaning if we are to pursue one it is going to be long distance, hence why I was cautious and not get emotionally invested. \nYesterday, I was scrolling on Whatsapp when one of my friends posted a two wedding invitations and one of them was of the guy getting married to the Bride the following day meaning today, let us call her Sally, I remembered her during our first year of college. I felt uneasy, I asked my friends for advice, one said to let it go and let them be but to me it felt like witnessing a murder and doing nothing about it. I spent the night trying to find her number and I texted him for being disgusting.\nThe next morning, I received texts on my phone the next morning, one from Tim, saying, \" Anyway thats your perspective that i cnt change but all i cn say is even if i try to say otherwise i will only look like am trying to cover up and seem to you like am lying more and more and it is difficult for me to try and explain for you to understand, so i will leave you with that thought but if wish to understand we cn talk as we do\", I did not reply there is nothing else I can say to this disgusting man, I did get her number though but when I texted her and sent her images of his confession to me, she was offline probably  preparing for her wedding, so I called her and explained to her. She went online saw the texts and thanked me.\nThe wedding did proceed, all I wanted was for to know the person she is getting married to, AITA?",
 "created_utc": 1701634155,
 "permalink": "/r/AITAH/comments/18a20v1/am_i_the_ah_for_calling_the_bride_on_her_wedding/",
 "score": 118,
 "url": "https://www.reddit.com/r/AITAH/comments/18a20v1/am_i_the_ah_for_calling_the_bride_on_her_wedding/",
 "comments": []
}