{
 "submission_id": "18a34rk",
 "title": "AITA for what I said to my Mom \u0026amp; MIL about them pressuring me to have a baby?",
 "selftext": "I’m a 25F who has lupus and fibromyalgia and was more or less bed bound for about a year from late 2021 - late 2022. I lost about 20-30lbs during this time and many members of my family saw this and constantly made comments on how “sick” and “underweight” I looked. My health has improved since then but I definitely still struggle with my disease and there’s always ups and downs. I recently got married and my family and his family have both been consistently asking me and my husband when we’re going to have a child. This is a sensitive topic for me because I want children but I’m very worried about the possible complications pregnancy and childbirth could pose to my already fragile health. My lupus has been flaring up a lot more lately due to the cold weather and I’ve been sick numerous times the past few months and everyone who’s been pestering me so much about having a baby knows this. This all has really getting to me lately, and yesterday, I guess I blew up on them. So, last night, me, my husband, my parents, and his parents all went to dinner. My mom and his mom both brought it up to me again and I (who already told both of them my concerns in the past with my health and childbirth) was blunt and told them how I’d read up on women with lupus and childbirth and my concerns with it. They both dismissed me and told me to try a bunch of bullshit essential oils and talk to the doctors on base (my husband is military which is why they said this, but I’ve already had horrible experiences with many doctors and it took me 5yrs to get diagnosed with lupus to begin with). I was just baffled at this point and felt so defeated and I just lashed out and stated that I wasn’t going to kill myself for a baby because the mortality rate for women with lupus is 300x higher than that of normal women in childbirth. My mom later told me that I shouldn’t have said this and I crushed my mother-in-law by telling her she was never gonna have a grandbaby, but I don’t feel like I was in the wrong here. I feel like everyone else has been prioritizing an unborn child over my health and so much stress is being put on me to have a child when I’m not even healthy right now. AITA for what I said to my mother and MIL?\n\nUpdate: Thank you everyone for all the kind words and tips! I told my husband about this post and about how much this situation bothered me today, and he actually spoke to my mom and MIL and told them to stop talking about this topic to me because of how much it bothers me. Hopefully this helps. ",
 "created_utc": 1701637095,
 "permalink": "/r/AITAH/comments/18a34rk/aita_for_what_i_said_to_my_mom_mil_about_them/",
 "score": 57,
 "url": "https://www.reddit.com/r/AITAH/comments/18a34rk/aita_for_what_i_said_to_my_mom_mil_about_them/",
 "comments": []
}