{
 "submission_id": "18a4tfe",
 "title": "My sister made a reservation at a hotel for Christmas, told me dogs were allowed. Apparently they aren’t, I said I wasn’t going and refused to pay my part. AITAH?",
 "selftext": "My (25F) sister (37F) was excited about going to a nature hotel for Christmas with all our family members included. She sent me pictures of the place, it was a very nice place to stay for Christmas. My boyfriend and I live together and we both have 2 dogs. We’re leaving our youngest (a border collie) in daycare for those days were going to be gone. But we also have a Golden Retriever who is 3 years old and he has grown to dislike male dogs. He’s also not used to daycare, and gets separation anxiety when he’s not with us. Our BC on the other hand is more social and outgoing with others, doesn’t mind to sleep somewhere else, etc.\n\nThe first thing I asked my sister was if I was allowed to take Noah(our golden.) since there’s no one of the fam who can take care of him on Christmas, such a special date. \n\nShe said yes, that dogs were allowed. I told her then we were going that it wasn’t an issue. She made the reservation and had to pay some for us to get the place for that day. She sent me out the link which said dogs are not allowed. I then ask her again, hey are you sure they are allowed? I sent her a screenshot of the part of the link where it said they weren’t. She again said “i’m sure the owner of the place won’t say no to us paying him a lot of money just because of a dog”… i talked this out with my boyfriend and he said we should confirm with the owner. \n\nI texted him via Whatsapp and he told me that dogs were 100% not allowed. I sent that out to my sister and she says “we see what we’ll do”. I told her that if Noah can’t go then we can’t either. She got angry at me yelling that we had to pay our part because she can not pay for what we were meant to pay. I told her that i was not going to pay a lot of money if we weren’t going. She said that our dog was our problem and we needed to see how we solved it. That it was up to me to see if dogs were allowed or not. I told her she lied to me and that I was not going to pay, because we were not going. AITA?",
 "created_utc": 1701641349,
 "permalink": "/r/AITAH/comments/18a4tfe/my_sister_made_a_reservation_at_a_hotel_for/",
 "score": 167,
 "url": "https://www.reddit.com/r/AITAH/comments/18a4tfe/my_sister_made_a_reservation_at_a_hotel_for/",
 "comments": [
  {
   "comment_id": "kbvh7gr",
   "message": "Nta. What kind of world does your sister live when it already states dog are not allowed, and she thinks she can manipulate the hotel owner?",
   "created_utc": 1701641998,
   "score": 170,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvingt",
   "message": "NTA, you were clear and double checked which is the responsible thing to do. she just wanted a nice place and to split it as much as possible to lower her cost… now that you aren’t going it’ll cost her more.",
   "created_utc": 1701642532,
   "score": 143,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvheb1",
   "message": "She lied to you to get what she wanted and is changing the subject now that you called out her lies.\n\nDon't pay. If she keeps complaining go low/no contact.\n\nNTA.",
   "created_utc": 1701642066,
   "score": 197,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvkhiv",
   "message": "NTA, your sister sounds like she planned to be one of those assholes who showed up with a dog and then insist it should be able to stay.\n\nHowever, I do suggest, as a dog owner, you just never trust a third party telling you you can take your dog. Always confirm it directly yourself.",
   "created_utc": 1701643231,
   "score": 170,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvjcmo",
   "message": "NTA\n\nStay home with the dogs and have a wonderful Christmas.\n\nYour sister is delusional and an idiot, the dogs are worth your time but she is not.",
   "created_utc": 1701642797,
   "score": 58,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvhms0",
   "message": "your sister is just trying to scam you 😅",
   "created_utc": 1701642153,
   "score": 82,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvhwzu",
   "message": "Nope, NTA but your sister is!",
   "created_utc": 1701642259,
   "score": 25,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvlhck",
   "message": "NTA. As a responsible pet owner you confirmed multiple times that the hotel was pet friendly. You absolutely fulfilled your obligation. Your sister is on the hook for the cost. She can find someone else to cover your part if she’s so concerned.",
   "created_utc": 1701643613,
   "score": 23,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvmyoa",
   "message": "NTA - Your sister wants your money and doesn't care if you are there or not. I am glad you confirmed.\n\nDon't pay if not going.",
   "created_utc": 1701644195,
   "score": 15,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvl4ce",
   "message": "NTA. Don’t go. Also, PLEASE don’t board or send your other dog to daycare with the unknown canine respiratory illness going around.",
   "created_utc": 1701643474,
   "score": 49,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvjze9",
   "message": "NTA, your sister seems like she wants to get a cheap hotel and is using you to cover part of the cost",
   "created_utc": 1701643038,
   "score": 13,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvoafk",
   "message": "NTA  She'll probably try to get any other family members involved calling you an AH for backing out. Let them know you never would have agreed if she hadn't lied to you, that your agreement was made on that stipulation. If any other family members agreed to go under certain circumstances and sister told them it was okay they might also want to check it out for themselves.",
   "created_utc": 1701644725,
   "score": 13,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvjju6",
   "message": "NTA She lied to you, voiding any contract she thinks you made with her.",
   "created_utc": 1701642874,
   "score": 12,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvkwx0",
   "message": "NTA\n\nYour sister lies, manipulates and guilts people to get her way. Don't let it work for her.",
   "created_utc": 1701643394,
   "score": 9,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvoveh",
   "message": "NTA\n\nYour sister lied to you. She either did not check it or lied on purpose. Either way you do not have to go. Holidays are not a command performance. You do not have to be there. As for \"your dog is your problem and you need to solve it?\". You did solve it. You are not going.",
   "created_utc": 1701644951,
   "score": 7,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvsro3",
   "message": "NTA. But do this to her next year: find adult-only hotel which accepts dogs, and copy what she told you when she figures out no kids are allowed.",
   "created_utc": 1701646474,
   "score": 7,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvo5tr",
   "message": "NTA ~ you did ask about dogs and she lied. This is all on her.",
   "created_utc": 1701644674,
   "score": 5,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvq6b1",
   "message": "Your sister is right your dog, your problem. However your sister made it her problem after she lied to you about pet allowability. \n\nNTA",
   "created_utc": 1701645468,
   "score": 6,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvtsvr",
   "message": "NTA\n\nGood on you for checking it out yourself. Your sister was setting you up to turn up with your dog and hoping to coerce the landlord to bend the rules \"since you're already here.\" Her plan relied on deceiving 2 parties. She's a major a-hole.",
   "created_utc": 1701646875,
   "score": 6,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvpmde",
   "message": "NTA\n\nYou were very clear that you do not have accommodations for your dog. Finding them at this point will be *very* difficult. Source: former dog walker/petsitter. \n\nYour sister was wrong or didn’t bother to check. This is not on you.",
   "created_utc": 1701645255,
   "score": 5,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvlty1",
   "message": "Most hotels have a cancellation policy, especially when you are weeks out",
   "created_utc": 1701643750,
   "score": 9,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvr6st",
   "message": "NTA\n\nBut I sure wouldn't have WhatsApp'd the facility.  I would have picked up the phone and called, whether I was in your sister's position or yours.",
   "created_utc": 1701645857,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvrnlp",
   "message": "NTA. Your sister shouldn't have lied to you to get you to commit to this. If she had just said she didn't know, everything would be different.",
   "created_utc": 1701646035,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvu114",
   "message": "Your sister is a giant asshole not you",
   "created_utc": 1701646965,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvw2i7",
   "message": "NTA.\n\nI'm glad you'll be home with your dogs, because there's a dangerous respiratory illness affecting dogs going around. Some high risk places include:\n\n- dog parks\n\n- kennels\n\n- groomers\n\nPlease be careful!",
   "created_utc": 1701647773,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwdsu",
   "message": "NTA. You only told her you’d go after she told you that dogs were allowed, so she has no room to accuse you of not checking first. Were you supposed to insult her by demanding proof to make sure she wasn’t lying?",
   "created_utc": 1701647890,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvxufm",
   "message": "Sister’s plan A was to bully the owner, and plan B was to bully you.  NTA",
   "created_utc": 1701648475,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvy218",
   "message": "Pure sabotage. She wanted your money knowing you couldn’t take the dog. That’s shady af",
   "created_utc": 1701648561,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw2sry",
   "message": "Are you in the US? If so, there’s a Covid-like unidentified canine respiratory illness going around. I’d strongly reconsider taking your dog to dog hotels, doggie day care, or any such facilities since dogs should be kept away from one another, kinda like our quarantine and social distancing. \n\nI know it’s off topic, but just in case you didn’t know.",
   "created_utc": 1701650461,
   "score": 3,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvq2ah",
   "message": "NTA - if she is tending to the details then she needs to tend to her oversight of the details",
   "created_utc": 1701645426,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvt6wa",
   "message": "NTA. She lied and now she has to pay for it.",
   "created_utc": 1701646637,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvtz6h",
   "message": "NTA. She’s entitled in every direction.",
   "created_utc": 1701646944,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvvurr",
   "message": "I like how her first solution to being called out on her lie was \"we can throw lots of money at them\" but also she's financially unable to eat what was supposed to be your portion of the cost. Does she have money to throw at people to convince them to change their rules at her behest, or is she barely affording this trip? Lol\n\nNTA of course",
   "created_utc": 1701647689,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwmo9",
   "message": "NTA. Dear friends of mine had a dog that had to be taken everywhere lest he demolished everything in its path until its owners returned.\n\nIn your case, the problem _had_ been solved, yet your sister flat out lied. So you owe her nothing.",
   "created_utc": 1701647989,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwqyo",
   "message": "Worst case here: you get all the way there either the pup and they’re like “no” and you have to drive home and you may or may not have paid your sister already which means you’d need to make her pay you back. Best case, this. Either way, you’re NTA at all. Your SIL is an entitled 🤬. I can only assume she was going to get you to pay ahead of time then never give your money back.",
   "created_utc": 1701648038,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwtr0",
   "message": "NTA just stay home and have a good time without the idiot fool",
   "created_utc": 1701648069,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwzdw",
   "message": "The owner can always turn OP and her sister's family away and cancel the reservation because of the dogs. There are reasons why businesses don't allow pets. Liability, someone getting bit, property getting destroyed, etc.",
   "created_utc": 1701648132,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvy798",
   "message": "NTA\n\nYou asked, she lied to you and now wants you to pay for a place you won't be staying at... This is stupid game stupid prizes sort of thing. Good on you for making sure your pup was welcome in the rental.",
   "created_utc": 1701648622,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw03m7",
   "message": "NTA, you already solved the problem telling her you can't go. She should have checked and found a place that allows dogs. This is not on you. She lied to you. Stay home. It will be way less drama for you not to be there.",
   "created_utc": 1701649380,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw1010",
   "message": "NTA. You made it known your limitations. She continuously lied, despite being shown multiple pieces of evidence contrary to what she was saying.\n\nWhat would happen if you did show up with your dog? You go in to be turned away. She’s still on the hook to pay. Or, you show up and your SIL says to just board your dog? Daycares and vet offices get full quick over the holidays. \n\nI think you’re doing right by your dog by understanding his limitations while adjusting your life to find the balance needed to ensure his wellbeing. \n\nHer acting deceitful makes her responsible for any consequences that comes from those lies. Maybe next time she’ll think about the concerns you express to get an appropriate headcount so she can make adjustments before having to eat the cost she’s upset to be on the hook for.",
   "created_utc": 1701649739,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3tqu",
   "message": "NTA….. you were told by your sister that dogs were allowed….. but they aren’t…..\nWhat I don’t understand is why do so many people want to bring their pets on vacation?  When I grew up, no one took their pets on vacation.  And “separation anxiety”?  Your dogs will be together, similar to how they are together when you and your bf aren’t home",
   "created_utc": 1701650897,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw8g7a",
   "message": "Nta but it’s sad yall can’t go nowhere cause of your dog",
   "created_utc": 1701652883,
   "score": 2,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3l31",
   "message": "NTA. Your sister is a manipulative Karen.",
   "created_utc": 1701650796,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvoc7t",
   "message": "Seriously? Why are you still talking to that bitch you call a sister? The only response she would have got from me is “go fuck your self you entitled narcissistic bitch”. Stand up for yourself. NTA.",
   "created_utc": 1701644744,
   "score": 253,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw7o6r",
   "message": "YTA for thinking that taking a dog with separation anxiety and other issues to ruin an entire hotel's Christmas is a better solution than boarding the dog. All of us whose dog that is NOT do not want to deal with that shit.",
   "created_utc": 1701652551,
   "score": 255,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw20y5",
   "message": "You’re both the AH because you should have checked in with the said hotel on your part… and her because she just assumed that you should both pay and also that the hotel would allow dogs",
   "created_utc": 1701650146,
   "score": 0,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvmx85",
   "message": "You are both the AH!  Seriously, you can’t leave your dog????",
   "created_utc": 1701644178,
   "score": 235,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvlfen",
   "message": "NTA\n\nBeef or pork bones for soups from the butcher work well as a fun treat.  It’s better to give them raw bones rather than cooked.  \n\n\u0026amp;#x200B;\n\nSee what else you can make or give your fur babies as a little treat, since they’ll be spending the holidays with you two.",
   "created_utc": 1701643591,
   "score": 255,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw11ok",
   "message": "ESH\n\nYTA because you are not willing to board your dog because it has emotional issues\n\nSister is obviously a manipulative liar though of course.  But maybe she has learned to just BS you and lie to you because you are dog crazy and she is just trying to get a family thing to happen and is tired of carrying all the water for your dog nutty butt.",
   "created_utc": 1701649757,
   "score": 248,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw4bbd",
   "message": "Yes YTAH…\nI’ve watched the insanity over the last 2-3 decades that have crept into full view which many people have grown afraid to address due to being shamed for being insensitive- this later expanded to full on cancel culture where ppl will try to shame you for saying something as basic as men are men and women are women. They expect you to adopt these weird normalities and force that sheer madness into your mind. People want to be referred to as they/them..and expect you to adopt that madness is where we’re at today.  \nIn that same vein we have ppl who treat dogs like people while they step over actual humans in the gutter. They consider the needs of animals over those of fellow humans. They buy jackets and shoes and hats and underwear for DOGS! All dogs used to need was a  nice house OUTSIDE to protect them from the extreme weather because guess what- they were born with fur coats! Now we’re in a place where ppl walk behind these well dressed little people (most in need of major attitude adjustments cuz some won’t even walk like regular dogs they need strollers or to be carried by their “humans” - have to say humans because it offends the civil rights of the dog if you “own” them-because they don’t like grass or the ground is wet) waiting for them to crap so you can pick it up in a bag.  Literal insane behavior. \nSo yes, if you start a beef with your family over an overly needy animal, yes YOU ARE the a******.  Imagine getting a hotel…FOR YOUR DOG. This world is officially insane. Did you get your dogs vaxed for covd too? Yeah…sorry not playing crazy games anymore…call a spade a spade and a nut a nut. 🤪",
   "created_utc": 1701651105,
   "score": 252,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvx0it",
   "message": "Yes you are the AH you can just put the dog in daycare with the border collie. And spend Christmas with your family. You act like putting your 3 year old dog up and it being upset for a few days is more important than your family. The dog will get over it, sounds like you don’t wanna go",
   "created_utc": 1701648145,
   "score": 243,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvv2h3",
   "message": "YTA - you chose a dog over family. \n\nYes, it's part of the family, but it shouldn't be at the level of a human. \n\nFor all you planning on blasting me here is a scenario.\n\nYou have a dog or cat and have had them for 5 years (could be any amount of time), you then have a child, and it turns out that the child is allergic to the animal. Who do you choose?",
   "created_utc": 1701647378,
   "score": 236,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvv05t",
   "message": "NTA you did your due diligence. SHE did not. Why should you pay? You did check. She lied. You figured it out by not going because you can’t. She knew. She can’t act surprised.",
   "created_utc": 1701647352,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvvelb",
   "message": "NTA",
   "created_utc": 1701647509,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvvp5x",
   "message": "Is your sister's name Karen?",
   "created_utc": 1701647625,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvvygc",
   "message": "Nta,  the dog is your problem. And you solved it by not going,  as a person with a 175 lb mastiff with crazy separation anxiety,   I almost have my wife convinced to buy a small rv",
   "created_utc": 1701647729,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvw1kl",
   "message": "Do you seriously need to make this post OP? C'mon now...",
   "created_utc": 1701647763,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwehf",
   "message": "NTA. She shouldn't have lied.",
   "created_utc": 1701647898,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwf4s",
   "message": "NTA, I bet your sister knew dogs weren't allowed drom the start, but tried the okie doke.",
   "created_utc": 1701647905,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwnvb",
   "message": "Nta I put my dog in a kennel once when we went on a trip. Very high rated and expensive. He got kennel cough even though he's vaccinated. It was awful and I won't do it again.",
   "created_utc": 1701648002,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvwt54",
   "message": "NTA",
   "created_utc": 1701648062,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvxf7l",
   "message": "NTA, your sister had her heart set on the hotel and knew that dogs weren't allowed and told you what you wanted to hear so she wouldn't have to sacrifice on location.",
   "created_utc": 1701648310,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvympm",
   "message": "NTA. I totally get it. If I'm expecting to be able to take my dogs with me (my dogs have separation anxiety) then I expecting to be able to stay at a place where I can bring them. Your sister lied to you (thankfully you did double-check with the owner first). She's either going to have to pony up the fee herself, or invite someone else to go.",
   "created_utc": 1701648797,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvyo0r",
   "message": "NTA.  She lied.  It’s on her.",
   "created_utc": 1701648812,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvz2z9",
   "message": "NTA; you had one caveat, and she lied about it.",
   "created_utc": 1701648982,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvz4bu",
   "message": "NTA: She lied to you and herself. This is on her. Why should you pay for a room you can't use when the only reason you said ok was because she said dogs were allowed.",
   "created_utc": 1701648997,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvzcpp",
   "message": "NTA\n\nYour sister really needs to learn the world doesn't revolve around her - Karen much!\n\nShe outright lied to you  \u0026amp; I bet she expected to tell you last minute \u0026amp; you would just shrug your shoulders \u0026amp; eave the dog at home",
   "created_utc": 1701649089,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvzkz5",
   "message": "NTA. She booked it. She lied.  Good for you for confirming. Now she has to pay.",
   "created_utc": 1701649177,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbvzn12",
   "message": "NTA.\n\nShe's right that the dog is your problem and that you should handle it. What's not your problem is her reaction to your solution. She's nuts if she thinks you should pay for accommodations when you're not going. My guess is that she hoped you wouldn't find out dogs weren't allowed until after you paid. Too bad for her",
   "created_utc": 1701649198,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw0370",
   "message": "NTA. Ffs, what did she think was going to happen?  You asked right away about dog’s being allowed and she lied to you. What if you’d shown up with your dog and weren’t allowed in?  How was she going to fix that?  Folks need to learn how to think ahead.",
   "created_utc": 1701649375,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw0re3",
   "message": "NTA - you made it clear to your sister that you could only attend if Noah could attend. She told you “yes” so you committed.  Now you’ve learned Noah is not welcome and it sounds like your sister knew the hotel said no pets but she just assumed they’d make an exception.  That’s ridiculous! And 100% on her.",
   "created_utc": 1701649644,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw0uq1",
   "message": "NTA your sister on the other hand is definitely the asshole. The audacity of her to lie to you just to get u to pay for a place she knew you couldn't bring your dog. Cut her off until she apologizes",
   "created_utc": 1701649681,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw0vvk",
   "message": "Am I the only one who doesn’t know what a nature hotel is?",
   "created_utc": 1701649693,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw1z1i",
   "message": "NTA. She lied and misled you, therefore it’s all on her.",
   "created_utc": 1701650126,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw23cd",
   "message": "NTAH - this is 100% your sister’s fault.  I book rooms \u0026amp; stuff for our family and if a person wanted to bring a dog, I know to look for dog friendly rooms.",
   "created_utc": 1701650173,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw26so",
   "message": "Did she get a discount based on the number of rooms booked? \n\nI’m wondering if she knew that you wouldn’t come and simply wanted you to pay for the room so that hers was more affordable.",
   "created_utc": 1701650211,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw2bad",
   "message": "NTA. Your sister clearly is.",
   "created_utc": 1701650262,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw2i81",
   "message": "NTA. You mentioned your issue at the beginning.  Your sister outright lied to you.  Then says it is your problem.  A problem she caused. Is she a narcissist?",
   "created_utc": 1701650339,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw2xpc",
   "message": "NTA. It's clearly on their website \"No dogs allowed\". Ownership doesn't put that out there as a negotiation tactic but to make their position clear on pets. Your sister knew this when she booked it. This is her mistake to pay for.",
   "created_utc": 1701650519,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw323y",
   "message": "NTA",
   "created_utc": 1701650571,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw33a5",
   "message": "Your sister is straight up a lying asshole.",
   "created_utc": 1701650585,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw36aw",
   "message": "Lol NTA.  Your dog IS your problem...... which is why you asked up front if dog was allowed.  If she lied, that's HER problem.",
   "created_utc": 1701650621,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3crq",
   "message": "NTA. She is a MAJOR idiot. I can't even get my head around her stupidity. She must be a real genius at her job, if she even has one.\n\nEdit: formatting",
   "created_utc": 1701650697,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3eaz",
   "message": "This is how your *forty year old* sister acts??? I'm so sorry. NTA",
   "created_utc": 1701650715,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3i78",
   "message": "NTA. At best your sister assumed - and you know what they say happens when you assume...",
   "created_utc": 1701650761,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3r6y",
   "message": "NTA, but you can't go anywhere without your dog? How do you manage?",
   "created_utc": 1701650867,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw3rrt",
   "message": "NTA - I have to say though that as someone with a dog allergy, my life is tolerable until I try and sleep in a room that has had a dog in it… then I’m miserable.  As a pet owner, I appreciate “animal free” places JUST AS MUCH as I appreciate places that accept animals.  If I’m staying in a hotel though, I would like to know if I’m going to wake up with my eyes glued shut with creepy allergy issues.  Not a good look, tbh.",
   "created_utc": 1701650874,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw41zc",
   "message": "NTA She lied to you. BUT her lying didnt preclude you from doing your own research before telling her yes and getting her to pay for the reservation so I dont think your entirely blameless. But your sister is way more of an AH for saying dogs were allowed, being pointed out it said no dogs, and then thinking it was going to be fine anyways. Just because she didnt want to find a different hotel/an alternative option. I still think you are entirely in your right to not go/not pay for the reservation (especially if multiple family members are going having a spare room isnt the worst thing) because you asked a very specific question to which she straight up lied to you about.",
   "created_utc": 1701650996,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw44bh",
   "message": "NTA\n\nYou asked, she said the were, when clearly it said they were not. That is how you solved the problem, but not going. You only agreed because she lied. That is on her.",
   "created_utc": 1701651023,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw4kmw",
   "message": "NTA. She lied, so she can deal with the recourse. Stay home with your fur babies, or find a different location that does allow pets if you want to travel for the holidays.",
   "created_utc": 1701651214,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw4l70",
   "message": "NTA. Your sister is the AH for lying to you.",
   "created_utc": 1701651221,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw4x03",
   "message": "NTA, but how do you work or go out there g your home for any real length of time together if your dog has such bad separation anxiety? Also, a boarding facility should be able to handle a dog that is afraid of male dogs.",
   "created_utc": 1701651360,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw55gt",
   "message": "NTA.\n\nYou are doing exactly what your sister demanded. She told you that your dog is your problem to solve, and solve it you did. Staying home with your dog IS a solution.\n\nShe sounds entitled if she thinks she can just rock up to the place expecting the rules to not apply to her. I think you'll have a happier Christmas with your husband and your dogs.",
   "created_utc": 1701651460,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw57de",
   "message": "NTA \nBut I do think you should have checked yourself. The chance that dogs are allowed at a hotel are some to none. \nA solution would be for you to find another place nearby that does allow dogs, and she can find someone else to go with, that can cover your part.\n\nDon't rely on her booking a hotel ever again.",
   "created_utc": 1701651483,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw5b4a",
   "message": "This is just another reason why I don't want a dog",
   "created_utc": 1701651529,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw5hnk",
   "message": "When you say “we both have two dogs” do you mean you have 4 dogs total?",
   "created_utc": 1701651606,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw5ll7",
   "message": "NTA.... your sister should find someone else or change the number of people attending... she trying to get extra cash .... if she call and change the amount of people attending they will change the price....",
   "created_utc": 1701651653,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw5lsa",
   "message": "NTA. You can’t just sneak a golden retriever into a place. Your sister is delusional and does not think that the rules apply to her. She’s wrong, they do.",
   "created_utc": 1701651655,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw5mt4",
   "message": "NTA your sister lied to get you to agree to go in order to keep the costs down.",
   "created_utc": 1701651668,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw5r5n",
   "message": "Your sister lied to you and did absolutely nothing to right the wrong. Too bad. It looks like OP has a snuggly, cozy Christmas coming up with her partner and two fluffy dogs.",
   "created_utc": 1701651719,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw610f",
   "message": "Why would someone want to drag their dog away from its familiar home and bring it to a crowded, strange place it doesn’t belong? I’m so sick of assholes who insist on dragging their shitbrasts everywhere they don’t belong. You probably lie to get your filthy mutt into the grocery store, too. YTA.",
   "created_utc": 1701651838,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw6obn",
   "message": "Your sister lied to you then thinks she can bully you to get her way. The fact that you are here questioning it says a lot. Welcome to unraveling this shit show. I’m sure if you look back over the years you will see more of this gaslighting to get her way and petty tantrums when she doest. The fact that she is so comfortable about it and so brazen when you said you would not go says that the older people will just shrug their shoulders and say that’s how she is and allow it to continue.",
   "created_utc": 1701652116,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw6qa7",
   "message": "NTA, but you'e comments about your special dog are deeply weird. He'd be fine a kennel",
   "created_utc": 1701652139,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw6xfw",
   "message": "I don't understand this at all. I dislike dogs, and I always pick hotels that do not allow dogs on purpose. I appreciate any owner that keeps that rule.\n\nHOWEVER, there are plenty of hotels that are dog friendly. I would love it if all owners went to those hotels. \n\nYou would have your dog friendly hotel and I would have my dog free hotel. \n\nYour sister is a liar and a manipulator.\n\nEither she's going to try and scam the hotel, or she's trying to scam you. Regardless she's an a$$hole.",
   "created_utc": 1701652226,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw6xxo",
   "message": "NTA. You very specifically stated your needs for the dog. She either lied to you about the dog being allowed, or gave false information w/o checking. Then when you double confirmed dogs weren't allowed, she tried to pressure you into an uncomfortable position of trying to screw over/manipulate the owner. And guess what would happen if you still went with the dog and then you/bf and poss others weren't allowed to stay? She set it up to blame you. I hope she is normally a better sister than this, but it seems like very inconsiderate and selfish behavior on her part. Good for you for being responsible, checking yourself, and giving clear expectations/requirements for your attendance. She had all the info she needed and chose to ignore it.",
   "created_utc": 1701652232,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw75bg",
   "message": "Is there any way u can hire a dog sitter ?",
   "created_utc": 1701652322,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw836i",
   "message": "NTA. Your sister makes absolutely no sense. Her logic hurts my head.",
   "created_utc": 1701652730,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw86c4",
   "message": "NTA, but I always check first with the place. I call the hotel directly and ask, and always ask the name of the person you talked to. She knew you wouldn’t go without your dogs",
   "created_utc": 1701652767,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw8fsf",
   "message": "I’m betting that from now on you verify pet rules for yourself. I have seen “pet-friendly” hotels that, when questioned specifically, do not allow cats.",
   "created_utc": 1701652878,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw8pt3",
   "message": "NTA, but your sister is a failure at being the manipulative little minx she thinks she is. She thought she'd lie to you to bring your dogs, then embarrass you into paying a huge amount of money to the owner as a bribe, or to throw away the money you already paid just to go home with your dogs. It's a good thing you got all the brains among your siblings. Don't go, but be sure to send everyone else all the texts, etc. that were sent back and forth about this nonsense. The family has the right to know the truth about why you're not going and not paying, and not just accept the lies she will be telling them. She will deny any of those conversations about the dogs being allowed to have ever taken place, and make you out to be the liar. Make sure everyone else there knows the truth!",
   "created_utc": 1701652997,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw8s0a",
   "message": "NTA",
   "created_utc": 1701653023,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw8tst",
   "message": "NTA. You stated that you were only willing to go if dogs were allowed. She lied to you about dogs being allowed, and now expects you to either leave your dog somewhere even though he doesn’t get along with male dogs, or pay for her vacation.\n\nNope to both.\n\nHonestly, I wouldn’t board my dogs anywhere right now, for any reason. There is a new canine respiratory disease going around that has been resistant to antibiotics. It’s killed some dogs.\n\nYour BC could very well get it, and then bring it home to your GR.\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/mystery-illness-affecting-dogs-across-united-states-2023-11-29/",
   "created_utc": 1701653045,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw94fq",
   "message": "\u0026gt;The first thing I asked my sister was if I was allowed to take Noah\n\n\u0026gt;She said yes, that dogs were allowed\n\n\u0026gt;She said that our dog was our problem and we needed to see how we solved it. That it was up to me to see if dogs were allowed or not.\n\nYour sister is telling you straight up that you cannot rely on her. However you choose to resolve this issue, you should remember that going forward.",
   "created_utc": 1701653174,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw9fye",
   "message": "NTA. \nGood on you for verifying before showing up with said dog. Many people have allergies and pick hotels that specifically do NOT allow dogs/pets. If people could just show up and throw $$ at the hotel, anyone, if not many people could get very sick and potentially die, from selfish spoiled people like your sister. She made the booking, and then she lied. She should learn her lesson. You asked from the beginning, and stated your needs. She thought she could bully you into what she wanted, no thoughts to the needs you communicated.",
   "created_utc": 1701653313,
   "score": 1,
   "submission_id": "18a4tfe"
  },
  {
   "comment_id": "kbw9l8q",
   "message": "NTA \n\nYou asked if your dogs were allowed and she lied to you.",
   "created_utc": 1701653377,
   "score": 1,
   "submission_id": "18a4tfe"
  }
 ]
}