{
 "submission_id": "18a4jfp",
 "title": "AITAH for calling my (F38) partner (M31) a “useless c*nt” for sleeping in while I was going through an pregnancy termination (abortion)",
 "selftext": "We have been exclusive 9 months. Known each other a year.\n\nI didn’t want to terminate the pregnancy so it was an emotional time for me, but he isn’t ready to be a father (he lost his licence drink driving, his employment is unstable and he going through depression, but not seeking counselling).\n\nOn top of the emotional factor, a medical termination can be physically painful, exhausting and quite scary. There can be a lot of blood loss and the pain is like really, really bad period cramps along side crazy unregulated hormones caused by the medication.\n\nBecause of this the doctor advised that someone stay with me the whole time to keep an eye on me, look after me, make sure I didn’t faint, excessively bleed, call the hospital if there are any complications, ect.  \nBut more than that just make me feel loved, cared for, bring me cups of tea, ect, in a time where I was feeling scared and vulnerable.\n\nHe agreed to come to my house to look after me.\n\nI took the medication at 8am. He knew the pain and bleeding will start half an hour after that.  \nHe didn’t get out of bed until 1:30pm.\n\nApparently, he got out of bed at around midday, couldn’t find me in the house (I was outside feeding the chickens) so he went back to bed.\n\nWe went to bed the same time (around 10pm). He often stays in bed until the afternoon on the weekends just scrolling on his phone.\n\nI told him he should’ve come to check on me as I could have fainted in the garden.\n\nWhen a particularly painful wave passed through me I frustratingly called someone else “a useless c\\*nt as well”, meaning I was indirectly referring to him as a “useless c\\*nt” too.\n\nThis is the first time I have use this kind of language towards him, although I have expressed in the past that I need him to put in a bit more effort into our relationship and not leave me to do everything.\n\nI try to make an effort to express this kindly, although I feel so frustrated.\n\nHe was upset but after that he, reluctantly and with prompting, helped me around the house and with some renovations, made me a hot chocolate with milk (I am lactose intolerance) and played a board game with me. We didn’t have any dinner and I made myself a small lunch because I knew I had to eat something.\n\nI was feeling increasingly irritable and frustrated with him the whole day and would make passive aggressive comments.\n\nLuckily  the termination was relatively easy and the pain was bearable so I could look after myself, make my own lunch, ect.\n\nThat night he barely spoke to me, spent the time scrolling or playing a game on his phone and didn’t hug me. I didn't make and effort to reach out either.\n\nThe next morning I said I was feeling better but I needed him to carry down a 20kg bag of chicken feed as I was still weak. He didn’t and he left back to his place in the afternoon.\n\nWe have barely spoken since and he has not asked how I am doing or checked up on my welfare. He is obviously still upset at me.\n\nI shouldn’t have used that kind of language on someone with depression but I don’t think I was in the wrong to be frustrated at him. He seems to think he has done everything fine but him not pulling his weight in this relationship has been an ongoing issue for me.\n\nI also earn more and own my own home so it is not like he is providing financially. Or emotionally. He helps me a lot with my home renovations, although it is clear he doesn't want to. But a job that will take me hours to do will take him, as a tradie, 20 minutes. I do try and express my gratitude and try to help him so he doesn't feel taken advantage of.\n\nI've no doubt he loves me and has good intentions, but are good intentions enough if not followed by action? \n\nHe says he is not normally this unmotivated and is not sure if it is physical or psychological, but it has been going on over a year.\n\nMaybe just different priorities/ standards/expectation in life but from what I have seen so far he will not carry the equal weight of childrearing.\n\nHe said he will pull his weight when we have children and says he wants to have children with me next year when he gets his driving licence back.\n\nShould I give him the benefit of the doubt, hope that this is just a passing phase due to his mental health, and stick around that long?",
 "created_utc": 1701640615,
 "permalink": "/r/AITAH/comments/18a4jfp/aitah_for_calling_my_f38_partner_m31_a_useless/",
 "score": 40,
 "url": "https://www.reddit.com/r/AITAH/comments/18a4jfp/aitah_for_calling_my_f38_partner_m31_a_useless/",
 "comments": []
}