{
 "submission_id": "18a5mr2",
 "title": "AITAH for being mad that my boyfriend's ex wife ruined my birthday plans?",
 "selftext": "I'm a 38 year old female. Been with my boyfriend for 4 years now. His ex has always been an issue but we deal with it. He has a 14 year old son. I don't have much of a relationship with him because his mom doesn't like the fact that his dad moved on after the divorce and she hasn't. She was caught cheating BTW and the man she cheated with went back to his wife. So, she is bitter towards us. Now, my boyfriend and I have been making plans for my birthday. We planned a day together,  going on a short road trip and then dinner. My boyfriend already told his ex that he would be out of town that day if their son needed anything. Everything was fine up until  that morning.  He gets a call that his son's mother has decided to go out of town and she was dropping their son off. I asked him to inform her that we had plans as discussed previous and she needs to adhere to the plans. It was her weekend to have him anyway.  My boyfriend refused . Any other time, I tell him his kids come first but this was my day. My one day out of the year that I ask to be accommodated. I never ask for anything during the holidays, this is just MY day.  His son gets bored easily and is constantly complaining so the entire day will be miserable with him constantly wanting to go home.  My boyfriend asked if we could reschedule. I told him NO!!  This is the one time I ask him to do for me and he can't. I told him to have a great day with his son, I was going to celebrate by myself.  He got mad and said I was not being fair. I explained to him that it isn't fair for him to coward down to his ex wife and stick the plans. She KNEW we were going out of town. So I left and did my own thing by myself.  AITAH for celebrating my birthday without him?",
 "created_utc": 1701643538,
 "permalink": "/r/AITAH/comments/18a5mr2/aitah_for_being_mad_that_my_boyfriends_ex_wife/",
 "score": 20,
 "url": "https://www.reddit.com/r/AITAH/comments/18a5mr2/aitah_for_being_mad_that_my_boyfriends_ex_wife/",
 "comments": [
  {
   "comment_id": "kbvy1us",
   "message": "Why tell her plans so she can ruin them? He’s 14 not an infant. I’d dump him for this.",
   "created_utc": 1701648559,
   "score": 65,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvqrv7",
   "message": "NTA. I know you understand kids come first but this isn't that. One day of the year, as you said. It's more about the ex's manipulation and his knuckling under to her. \n\nI'm so sorry, but happy birthday, and make it a great year, with or without him.",
   "created_utc": 1701645695,
   "score": 69,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvng5g",
   "message": "NTA you absolutely come second but your bf also needs to know how to roll with it and have a contingency plan for his kid. The kid is 14, he’s old enough to stay at home for the day, or have a neighbor check on him, or have a parent of his kid’s friend watch him, something other than having to drag him along on your day out",
   "created_utc": 1701644387,
   "score": 163,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvvm1a",
   "message": "NTA. Since it was her weekend to have the kid she did it on purpose.",
   "created_utc": 1701647590,
   "score": 114,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvxw1k",
   "message": "NTA\n\nHe knew what she was doing, you knew what she was doing. \n\nFind a better boyfriend",
   "created_utc": 1701648493,
   "score": 49,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvnolu",
   "message": "NTA, Your BF needs to make you a priority. His son will always be top priority but in this case, there was no reason for him not to stick up to his ex. If his son had been injured or some emergency was happening, I could understand his position. That’s not the case here. His ex wife did this to be spiteful. If he allows her to do this, and doesn’t hold her accountable for her childish behavior, she will keep doing this. Your BF just set a precedent with his ex that she can screw up your plans whenever, without impunity. Not to mention how this must be on their 14 year old. Being put into the middle of his Mother’s childish antics that his Father allows. It’s tough enough at that age, he doesn’t need his Mother pretending to be Jigsaw from Saw, “I want to play a game.”",
   "created_utc": 1701644481,
   "score": 76,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvva2p",
   "message": "NTA  Putting his children first is understandable but in this case after 4 years he is still putting his ex's wants  over you. This isn't going to change. It may time to evaluate if you always want to be third place in this relationship.",
   "created_utc": 1701647460,
   "score": 32,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvvvta",
   "message": "NTA She did it out of spite and your husband is spineless. He should have said no, we already said you have plans for ops birthday and you cant simply say \"Im droping son at your house cause I want to do a last min trip\". Honestly this is a Hill to die on, cause first it your birthday, next a something even bigger and when you know it its your honeymoon.",
   "created_utc": 1701647700,
   "score": 34,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2zhm",
   "message": "NTA I just want to say good for you!! I hope you had a great day 😞",
   "created_utc": 1701650539,
   "score": 7,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw27tw",
   "message": "NTA \n\nYour BF is a dad first \u0026amp; foremost we all get that, however it was NOT his scheduled weekend, it wasn't an emergency, just a nasty spiteful b!tch ex trying to ruin your plans \u0026amp; your spinless BF let it happen - and the best, he gets upset at you for still continuing on with your plans!!!\n\nYour BF is an A-H for this, good dad, no-one disputes this BUT an A-H of a BF\n\nHappy Birthday OP?? \n\nAs sad as it is to say, I truly believe if you stay with your BF this will probably be the norm going forward!",
   "created_utc": 1701650223,
   "score": 13,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvx4fi",
   "message": "NTA.. you will always come last until he steps up to his ex.. I understand it’s his son but you asked for one day.. I would have gone and done my own birthday as well.",
   "created_utc": 1701648189,
   "score": 12,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw012l",
   "message": "NTA.  Your boyfriend has a spine problem if he can’t tell his ex “no”; when it’s not his scheduled visitation day.  You’ll have other birthdays, but if your bf’s spine hasn’t already grew in, it probably isn’t going to at his age.",
   "created_utc": 1701649351,
   "score": 12,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvx38n",
   "message": "Yeah I would be annoyed too. It was not medical emergency and it s clear ex did it on purpose. You are both going out of town so not sure why ex wouldn’t be able to take the son more than you would. Your bf is relying too much on you to be the bigger person to please his ex or avoid conflict",
   "created_utc": 1701648176,
   "score": 18,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvze0o",
   "message": "You were right to celebrate your birthday by yourself since your boyfriend is choosing to put his ex before you. \n\nI myself would never stay with anyone who does this and it is never going to change.",
   "created_utc": 1701649103,
   "score": 15,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvxgg7",
   "message": "NTA   \n\nHope you managed to have a decent  birthday",
   "created_utc": 1701648324,
   "score": 15,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvyumc",
   "message": "NTA, Happy birthday, OP and your bf is the AH. Stop putting up with this guy and his ex-wife's nonsense they are both terrible. I can't understand why you tolerate his crap! He is just a bf, I would bail.",
   "created_utc": 1701648887,
   "score": 10,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2cmz",
   "message": "Ex's weekend, her job to take care of son. The kid is 14, he is also an age where he can be alone during the day.",
   "created_utc": 1701650276,
   "score": 10,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2ebh",
   "message": "NTA. I’m not sure why he felt the need to tell his ex he was going to out of town with you. It was her weekend with her son. She didn’t need to know you two were taking a short trip. \n\nIt would be a deal breaker for me. She did this to exert her control over him and he caved. If he told her no, she would have had to make other arrangements or cancel her trip out of town. It wasn’t his problem to solve as it was her weekend with their son. He prioritized her ego over your birthday. She cheated because she didn’t respect him, so seeing him be weak with her would permanently give me the ick. Now both you and the ex-wife know that she can snap her fingers and disrupt your relationship.\n\nYour boyfriend is not ready for a relationship until he is able to establish and maintain boundaries with his ex wife.",
   "created_utc": 1701650295,
   "score": 10,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2hp9",
   "message": "NTA. My husband's exwife did this EVERY WEEKEND that was A HOLIDAY, even ruined out honeymoon to mexico. He and I both worked so the 3 day weekends when we didn't have the kids was when I tried to plan things, for the first couple of years. The kids just ended up living with us and my husband still paid her child support too.",
   "created_utc": 1701650333,
   "score": 9,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvudfw",
   "message": "No you’re not. His child is his problem especially if he let’s his ex manipulate him. Why should you not celebrate your birthday as you planned.",
   "created_utc": 1701647103,
   "score": 11,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw75tq",
   "message": "okay but like.....he's 14 why can't he just stay home lol",
   "created_utc": 1701652328,
   "score": 4,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw3r0v",
   "message": "She sabotaged your plans on purpose, and he let her. NTA. Next time, don't telegraph your plans to her... if there is a next time.",
   "created_utc": 1701650865,
   "score": 7,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvy3qm",
   "message": "NTA \n\nYou're too old to mess with a spineless man. He needs to step up with boundaries or you cut him loose",
   "created_utc": 1701648582,
   "score": 9,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw3ndt",
   "message": "Nta. This is a power move. She is trying to prove to you and your BF that she will always come before you.",
   "created_utc": 1701650822,
   "score": 3,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw3p2b",
   "message": "NTA.  Kids always come first but in this one instance it should have been about you",
   "created_utc": 1701650842,
   "score": 3,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw3yon",
   "message": "She’s doing it because she knows he’s weak and easy to manipulate. He is",
   "created_utc": 1701650957,
   "score": 3,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw7m83",
   "message": "NTA but your bf is a problem. You should ask yourself if this is the life you want",
   "created_utc": 1701652527,
   "score": 3,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvyb28",
   "message": "Definitely NTA. He chose to accommodate his ex \u0026amp; change plans. Its still your bday. You have a right to celebrate. BUt ultimately I dont think this relationship is gonna work. You have 4 more yrs til kiddo is an adult",
   "created_utc": 1701648665,
   "score": 6,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvyold",
   "message": "NTA, but you need to decide for yourself if this is the future you want. It’s clear this isn’t a one off instance, and this is not an issue that will be going away. Your bf unfortunately comes with a son and a manipulative ex. It doesn’t sound like he has any interest in standing up to her, and you most likely will not be prioritized over his son, regardless of circumstances. \n\nIf you choose to stay with him, it could help to manage your expectations or to try couple’s/family counseling.",
   "created_utc": 1701648818,
   "score": 6,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2lm6",
   "message": "Your boyfriend needs to grow a spine. Putting your child first is generally a good thing, but being a doormat to your ex is not.\n\nNTA. I'm sorry your birthday was ruined.",
   "created_utc": 1701650378,
   "score": 4,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw3lk0",
   "message": "NTA. Your “boyfriend” put his ex-wife before you by caving in to her and taking his son instead of saying no. If he doesn’t understand this, then it’s time to move on.",
   "created_utc": 1701650801,
   "score": 4,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw4jzf",
   "message": "No she only did that to ruin your day. If it get weekend he shouldn’t be telling her anything.",
   "created_utc": 1701651207,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw4phw",
   "message": "NTA you need to rethink this relationship. Your boyfriend obviously put you second to his son. That's not a bad thing, but do you want to be second fiddle to a 14-year-old.",
   "created_utc": 1701651271,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw50tg",
   "message": "NTA\n\nI'm so glad you proceeded with your plans. Maybe it'll be the wake up he needs that his ex is NOT entitled to information and HE will be the one paying for her manipulation, on his own. Do NOT apologize for celebrating your birthday. He wasn't even willing to tell her no. If he tries to say that maybe yalls relationship won't work, please agree with him and don't let his attempt of manipulation back you down",
   "created_utc": 1701651406,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw51wp",
   "message": "NTA. His ex is playing him and he is letting her. He’s the fool, not you. Good for you for going on your own!",
   "created_utc": 1701651419,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw54z9",
   "message": "NTA. Make it clear to your boyfriend that he knows and you know his ex is using his son to drive a wedge in this relationship because she's spiteful and bitter. Also inform him whether the 2 of you get through this incident she will continue to use his son anytime she can to interfere with his romantic life until she gets one of her own so he needs to find his spine and set some boundaries with her.",
   "created_utc": 1701651454,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw5bt6",
   "message": "NTA.\n\nI get that when you have a kid, the kid comes first. But op, that doesnt mean that you have to just settle for being on the backburner for the rest of your life.\n\nIf your boyfriend refuses to prioritize you *one day* out of the year, then you deserve someone who will. It wasn't an emergency. Your bf wasn't needed to take care of the kid or go to the hospital or whatever. His ex did it on purpose and your bf just caved.\n\nFind someone who will put you first, op.",
   "created_utc": 1701651537,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw5h01",
   "message": "NTAH.  I'm reading all of your comment replies shaking my head, girl leave him.  His ex is getting the results she wants and will not let up any time soon and that is not your problem, let him learn the hard way.  Focus on yourself for a bit.",
   "created_utc": 1701651598,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw5mjb",
   "message": "What were these last minute plans that the ex had that were so important she couldn't keep with her agreed upon custody schedule, but also impossible to include a 14 year old kid in?",
   "created_utc": 1701651664,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw5uq5",
   "message": "NTA, his ex is his problem. He should know her better than you, yet he allowed her to harm you indirectly like this. He should be the one apologetic, not expecting you to go along with his messy tango with his ex. Anyone who get mad at others when the problem obviously his,  is not mature enough for a relationship.",
   "created_utc": 1701651762,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw5uzs",
   "message": "NTA\n\nBF shouldn’t have told the ex anything about being gone that day.  She had no need to know. \n\nShe knew exactly what she was doing. And for all either of you know she stayed at a nice hotel in town or just went back home. \n\nI do agree the children’s needs come first.  But this was so obviously the ex screwing with your bf and definitely screwing your plans it’s ridiculous. \n\nHopefully he will decide to pull out his divorce decree as to visitation and decide to enforce it with no exceptions. \n\nHer time with the kiddo then she needs to find a caregiver to stay with him or cancel her plans. That would also apply to him.",
   "created_utc": 1701651765,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw64ji",
   "message": "*My boyfriend already told his ex that he would be out of town that day if their son needed anything.*\n\nI have to wonder if he already told his ex that he'd be out of town knowing that his ex would pull some stunt.\n\n*His ex has always been an issue but we deal with it*\n\nBased on the rest of your post, it doesn't sound like the 2 of you deal with it. It sounds like YOU deal with it and get the short end of the stick while he has zero boundaries for putting a stop to her bs.\n\nNTA and after you enjoy your day, take some time to think about the likelihood this relationship is going to be sustainable. Sounds like no.",
   "created_utc": 1701651881,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw64v2",
   "message": "NTA. You have every right to do whatever you want for your birthday.",
   "created_utc": 1701651884,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw6hmp",
   "message": "NTA. This is a boyfriend problem not an ex wife problem. He’s not setting boundaries dairies with her and he shouldn’t have backed down especially since you made plans before she did. He needs to have your back and he doesn’t. This would be a deal breaker for me.",
   "created_utc": 1701652036,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw7egs",
   "message": "Proud of you for going without him. If he wants to let ex hijack his weekend you can't stop him, but you can refuse to let her do it to you, and you did.\n\nI wish someone could explain to 14 that he is being excluded from things due to unpleasantness.",
   "created_utc": 1701652433,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw7qvr",
   "message": "NTA. If My ex did this to my current girlfriend, I'd  open a world of hell on her like she has never seen before. I put my kid before anything BUT, there are times that my kid can take second fiddle for the day unless it's about their safety and well being. All these people saying YTA are probably just like your boyfriend's ex. A manipulative pile of crap. Literally. Don't listen to them. It was only one day you asked.",
   "created_utc": 1701652583,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw82b3",
   "message": "Well sounds like you’re willing to deal with this so just get used to it. If you marry him expect the same treatment no matter how old the kid gets. I hope he’s worth it.",
   "created_utc": 1701652719,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw8nlp",
   "message": " NTA personally, I don’t know why you would even want to stay with him after this, and I would be blunt and honest with the son. Does he even know his mom cheated? Who cares if she gets upset, I would be calling out her behavior and letting the son know exactly the type of person she really is.",
   "created_utc": 1701652971,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw8vhh",
   "message": "NTA. There really was no need to tell her that he was going out of town.",
   "created_utc": 1701653065,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2g2d",
   "message": "The son is 14 and old enough for dad to have conversations about dad having a life when he’s not around.  I feel dad should be able to let the son know he is important, but OP is equally important to him.  In the future, maybe dad can let the son know when he has plans where he won’t be available. It would show the son that dad is treating him like a full human being, and not just an object caught between two people who don’t really like each other.  \n\nBy that age, I would let my daughter know where I would be, before I told her mom.",
   "created_utc": 1701650314,
   "score": 3,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw091y",
   "message": "Why did you get involved with someone who already has a kid, a toxic ex and never stands up to her? You knew this would be your life when started dating him. So how are you still mad after 4 years?",
   "created_utc": 1701649441,
   "score": 5,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2wnz",
   "message": "NTA\nthe ex did this on purpose \u0026amp; you responded appropriately. however you BF did not, he needs to set boundaries with her \u0026amp; adhere to them unless it is an absolute emergency.\nI have 4 kids with my exhusband. Last year he had made travel plans for his wifes birthday that put him out of town for half of fall break when hes supposed to have the kids. When he told me I simply said Id keep the kids \u0026amp; we arranged to split another break where hed get some extra time. \n (btw my ex married his affair, SO WHAT, he still has the right to move on with life, we have kids so why make life difficult for everyone)",
   "created_utc": 1701650507,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw0dbf",
   "message": "Nah, you’re NTA in this situation. You’re completely aware of the fact that he’s a package deal. He’s going to have to stop letting the ex dictate everything or it will go on forever.",
   "created_utc": 1701649490,
   "score": 2,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw0b18",
   "message": "NTA but is there a grandparent that might enjoy a visit for a day? How about an aunt or uncle with cousins? This need not be a power struggle if you lean on your support system to take him for a last minute, unplanned day that his mother dumped on you. If you had to work you could be expected to to do the same thing and if your kid is happy to see them then everyone wins (except the ex with her sabotage plans)",
   "created_utc": 1701649464,
   "score": 255,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2tiw",
   "message": "I have to wonder if the ex would have done this if she knew nothing about your plans.  No judgement.",
   "created_utc": 1701650470,
   "score": 0,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvo8kh",
   "message": "Nta. Sounds like you shouldn't be with someone who is a parent because if he is a good one, you will always encounter this type of behavior towards you unfortunately",
   "created_utc": 1701644705,
   "score": 232,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw8873",
   "message": "Yta",
   "created_utc": 1701652789,
   "score": 0,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2qe1",
   "message": "Are you the asshole for celebrating your birthday without him? No that was the most reasonable thing you could have done under those circumstances.   \n\n\nCalling him a coward was kind of an asshole thing to do though. Because at the end of the day lets say he told his ex that he told her already he had plans sorry and ex just leaves the kid at home alone or out in front of his house, what are his options? Ignore the kid and risk them doing something stupid unsupervised or canceling mid plans to pick up kid anyways. If this is a frequent issue he should probably be pushing for sole custody on the grounds that the mother is showing that she's unfit by being unavailable during the periods when she has custody but even if he did that you still have the issue of him having the kid and either the kid having to be included in your you time or otherwise occupying his time.   \n\n\nAt the end of the day you're a grown ass woman and his kid will always be his responsibility both morally and legally at least until the kid is grown and that means the kid has to be his priority so you don't get to pick a day for him to choose you over the kid. It sucks but that's the way it is.",
   "created_utc": 1701650434,
   "score": 248,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvmml7",
   "message": "So, look, I get being disappointed. I get his ex was a major asshole. \n\nHis son always, always, ALWAYS comes first, ma’am. Every single time. Every holiday, every Hallmark Holiday, and your birthday too. You don’t do the guy any favors by acting like a child in addition to the child he already has to care for because his ex is acting like a child. He’s honestly the only adult amongst any of you.\n\nYou aren’t an AH, I get being upset. His ex is the major AH here. Just….. recognize he isn’t the AH here, either.",
   "created_utc": 1701644060,
   "score": 208,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbvn165",
   "message": "Children always comes first no matter if it is YOUR day don’t date people with kids if you can’t handle it if he wants to have his son let that man have his son",
   "created_utc": 1701644222,
   "score": 213,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw1gvn",
   "message": "YTA. His child should (and sounds like will) always come first. The ex did him dirty but that doesn’t mean he can abandon his kid on the porch so you two can enjoy the day. If the parents feel the kid can’t be alone for the day then your boyfriend has to be a soft place for his kid to fall when his mother dumps him out of spite. You can be mad and frustrated; but obviously dating a parent is not for you. Move on for everyone’s sake. The kid doesn’t need another adult in his life who doesn’t put his interests first.",
   "created_utc": 1701649923,
   "score": 223,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw2zii",
   "message": "When you're a parent, sometimes you have to be flexible. Boyfriend is NTA.\n  \nYou have a right to be hurt, but clearly you are not ready to become a loving stepparent to this child. No need to throw a tantrum, just do your birthday thing by yourself if that's what you want to do.\n  \nEx-wife is major AH, but no need to take it out on boyfriend or son.",
   "created_utc": 1701650540,
   "score": 243,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw7u8s",
   "message": "Rethink the relationship for sure. And don’t skywrite all your itinerary.  NTA",
   "created_utc": 1701652623,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw8gpe",
   "message": "NTA, your boyfriend tried to manipulate you after he let his ex screw with your birthday plans, find a new boyfriend if he doesn't understand that he was screwing you over just as much as his ex was.",
   "created_utc": 1701652889,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw94c9",
   "message": "NTA. I'm all for \"kids come first\" but this was done on purpose and was not an emergency. I'd be pissed off too",
   "created_utc": 1701653173,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw95me",
   "message": "Had a friend who was with a man who had gotten divorced within a year from the time my friend and him met. His ex did this kind of stuff. For years and years. If she's a horrible person and unattractive, it's less likely she will find someone to distract her from you two, so she will make your lives miserable as long as she can. I understand the father, but he needs to also understand that he cannot let himself be manipulated. His son is no longer a baby and he could have stood his ground and let her know she could take him where she was going, that he had plans. Rent a hotel room if it was a job interview or whatever and park her son's 14 yr old behind there for a while. Like others said, you are going to have to keep your info to yourself instead of trying to be reasonable, because she won't be. I wouldn't say this is breakup worthy, but he does need to be less emotional and know that if he's trying to set up a new life with you, your feelings also matter. I find that most divorced parents usually do things for their kids out of guilt. He needs to work on that if that's his case.",
   "created_utc": 1701653189,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw9e2e",
   "message": "Aside from this one incident, would you still be with him?",
   "created_utc": 1701653291,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw9hwx",
   "message": "First couple posts and wasn’t what I thought I’d see.\n\nMy first thought was, your boyfriend is a father. You bought into a family. It would seem he wasn’t going to play games with his son over what his mother did.  And she most likely did it just to piss you off.\n\nYou are right to feel disappointed and spending your day how you like sure doesn’t make you TA, but don’t be mad at your BF for not letting his son suffer having an AH for a mother.",
   "created_utc": 1701653337,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw9ibg",
   "message": "First couple posts and wasn’t what I thought I’d see.\n\nMy first thought was, your boyfriend is a father. You bought into a family. It would seem he wasn’t going to play games with his son over what his mother did.  And she most likely did it just to piss you off.\n\nYou are right to feel disappointed and spending your day how you like sure doesn’t make you TA, but don’t be mad at your BF for not letting his son suffer having an AH for a mother.",
   "created_utc": 1701653342,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw9iqp",
   "message": "First couple posts and wasn’t what I thought I’d see.\n\nMy first thought was, your boyfriend is a father. You bought into a family. It would seem he wasn’t going to play games with his son over what his mother did.  And she most likely did it just to piss you off.\n\nYou are right to feel disappointed and spending your day how you like sure doesn’t make you TA, but don’t be mad at your BF for not letting his son suffer having an AH for a mother.",
   "created_utc": 1701653347,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw9s18",
   "message": "Get out of that relationship ASAP because you will never be valued as nothing but second-rated I have a lot of experience from that and put up with more than I should have",
   "created_utc": 1701653459,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbw9wkr",
   "message": "he ex cheated but is bitter at both of you? Something sounds missing. \n\nThat said, you shouldn't be mad at his ex but at him. A grown man can't make you feel special any day but your birthday and only if you plan it and his ex let's him? Wtf. There are 365 days a year. You don't feel special because you aren't. Stop blaming the ex. He is the issue.",
   "created_utc": 1701653513,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbwa5u7",
   "message": "NTA. My sisters husbands ex is exactly this. You need to put your foot down.",
   "created_utc": 1701653624,
   "score": 1,
   "submission_id": "18a5mr2"
  },
  {
   "comment_id": "kbwa5y8",
   "message": "NTA, and I am saying this as an ex with kids that age between us. Medical emergencies, sure! I had to get a babysitter for my time with the kids while I was working, and my ex has to do the same thing. If I have a weekend planned (like next weekend I am doing a stay-cation with my best friend), then we plan it well in advance. My 11 year old wants to go to her friend's for the weekend. I told her that it is her dad's weekend now, so up to him what he does with her. I will be out of town. My husband will be working. The adult children and 16 year old will be working. So, he is in charge of what happens to the 11, 12, and 14 year Olds. In your case, your boyfriend's ex did this on purpose. I would clearly tell him we are breaking up because of his ex. Not because of the kid. He needs to see that he has to deal with adult issues like his ex and his current relationship.",
   "created_utc": 1701653626,
   "score": 1,
   "submission_id": "18a5mr2"
  }
 ]
}