{
 "submission_id": "18a669q",
 "title": "AITAH for asking my brother to change the time of the dinner reservation he's made for his birthday?",
 "selftext": "My (28M) brother (23M) was born on February 29. Next year is a leap year and he's made reservations at a local restaurant and invited everyone to dinner. There is no with the restaurant he's booked a room at. The issue is the start time. Our sister (27F) follows intermittent fasting for diet and weight loss/maintenance. She only eats between the hours of 1:00pm and 7:00pm. Inside of the those hours she can eat and drink whatever she wants. Outside of those hours she only drinks water. No eating or drinking anything other than water.\n\nThe issue is that my brother has made the reservation for 7:30pm. This is outside of our sister's eating window. She asked him to move the reservation to an earlier time because she doesn't ever make exceptions to eating outside her 6 hour window, but my brother said the only other time the restaurant had an opening is 3:30pm. He said he doesn't want to take the earlier opening because some of the people he's inviting are working that day and won't be free until the evening (February 29 is a weekday) I think our sister being family is more important than some random friends. My sister takes her eating window seriously and I can't believe my brother isn't being accommodating. He just argues with anyone who tells him to change the time. AITAH for saying he should be more accommodating of our sister? She's really hurt that it seems like he doesn't care.",
 "created_utc": 1701645014,
 "permalink": "/r/AITAH/comments/18a669q/aitah_for_asking_my_brother_to_change_the_time_of/",
 "score": 192,
 "url": "https://www.reddit.com/r/AITAH/comments/18a669q/aitah_for_asking_my_brother_to_change_the_time_of/",
 "comments": [
  {
   "comment_id": "kbvpjhd",
   "message": "YTA.  She can just eat beforehand and show up for the company.  People shouldn’t need to accommodate her.",
   "created_utc": 1701645222,
   "score": 171,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvpvsu",
   "message": "YTA. It’s one night and tbh it seems like you and your sister don’t care that it’s HIS birthday. Also that he actually only gets to celebrate on the day once every 4 years. I’m sure it’s not a big ask for your sister to eat outside her fasting window for once. It’s not going to do any harm at all. If it bothers her that much, then she shouldn’t go. It’s your brothers night, stop making it about anyone else.",
   "created_utc": 1701645357,
   "score": 49,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvpp0t",
   "message": "YTA. Why do you think your sister’s choice about eating times is more important than your brother’s birthday wishes. It’s one day, she can stop being selfish and deal with it instead of inconveniencing everyone else.",
   "created_utc": 1701645284,
   "score": 163,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvrvz8",
   "message": "YTA and so is your sister. The world doesn't revolve around her self imposed dietary restrictions.\nI can't imagine how self centred she much be to expect it to, but seeing how you enable her it's not that surprising.",
   "created_utc": 1701646126,
   "score": 55,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvq3sb",
   "message": "YTA. Your sisters diet isn't anyone else's problem. She can have some water. It isn't her fuking birthday. And you're a clown for even getting involved.",
   "created_utc": 1701645441,
   "score": 214,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvr4d6",
   "message": "\"The needs of the many outweigh the needs of the few -- or the one.\" -- Some science fiction dude\n\nIf the only options for your brother at the restaurant he wants to eat at for his birthday are 7:30 pm or 3:30 pm, then I don't blame him for taking the 7:30 pm opening so that his friends can attend.  That is not an unreasonable hour for a dinner party.  3:30 pm on a weekday, on the other hand, is ridiculous.\n\nYour sister can make an exception to her eating schedule for one night.  If she chooses not to make an exception, fine, but that's her choice.  She can eat beforehand and just show up for the celebration.  Or she can stay home and pout.  ¯\\\\\\_(ツ)\\_/¯",
   "created_utc": 1701645831,
   "score": 192,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvsrpf",
   "message": "YTA I follow IF as well and it is no problem adjusting her eating window by a couple of hours for this occasion. She can open her window two hours later than usual and enjoy the birthday dinner. If she doesn’t want to do that, she can go and drink water or unsweet tea or black coffee and be there to celebrate. It’s not about you or her, it’s about him. Imagine only having a birthday once every 4 years and some asshole wants you to reschedule it to suit them!?!",
   "created_utc": 1701646474,
   "score": 128,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvvydm",
   "message": "YTA. Your brother literally has a birthday that falls once every four years. 330 is a ridiculous time to ask somebody to have their birthday dinner because one person has a completely offbeat eating schedule.\n\nFair enough on her that that is what she does, and if it works for her great. I’m not going to say she has an eating disorder, because I don’t know. \n\nBut I do know if it was my sister. I would look at her and ask her if she was fucking kidding me that she thought I should give up who I wanted at my birthday celebration because she can’t eat. I would be telling her that she can eat ahead of time and still come because I’d like to see her, but fuck that bullshit I don’t get to have a nice birthday for someone whose birthday it isn’t. \n\nJFC, please tell me, you are not always pushy and bossy and entitled where you think everyone has to accommodate your sister.",
   "created_utc": 1701647728,
   "score": 122,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvw7za",
   "message": "YTA who the fuck eats dinner at 3:30?",
   "created_utc": 1701647830,
   "score": 67,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvrdj5",
   "message": "YTA and your sister is an asshole. Go or don’t go. Those are your options.",
   "created_utc": 1701645928,
   "score": 52,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw0j9c",
   "message": "YTA. one day she can make an exception.  Your brother only has his birthday on his actual birthday once every four years.  \n\nBe less self centered.",
   "created_utc": 1701649557,
   "score": 51,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvqt02",
   "message": "YTA and so is your sister. PeriodT",
   "created_utc": 1701645707,
   "score": 43,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw0n9e",
   "message": "It’s his birthday. Why does he have to accommodate your sisters eating window? Either eat before going or don’t go.",
   "created_utc": 1701649600,
   "score": 39,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw36f3",
   "message": "This has to be a troll post. Nobody is this ignorant.",
   "created_utc": 1701650623,
   "score": 37,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw49pl",
   "message": "Your sister is a moron.\nYou can absolutely take a day off from fasting or she can move her window to 3 - 9 pm or 4 - 10 pm.\nIntermittent fasting is not supposed to be that rigid.",
   "created_utc": 1701651086,
   "score": 33,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvqota",
   "message": "YTA.\n\nAnd your sister has an eating disorder. You can dress it up as a diet but she needs therapy because her \"diet\" and refusal to change it for even one night is not healthy.",
   "created_utc": 1701645662,
   "score": 62,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw3fr6",
   "message": "YTA she can shift the time for ONE day, instead of 1 to 7 make it 2 to 8. Its ONE DAY. Besides, what does she do during Daylight savings time?",
   "created_utc": 1701650733,
   "score": 29,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvr22l",
   "message": "\nYes, YATA\n\nI didn't have to read too far to figure out that YATA.\nOn his birthday, everyone can eat or not eat, it's up to them.",
   "created_utc": 1701645806,
   "score": 21,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvsbda",
   "message": "\u0026gt;Our sister (27F) ~~follows intermittent fasting for diet and weight loss/maintenance.~~ has an eating disorder. She only eats between the hours of 1:00pm and 7:00pm.\n\nFixed it for you. You are TA not only for demanding that your brother change the reservation time, but also for glossing over your sister's behaviour. Instead of demanding that people change things for her, you should be concerned for her.",
   "created_utc": 1701646298,
   "score": 82,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvwb6v",
   "message": "YTA and so is your sister.  It’s not reasonable or understandable to expect people to accommodate your your self imposed diet.",
   "created_utc": 1701647862,
   "score": 14,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvwm1s",
   "message": "yta....your brother gets to celebrate his birthday on his actual birthday 1 in every 4 years what is wrong with you !",
   "created_utc": 1701647982,
   "score": 14,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw22mk",
   "message": "YTA.  Leap babies only get their bdays on their birthdays every few years.  Why would anyone need to plan their bday celebrations around someone’s stupid intermittent fasting schedule?!  That’s insane.",
   "created_utc": 1701650165,
   "score": 13,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvzcgb",
   "message": "YTA. The sister can eat beforehand and drink water. Many business dinners happen after 7pm. Would she not go to a business dinner and do her job because of her rigid eating schedule? She’s being ridiculous.",
   "created_utc": 1701649086,
   "score": 13,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvzxd9",
   "message": "YTA for pushing it. He has explained why he won't move it and that's that. Just because his friends and just random people to you, does not mean they are random to him. I'm alot closer to some of my friends than my sister, so I would 100% make plans on what would suit the majority over one person.",
   "created_utc": 1701649310,
   "score": 14,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvwoqo",
   "message": "YTA no one wants to eat at 3:30. She can come and drink water and provide company. Everything doesn’t have to be about her.",
   "created_utc": 1701648012,
   "score": 13,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw1rxy",
   "message": "Is this serious? YTA, one meal for a special occasion is not going to ruin her. And if she’s this rigid about it, it’s edging into ED territory and she needs therapy for it. It’s incredibly entitled to make such a demand in the first place.",
   "created_utc": 1701650047,
   "score": 13,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw2bcu",
   "message": "3:30?!  Did I read that right?  3:30?!  Fuck all the way off.  This has to be rage bait.",
   "created_utc": 1701650262,
   "score": 12,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvq3n0",
   "message": "YTA, your sisters cult diet can kick out rocks bro. Now go mirror that or whatever yall do.",
   "created_utc": 1701645440,
   "score": 23,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw2t1a",
   "message": "YTA  At 3:30 in the afternoon won't he also be working? Why do you expect your brother to accommodate your sister but you sister refuses to accommodate him on his birthday? The reason your sister eats as she does is because it's her choice, a choice that can be changed for one evening if she chose to. Maybe it's not that he doesn't care about her but that she and you don't care enough about him that you think she shouldn't have to make a change 1 time in a 4 year period. It's not like you, his birthday only comes every 4 years.",
   "created_utc": 1701650464,
   "score": 10,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwc5bh",
   "message": "“Hey, can you make your birthday dinner reservation at 3:30 instead of 7:30, with only half of your friends present, so sis can eat because she refuses to change her eating habits for one night on your once-every-four-years birthday?”\n\n“No”\n\n“Gasp!” *pearl clutch*\n\nYta. Sister is too.",
   "created_utc": 1701654479,
   "score": 9,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw5t8j",
   "message": "Oh tell your sister to “get a grip” and make an exception!   YTA or actually she is!",
   "created_utc": 1701651744,
   "score": 9,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwd6c6",
   "message": "YTA and so is your sister, I feel bad for your brother",
   "created_utc": 1701654919,
   "score": 9,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw4a7y",
   "message": "YTA \u0026amp; your sis too. So it's your brothers BD, she can come and just drink water if she cannot deviate for an hour once a year. Or she can just send a card and not go at all, but yea, it's pretty crappy of you \u0026amp; her to make such ridiculous demands. Good grief.",
   "created_utc": 1701651092,
   "score": 8,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvtlgx",
   "message": "Ywbta",
   "created_utc": 1701646795,
   "score": 7,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw6ni5",
   "message": "YTA. Well she has two choices, she can either not attend or she just doesn't eat and goes to just spend time with friends and family. If she's so strict and can't break it for one lousy day or shift her times for that particular day. Only a 6-hour window that is extremely strict I'd say most people do an 8-hour window I think for a day she can expand it to an 8-hour window and then go back to her 6-hour window the next day it's not going to make a huge difference for one stinking day. And you shouldn't have asked and he's already giving you the reasons why he doesn't want it at 3:30 in the afternoon since nothing else is available. So suck it up and don't worry it.",
   "created_utc": 1701652106,
   "score": 7,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw73vg",
   "message": "Your sister will probably have quit this diet and gone on to 3 or 4 other fad diets that come along by then. Maybe the only time she's allowed to eat will be 7:30 on leap year day. (joke)",
   "created_utc": 1701652304,
   "score": 7,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw9beu",
   "message": "Holy fuck it’s *one day* where she eats later, it’s not like she’s going to instantly lose every ounce of progress if she has some food at 7:01. Shift the window by an hour so it’s 2-8, she’s not going to fucking die.\n\nYTA. You and your sister need to get over yourselves. It’s HIS birthday dinner and you’re making it revolve all around your sister.",
   "created_utc": 1701653259,
   "score": 7,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbvrp8n",
   "message": "\u0026gt;She only eats between the hours of 1:00pm and 7:00pm. Inside of the those hours she can eat and drink whatever she wants. Outside of those hours she only drinks water. No eating or drinking anything other than water.\n\nThat's a really fancy way of saying your sister has an eating disorder.\n\nYTA for trying to make your brother accommodate your sister's eating disorder on his birthday.",
   "created_utc": 1701646052,
   "score": 29,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw68fq",
   "message": "I think you're being ridiculous. Of course he's not going to change the dinner reservation to fucking 3 in the afternoon. What is wrong with you?\n\nYTA. Your sister can either eat beforehand, or not come. The world doesn't revolve around her.",
   "created_utc": 1701651927,
   "score": 5,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw7d8g",
   "message": "YTA and so is your sister. This is his once in only 4 years actual birthday. I can't believe you and your sister are whining and making it about her diet. How about the two of you stay home so than he can enjoy his birthday dinner.",
   "created_utc": 1701652419,
   "score": 4,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw87f2",
   "message": "This sounds like an eating disorder and you’re enabling it. Being this strict on a “diet” is not healthy. Your sister needs help and you need self reflection as to why you’re supporting this behavior.",
   "created_utc": 1701652780,
   "score": 4,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw8ovv",
   "message": "This is his birthday not hers! YTA and so is anyone else asking him to change the reservation for HIS Birthday!",
   "created_utc": 1701652986,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw9717",
   "message": "Your sister can get over herself and vary her eating for one night or drink water. It’s not her birthday. . If a person  wants a different diet plan than the rest of the world, everyone else does not have to accommodate.  I’m way over people thinking their diet ( vegan, vegetarian, pescatarian, keto, restricted hours to eat etc) should always be accommodated in a social setting. You want people to be included but it’s his birthday and 330 pm is too early for him and the other guests",
   "created_utc": 1701653206,
   "score": 4,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwawtv",
   "message": "YTA and so is your sister who seems to have a raging case of Main Character Syndrome, which you happily enable. \n\nI feel sorry for your brother having to deal with siblings who refuse to put him first on his once every four year birthday.",
   "created_utc": 1701653944,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxj3f8",
   "message": "If she can't adjust for a single celebratory meal she's in a cult, not a diet. Y'all acting like this will set her off a sobriety journey back to rehab, when it's a completely arbitrary timing limitation.\n\nYTA",
   "created_utc": 1701678467,
   "score": 5,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kby1lps",
   "message": "YTA\n\nYou're asking him to abandon several friends because one family member chooses to follow a strict diet and refuses to change for 1 day.",
   "created_utc": 1701692830,
   "score": 4,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw6rfn",
   "message": "YTA, as some who has tried and partner lived a fasting lifestyle, one day won't hurt for her to eat. Is she really going to just sit, eat nothing and drink water the entire night???\nAlternatively she could eat beforehand, or just not go. But it's unreasonable for you noth to expect him to change his celebrations, especially being that the other time is 3.30..\n\nEdit: She could also push her window forward an hour or so, so she could eat with everyone and still only eat in a 6 hour window.",
   "created_utc": 1701652153,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw9ht2",
   "message": "This has to be a joke. YTA. \n\nI do intermittent fasting and I would never ask anyone to change their plans to accommodate me. I also am a bit flexible with my start and stop times with it comes to events. She has a year to plan.",
   "created_utc": 1701653336,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw9pdw",
   "message": "YTA\nShe can push her eating window the next day to make up for the fasting hours and have a shorter eating window. She could also decline since it’s not about her. \nAt 23, your friends are much more involved with your life than your sisters.",
   "created_utc": 1701653427,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwgt1p",
   "message": "YTA - he looked into changing the reservation and the only available was way to early. People working trumps self enforced diet. She could be flexible and is choosing not to be, she can also eat before she goes, his friends can’t leave work at 3.",
   "created_utc": 1701656510,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwhjq9",
   "message": "YTA and your entitled sister is too it’s his birthday and none of yours so either be happy and nice or don’t go end of",
   "created_utc": 1701656845,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwivlx",
   "message": "He’s gotten 7 real birthdays in his life. And you have the make it about yourselves. That’s wild. Your sister is a grown adult who has made the choice to not eat after 7 why should your brother have change a normal dinner time for one person? Your right she’s family she should be more considerate that it’s her brothers birthday not hers.",
   "created_utc": 1701657444,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwjo37",
   "message": "dear lord :/ you and your sister sound insufferable 😩 \n\nYTA",
   "created_utc": 1701657804,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxepu9",
   "message": "...so why can't she eat before hand and come to hang out... what adult really says \"it's your birthday but me me me\". You plans your sister are assholes",
   "created_utc": 1701674964,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxerel",
   "message": "YTA.  Sorry your sister can’t make a compromise on her brother’s birthday. But it’s not cool to tell him that “oh it’s okay to make it impossible for half your party not to be there on your birthday so I can stick to my diet.” She can get there early have something at the bar because there’s no seating for earlier or she can drink water. But the world doesn’t revolve around you on someone else’s birthday. And you shouldn’t expect it to. They call that entitlement. Also selfishness.",
   "created_utc": 1701674999,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxfir3",
   "message": "Lmao YTA. I did intermittent fasting for a year and lost over 60 pounds with it, so I’m very familiar with the concept. Still, I would’ve never been so self centered as to expect for anyone to change dinner reservations to fit MY eating schedule, much less on THEIR birthday. 🤦🏽‍♀️ \n\nYour sister isn’t going to fall off track or gain weight because of one day. I had many “cheat days” where I ate outside of my eating hours and still lost plenty of weight.",
   "created_utc": 1701675591,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxfjcl",
   "message": "YTA. \n\nAsking him is fine.  She did that.  Trying to force the issue makes you TA.",
   "created_utc": 1701675604,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxgtbu",
   "message": "OP, this is a birthday that comes once every 4 years. You and your sister seriously need to grow up. Massive YTA on your Parr and your sister throwing a tantrum, she needs to be back in diapers for a few years to grow up right.",
   "created_utc": 1701676605,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxibo0",
   "message": "YTA, Your brother gets to celebrate his actual birthday on the day, once every 4 years.\n\nYour sister can shift her eating hours (she has plenty of time to do the gradually between now and the day), however it sounds to me like you/your sister may have a wider issue than following a time-restrictive diet if you you going as far as asking someone to change their plans to accommodate your unproven diet.",
   "created_utc": 1701677825,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxpqp6",
   "message": "YTA and you sister too. I have done intermittet fasting. My first Question is, why is her window to eat only 6 hours? Normaly it is 8 hours eating and 16 houers fasting. She wont die if she changes it for one day (I speak out of experience) and goes as usual the next day again. \n\nThis is your brothers birthday. He is not the one who does the fasting, your sister does. So it is her responsibility to look if she can do it and not his. He is right with the sooner reservation and people working.\n\nIf you want do commit to one way of living that is fine, I can tell you, I too have problems with living LCHF but that is my problem. I cant expect people to change just for me.",
   "created_utc": 1701684115,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxqptw",
   "message": "YTA\n\nI only needed to read the title to know that. You request he inconveniences EVERYONE ELSE to accomodate 1 person.\n\nIt's his birthday and his party. The only thing up to you to decide is if you show up (and on what time) or not.",
   "created_utc": 1701684927,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxynif",
   "message": "So he gets a birthday on his actual birthday once every four years, and your entitled bitch of a sister, thinks she can decide what time he eats on his birthday (and she enlists your aid to enforce this). That happens once every four years. What planet are you living on?\n\nThere is absolutely no reason why she can’t eat before during her ‘eating window’ and come and join in the celebration and just not eat. Or she could see him on a different day the same as she does every year that isn’t a leap year.\nYTA",
   "created_utc": 1701690945,
   "score": 3,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw410e",
   "message": "YTA. Both of you. It's not a dinner for her and it's not her day. She is the one with the regimented time table. No one should have to change their plans around her/just one person. She chose this schedule and refuses to allow any exceptions, so she can eat before hand and just stop by to hang out.",
   "created_utc": 1701650984,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw5fky",
   "message": "You and your sis are the ass.  Either go or don’t go. The world does not revolve around you (her) eating schedule.",
   "created_utc": 1701651581,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw5r2i",
   "message": "LOL!  Are you serious?",
   "created_utc": 1701651718,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw5sqc",
   "message": "Your sister can alter her timing for a day.",
   "created_utc": 1701651738,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw74os",
   "message": "In Intermittent Fasting, you can adjust the window. If she only eats in a 6 hour window, is it at all possible for her to have the window start later that day? YTA unless you help your sister find a way around this so you can all celebrate your brother's actual birthday once every four years.",
   "created_utc": 1701652314,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw8074",
   "message": "YTA.",
   "created_utc": 1701652694,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw8ed4",
   "message": "YTA. His bday celebration shouldn't have to work around your sisters eating schedule. She can eat before and still go and have water.",
   "created_utc": 1701652862,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw8i33",
   "message": "YTA. It’s your brother’s birthday, yet you and your sister seem to feel entitled to change his arrangements. I don’t think this is diet. I think it’s dominance and wonder if it’s part of a pattern within the fAmIlY.",
   "created_utc": 1701652906,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw9734",
   "message": "It’s his BIRTHDAY DINNER. It’s not even once every year he gets to do this is literally every four years.\n\nYour sister is allowed to eat when she wants, she’s not allowed to dictate when your brother does his birthday dinner every four years. She has more than a year to plan eating or not eating slightly late one time. She doesn’t even have to go.\n\nYou are absolutely the ah and so is your sister.\n\nYou two aren’t the main character on your brothers birthday.\n\nAnd for the record, no, he shouldn’t change dinner to 3:30. Wtf.",
   "created_utc": 1701653207,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw97w4",
   "message": "She can eat before. She is following the diet not everyone else. A diet doesn’t come first",
   "created_utc": 1701653216,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw985w",
   "message": "Wow, just wow !\nThe sense of entitlement has reached new heights \nYou are a piece of work!\nAH is too kind an adjective to describe you.",
   "created_utc": 1701653219,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbw993m",
   "message": "YTA",
   "created_utc": 1701653231,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwa27z",
   "message": "She prioritises her diet over her brother. Won't make an exception once a year, is called being a bitch.",
   "created_utc": 1701653581,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwa4j9",
   "message": "She prioritises her diet over her brother. Won't make an exception once a year, is called being a b**ch.",
   "created_utc": 1701653609,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwadpo",
   "message": "Intermittent fasting is not that restrictive - her usual window is between 1 and 7 - fine - but there’s no reason she can’t do a longer overnight fast and start her window at 3 or 4. Life happens, adjust.",
   "created_utc": 1701653719,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwax8z",
   "message": "It's his birthday, and he's planned it far in advance. Yes, YTA. She can drink water or just not attend.",
   "created_utc": 1701653949,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwb8x3",
   "message": "It reeks of favoritism towards your sister.  \nYou are closer in age, so it seems like your brother is an afterthought to you both. \n\nOn top of that, you're asking him to choose his siblings over his friends, but  your sister can't even make a simple adjustment, like eating before,  extending her window to eat for one day or not going. \n\nYTA",
   "created_utc": 1701654085,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwb9zl",
   "message": "YTA.  It is one day.  Your sister can either just deal with it or not go.  She should not be forcing her inflexible eating choices on others.",
   "created_utc": 1701654099,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwbc8p",
   "message": "YTA that is a totally unreasonable ask.",
   "created_utc": 1701654126,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwbyzi",
   "message": "YTA\n\nEntitled much? You and your sister are absolute ahs.",
   "created_utc": 1701654401,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwc26t",
   "message": "YTA. I don’t know why your brother’s birthday celebration would be dictated by your sister’s self-imposed diet? I understand that maybe it works for her and she’s happier with this way of eating but the rest of the world doesn’t revolve around the hours she chooses to eat. She can eat before, make an exception to her eating hours for 1 day or not attend. Everyone else can happily celebrate at 7:30.",
   "created_utc": 1701654441,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwc8nj",
   "message": "Lil sis can adjust her schedule for three days. The day before the event, the day of and day after. Sheesh come on sis the world does not revolve around you.",
   "created_utc": 1701654519,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwcar5",
   "message": "YTA I also do IF. I would never ask someone to change their birthday or other plans for me. I either change my hours that day, don’t eat, or don’t fast. One day isn’t going to make or break your sister’s diet, but your brother only has a birthday every four years.",
   "created_utc": 1701654544,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwddt4",
   "message": "Wow. Super-entitled. YTA. It's his bday not hers. If she wants to go, then she can figure it tf out! No discussion.",
   "created_utc": 1701655009,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwe6vf",
   "message": "YTA. Who wants to have dinner at 3:30 on a week day? Thats too close to lunch and people aren't hungry for a full meal. It won't kill your sister to eat late one day.",
   "created_utc": 1701655362,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbweei0",
   "message": "YTA!  She doesn’t have to eat when everyone else does. He wants to have his party at DINNER time. Since there are no other times available that his other guests will probably be at work, 7:30 it is. She has the option to eat before, eat after (is one time going to totally kill her diet?) or don’t attend.  One could make the argument that your sister considers her diet and refusal to eat, more important than your brother’s once-every-4-year actually-on-his-birthday celebration. \n\n!UpdateMe about how it goes.",
   "created_utc": 1701655452,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwehb6",
   "message": "I’ve done IMF and shifting your window on occasion is actually recommended so you don’t plateau. YTA",
   "created_utc": 1701655484,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwey16",
   "message": "YTA. The sister can load up on food slightly earlier than the dinner. You’re literally trying to force your brother and ALL his other guests adhere to your sister’s eating schedule when there’s such a super easy workaround. You and your sister both suck.",
   "created_utc": 1701655682,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwfrz0",
   "message": "YTA \n\nHe gets a birthday EVERY FOUR YEARS!\n\nShe can turn up and drink water and celebrate",
   "created_utc": 1701656057,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwfrzc",
   "message": "Lol. Of course YTA and so is your sister. This is your sister’s problem, not your brother’s problem. As everyone else has said, it is HIS birthday. He gets to choose the restaurant and the time and the people he wants to attend. She can 1. make an exception and shift her schedule one time for her brother’s birthday, a birthday he only actually gets to celebrate every four years, 2. she can eat beforehand and drink water or tea at the dinner, or 3. She can stay home. Expecting him to change his plans and eat dinner at 3:30 is a ridiculous ask.",
   "created_utc": 1701656058,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwgyya",
   "message": "YTA and you sister sounds like one of those insufferable main character types. It’s not her birthday. She doesn’t have to eat at his party. *She doesn’t have to go to his party.* She can have all the dinner parties herself during her damn “eating window” (wtf??) but she doesn’t get to inflict that bullshit on others for someone else’s event! Tell her to do your brother a favor and just stay home.",
   "created_utc": 1701656582,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwh2jr",
   "message": "YTA",
   "created_utc": 1701656628,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwhe3f",
   "message": "Yikes on bikes the entitlement!",
   "created_utc": 1701656773,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwhh8f",
   "message": "Yta!  Your sister can eat beforehand and just be there to attend and drink her water!  It’s not her birthday, she doesn’t get a say",
   "created_utc": 1701656813,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwhrmh",
   "message": "YTA. It’s his birthday that he only gets to celebrate on his birthday every four years. Your sister can eat before hand or she can have a cheat day. I have done intermittent fasting too and it doesn’t destroy your body or weight loss to “cheat” one day. His birthday isn’t about you or your sister.",
   "created_utc": 1701656942,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwiatp",
   "message": "YTA. It's his birthday. He gets to pick what he wants. Your sister's dietary choices are on her. She can eat beforehand or have a cheat day... That's on her. Not birthday boy's problem.",
   "created_utc": 1701657185,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwicgh",
   "message": "You and the sister are TAH. Intermittent fasting isn't supposed to be so strict as to harm special occasions.  Also if she has to follow it she can eat earlier and shoe for company. Asking your brother to change his birthday that he only properly gets once every 4 years is a jerk move. If you and your sister are too self-centered to get over yourselves and celebrate your brother when he wishes you don't actually love him.",
   "created_utc": 1701657206,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwikm3",
   "message": "YTA. Also. If your sister is that strict, she has an eating disorder.",
   "created_utc": 1701657307,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwipre",
   "message": "YTA, it’s his birthday. It comes once every FOUR years. She’s the one who should be making an exception, not him.",
   "created_utc": 1701657372,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwjl9w",
   "message": "YTA He gets a birthday once every 4 years. He doesn’t need to accommodate your sister. \n\nWhy can’t she shift her diet by an hour? How does she accomodate daylight savings and times change with travel?",
   "created_utc": 1701657767,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwjopm",
   "message": "He only has a birthday every 4 years.  She can either eat before or shift her window a couple of hours.",
   "created_utc": 1701657812,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwjsfi",
   "message": "YTA. How does the sister cope with daylight savings time? If she doesn't switch her eating hours when the clocks change, then she can make this exception in her eating disorder too",
   "created_utc": 1701657860,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwkda5",
   "message": "YTA. Her fasting can’t be counted in every gathering.",
   "created_utc": 1701658121,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwkogi",
   "message": "Don’t give a leap year baby any lip about inconvenience.",
   "created_utc": 1701658257,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwlof4",
   "message": "You and your sister can kick rocks. \nSiamese AH’s. \n\n“She’s really hurt and feels like he doesn’t care…”\n\nI’ll let you in on a secret…he *doesn’t* care. Nor should he. \n\nHe’s done catering to the every whim of your narcissistic sibling and her enabling little toady (that’s you…you’re the toady).\n\n*Let’s rearrange his day, set aside to honor him, inconveniencing a majority of guests and the birthday boy himself, for your poor, manipulative sister.*\n\nSo she can feel important. \n\nSuck an egg 🥚 \n\nAssholes.",
   "created_utc": 1701658705,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwmhlg",
   "message": "YTA your sister needs to get a grip and understand the world doesn’t revolve around her unyielding self imposed dietary restrictions. What a really shitty thing to expect of your brother on HIS special day",
   "created_utc": 1701659070,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwmk9j",
   "message": "YTA \n\nI’ve seen people intermittently fasting make the odd exception, one meal out of time isn’t going to undo all her good work (assuming unlike most people who intermittently fast she’s still at it come Feb 29)",
   "created_utc": 1701659105,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwmvge",
   "message": "YTA. Repeat after me: “Neither me nor my sister are the Main Characters in this story. It’s my brother’s birthday dinner so he gets to make the decisions based on his own criteria.”\n\nEasy solution: gradually adjust her eating window in the week leading up to the dinner, so that she can eat with everyone. \n\nEasier solution: eat beforehand and simply drink water and socialize at the dinner while others eat. \n\nEasiest solution: politely decline the invitation and stay home, after eating during her window.",
   "created_utc": 1701659245,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwo70u",
   "message": "Why would he cater his birthday to your sister? She can eat beforehand and deal with this like she likely has too before since she has restrictions",
   "created_utc": 1701659834,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwpsxo",
   "message": "This is so dumb, how could you even write this out without feeling like a fool? YTA.",
   "created_utc": 1701660575,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwpu6z",
   "message": "YTA. Expecting him to change it to 3:30pm on a weekday is ridiculous and selfish. This is his birthday dinner so it’s his choice. Either show up to support and celebrate him or be an asshole and don’t. She can still go to the restaurant to celebrate without eating anything and only drinking water.",
   "created_utc": 1701660591,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwt12s",
   "message": "\nYTA and sister is a diva.\n\nIntermittent faster here.  She can move her fasting window for a day.  It’s truly no big deal.  \n\nSo instead of 1-7pm she eats from 3-9pm that day.  Bonus: she fasts a little longer on the day of the meal.",
   "created_utc": 1701662101,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwuk1t",
   "message": "YTA if she won’t make an exception for your brother, why should he make an exception for her? Your sister can eat beforehand if necessary. And “random friends “ can be extremely important, especially when your family treats you like an afterthought for your own birthday.",
   "created_utc": 1701662802,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwwelc",
   "message": "Holy triangulation, Batman.\n\n\u0026amp;#x200B;\n\n\u0026gt;she doesn't ever make exceptions to eating outside her 6 hour window\n\nThat sounds like it's her problem to fix. Not your problem. Not your brother's problem. She's been invited to dinner at 7:30 and she can figure out how that fits with her priorities and self-imposed rules.",
   "created_utc": 1701663677,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwwrvd",
   "message": "You and your sister are the big time AHs. Seriously, you already should know that. The world does not require everyone to bow down to someone else’s eating quirks,  and you come off so entitled in your post that should be presenting you in the best light. Family does not need to be elevated that much over literally everyone else invited. When you get one real birthday every 4 years, everyone else for once needs to accommodate you. It will not kill your sister to either eat late on one day or eat first and just come to socialize. Did you know that there are still companies whose systems won’t even take our birthdays? Starbucks is one. That free birthday drink? Have to pick February 28 or March 1. I’ve had people tell me that can’t be my birthday. Geez be supportive sisters and stop being b\\*$#hes.",
   "created_utc": 1701663845,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwwv9o",
   "message": "Dude, your brother only gets to actually celebrate his birthday on his birthday once every FOUR YEARS.  Anyone who can't find a way to accommodate him once every 4 years is absolutely the AH, so YTA, and so is your sister.",
   "created_utc": 1701663885,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwxcif",
   "message": "Your brother only gets to have his birthday on the actual date once every 4 years. I notice that neither you, nor your sister, are holding a birthday party *for* him; he’s had to arrange his own. He has chosen a time when the majority of the people he would like to invite are free to attend. As a good host does, he’s arranged the venue and issued the invitations. Now it’s up to your sister. As I see it, she has 4 equally polite choices:\n\n1) Accept and eat ahead of time, showing up and being pleasant company while enjoying her water or spritzer and asking for a to-go box for her piece of cake. (Or, for an entire meal, if she wants to eat it the next day.)\n\n2) Accept and shift her 6-hour eating window for that day so that she can eat freely at the party during the time that it is being held. This is fully in line with her diet, if not with her preference.\n\n3) Decline and cheerfully stay home, making plans to celebrate with him at another time.\n\n4) Decline and stay home pouting by herself. If she likes, she can even sing the “Nobody loves me, I’m gonna eat a worm” song — tomorrow, during her eating window, of course. But, she needs to sing it to herself, not to anyone else.\n\nWhat she **can’t** politely do is throw a tantrum, insist that he should change his party to suit her lifestyle choices, and try to call in reinforcements like her big brother to back her up. Unfortunately, that seems to be what she has chosen, and you seem to have bought into it.\n\nSo, yes, as it stands, YTA, and so is she. When invited to a wedding, does she also think she should have a say in what time and how long the reception dinners must be?",
   "created_utc": 1701664109,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbwxr60",
   "message": "YTA\n\nYour brother gets a birthday once every 4 years. Your sister can drink water or stay home. This isn’t about her.",
   "created_utc": 1701664288,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx0kqy",
   "message": "YTA\n\nFeb. 29th only comes once every four years. Your sister can adjust her eating window for one  day or she can skip the dinner and do something to celebrate your brother's birthday at a later date.",
   "created_utc": 1701665732,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx1m1z",
   "message": "YTA. She made a choice. It’s her job to figure it out",
   "created_utc": 1701666302,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx1ncj",
   "message": "Yta . and your sister too. It’s his birthday yall should be the ones accommodating him",
   "created_utc": 1701666322,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx1w6s",
   "message": "YTA. I think your sister is who needs to be accommodating. She can beforehand and then just hang out.",
   "created_utc": 1701666455,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx1ysx",
   "message": "Aside from being completely entitled, sister is flat wrong. Intermittent Fasting isn’t meant to be done every single day and it’s better for your body to take a day off from time to time or shift your window backward or forward a few hours.",
   "created_utc": 1701666497,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx2rqj",
   "message": "You and your sister are so fucking stupid. Just tell her to extend the fast from 1-7pm to something like 4pm-10pm. That way, she still sticks to the 6 hour eating window, allowing her to eat during the reservation. You’d think a 28 year old can think of that as a solution instead of whining like a selfish dumbass about your brothers birthday. YTA",
   "created_utc": 1701666953,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx5iz7",
   "message": "YTA and STA (she's).\n\nIntermittent fasting has **some** leeway. Since she's already used to it, I don't see any reason why she couldn't just start eating an hour or two later that day to extend the window to 9 pm. Not only that, she can **easily** make the fasting window 16 hours instead of the typical 18 hours. This isn't something like keto where \"cheating\" would throw her body and the diet for a loop and derail progress. The entitlement you and your sister have is insane.",
   "created_utc": 1701668594,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx8jej",
   "message": "YTA it’s his birthday y’all should be accommodating to him, it’s not just his birthday it’s his leap year birthday. The restaurant can’t change the reservation, it’s his dad, and your sister doesn’t HAVE to eat or drink, but if she does one day will not kill/hurt/damage her. If she’s that insane about adjusting her schedule for one single night then that says something about her",
   "created_utc": 1701670528,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx9qsk",
   "message": "Her weird ass diet isn’t anyone else’s problem but her own. She chose the diet. She has to work around it. Not other people.",
   "created_utc": 1701671338,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx9rf6",
   "message": "YTA. If I had to verify with my friends all the limitations and habits they have, before making a reservation for MY BIRTHDAY, I would never make a reservation.\n\nA person's personal choice of diet is NOT your brother's responsibility. If she has a diet that she adheres to, that's her business. She could simply move her eating time a few hours later for one night. Or suspend the diet for ONE EVENING. Or attend for company. SOO MANY OPTIONS! Tell the sister to suck it up.",
   "created_utc": 1701671350,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbx9y2c",
   "message": "YTA I follow intermittent fasting and having one meal late won't kill her. The world doesn't revolve around her diet.",
   "created_utc": 1701671477,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxa5de",
   "message": "Whose birthday is it?  Is it your sisters or your brothers?  Your brothers right? So he matters.  Your sister and her “eating window” don’t matter.  She can eat before and just show up for your brother to celebrate his birthday.  Stop trying to make this day about your sister.  Oh yah and YTA",
   "created_utc": 1701671617,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxav1k",
   "message": "YTA - and so is your thinking if she thinks it should be changed too.",
   "created_utc": 1701672117,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxazap",
   "message": "YTA.  It is not socially acceptable for EVERYONE in a group setting to bend over backwards for ONE person. It is far more reasonable for her to eat in her window and celebrate HIS BIRTHDAY when he wants to. To think otherwise is delusional",
   "created_utc": 1701672201,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxb0hw",
   "message": "I’m calling bullshit.\n\nIntermittent fasting allows for *break* days. Your sister can just align her calendar to accommodate the event.\n\nYTA for enabling her.",
   "created_utc": 1701672224,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxbhgf",
   "message": "So your brother can only celebrate his actual birthday 1 in every 4 years, he had a choice of 2 timeslots either crazy early for a Birthday dinner (on a weekday) or a socially accepted dinnertime and you and your sister are giving him grieve over this...\n\nSay you hate your brother without saying you hate your brother, and are envious that even if it is once every four years all eyes are on him... \n\nOP YTA.",
   "created_utc": 1701672560,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxdzag",
   "message": "Also. You can just change your eating window? It’s not that hard?\n\nYTA.\n\nYour sister is apparently a moron. Personally, I don’t feel it is polite to call morons arseholes, they don’t know what they’re doing.\n\nGot eat rocks together (within the permitted, immovable, time period, of course), and give the gift of your non-presence. JFC.",
   "created_utc": 1701674396,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxdzjz",
   "message": "YTA\n\nShe chooses to do intermittent fasting. She can eat before 7 pm and just drink water after 7 pm.\n\n\n\u0026gt;I think our sister being family is more important than some random friends.\n\nI think your brother being family is more important than your sister's choice to not eat after 7 pm.",
   "created_utc": 1701674401,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxe5zz",
   "message": "YTA. She can change the times adapting them a week or even a couple days in advance: 2-8, 3-9 and be able to eat and then change them back again: 3-8, 2-8, 2-7, 1-7. The important thing is fasting the number of hours you decided to fast and adapt by taking down the eating window.\n\nI was doing it as well and I would've never expected anyone to adapt to me. Just don't make it difficult fir your brother. He already has 1 real date every 4y.",
   "created_utc": 1701674537,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxf0n6",
   "message": "YTA \n\nHer unhealthy diet plan doesn’t give her the right to dictate other people’s schedules.",
   "created_utc": 1701675200,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxh5q9",
   "message": "YTA. Your Sister can shift her eating schedule for an hour so she can eat at dinner, or she can eat before hand to maintain her schedule, there are other otions available to be present for your brother's dinner, she won't gain weight just by altering her fasting once. She should be the one to accommodate, not everyone else.",
   "created_utc": 1701676885,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxh6vu",
   "message": "This is a crazy question, of course YTA. She can skip intermittent fasting for one GD meal, or eat before.",
   "created_utc": 1701676911,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxh9w5",
   "message": "She can still keep the six hour window, but from 2:30pm to 8:30pm - or not go.  Its not a command, it's an invitation.  And she can't honestly expect everyone else to change their time because of her - entitled much?",
   "created_utc": 1701676979,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxhbdl",
   "message": "I have a stomach disorder and one of the ways it affects me is that I can't eat in the morning. This means that I can only eat a late lunch and dinner. Because of this, my family goes to breakfast without me, and I think this is just fine. Now, since this is a birthday dinner, she might want to attend but she doesn't have to eat.",
   "created_utc": 1701677012,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxhgtr",
   "message": "So, he only gets to really celebrate his birthday once every four years. And really, his birthday comes once a year. Even once a year, she can make an exception and celebrate his birthday, let alone every four years. I get it, I do IF too, but during the holidays and when I go on vacations, I give it a rest and eat whatever. I'm at a healthy weight, eat right and exercise. There's something called the 80/20 rule (and there are variations). 80% of the time, I eat healthy and exercise. 20% of the time I say eff it and eat whatever and relax. If your sister is really freaking out over your brother's once every four year birthday party and insisting that he change his entire party, with guests that can only meet at a certain time to fit HER EATING SCHEDULE, she needs therapy. This sounds like an eating disorder.",
   "created_utc": 1701677133,
   "score": 2,
   "submission_id": "18a669q"
  },
  {
   "comment_id": "kbxhzs9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18a669q"
  }
 ]
}