{
 "submission_id": "18a6pyn",
 "title": "AITAH for refusing to help my FIL with a vehicle?",
 "selftext": "I (38F) have been married to my husband (43M) for almost 15 years.  My FIL has never really accepted me as family. He referred to me as \"my son's wife\" for the first 5 years of my marriage \u0026amp; when he convinced us to go halves on a property insisted on only his \u0026amp; my husband's names on a survivors deed, \"in case we divorced\".  In the last few years, he has struggled financially due mostly to poor choices he made. His wife, husband's step mom, is much older \u0026amp; has medical problems leading him to choose to work mostly from home. He has traded in vehicles numerous times in the last few years, supposedly trying to lower his payments, but is always upside-down on the loans that it doesn't work. He is paying close to $1000 a month on a minivan. Now here is my problem.\n\nMy FIL is currently trying to guilt trip my husband into giving him one of several vehicles I inherited. I had two uncles pass away 3 weeks apart during the holidays more than a year ago \u0026amp; I am still going through the probate process because they passed so close together. I do not have the court's permission to do anything with their vehicles yet.\n\nHe told my husband how much it would help him to have one of the vehicles so that he could let his car go back on repo \u0026amp; not have to make the payments. I may have considered it too, if he had waited more than a couple weeks after my both uncles passed away. I was, quite litterally, knee deep in a horders paradise,  trying to clean out their apartment within the month to avoid having to pay rent because i couldnt afford it and had no access to their money (strike one). He picked out which vehicle he wanted, the most valuable of the 4, rather than asking if we had plans for them yet (strike two). Then he asked my husband to give him said vehicle (strike three). As a cherry on top, asked my husband again (still has never asked me) to give him a $10k vehicle after we pay for all the little repairs it needs, of course. \n\nHere is where I might me the Asshole:\nDo I need the vehicle? No. Could I use the money from its sale? Yes, but I could live without it, too, as our finances are better now. Will I sign it over to him? Never.  This is far from the first time that man has shown utter disrespect for me \u0026amp; he can pay for rides before I give him any vehicle. Yes, I am probably being a little childish. The only reason I hesitate, I actually like his wife \u0026amp; it would help her to some extent.\n\nEdit to add: My husband has already told me that the vehicles are mine \u0026amp; I can do whatever I want with them.",
 "created_utc": 1701646568,
 "permalink": "/r/AITAH/comments/18a6pyn/aitah_for_refusing_to_help_my_fil_with_a_vehicle/",
 "score": 61,
 "url": "https://www.reddit.com/r/AITAH/comments/18a6pyn/aitah_for_refusing_to_help_my_fil_with_a_vehicle/",
 "comments": [
  {
   "comment_id": "kbvu4qv",
   "message": "NTA. He is rude and made his bed with his actions. Offer him the worst of the lot. But no more.",
   "created_utc": 1701647006,
   "score": 52,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbvw2k9",
   "message": "Don't give that entitled, arrogant, hateful old viper A DAMN THING.\n\nOr be really petty and get him a model car of the one he wants and tell him, here's the only car you're ever gonna get from me.",
   "created_utc": 1701647773,
   "score": 17,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbvwvyf",
   "message": "\nNTA\n\nYou owe him nothing. \nDon't feel guilty about keeping what is yours.",
   "created_utc": 1701648094,
   "score": 12,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw0f5q",
   "message": "Make him come to you. Seriously. If he wants something from you, he needs to ask you. Respectfully and after he apologizes for disrespecting you.",
   "created_utc": 1701649511,
   "score": 8,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbvy0p4",
   "message": "He can have one of the cars (no repairs made) if he signs a quit claim deed for the property you are set to lose if your husband dies.",
   "created_utc": 1701648546,
   "score": 7,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw0rdd",
   "message": "NTA. Have your husband tell him that there is nothing he can legally do since they will be in your name so he should ask you personally about it. Then, get out the popcorn and watch him squirm. If FIL objects, have your husband tell him that you will not put the cars in both your names ‘in case there is a divorce’.",
   "created_utc": 1701649644,
   "score": 6,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbvvmc2",
   "message": "Offer him the worst for 3 or 4000!",
   "created_utc": 1701647594,
   "score": 4,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw508e",
   "message": "NTA.  The vehicles are yours end of story.  Your FIL is an entitled jerk and you don’t owe him anything.",
   "created_utc": 1701651399,
   "score": 3,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw5dkb",
   "message": "NTA  Tell him you'll sign over your choice of vehicle (not his) AFTER he signs over his part of the house to you.",
   "created_utc": 1701651558,
   "score": 3,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw2n3u",
   "message": "NTA,",
   "created_utc": 1701650395,
   "score": 2,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw5w39",
   "message": "You're not his doormat, but he treats you like it. Give him nothing. If you give him one of those cars, you're telling him that the way he treats you is right. That you ARE his doormat.\n\nDon't do that. You have your husband's support, you don't have to consider it. I'm sorry for his wife but it's too much. Treat him like the asshole he's been to you.\n\nNTA. But you will be if you change your mind.",
   "created_utc": 1701651778,
   "score": 2,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw90q9",
   "message": "I'd sell them all and act like husband never mentioned he'd asked. \"Oh, dang, if only you'd have asked me!\"",
   "created_utc": 1701653130,
   "score": 2,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw5e5j",
   "message": "So FIL set you up to lose out on a property if your SO passed away before FIL did? I'm glad to hear you bought him out and that's set now.\n\nIf you find it in your heart to give him one of the vehicles then you may be a better person than I because I'm not sure if I could, given the history. What if (when probate is set and all) you offer to *rent* him one of the vehicles? Obviously that isn't what he wants, but you'd get some income but still own it to sell it when he was done with the vehicle?\n\nGood luck!",
   "created_utc": 1701651564,
   "score": 1,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw8bs2",
   "message": "NTA, That FIL is an AH. Take care of the cars and sell them if you like and pocket that money. He has always been a disrespectful prick to you, so you don't need to do jack for his entitled arse. It doesn't matter if you like his wife or not. That man is too blatantly disrespectful to you, stand your ground. The answer is no! \n\nKeep us updated, if you can.",
   "created_utc": 1701652832,
   "score": 1,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbw8dzg",
   "message": "NTA; he is, though. Entitled and rude, is what he is. Is he disrespectful to all women, or just you?",
   "created_utc": 1701652858,
   "score": 1,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbwa3fk",
   "message": "NTA. This is your inheritance to do with as your please. He's an adult, a father and a husband which means he needs to talk to the actual person who is inheriting the property aka you and not your husband. That alone is enough to refuse him.",
   "created_utc": 1701653595,
   "score": 1,
   "submission_id": "18a6pyn"
  },
  {
   "comment_id": "kbwaa0a",
   "message": "NTA - Have you been added to the deed?\n\nYour inheritance isn't even available for hubby. Sell them and keep the money separate from family funds.\n\nSorry for your losses.",
   "created_utc": 1701653674,
   "score": 1,
   "submission_id": "18a6pyn"
  }
 ]
}