{
 "submission_id": "18a8q84",
 "title": "AITA for uninviting my brother to my wedding because he chose our incentuous cousin over me?",
 "selftext": "I (27 f) live over 1,000 miles way from my entire family. With that being said, it is rare I get to visit and when I do, I want to spend that time with my close family and no one else. I don’t even visit friends. \n\nIn the past year or so, my family has gotten incredibly close to a cousin that dated \u0026amp; had a baby with our/her first cousin. I think this is gross, but for some reason my family is ok with this and have accepted her into their lives and she is invited to every event. I have not been able to visit since she’s been around, so I have not seen this but my family talks about her often. \n\nFor thanksgiving, I FaceTimed my parents, and of course, she was there. I asked my mom if she would be there for Christmas \u0026amp; she got angry right away because she knew that I would say I didn’t want her there. My mom then told me to relay this information to my brother. He lives 3 hours away from my parents house (where Christmas will be held at). \n\nSaid cousin lives in the same town as my brother (not really sure when that happened. She used to live in another country) and he is the one who brings her around. When I told him I didn’t want feel comfortable with her being at Christmas due to not knowing her, he started to go off on me saying “how dare you judge our cousin for something she did? She is FAMILY”. Although i don’t agree with that, the fact that she was in a relationship that I find weird, isn’t why I don’t want her there; I don’t want her there because I want to be comfortable at Christmas. With a member of my family that I don’t even know, I won’t be able to be comfortable. \n\nThis ended in a back and forth argument between us where I kept reiterating that I just want to spend time with those that I love, \u0026amp; she’s not one of those people. He states I need to love her bc she’s family, I’m stating I don’t love her and want those close to me, to be the only ones there, like always. He didn’t agree and said he will have his own Christmas then with her, and he won’t be coming. \n\nI found this hurtful because all I asked for is ONE day with him and his kids \u0026amp; I can’t get that. So in return, I told him not to come to my wedding that is in 2 months. He called me a “spoiled ass kid” and I told him that I only want people there that show they care about me and my feelings. Now my mom is mad too at me for that and I’m sure the rest of my family will be too. Am I the asshole?\n\nSide note- I mention her relationship because that’s why my family thinks I don’t want her there. WHICH ITS NOT!! Whether or not she was family, whether or not she was dating a cousin, I am not comfortable with a random person. I loved our small, close knit Christmas. ",
 "created_utc": 1701652541,
 "permalink": "/r/AITAH/comments/18a8q84/aita_for_uninviting_my_brother_to_my_wedding/",
 "score": 154,
 "url": "https://www.reddit.com/r/AITAH/comments/18a8q84/aita_for_uninviting_my_brother_to_my_wedding/",
 "comments": []
}