{
 "submission_id": "18aajjp",
 "title": "AITA for hesitating to give my mixed ethnicity son a name strongly associated with black males?",
 "selftext": "I'm white, and my wife is black. She teaches kindergarten, and I teach high school. I honestly think being a teacher makes it much harder to find a name. There are very few names that don't immediately remind us of students or parents.\n\nMy wife has always loved a name that is very strongly tied to black males. It's a family name on her side and means a lot to her. Let's use the name Jayshawn for reference. She suggested it, and I told her that I didn't really like it but would be okay with naming him Shawn or Sean if it was really important to her, but that I didn't like Jay. I previously had shut down Sean/Shawn because of a student we had, and my wife asked why I was suddenly okay with Shawn. I told her that I still didn't love it but was willing to compromise. I said that I'm sure our son will erase the current connotation I had with the name.\n\nShe accused me of trying to \"whitewash\" the name she suggested and asked why I didn't like Jayshawn. I told her I just didn't like it, and she asked if it was because I thought the name was ghetto. I told her that I didn't think it was ghetto but it's mostly associated with black men, and our child wouldn't just be black. He would be equal parts white and should have a name that reflects that. She said that my cultural background would be passed on with my last name and giving him a name like Jayshawn would be honoring both cultures. I disagreed. I'm not looking for a name only associated with white males and think we can find a compromise if we keep searching, but my wife has shut down the conversation because she believes I'm being an asshole. This morning she said, \"You know people will see him as black even if we name him Chad, right?\" When I tried to talk about it, she said she didn't want to talk further, but I feel like she's trying to eliminate the white part of him.",
 "created_utc": 1701658315,
 "permalink": "/r/AITAH/comments/18aajjp/aita_for_hesitating_to_give_my_mixed_ethnicity/",
 "score": 105,
 "url": "https://www.reddit.com/r/AITAH/comments/18aajjp/aita_for_hesitating_to_give_my_mixed_ethnicity/",
 "comments": []
}