{
 "submission_id": "18aagrf",
 "title": "My wife pi$$ed her family off",
 "selftext": "My wife pi$$ed her family off and I helped with it! I'm not sure if we are in the right or wrong? (Why I'm posting this) her family has ALWAYS been against her, they gave her, her first car and held the title over her head, they would scream at her and make her do EVERYTHING around the house! Skip to about 2 years later, my wife's family needs a car, we have one we are trying to get rid of but we don't want to get screwed out of the money, so we keep the title. Her family is demanding the title before giving us the payment and we both said no! AITAH for not giving them the title? Because we don't want to lose money??",
 "created_utc": 1701658075,
 "permalink": "/r/AITAH/comments/18aagrf/my_wife_pied_her_family_off/",
 "score": 209,
 "url": "https://www.reddit.com/r/AITAH/comments/18aagrf/my_wife_pied_her_family_off/",
 "comments": [
  {
   "comment_id": "kbwqgvr",
   "message": "(1) Nobody gets title to the car without payment in full first\n(2) Never do business with family, especially family who have already proven to be untrustworthy\n\nJust sell the car to someone else.",
   "created_utc": 1701660887,
   "score": 96,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbwyvgn",
   "message": "You hand that title over you'll never see a dime for that car.\n\nNo money, no title.  Simple as that.  And family are the worst for stiffing people on sales.",
   "created_utc": 1701664833,
   "score": 85,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbwkwci",
   "message": "NTA sell the car to someone else",
   "created_utc": 1701658353,
   "score": 114,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbx0aq4",
   "message": "Don’t sell it to them.  Every time there’s an issue they are going come bother you to resolve it cause “you should of fixed before selling it”",
   "created_utc": 1701665580,
   "score": 45,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbwpt95",
   "message": "Don't sell the car to her toxic family. You're just asking for never-ending problems. Sell to a stranger or dealer and move on with your life.",
   "created_utc": 1701660579,
   "score": 44,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbx3uum",
   "message": "NTA. If they don't want to buy the car then they shouldn't ask. Tell them the price, give them a deadline to pay before you just simply sell to the first person to offer what you're happy with.",
   "created_utc": 1701667580,
   "score": 20,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbx91pp",
   "message": "No - not at all\n\nThey treated her like crap, y'all are gracious enough to be willing to sell the car to them, and they have the audacity to want the title first - no - \n\nTell them good luck finding anyone willing to \"sell\" them a cat without requiring payment.\n\nNTA \n\nOh oh - I just had an evil idea - if you didn't need the money (depending on what the car is worth) you could go to a local fire department and offer to donate the car to them. Then you can film them when they practice getting into cars using the jaws of life and actual freaking axes, all the while knowing they are walking these days because they don't know how to behave properly and treat people right.",
   "created_utc": 1701670867,
   "score": 15,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbx9n69",
   "message": "Nta. Even if they were the most amazing people in the world (and they don't sound like they are) it's just good business practice. No money, no title.\n\nIf they're getting pissy, just telk them this is the way you'd do it for anyone and if they don't agree you'd be happy to sell to someone else.",
   "created_utc": 1701671269,
   "score": 6,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbx704y",
   "message": "You can write the word “pissed” btw",
   "created_utc": 1701669527,
   "score": 7,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbwxmnp",
   "message": "NTA",
   "created_utc": 1701664232,
   "score": 4,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxf4uy",
   "message": "NTA. You don’t sell cars to people and turn over the title without full payment. If they want the car they can get a loan for the full amount and pay you in full. \n\nIf they don’t want to do that, then sell it to someone else.  For cash.",
   "created_utc": 1701675289,
   "score": 5,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbwvy2x",
   "message": "Report the car as stolen.",
   "created_utc": 1701663475,
   "score": 11,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbx4doo",
   "message": "Nta",
   "created_utc": 1701667894,
   "score": 5,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxah3p",
   "message": "Take the car back and sell it to someone else.",
   "created_utc": 1701671843,
   "score": 4,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxgwpk",
   "message": "NTA wtf are they thinking getting a title before paying?\n\ndo they go to a car dealership and expect to drive off with a car without paying too?",
   "created_utc": 1701676680,
   "score": 5,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxl79k",
   "message": "Tell them they get the title after they do all of your wife's household chores, to her satisfaction, every day for a month.\n\nAnd pay for the car, of course.\n\nNTA",
   "created_utc": 1701680236,
   "score": 3,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxdcsn",
   "message": "You in right here cause her family treated her like shit all her life so you not the a-hole",
   "created_utc": 1701673918,
   "score": 3,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxlj0d",
   "message": "Aside from not giving over the title to someone before getting full payment, never sell a car to family. If you do they will come at you every time there is any issue with the car.",
   "created_utc": 1701680515,
   "score": 3,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxqird",
   "message": "Quote them a number and then sell the car to someone else for less.  They're already mad.  😅",
   "created_utc": 1701684762,
   "score": 3,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby4al3",
   "message": "NTA but you already let them have it and use it early, you already lost the battle but can win the war.  \n\nTo turn it around, tell sister you will accompany her/drive her to next appt using it. On the way back claim you hear something with the car and want your mechanic to check it out. Of course, you drive it home because they want you to pay for repairs and save them money. Now you have your car back, you can lie and say mechanic found astronomically expensive problem, thousands in repair, unsafe on road etc, so you scrapped it. (Sell or donate to charity of your choice, I like the fire dept suggestion- jaws of life are so cool!)",
   "created_utc": 1701694405,
   "score": 3,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxhz0r",
   "message": "NTA.   Don’t sell it to them. Even if you were to hand over the title, as soon as something is wrong with it, it will be your responsibility/fault to fix it.",
   "created_utc": 1701677541,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxmftx",
   "message": "NTAH. But, it sounds like they already have the car and are using it 🤔. \nHope you can get it back unharmed and find a decent buyer for it.",
   "created_utc": 1701681292,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxr86b",
   "message": "NOOOO\n\nNTA\n\nKeep strong",
   "created_utc": 1701685341,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxxowa",
   "message": "They’ve already shown you who they are.  Believe them.  No money, no title. \n\nHonestly you’d be better off selling to a stranger.",
   "created_utc": 1701690300,
   "score": 3,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby3gbe",
   "message": "Nope. NTA. NOBODY shall get the title without first paying. If you give them the title without them paying first; they can do all kind of stuff with the title .. get a loan on the vehicle, possibly transfer the title without your knowledge.\n\nALWAYS get the $ first! Even when it comes to family. My cousin bought a 2001 Ford mustang convertible from us. He still owed 2 payments but we hadn't had any trouble with him paying so we gave him the title. Guess what? He didn't pay the other 2 payments and forged the title and traded the damn car without our knowledge. Then he upped and booked town. Even family will sometimes try and F you over.",
   "created_utc": 1701693932,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby5b8m",
   "message": "OP is 13 and making up story for internet points",
   "created_utc": 1701694967,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby705n",
   "message": "Yeah no, no cash no title but considering they already have and are using the car getting cash out of them is going to be difficult, my advice get the car back and sell to someone else because even if by some miracle you dp get paid for the car every time there is a problem with it it'll be your problem that they expect you to fix. Seriously save yourself the headache get the car back and sell to someone else. NTA but a bit naive giving them the car without the cash upfront.",
   "created_utc": 1701695874,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxlbwj",
   "message": "Do not sell to them. If you want to mess with them, sell it elsewhere, drag it out, say you have a buyer for more than they will offer, and then say sorry its sold",
   "created_utc": 1701680347,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxlf30",
   "message": "NTA. \n\nCut all contact immediately without warning. Sell the car to someone else. Have a better life as a result.",
   "created_utc": 1701680423,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxnsf9",
   "message": "NTA never hand over the title without complete payment (and some type of proof of purchase)",
   "created_utc": 1701682452,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxoufn",
   "message": "No stuff them… why are you both even in contact with them?!?",
   "created_utc": 1701683357,
   "score": 2,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxqp74",
   "message": "Id never sell my family a vehicle that I have owned, mainly cause I do the work on it myself and if they crash it I dont want to be blamed XD",
   "created_utc": 1701684912,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kbxqsb4",
   "message": "I would intentionally sell to someone else, just to spite them",
   "created_utc": 1701684983,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby203k",
   "message": "I hold the title to my little car and rent it to my 32 year old son. This way he doesn’t have to fork out for it and I get to use it occasionally (he doesn’t live far away)",
   "created_utc": 1701693078,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby2lmc",
   "message": "NTA. I have a family like that, living a happy life since going no contact, always will be an a-hole in their narcisistic heads.",
   "created_utc": 1701693437,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby2q9w",
   "message": "Sell the car cheaper to someone you don't know 🤣🤣🤣",
   "created_utc": 1701693512,
   "score": 1,
   "submission_id": "18aagrf"
  },
  {
   "comment_id": "kby2qa7",
   "message": "I’ve lost a TON of money (like six digits) giving it away to family and friends who literally won’t even speak to me because every time I ask for it back, they get offended, don’t have it, need MORE…etc. \n\nNTA. I won’t give away another dime, because I’ve been screwed. Here’s what will happen when you say no: \n\nIt’s going to ruin the relationships…same thing will happen if you say yes.  Because they’re probably not going to pay you. \n\nSo ruin the relationships and be up the cost of the car.",
   "created_utc": 1701693512,
   "score": 1,
   "submission_id": "18aagrf"
  }
 ]
}