{
 "submission_id": "18aapzn",
 "title": "AITA for getting refusing to punish my daughter for fighting back against school bullies and taking her to go get ice cream instead?",
 "selftext": "New to Reddit, not exactly sure how to post and fake names.\n\nFor some context I’m (36M) Bengali by origin so my skin and hair are dark in contrast to my ex wife Alice (35F) is white, we met in college and got married before graduating.  We have a daughter Noor (10f) who many of my features such as dark skin and hair.  This is an important component to the story.  Alice and I divorced (I won’t discuss details but it was amicable) when Noor was 8 and are generally in good terms and have 50/50 custody of Noor.  While Alice is a good mother, she can be tone deaf sometimes especially in the topic of racism.  There may be somethings that looks like fillers but I feel they are relevant to the story.\n\nRecently due to Alice’s job, she moved to a new location, enrolled Noor in the school district for the new year. She convinced me it was an excellent district.  Its 30 minute drive from where I live.  I visited the neighborhood saw that its like 95% white and Noor is one of the handful of kids in her school that isn’t white.  I expressed my concern to Alice that she might be a target of racist bullying (I went through something similar at that age) but she reassured me that it will be fine, I reluctantly agreed but had my doubts.  This isn't to say it was all bad, Noor did make a few friends in that school.  Less than a month after, my suspicions are confirmed.  Noor has been a target of racist bullying by some of her classmates.  Teachers did nothing either because they can’t or just won’t despite some of these altercations being recorded. Even the friends Noor made who saw the bullying and reported it was largely ignored.  At best, its a slap on the wrist.\n\nAlice instead of being supportive gives Noor unsolicited lectures about kindness and friendship and the vIoLeNCe iSNt tHE aNSwER reply when I encourage Noor to stand up for herself.  I again remind Alice that her sentiment isn’t helping Noor.  It was like she isn’t even trying to listen to Noor and understand her predicament.  Noor always talks to me about this because she's also come to realize Alice doesn't understand.  The violence isnt the answer sentiment is especially real rich since I've seen Alice glamorizes pink and rainbow imperialism (thinking weapons manufacturers like Raytheon celebrating pride month or rainbow liveries on missiles in Rad or badass or whatever, my criticism of the military industrial complex is a topic of its own, as Malcolm X said about white liberals)\n\nAnyways. A while back before our divorce, against Alice’s wishes I enrolled Noor in karate near at a karate school near her and now she has one class during her time with me. Its not the only thing that happens during her time with me, we do other activities she enjoys together as well as helping with homework.  As I said I myself dealt with bullying and enrolled in martial arts classes during college days and got stronger, more fit, etc.  I have had to use my skills a few times here and there but nothing too serious.  When Noor was born, I promised myself I would never allow her to be bullied like I was.  Alice told Noor that if she fought, she'd be in deep trouble regardless of who started it and this discouraged her.  I must also add that Noor is a bit smaller in size than most of her classmates so that made her an easy target and I taught her some dirty moves.  A few nights before the bullying Noor called me, she sounded distraught and I was a mixture of mad at Alice, sympathetic for Noor.  I told her she doesn't have to listen to her mom and she can say I said she can fight back if she has to.  BUT, I said to her that if she has to resort to fighting, so be it but not make sure its last resort, and to NEVER throw the first punch.  She knows how to fight, as I mentioned I have taught her.  Few weeks ago she fought back and used some of the dirty moves I thought her and landed some good hits and left 2 bullies with a few nasty bruises.  Noor got a 6 day suspension, the bullies got 4 days (which is bullshit).  Alice called to tell me what happened and she was mad, I was proud.  I was working from home that day, told my boss I had an emergency so I rushed to the school and got there a little after Alice did.  I came prepared.\n\nNoor greeted me with a hug and I patted Noor's back and said good job with a huge smile before we went into principals office.  Principal and another administrator came and I sat and listened to the school administrators about what happened I questioned her about her knowledge of the bullying Noor was subjected to and they acted shocked.  I even highlighted some of the rules from the handbook to show them the punishment was unfair towards Noor. I was firm but civil.  I told them about the multiple incidents where Noor was targeted and they did nothing they were unresponsive or trying to dodge the questions I had for them.  They still tried to make Noor look like the culprit despite a teacher and few other students who witnessed it siding with Noor and telling them she was targeted and heard the bullies make nasty remarks to Noor.  The meeting when on for like another 15 minutes and it ended with me hugging Noor and saying “good job, you did nothing wrong.  Let’s go get some ice cream”.  Much to the shock of Alice and others in the office.  In the hall, One of the bullies mom was yelling racist remarks as we passed and saying Noor should be expelled and deported to which I said 'whatever Karen' to while another mom apologized to me and had her daughter apologize to Noor.  I accepted the apology.\n\nAlice was still mad at Noor as we stepped out the office to walk to our cars in the parking lot and started to yell at me for how I reacted and told me I was an asshole for “encouraging Noor to use violence”.  Alice then tells Noor how she’s in deep trouble and will be grounded. I intervened and again reminded her that Noor did nothing wrong and will NOT get punished and said Noor is coming with me, I pressed the unlock button on the keys and told Noor to go sit in my car while Alice and I bickered.\n\nI ended saying to Alice that “you should side with your daughter, not the school officials, are you seriously going to punish her for standing up for herself?  is she just supposed to roll over and let people bully her like that”.  First time I ever raised my voice at her and asked why is she not bothered by the racist bullying Noor faced like she is of her fighting back.  She made an angry face told me I was a shitty dad and got into her car and drove off.\n\nNoor and I drove up to a nearby ice cream shop and my phone was full of messages from my ex and well as few other from her side of the family calling me asshole especially my exMIL and exSIL accusing me of poisoning Noor.  I decided to ignore them and just enjoy my ice cream and quality time with Noor.\n\nMost are on my side especially my sister and BIL (her husband) telling me I did the right thing. A cousin of mine who laughed said that he understood my POV but I took it too far when I yelled at Alice.  Even certain members of Alice's family side with me when I gave them details of what happened.  So AITA.",
 "created_utc": 1701658889,
 "permalink": "/r/AITAH/comments/18aapzn/aita_for_getting_refusing_to_punish_my_daughter/",
 "score": 247,
 "url": "https://www.reddit.com/r/AITAH/comments/18aapzn/aita_for_getting_refusing_to_punish_my_daughter/",
 "comments": [
  {
   "comment_id": "kbwmm85",
   "message": "NTA.\n\nGood for your kid. Bullies only stop when confronted with one response: fighting back. And when you do, they'll slink away to go try their shtick on someone else.\n\nGood for your kid, standing up for herself. Takes guts, have to put aside your fear. But that's how life is sometimes: uncomfortable. Yet it's a good life lesson.",
   "created_utc": 1701659129,
   "score": 191,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwrze8",
   "message": "Noor is never going to forget how you stood by her. On the flip side, she’s also never going to forget what Alice has allowed. I hope your ex wife fixes her mistakes before Noor turns 18.",
   "created_utc": 1701661604,
   "score": 96,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwqi3p",
   "message": "Go Noor! Kick some bully ass! NTA \n\nThe one thing the bully hates is when their victim fights back and wins. Word will get around that Noor knows how to defend herself and the bullying should at least slow down, if not stop. There may even be new friends that have been bullied wanting to learn how to protect themselves.\n\nOP check on the school bullying laws in your state. Tell your attorney what happened and ask him to write the school a letter.",
   "created_utc": 1701660903,
   "score": 59,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwx99g",
   "message": "NTA but there is more going on here. I would get your daughter into therapy. There may have been subtly way noor has been “encouraged” to not “show that of herself” bs. Noors bullying was the issue but how your wife handled it was strange and alarming. It almost seems like she wanted Noor to let it continue and suffer through it without helping.",
   "created_utc": 1701664064,
   "score": 42,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwrunc",
   "message": "NTA So in your ex head Noor has to just let them be racist and bulling her while everyone even teachers and principal ignores as if nothing was happing? Hell no I hope Noor gave them a leason they will never forget. Even the Mom of one the bullies said it was wrong and made their demon of child apoligise! Just one question did she still get suspended? Cause if she did I would sue the school for letting this happen, there is even video proof of the bulling and witnesses!",
   "created_utc": 1701661542,
   "score": 33,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwt5ki",
   "message": "NTA as a victim of bullying in my days I wish I was Noor",
   "created_utc": 1701662161,
   "score": 20,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwrzcd",
   "message": "NTA.\n\nSometimes violence is the answer.  I also was bullied, I was smaller in stature and a late bloomer.  I took martial arts and with violence I got the bullying to stop.  \n\nYour kid is not a punching bag.  She has resources with karate has developed and will give bullies second thoughts when they think of picking on her again",
   "created_utc": 1701661604,
   "score": 18,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx28zn",
   "message": "NTA also I think you need to start documenting this bullying and racist behavior Alice is showing towards Noor. \n\nI have been where Noor is I was the only Native American child in a mostly white school and the administration like here rug swept it all.",
   "created_utc": 1701666655,
   "score": 19,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwwl0d",
   "message": "NTA. You taught your daughter to defend herself. Your ex is ignoring the problem.",
   "created_utc": 1701663760,
   "score": 16,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx2qp6",
   "message": "NTA - Time for a new custody arrangement.",
   "created_utc": 1701666937,
   "score": 17,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx46mo",
   "message": "NTA\n\nMake sure you remind Alice (and her family members defending her) that what she is doing is racist. She'll probably claim that she can't be racist since she married a Bengali man and has a mixed child, but her actions clearly show otherwise. She is enabling racist bullies to hurt Noor and the only kind of person who would enable a racist is another racist. \n\nI'd also say that this is probably true of the principal/administrators, especially if they are willing to tolerate racist bullying in their school in the face of clear evidence and witnesses.",
   "created_utc": 1701667776,
   "score": 14,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwvhxz",
   "message": "I have some experience being bullied.  Not racist experience, but I know bullying.  \n\nIn my experience, bullying is usually done by someone who thinks they are teaching a lesson.  They are teaching someone how to dress, behave, etcetera.  Adults then often back the bully because they also think, maybe subconsciously, that the victim needs to be taught something.  Often the adults are themselves pile on the bullying.  Bullying victims who Fight back are very often the ones who get the punishment.  The point is, bullying runs so deep in the human psyche as a way of enforcing compliance to social norms, that generally decent people can have a really hard time perceiving it when they are directly involved.  \n\nThe most effective way to stop someone from being a bully, particularly adults, is to remind them to mind their own business.  Remind them that being a decent human being has to involve respecting someone’s choices to be different. I think for the adults in this circumstance, particularly your ex-wife, you need to remind them that the accusation that the one coloured girl decided to physically attack two larger white girls at once, unprovoked, is ridiculous and they cannot possible be naive enough to believe that version.  And if they don’t, what are they saying - that your daughter did something to deserve being physically attacked by two larger girls?  And do they think your daughter does not have the right to defend herself when attacked by two larger girls?  Tell them the six day suspension is asinine, and you are taking your daughter for ice cream and if they would spend thirty seconds actually thinking about what they are saying, they would join you.",
   "created_utc": 1701663257,
   "score": 10,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx306u",
   "message": "Your ex has her own issues to work through. I'd be filing a report with the school district, the state and maybe even the feds, they do not tolerate racism on the fed level.",
   "created_utc": 1701667088,
   "score": 9,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx6ppl",
   "message": "NTA. And honestly, consult a lawyer because Alice letting Noor get bullied is shitty parenting. The fact that she is letting her face racism is a different kind of shitty parenting. \n\nConsult a lawyer then tell Alice if she doesn’t get her white head out of her white ass you will go to court and fight her there to ensure Noor is taken care of properly.",
   "created_utc": 1701669343,
   "score": 8,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwzt1e",
   "message": "NTA",
   "created_utc": 1701665321,
   "score": 6,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx20gg",
   "message": "My mom gave me the same advice you did, I couldn't start a fight, but I was allowed to finish it. But I was only a fat white kid, so no trouble for me. 🙄 NTA, congrats to Noor, and you for being an A+ dad.",
   "created_utc": 1701666522,
   "score": 4,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx4shd",
   "message": "I have a son who was mercilessly bullied through school. In the last episode, he delivered what must have been a cutting come-back to some verbal bullying, and the bully responded by trying to choke/strangle him. They actually had their hands around his throat. I had put him in Jiu Jitsu, so he easily broke the hold, and shoved the person back. \n\nI got a call from the assistant principal, who told me everything. He said my son was not in trouble “this time,” but they wanted me to talk to him, because “violence is never the answer.” I solemnly swore that I would talk to him.\n\nHe came in the door after school looking like he wasn’t sure how much trouble he was going to be in. I sat him down and told him that I had gotten a call from Mr. Dinglebutt (not his real name), and that based on what I was told, my son had done everything right. We talked about it a bit, and I continued to reassure \u0026amp; congratulate him.\n\nInterestingly, he told his dad, and his dad said that my son should have hugged her instead. (Like, wtf?!)\n\n\nAnyway, congratulations and well-done to Noor!",
   "created_utc": 1701668143,
   "score": 4,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbwxopq",
   "message": "NTA- your ex wife, her family, and the school officials are all acting out of white privilege. Sounds like it's time to report them and force sensitivity training on the school. I don't know what state you live in, but something like your story would make the news where I live.",
   "created_utc": 1701664258,
   "score": 10,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx4avl",
   "message": "I love all of this. You are a kindred spirit, sir. Our son gets bullied and always has. We've told him and the school point blank, \"never swing first, but defend yourself. If you have to suspend him, so be it, but we're going out for Japanese at his favorite restaurant that night. He will not be in trouble at home for defending himself.\"",
   "created_utc": 1701667847,
   "score": 4,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx4i25",
   "message": "NTA. Your ex seems to have blinders on. How a parent doesn't stand by their child is abhorrent to me.",
   "created_utc": 1701667966,
   "score": 4,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx6ygc",
   "message": "NTA. Your ex has some very serious privilege blinders on, which is hard to stomach as ITS HER DAUGHTER. You stood by your daughter in the face of outright racism. Not just from the kids, but more importantly from the school that was going to give the brown kid a more severe punishment than the white ones. Definitely start saving videos and documenting in writing every incident. You need to put the screws on the admins so they can’t ignore this.",
   "created_utc": 1701669497,
   "score": 3,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxa4v5",
   "message": "NTA. Your ex wife is racist and she's hiding it. Nor will be old enough soon to decide who she wants to live with and it won't be Alice. You've helped your daughter form a core memory and shown her who has her back. It ain't her racist mother that's for sure.",
   "created_utc": 1701671607,
   "score": 3,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx3ua9",
   "message": "Nta at all.",
   "created_utc": 1701667571,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx5acc",
   "message": "NTA - happened to me too, magically stopped right after I went apeshit on the ringleader and was suspended for a few days.\n\nRingleader just avoided me after that and I changed districts for highschool. While I admit maybe there might have been another way to deal with it, I won't deny it was very effective.\n\nI got rightfully grounded for it, but it was 100% worth it to get the bullies off my back.",
   "created_utc": 1701668446,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx5uf3",
   "message": "NTA\n\nI had a bully in middle school and I did what your daughter did. I threw him on the ground and his head sounded like a cantaloupe as it hit the floor. Our “punishment” was spending a day together, supervised, and discussed why he was a bully(shitty parents). Violence should never be a first response but out right ignoring it is silly. ESPECIALLY, if the school did nothing. My parents reported the school and lead to the principle getting fired and a bunch of school board members stepping down due to back lash. Contacts some local organizations depending where you live and document EVERYTHING",
   "created_utc": 1701668794,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxrttd",
   "message": "NTA\n\n\u0026gt;he understood my POV but I took it too far when I yelled at Alice.\n\nHow can someone with that name be so God damn stupid. \n\nThankyou dad for giving your daughter the confidence to do what had to be done to get bullies to back off. I would ring the school and ask what they are going to do about the racist mother who yelled AT YOU in the office.\n\nI'm sure you can file a restraining order....would phuck her up",
   "created_utc": 1701685837,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx58z9",
   "message": "Not the asshole but you and Alice have to learn not to fight in front of your kid.",
   "created_utc": 1701668423,
   "score": 0,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxeko5",
   "message": "Your grammar broke up more the more you got upset writing this, so it's hard to tell exactly what you were saying. It's good to stand up to bullies. It's bad to do it in a way that will get you suspended or expelled since that affects your future.",
   "created_utc": 1701674850,
   "score": 251,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx3loa",
   "message": "YTA did you ever go to the school to attempt to deal with the situation? Discuss it with her teacher, principle, school councilor? \n\nThe bullies are wrong but so it teaching your child to respond violently. This isn't the world most of us grew up in, most schools have a zero tolerance policy for violence,  as you can see by your child getting suspended. Right or wrong, it doesn't matter anymore who threw the first punch.",
   "created_utc": 1701667431,
   "score": 238,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx5k91",
   "message": "NTA  You showed appropriate support. \n\nAs someone who had a similar experience as your daughter, thank you. \n\nI had the same advice you gave her from both parents. They really stressed never touching first, removing yourself, avoiding being hit, however once started by someone else, fully encouraged to not hold back until the threat was fully neutralised. \n\nIt was never about encouraging violence, quite the opposite. It was about knowing they thrusted me to control myself, even confronted with unfair treatment -different than not reacting. It was about making sure I knew they trusted me to not have any will to harm others, and knew I wouldn’t be blamed for protecting myself. \n\nUnfortunately moving around fews time, it happened almost at each new place. From my experience once was enough to be a warning to others to never dare trying again… at least the years before moving again. \n\nI hope those tormenting Noor will never dare acting this way ever again. \nAlice was disappointing failure on the matters .",
   "created_utc": 1701668616,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx6gao",
   "message": "I think you did the right thing! Stand strong in your decision! Alice seems to only care about the public’s perception of her instead of protecting her own child. It sickens me that this still goes on in school especially at such young ages. Even to get remarks from passerby’s in the hallway. The fact that the principal and other teachers are not sticking up for their students saddens me as well when you even told them what has been said towards your daughter. I feel like the wife always may have twisted things to her side of the family to make you seems like a bad person. Personally seems like slight narcissism from the mother if you ask me. You are raising your daughter right! I was taught the same things growing up, to always stick up for myself. I hope the situation gets better. You are raising a strong young lady!",
   "created_utc": 1701669173,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx73mh",
   "message": "Sometimes a decisive stand for yourself is what's needed to end bullying. You might spend the suspension studying and working out in Karate. NTA",
   "created_utc": 1701669590,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx8vcc",
   "message": "NTA, Alice doesn’t get it and will never get it atp. She witnessed someone yell racial slurs at y’all daughter and she said nothing??? That doesn’t sit well with me.",
   "created_utc": 1701670751,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbx98gy",
   "message": "NTA. Your ex's belief that Noor should allow herself to be racially bullied is concerning. I'd definitely bring that up in court. If someone sees abuse and they do nothing, they're siding with the abuser.",
   "created_utc": 1701670990,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxan2j",
   "message": "NTA hope she enjoyed the ice cream",
   "created_utc": 1701671961,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxbrf8",
   "message": "NTA\nIce cream is the best after being suspended for sticking up for yourself. I did the exact same thing with my son when he defended himself.",
   "created_utc": 1701672755,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxcp4t",
   "message": "So much of my childhood was spent being bullied for being the disabled kid. And getting shit advice from adults on the topic. When the adults intervened, it got rid of one group of bullies and allowed another to step in.\n\nOnly in high school did my dad tell us kids \"I better not hear you started the fight. But I better hear you ended it.\"\n\nNoor, I'm proud of you, kid. Be proud of who you are and what you bring to the world. Own that suspension as a victory: not every win is a clean one, but you still won.\n\nOP, good job. She's going to grow up knowing her strength and resilience and that, while she won't always need to physically fight, she can take care of herself when difficulty presents itself.",
   "created_utc": 1701673435,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxdj81",
   "message": "Nta. My dad taught me the same thing. He always told me to stand up for myself and if I got in trouble,  so what. He said he'd be in the office congratulating me and telling the school he was proud.",
   "created_utc": 1701674057,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxez5j",
   "message": "The mom that was spouting that racist shit woulda got the baddest fuckin left hook i could throw the silly bitch nta",
   "created_utc": 1701675168,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxh2sg",
   "message": "I literally just fist pumped the air. Go Noor!! Screw those bullies!!",
   "created_utc": 1701676818,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxim9k",
   "message": "No more Karate. Enroll her in boxing and BJJ or MMA style training. Every woman would benefit from these skills. Learning how to hit, grapple and using locks are invaluable for someone who is smaller, or bullied. They will only need it once for bullies.",
   "created_utc": 1701678071,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxjib1",
   "message": "NTA. You are reading her to be strong, independent, capable and proud of who she is. You’re a good father.",
   "created_utc": 1701678808,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxjv9y",
   "message": "If I’m honest, I would take Alice to court. Change schools and get more than half custody. As someone who is a POC woman, her mother is doing so much harm to your daughter. You need to make more steps in this NTA",
   "created_utc": 1701679106,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxkdx7",
   "message": "NTA. Get custody. Mom is a piece of shit.",
   "created_utc": 1701679549,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxneza",
   "message": "NTAH \n\nBut I recommend getting the courts involved to get more custody and enroll her in a school with less racism.",
   "created_utc": 1701682131,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxnyf9",
   "message": "Violence is never the answer is biggest bs there is, i remember in my school days, kids who rolled over had it worst.",
   "created_utc": 1701682591,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxpeht",
   "message": "NTA...not a chance.\nI'm very proud of you and I don't know you at all 😀\n\nFirstly. Our job as parents, is to support our children. Our kids come first. Always. We are as i say \"the soft place to fall\". Our kids need to know they can count on us. Always. \n\nAnd? I am NOT into punishment. At all. I never \"punish\" my children. I have raised my daughters with love, understanding and kindness. If they have done things wrong? We talk about it. Why it was wrong. I try to work out what they were thinking? We talk about better ways to handle it ...\n\nThing is? My way works!! My girls are nearly 18 \u0026amp; 19yrs. Lovely girls. Kind, respectful, never been in trouble, great manners \u0026amp; hb and i get on with them SO well. No issues at all.\n\nThe bullying and racism😡 Sorry wife .. but that CANNOT BE TOLERATED. At all. Totally unacceptable \n\nI know because my youngest was bullied...same...freakin school would not do a damn thing😡 She didnt have to resort to physical fighting. But we took her out of that school. \n\nGood on Noor and VERY good on you 👍 i took my daughter for ice cream one day after i picked her up too 😀 School didn't agree with me taking her out of school...but she'd managed to text me. So i turned up to the school and demanded to take her home.  I told them NO ONE tells me i can't pick up my child🤬\n\nI dont know what happens now? But looking at this situation in its entirety? You need to have Noor living with you and going to school where she used to. No way id be sending my child back to that viper pit.",
   "created_utc": 1701683827,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxpmfv",
   "message": "Go file a police report against the bullies. Even the racist mom. Then call the news stations and tell them all about the racist school employees. Edit to add I have told my kid as long as they don’t start it they can finish it and that I will take them for ice cream too!",
   "created_utc": 1701684015,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxpuu7",
   "message": "I am mixed race (similar races to your daughter). My mother enrolled me in martial arts since I was 5. I have always been greatful because the confidence it gave me alone acted as a shield for most of my life from inevitable bullying. \n\nShe taught me that if someone hits me, I should hit them back harder, but never throw the first punch. She stood up for me when I got in trouble, as she experienced the same in school but was told to sit there and take it because, as the odd one out, she was somehow the problem. Teachers can be worse than children - they're racist but actively pretend not to be. \n\nYour daughter will always love and trust you like I love and trust my mother. You are a fantastic father. Some people like Alice believe that if they don't see the problem, the problem isn't there. Noor will never trust her mother the same again after this. Make sure to tell Noor that if Alice is mad at her, that's because Alice doesn't like to be confronted with bad things, and Noor is 100% not responsible for her mother's emotions (and shouldn't take it to heart).",
   "created_utc": 1701684214,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxqrgr",
   "message": "NTA",
   "created_utc": 1701684964,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxr6k0",
   "message": "Nta. Sometimes violence is absolutely the answer. And if they keep bullying her? The answer is even more violence. Hit them twice as hard. Instead of bruises, leave broken noses, since obviously they didn't learn the first time. Then go and get her some more ice cream.",
   "created_utc": 1701685305,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxs94b",
   "message": "NTA\n\nIf your ex is unwilling to meet your daughter's emotional needs, maybe it's time to get a solicitor and go for full custody, and move her out of that school.",
   "created_utc": 1701686188,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxtmel",
   "message": "NTA, you did the right thing in teaching Noor to stand up for herself. Clearly she needed to learn that more than ever given how much her mother, the school, and everybody else are wanting to make sure she is kept down as much as possible. Remind all the bullies, including, Alice, the school officials, Karen and everybody else that if they are not going to practice what they preach, then they have no say in how you or Noor stand up for yourselves.",
   "created_utc": 1701687287,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxtzki",
   "message": "Go talk to a few lawyers and put a little retainer down with the one you like in case you have to involve a lawyer in the future. Given the attitude of the principal, the admin and the mother of the bully this sadly may not be over for you and your daughter. \n\nYour wife also needs some therapy as she seems to be struggling with some weird emotions.",
   "created_utc": 1701687575,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxu23q",
   "message": "NTA. I think you might need a change in custody.",
   "created_utc": 1701687630,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxu8zp",
   "message": "Info: does your wife actually like your daughter? Why isn’t she more upset that her child is being targeted on what sounds like a daily basis? Why does she want her to suck it up and put up with it? Why is she ok with other adults sweeping it under the rug nd telling her it isn’t that bad? \n\nIn a perfect world, violence isn’t the answer. But when it’s been months of targets attacks and a school who won’t protect its own students from other students, I think we left “perfect” behind. \n\nWife needs to think about the message she’s sending her daughter .",
   "created_utc": 1701687779,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxvfn4",
   "message": "When I was small, I came home from school with dried blood on my shirt and nose. My dad saw, locked the till in the bar, and took me outside to teach me to fight (with the assistance of a few sheaers, farm town). As I was smaller, he also taught me some dirty shots to \"help you finish the fight, but make sure you don't start it\". Next time I was bullied and shoved, I hip threw that mean cunt through a cabinet, and was left alone for the rest of high school. \n\nAnd now, as my dad has been dead for 20 years, I have that fond memory of us bonding over mean cunts, and learning that valuable skill to finish the fight, not start it. \n\nIt may not be the \"right\" thing to do, but good on you for helping your daughter. NTA.",
   "created_utc": 1701688678,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxvvra",
   "message": "NTA",
   "created_utc": 1701689003,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxxv8o",
   "message": "NTA. If you don't stand up to your bullies, it will never end. There is nothing wrong with standing up for yourself. Noor's mother is just as bad as the bullies. Also, the racist mother? I Would have reported her to the school board, citing that the parents racist and bullying tendencies were being taught to their child who is using that behaviour in the school. Things like that should not be tolerated in a school.",
   "created_utc": 1701690421,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxxwd8",
   "message": "NTA\n\nI think you need to document every instance of bullying and racism your daughter has went through and also note your exs reactions and how she’s supporting the bullies and done nothing but punish Noor through all this. I have a feeling she’s going to try and remove custody so you need everything and if possible take screen shots of all messages and record all conversations with her. Just to protect you and your daughter. Then if you need you can use them to prove she’s the harmful parent not you.\n\nI would also contact the school board about the headteacher and aids being racist and how the are treating your child and punishing her for being racially attacked. I’d get the teachers and people who saw and were willing to back you details to the board as witnesses to the crimes against your child. Even go to the papers if you need to as unless you get the school handed it’s arse the will continue to allow this sort of thing.\n\nHonestly I’d petition the family court to remove your daughter from the school regardless of her mother who refuses to protect her own child and in fact is further bullying her at home for issues out of your daughters control.",
   "created_utc": 1701690442,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxy3f3",
   "message": "NTA and good on your kid for standing up",
   "created_utc": 1701690577,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxyddy",
   "message": "You did the right thing. And your daughter will remember that.",
   "created_utc": 1701690758,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxylik",
   "message": "NTA! :) Good parent!",
   "created_utc": 1701690908,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kbxzxf8",
   "message": "You did good. I am SO proud of how you rewarded her instead of punishing her. Keep it up! While she is on suspension, take her to do fun things, if you can, or just buy her her favorite treats, let her sleep late, and make the days otherwise special for her.\n\nMy second oldest son (I have four, all grown now), when he was in middle school, had this one bigger child that would bully him mercilessly. Just enough to get under his skin, nothing he could \"prove\".\n\nOne day, while waiting for the bus after school, the bully kept poking him in the chest and calling him names. My son, very quietly,  asked him to stop poking him. I am sure you know what kind of reaction that got, more poking and harder.\n\nAt some point, my normally shy child hauled off and punched the bully in the face, inadvertently breaking his nose.\n\nThey were both called in to the office because there were witnesses. I got to the school within 5 minutes (SAHM).\n\nThe principal was a pretty nice man,  and understood that my son was being bullied, but school policy was that if you laid hands on another child, you were suspended. \n\nI looked at my son and said, \"Violence is not always the answer, but good for you!\"\n\nI told the principal that if he was going to suspend my son for defending himself, then my son would spend those three days sleeping late and playing video games all day. I would NOT punish my son for standing up to a bully. \n\nSo, I totally get where you are coming from. I hope your daughter enjoys her suspension with things she loves to do!",
   "created_utc": 1701691783,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby1kah",
   "message": "NTA. You did the right thing. Your kid did the right thing. Honestly, you should think about going for full custody, because your ex sounds like a horrible person.",
   "created_utc": 1701692805,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby2qxz",
   "message": "NTA but I think it is time to talk to your daughter about what is really going on at home with her mom and family. She may have had racist comments made about her and you.  Sometimes it may have been said to her or she has heard things.",
   "created_utc": 1701693523,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby3fk5",
   "message": "NTA, maybe you should talk to your attorney about changing custody since Alice won’t protect your daughter. That’s abuse. Also get your attorney to send a nice threatening legal action letter to the mother who yelled racial slurs and the school too. School districts don’t give a fuck until the real possibility of legal action is started taken against them",
   "created_utc": 1701693920,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby3ibn",
   "message": "I’m white, and I was the target in middle school for 1) being an identical twin and hugging my sister and was called gay, and 2) by black girls.  I don’t think I ever knew exactly why.  The one time I do remember is finally getting near the front of the lunch line and several girls cut in front of me.  I curtiously let them know I was there first (duh) and they needed to get to the end of the line.  Parents were called, and my mother let me know the principal said no fighting for any reason, but she said she is going to make sure we can stand up for ourselves.  We took the kwon do, and after we did a demonstration at the school, I was not bullied anymore and in fact made a few African American friends. Updateme",
   "created_utc": 1701693964,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby47mn",
   "message": "NTA good job dad... you should report those school officials  as well as the other parent that was being rude..your ex and everyone on her side are major AH",
   "created_utc": 1701694360,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby4ibq",
   "message": "NTA. My dad did the same for me when I was being bullied for being “poor”. I got in one fight where the bully threw the first punch and I definitely threw the last. I got suspended for a week because of the zero-tolerance policy, but even the principal said I wasn’t a violent kid or “troubled”. My dad’s response was to treat me to a movie and lunch. It’s been 16 years and I still think about how my dad had my back and made sure I could protect myself when I needed to. Your daughter is going to remember you supporting and helping her long after she grows up and moves out. She’s always going to know she absolutely has the ability to defend herself and she will know when to use that ability. And she will always remember you made sure she had that power. Your ex on the other hand will always be the person who would rather see Noor being victimized and attacked than defend herself. She will remember, and she will make her decisions on who she talks to as an adult accordingly.",
   "created_utc": 1701694523,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby56pz",
   "message": "NYA: You encouraged her to report the issues multiple times first. When that didn't work, you told her that she could defend herself as long as she didn't throw the first punch and it was a last resort. That's exactly the advice you should give. Good for you!",
   "created_utc": 1701694897,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby5a81",
   "message": "Definitely NTA. First off I would like to say WAY TO GO DAD!!! You are protecting your daughter the best way you knew how when it comes to bullying and that's self defense. You ex wife is oblivious to racism due to the fact that she cares more about what white strangers think more than her own daughter. Your ex wife is sad and disgusting. She needs a reality check.",
   "created_utc": 1701694951,
   "score": 1,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby7jfe",
   "message": "I never understood why a school would continuously ignore bullies until the victim fights back. It happened to me ... I had people on my ass for more than a year (this included our main teacher adding passive aggressive remarks towards me and so defintely turning a blind eye) and finally I snapped and hit back. It wasn't a graceful fight because rage took over, but those AH definitely stopped afterwards when the consequences finally hit them. All I had was in-school suspension and a rep for being a bit \"crazy\", like I said... rage just finally hit me.",
   "created_utc": 1701696149,
   "score": 2,
   "submission_id": "18aapzn"
  },
  {
   "comment_id": "kby87u0",
   "message": "nta - any type of bullying is wrong. Your daughter defended herself. She should not be punished. The school needs to take bullying seriously. You ex is delusional.",
   "created_utc": 1701696493,
   "score": 1,
   "submission_id": "18aapzn"
  }
 ]
}