{
 "submission_id": "18adex5",
 "title": "AITA for telling my mom that I would disinvite my father to my graduation if she invited him?",
 "selftext": "I posted this in another subreddit but figured I could also get some advice from here too! I'm also kind of new to posting so forgive me for bad formatting.\n\nRecently I have argued with my mom about this so I came to reddit to help settle the matter. I F17 am going to graduate in May 2024, that being said I have started figuring out who is allowed and who is not allowed to come to my graduation ceremony and my graduation party. I have invited all of my paternal family except for my father himself. Me and my father have never gotten along, in my earliest years he physically, verbally, and emotionally abused me and he has tried to gaslight me for years into believing it never happened. The abuse messed me up very badly, I was told that I may have depression and anxiety at the age of 10 and confirmed it at 13. To say that his abuse caused me damage would be an understatement. Everyone knows I have no intention of staying in contact with him when I turn 18, my 18th birthday is in February so I do not have to talk to him after that.\n\n  \nLately my mom has been talking about letting him know after she finds out when and where the ceremony is and inviting him and his gf. I don't get along with either, she once allowed her kids to touch me after eating peanuts to which I am deathly allergic to and his gf insulted my mom multiple times while I saw her when I was visiting my father. I refused to let him come and that if he did I would not walk the stage or attend the ceremony at all. She got mad and said my father is not as bad as he used to be (he is not as neglectful or abusive), I argued that he destroyed my confidence and ruined my self-image, I hated looking at myself because of him. I told her not to invite him because if he was invited I would never forgive her.\n\n  \nMy step dad said my father has called me more and communicated more with me, that he is making more of an effort. I said he's doing that because he's finally realizing that he's losing time to fix what he messed up, I then said that he realized too late and that I hate him and never want to see, hear, or be around him, especially not for a day as important and sentimental as this. I said he had many chances, he missed  my Elementary graduation and Middle school, and my middle school graduation was on Zoom, he really had no excuse. He doesn't get to play dad when it's most important or when it makes him look best, if he really wants to look like a good parent he can go and parent the only child he actually loves, my half brother C7. My mom yelled at me saying my father did love me, he just had a difficult way of expressing it. I said maybe he should have tried to express it in other ways than abusing, gaslighting, and neglecting me. The argument ended with me telling her if she invited him I would not forgive her for betraying me and not respecting my boundaries and that I would end up just disinviting him myself and telling him exactly why.\n\n  \nSo, Reddit, AITA for telling my mom I would disinvite my father from my graduation ceremony and party if she invited him and that I would tell him the reason why?",
 "created_utc": 1701668063,
 "permalink": "/r/AITAH/comments/18adex5/aita_for_telling_my_mom_that_i_would_disinvite_my/",
 "score": 59,
 "url": "https://www.reddit.com/r/AITAH/comments/18adex5/aita_for_telling_my_mom_that_i_would_disinvite_my/",
 "comments": []
}