{
 "submission_id": "18af6b7",
 "title": "AITA for puking while giving a bj?",
 "selftext": "I 20F was hooking up with 21m when I accidentally puked while giving him a bj.He kept pushing my head down and wouldn’t stop despite me tapping his thigh. He triggered my gag reflex. I was very apologetic, extremely embarrassed, and said sorry. A small tiny amount of it got on his shirt. Like two dots. I said let me make it upto you. Probably get it laundered or something. But he was very rude and called me the worst sex, weak and that he couldn’t stand the smell. And said ugh.\n\nWhile I understand I made a mistake. That doesn’t justify him talking to me like this. I’m weak?! It feels like he is trying to manipulate and gaslight me. I am curvy/fat, and I’m not ashamed or embarrassed of my size, however I have had people try to break my self esteem down and try to manipulate me before. He said he needs time to process this and hasn’t texted me since. Ngl, when he called me weak I got mad and cussed him out too. Especially given he hasn’t been able to/ purposely make me finish thrice (we hooked up twice before , this happened the third time). I don’t care if he doesn’t text me back. Or doesn’t hook up again. But he doesn’t get to talk to me or berate me like this either. It was a mistake and I apologised. It feels like he said it to make me feel bad about myself and later on make me do whatever he wants. \n\n\nAm I in the wrong here? Is what I did really that bad? Am I the asshole here and overreacting?",
 "created_utc": 1701675264,
 "permalink": "/r/AITAH/comments/18af6b7/aita_for_puking_while_giving_a_bj/",
 "score": 88,
 "url": "https://www.reddit.com/r/AITAH/comments/18af6b7/aita_for_puking_while_giving_a_bj/",
 "comments": [
  {
   "comment_id": "kbxfkua",
   "message": "He continued to push your head down despite you tapping him in an effort to stop? Of course you’re NTA. Never speak to this guy ever again.",
   "created_utc": 1701675636,
   "score": 187,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxfnpt",
   "message": "This is a guy that you should cut out of your life and never have anything to do with ever again. He forced you. He ignored your signal and then gets upset over something he caused. He is manipulating you. Run away. You are definitely not the AH here.",
   "created_utc": 1701675698,
   "score": 113,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxg22b",
   "message": "Ffs. NTA. He should have apologized to you. He kept pushing your head down even though you were tapping out?! He is an abusive creep. Don't hook up with losers and assholes.",
   "created_utc": 1701676010,
   "score": 91,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxfotc",
   "message": "This guy’s a disgusting creep. You need to not want to see him again.",
   "created_utc": 1701675721,
   "score": 145,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxfg67",
   "message": "no. don’t see him again.",
   "created_utc": 1701675534,
   "score": 88,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxgdkl",
   "message": "NTH\n\n1: he was pushing your head down like a jerk\n\n2: Even if it was all your fault (lets  you where drunk) it doesnt make you an asshole. just an accident that 2 grown adults can handle easily. but im thinking the guy is not really an grown adult here...\n\nstop seeing that dude, spare yourself the mental health issue types like him can give you",
   "created_utc": 1701676260,
   "score": 35,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxg2yx",
   "message": "He didn’t stop when you were tapping him? He deserves to be thrown up on. Please never see him again. NTA",
   "created_utc": 1701676030,
   "score": 57,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxfzip",
   "message": "nta\n\ni hope neither of you ever reach out to each other again because then you didnt dodge a bullet but a tactical nuke.",
   "created_utc": 1701675955,
   "score": 23,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxhqnc",
   "message": "NTA. I don’t even think you made a mistake?? You gave him the tap, he was a selfish pos and what happened happened. You’re fine, as long as ya don’t go back to him. It’s not like us guys aren’t aware that a gag reflex exists lol",
   "created_utc": 1701677352,
   "score": 22,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxkhb9",
   "message": "It was his own fault. You tried tapping out, and he kept pushing your head down (God, those men are horrible). He literally caused you to vomit, and then he has the nerve to blame you?\n\nNTA, but listen, don't let men do that to you. The next time a man pushes your head, just stop and leave. \n\nI know there are too many assholes out there. But trust me, there are also decent men out there. Hold out for one of them.",
   "created_utc": 1701679628,
   "score": 19,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxj3ac",
   "message": "NTA but you're very young, you need some serious self respect. Don't get yourself used for 5 minutes of unworthy sex sis",
   "created_utc": 1701678464,
   "score": 41,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxit2v",
   "message": "NTA.  But next time make sure you have a stomach full of the reddest fruit punch you can purchase so that you at least can respond with dramatic red vomit when he does the sexual assault thing",
   "created_utc": 1701678230,
   "score": 19,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxmnin",
   "message": "You did NOT make a mistake! \nHe is MANIPULATING you into feeling like you should be desperate to please him. \nIGNORE HIM COMPLETELY FOREVER!\nThat’s the only way to win with a narcissist.",
   "created_utc": 1701681476,
   "score": 17,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxgp8h",
   "message": "why is he not blocked yet ????",
   "created_utc": 1701676514,
   "score": 14,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxkiow",
   "message": "Wow definitely NTA!!!\n\nHe pushed your head down until you puked!\n\nDefinitely not weak, I'm all for any sex acts as long as they are consensual, you'd tapped out, that's clear as a bell he had no consent to push further\n\nPuking is not your mistake, in this case 100% his and you deserve better.\n\nEven if you made the mistake by voluntarily going too deep, then he should be so fucking lucky you'd put that much effort to please him!",
   "created_utc": 1701679661,
   "score": 15,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxi7vz",
   "message": "A BJ is literally the nicest thing a girl can do for a guy, he forced you past what you were comfortable with then berated you for a natural reaction you can't control. NTA find someone who appreciates your BJs.",
   "created_utc": 1701677738,
   "score": 14,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxiuct",
   "message": "NTA. I love giving oral but HATE guys pushing my head down. The first time I went down on my now husband he pushed my head down. I immediately stopped and said \"I REALLY don't like that. Don't do that.\" And he apologized and we continued our activities. If he was pushing you so hard that you couldn't pull away than that is a problem. He was basically trying to use you like a sex toy and when you ruined the illusion by being human he got pissed off. You shouldn't have even apologized honestly.",
   "created_utc": 1701678260,
   "score": 37,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxjcat",
   "message": "Oh honey, this wasnt your mistake or in anyway your fault. Pls Run and never look back nta",
   "created_utc": 1701678671,
   "score": 13,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbximdg",
   "message": "You deserve so much better than this.",
   "created_utc": 1701678074,
   "score": 10,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxmdf1",
   "message": "NTA at all. He kept forcing your head, he got what you deserve. \n\nI absolutely hate when people touch my head when I'm going downtown. It removes any control I have in the situation. My hubby knows that if he does it, it's game over. I'm stopping.",
   "created_utc": 1701681234,
   "score": 12,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxntf7",
   "message": "Run. Must run . Fast. Faster.",
   "created_utc": 1701682475,
   "score": 11,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxq5i0",
   "message": "Did you even want to give him a blowjob or did he coerce you? This sounds concerning.",
   "created_utc": 1701684457,
   "score": 11,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxhktp",
   "message": "He is a total ass, never talk to him again. Gross guy.",
   "created_utc": 1701677220,
   "score": 10,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxjdvm",
   "message": "NTA at all. He is. And a big one. Dont let him gaslight you and make you feel bad about yourself.",
   "created_utc": 1701678707,
   "score": 9,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxl1f6",
   "message": "A VERY emphatic NTA. He disrespected you, he was selfish to keep pushing your head and for not making you finish, and he's an idiot for not expecting you to puke. He sounds like a complete asshole, and you deserve so much better.\n\nI've also had exes push my head down. At first, I was very insecure and shy, so I wouldn't say anything, but over time, I'd tell them not to do it or else I'd bite them, and I would follow through if they crossed that boundary.",
   "created_utc": 1701680098,
   "score": 11,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxqr9p",
   "message": "The tap is a pretty universal sign to stop. \n\nNTA for sure.",
   "created_utc": 1701684960,
   "score": 11,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxjqf0",
   "message": "NTA and you should leave him alone.",
   "created_utc": 1701678993,
   "score": 8,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxnprt",
   "message": "NTA. I’m a guy and I can’t imagine pushing someone on to me until they puked. This is closer to him abusing you than you doing anything wrong.",
   "created_utc": 1701682388,
   "score": 10,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxo90k",
   "message": "You should have puked all over him. He sucks. No pun intended.",
   "created_utc": 1701682841,
   "score": 9,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxkbnd",
   "message": "First of all. You ARE NOT the asshole. Second he absolutely is one, and doesn’t deserve the attention you gave him, let alone the caring over a few drops of puke getting on his shirt. By not allowing you to at least pause and take a breath to prevent choking \u0026amp;/or puking even though you were indicating a need to stop, he turned a consensual act into an opportunity for rape. I am sorry you had to go through this, and hope that it hasn’t harmed you beyond feeling bad enough to need outside input verifying that you were not wrong.",
   "created_utc": 1701679495,
   "score": 8,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpnca",
   "message": "That’s basically sexual assault. Nta",
   "created_utc": 1701684036,
   "score": 8,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxvk1r",
   "message": "He's lucky he got the gag reflex and not the teeth reflex. \n\nNTA. Lose that childs number and find a man who understands consent and boundaries",
   "created_utc": 1701688768,
   "score": 8,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxqvrh",
   "message": "Jesus why are you apologizing? He wouldn’t let you stop so he essentially turned a blow job into forced oral.",
   "created_utc": 1701685064,
   "score": 8,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxna8w",
   "message": "Not only you're not the AH. \n\nHe is very close to sexually abuse you. What about pushing your head down when you're clearly choking (you patted him in the thigh)? What did he expect by doing that?\n\nThat guy watched too much p*rn, I would run away from him.",
   "created_utc": 1701682015,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxnhul",
   "message": "You didn't make a mistake... He pushed you down and triggered a reflex. Its his fault and he calling you the weak sex while crying about the smell is just ironic.\n\nChoose ur man better... This one doesn't respect you!",
   "created_utc": 1701682201,
   "score": 5,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxo88h",
   "message": "Um... This really should be a story about your asshole boyfriend that made you throw up and instead of apologizing was verbally vile to you. \n\nLike getting puked on isn't a nice feeling for sure, especially on your genitals, but so is like getting forced to puke? 😆 It would be your mistake if you pushed yourself over your limits, but he's the one who forced you to continue. I don't understand how can you think it's your fault.",
   "created_utc": 1701682822,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpdcq",
   "message": "You're NTA, darling.\n\nThere was no mistake on your end. You tried to signal that you weren't ok with him *forcing your head further on him* and in turn, he got vomited on. \n\nMan fucked around, found out, and then got mad at you for /his/ mistake. Drop him and be done with him, you don't need someone who doesn't value your communication and explicit consent while doing anything like that",
   "created_utc": 1701683800,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpggv",
   "message": "Girl have some self respect. Dont be a doormat for sex. Dont stand for such behavior and learn to set boundaries and enforce them.",
   "created_utc": 1701683874,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpjcv",
   "message": "NTA\nHe is a giant AH for basically sexually assaulting you.",
   "created_utc": 1701683943,
   "score": 7,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpl7b",
   "message": "You made no mistake at all, he is a toxic asshole and I would suggest you don't see him again. Forcing you down without your explicit and enthusiastic consent is a big nono. His immature reaction afterwards is just the strawberry on top. You did not owe him an apology - he is the one who needed to apologize.",
   "created_utc": 1701683986,
   "score": 5,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpx7q",
   "message": "He’s bloody lucky he never got a full stomach load on him, he kept pushing OP: really what did he expect? He’s the one who’s shit at sex - he couldn’t get you off the 3 times you’ve hooked up?! He needs an anatomy lesson. Don’t know why you went back for more after the first time, PLEASE don’t go near him again, he’s really not worth it. Abusive wee shit",
   "created_utc": 1701684269,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxpzii",
   "message": "NTA. He sexually abused you and he deserves to clean that vomit up with his own tongue.\n\nYou need to take a step back and look at this objectively, and consider your own boundaries and self-worth.\n\nIf a friend had told you this, would you have been sympathetic to the guy who did that to them? My guess is no. My guess is that you'd tell your friend to stay away from this guy and you'd be seriously worried about her and her safety.\n\nI'd back out of that relationship, and I don't think you'll be ready for a new one until you work on yourself because as you describe this situation, you are *incredibly* vulnerable towards abuse. Find yourself, find your boundaries and find your worth.",
   "created_utc": 1701684322,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxqom0",
   "message": "Nah if you tapped, he's the dick. What are you gonna do bite his dick?",
   "created_utc": 1701684900,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxqsed",
   "message": "NTA never apologise for situations like this!! He made you puke by pushing your head down (never push guys!). He is the big asshole. Small tip if this ever happens to you. Bite. It will hurt like hell for them, but so does a dick too far down and guys should never push your head down in the first place. That will do the trick. The evening will be over then, but women (or other men) don’t deserve these kind of guys",
   "created_utc": 1701684985,
   "score": 7,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxrv7x",
   "message": "So he forced you to keep going... He sucks, honestly you should have puked him in the face. NTA",
   "created_utc": 1701685870,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxukoq",
   "message": "This is not okay on any level. He forced you to continue something you wanted to stop. Even if for a minute. \n\nGuys. Pay attention. That pushing the head down when we are gagging? It's not fucking sexy. This is not a porn. \n\nAnd then speaking to you like that? \n\nDon't respond at all. Block. No contact. Be fine with him. He will continue to treat you like garbage if you continue to see him. \n\nNTA. Things happen and he needs to get over himself. He also should seek therapy for how he talks to women.",
   "created_utc": 1701688026,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxus0x",
   "message": "\u0026gt;While I understand I made a mistake.\n\nWhat mistake? NTA for the incident, but YTA to yourself for believing you made any mistake, when a consented blowjob turned into a mouthrape.",
   "created_utc": 1701688179,
   "score": 7,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxlsxn",
   "message": "NTA. This guy is a complete jerk. He’s entirely the reason you vomited. Don’t have anything else to do with him.\n\nAnd in the future have the convo *before* the BJ. I tell every guy that pushing my head down is a huge personal no-no for me. You can express what sign you’ll use, or what you want or don’t want while you perform oral sex and he can do the same. Communication can stop situations like this.",
   "created_utc": 1701680748,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxlu78",
   "message": "RUN - cut him out of your life. Block his number and delete him from your socials. He manipulated you thinking you did something wrong. He sexually assaulted you for his own self pleasure. What’s next, a punch in the face, kick to the stomach all because he doesn’t get his way. \n\nGet away from him as fast as you can and don’t look back",
   "created_utc": 1701680777,
   "score": 5,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxn3n4",
   "message": "Creep with a fetish. Men like this don’t deserve sex",
   "created_utc": 1701681858,
   "score": 6,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxn4o0",
   "message": "Wholeheartedly f this guy. I wish you made a bigger mess while puking. Loose his number",
   "created_utc": 1701681883,
   "score": 5,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxq8yo",
   "message": "Only mistake you made was continuing when he was obviously not respecting you...move on and forget that douchebag. Getting a bj is a privilege and being with a nice lady is too. He doesn't deserve either. I'm a guy and we all love a good bj but keep it mutual.",
   "created_utc": 1701684536,
   "score": 5,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxny5m",
   "message": "It is so unfortunate that you did not puke fully on him , sweetheart there is nothing for you to apologise for, he is such a bastard. You need to never ever contact him again and move on but you have to do some work on yourself like self esteem. I would advise you to stop hooking up and get a boyfriend, stop with the bullshit you have been fed that a chubby or overweight girl cannot get someone to love her truly. You have to change for yourself and not other people. Hookup is only ever gonna hurt you my dear, get into a relationship where you feel loved, secure and respected. Whatever happened happened so move on and don't dwell on it so much.",
   "created_utc": 1701682584,
   "score": 5,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxnzlz",
   "message": "Consider it payback and don't look back. Guy's a douche. NTA",
   "created_utc": 1701682618,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxrczk",
   "message": "He’s a dick for continuing to push your head down, feel free to just stop and ask him to not do that. I honestly don’t know how you women deal with men like that, I gag when brushing my teeth I can’t imagine having a cock pushed to the back of my throat. Communication is key and sounds like this situation lacked that",
   "created_utc": 1701685450,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxrdib",
   "message": "Never ever see this guy again!",
   "created_utc": 1701685463,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxrew5",
   "message": "NTA as embarrassing as it is the exact same thing happened to me with my bf the first time we hooked up. I started laughing hysterically out of embarrassment. He was annoyed but apologized for pushing my head down and then it sort of became a joke for the next couple of weeks. There was no reason for this guy to be rude to you specially considering how nice you were about it.",
   "created_utc": 1701685494,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxs95e",
   "message": "NTA\n\nHell no! It's this rapey jerk's fault by pushing your head down in the first place. I hope this either scared him or grossed him out so bad he's afraid to get a bj from anyone again.",
   "created_utc": 1701686189,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxsir3",
   "message": "So he was forcing you to go down on him when you were clearly giving signs you needed to pull back? And then tried to make you feel like the bad guy?",
   "created_utc": 1701686409,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxss94",
   "message": "NTA - But I am worried about the fact that you do not see that this is abuse. If not straight up SA. You made it clear you wanted him to stop, he forces even more and got mad at the result. \n\nNEVER let a man treat you that way!",
   "created_utc": 1701686626,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxufbj",
   "message": "Ask him how he knows you're weak if he never sucked dick",
   "created_utc": 1701687915,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxuria",
   "message": "NTA, you should never be forced to do anything in sex and if he triggered your gag reflex that’s his fault not yours.  You deserve better. Don’t let this guy break you down. Find a guy who listens and cares.",
   "created_utc": 1701688168,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxvcoz",
   "message": "HE is the asshole!\n\nYOU are a normal person with a normal reflex. In fact, you're far too nice, to even consider giving him another chance.\n\n\"Ugh\" applies to him.  And he's a crappy lover to practically suffocate you for his own pleasure.",
   "created_utc": 1701688616,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxw01y",
   "message": "NTA. Never talk to this man-child again. \nIf ever in a situation of a man forcing your head down and not stopping, I recommend dragging teeth. If that doesn't work, bite. They tend to forget we have a valuable appendage in our mouth that is surrounded by teeth.",
   "created_utc": 1701689091,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxw2ot",
   "message": "Warn anyone within earshot to never ever touch that guy. What a way to show someone that you didn't respect them. I'm so sorry this happened to you.",
   "created_utc": 1701689146,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxw45d",
   "message": "NTA. YOU DID NOT make a mistake. He ignored your boundaries despite the obvious cues that you didn't like what he was doing. This is not on you.",
   "created_utc": 1701689176,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwnc4",
   "message": "NTA. He's in the wrong. Full stop. He pushed you beyond your limit. You signaled this. He ignored it. You can't control your gag reflex. It's a reflex. He's lucky he got away with so few stains. You had the right to fully cover his shirt. Also, don't pay for cleaning. He caused it. He can deal with it.\n\nEdit: I say this as a guy. If a guy does this to you, bite the fucker. He deserves it.",
   "created_utc": 1701689568,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxx5pk",
   "message": "You're NTA for throwing up while a man sexually assaulted you to the point of making you throw up on him. Im so sorry that this happened. \n\nHe may not even realise that what he did was SA. If you want to text him at all, I would just tell him that he triggered your gag reflex by forcing himself into you and that it's sexual assault. Then block him on everything.",
   "created_utc": 1701689929,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby4603",
   "message": "WTF, he held you down!?! Then blamed you? I'm not a stranger to a bit more extreme play, but if someone is giving you a clear signal like that, you fucking stop immediately and make sure you're partner is OK. That's a very clear red light. NTAH.",
   "created_utc": 1701694335,
   "score": 3,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxgu5d",
   "message": "That is sexual assault. Report it. Get away fast.NTA (49 M poster)",
   "created_utc": 1701676623,
   "score": 11,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxkuhd",
   "message": "NTA you could do better",
   "created_utc": 1701679931,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxm92d",
   "message": "NTA- he’s a pos",
   "created_utc": 1701681128,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxo311",
   "message": "It is so sad that someone has such low self esteem that they allow themselves to be abused and then have doubt whether they were the one in the wrong. \n\nYou should have bitten down until your teeth clicked.",
   "created_utc": 1701682699,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxp758",
   "message": "Jesus woman, get your shit together. If a guy throatrapes you, you should not be apologetic, rather throw his ass out.",
   "created_utc": 1701683652,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxptp7",
   "message": "NTA",
   "created_utc": 1701684186,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxq0cg",
   "message": "NTA, I'd respond if you weren't shoving me down. This wouldn't have happened. Maybe don't force women's heads, then you won't get puked on and never see this guy again",
   "created_utc": 1701684340,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxq5tf",
   "message": "NTA. I'm not going to bother guessing whatever his issues are, but all that matters are his issues are not your problem and you don't need to put up with them. Find yourself someone who treats you the way you want to be treated.",
   "created_utc": 1701684464,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxr700",
   "message": "Why didn’t you punch him when tapping didn’t work?\nNTA",
   "created_utc": 1701685315,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxrthb",
   "message": "Bro, that's borderline SA. You tapped out, quite literally because you couldn't say stop or no. He continued to push your head down. You didn't do anything wrong in this situation, at all. You didn't even make a mistake. Your body reacted in the only way it knew how, and threw up. Humans have a gag reflex, its natural. And he sounds like the worst sex if he hasnt made you cum ONCE. Seems like you might have lucked out with an unexpected pay back. Good for you! Now go find a man that will give you a whole body orgasm, you deserve it!! Also try and make sure this guy understand the nonverbal \"no\".",
   "created_utc": 1701685830,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxslde",
   "message": "NTA. Run. Dude’s a straight up asshole.",
   "created_utc": 1701686469,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxsrq1",
   "message": "NTA\n\nI don‘t mind the pushing down part. I do like it but i also „tap out“ when it’s too much and i can‘t imagine a guy just ignoring that? Kinda rapey…i‘m so sorry.",
   "created_utc": 1701686614,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxt8dw",
   "message": "NTA. \n\nGuy is an asshole you don’t unknowingly push a girls head down while she is doing that, you can do better sorry this happened.",
   "created_utc": 1701686983,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxtal2",
   "message": "that pervert has watched too much porn and he should be the one who's embarrassed",
   "created_utc": 1701687030,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxtbm7",
   "message": "This is rape, plain and simple.",
   "created_utc": 1701687052,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxtq1y",
   "message": "That's called sexual assault, you tried to get him to stop but he continued to push into you causing the gag reflex. He's lucky if you don't report him, quite frankly. A bit of puke on him is the least of your problems, he's disgusting. Definitely stay tf away from him and anyone who agrees with him. And if they try to damage your reputation in anyway be sure to point out that his penis literally made you barf, that story will grow legs on its own and none of it will be in his favour.",
   "created_utc": 1701687368,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxtrp8",
   "message": "NTA. This guy gaslit you and you went along with it. As others have said, he should have stopped when you tried to communicate with him.",
   "created_utc": 1701687405,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxuc0c",
   "message": "NTA, he was using you as a fleshlight. Dude needs to fuck off. You didn't do anything wrong OP, but for the love of whatever you believe in, do NOT see him again.",
   "created_utc": 1701687844,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxug5t",
   "message": "If you had projected vomited onto his shirt and pants ON PURPOUSE you'd be a hero. Serves him right for moving your head during BJs which is a HUGE nono and everyone and their mother knows it in 2023. Lose his number.",
   "created_utc": 1701687932,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxugl7",
   "message": "Dude why are you sleeping with this guy? He doesn’t respect you",
   "created_utc": 1701687941,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxv24p",
   "message": "Why did YOU apologize?? It was absolutely his fault. Obviously NTA, and please block this creep.",
   "created_utc": 1701688392,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxvypk",
   "message": "NTA and you didn't make a mistake, if I'm tapping him that means it's my limit unless agreed differently in advance, and I wouldn't give him bj anymore as he's piece of shit:-)  eta - you deserve hooking up with someone who actually cares about your pleasure, this guy sounds like a nightmare tbh",
   "created_utc": 1701689062,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxw1af",
   "message": "You don’t have to apologize for such things. Also feel free to tell other women in your common circle about what happened.",
   "created_utc": 1701689117,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwhnd",
   "message": "You tried to get air and he kept forcing your head down. He’s definitely gaslighting and manipulating and frankly sounds like a piece of work. Ditch that tight he’s the ah.",
   "created_utc": 1701689453,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwobd",
   "message": "let’s state the obvious first:  he is just using you for sex cause it was a hookup\n\nhe is not going to be nice to you, he even kept pushing you down past comfortable limits, he just wants a better fuckhole not a friend out of you\n\nyou already got gaslit and here you are, wondering if you’re the asshole????\n\nare you fr? \n\nlike yea sure there’s girls out here being a goddess throat goater who can take 10 inches and not gag.  but he has no right to speak to you that way.\n\nyou arent the asshole in situations like this ever, but you really need to work on getting better hookups than this dude",
   "created_utc": 1701689588,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwpo7",
   "message": "Sometimes I read posts here and I need walking through how exactly it ended up on this sub.\n\n“Someone forced something down my throat when I made it clear not to do that, I vomited due to natural human reflexes, and got some on them. They hurled insults at me and I got mad in return - but maybe it was totally ok for them to do that to me and then get mad, and I should have just took it without getting mad back (I already apologised). Help me out guys, this is a real conundrum right?”",
   "created_utc": 1701689615,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwsit",
   "message": "NTA \n\nYou should’ve puked all over him. He pushed your head down repeatedly after you tried to tap out. He deserved to be puked on and he deserved to ride home in the mess.",
   "created_utc": 1701689670,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwtp5",
   "message": "Shoulda bit down🤷🏾‍♀️",
   "created_utc": 1701689693,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwu75",
   "message": "My best advice is, hooking up is a mistake. Unless you really want this type of relationship? Personally, I don't. I'm not so horny rhat I can't wait for someone to show me he cares about me before we sleep together. You are NTA in any way here, if this man was a good person he'd be falling all over himself apologizing.",
   "created_utc": 1701689703,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxx2ct",
   "message": "So he assaulted you by not listening to you tapping out and YOU think you’re in the wrong? No. He’s a sexual assaulter.",
   "created_utc": 1701689862,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxx5jp",
   "message": "This guy is TA all the way. He forced your head down further and intent I guess to give himself more pleasure. When you told him this was not good for you or pleasurable he continued to do so. He got his karma. He reaped the punishment of what he did. You were clearly telling him no and to stop and he didn't. \n\nNot only is he ta, he's a borderline sex offender from this.",
   "created_utc": 1701689926,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxxvyl",
   "message": "Early in my relationship I puked doing this too. It even came out my nose. I was horrified.\n\nYou know what he did? He sat up, apologized, asked if I was ok, used his shirt to wipe the puke off my face, reassured me that it was ok, apologized again, asked me if I was sure I was ok, and then went and got me a cup of water and a cup of orange juice so I wouldn't have to taste the puke. \n\nThen we watched TV.\n\n**this isn't me bragging about him (tho I do every chance I get) - this is the bare fucking minimum. dump that piece of shit**",
   "created_utc": 1701690434,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxxy0e",
   "message": "He’s the asshole. Don’t push. \n\nGag reflex is exactly that. A reflex. Not your fault. And for fucks sake if a girl is giving you a blow job then let her go at her own pace. If you make it uncomfortable don’t expect any more of them.",
   "created_utc": 1701690474,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxz488",
   "message": "In what world could you possibly think any of this makes you an asshole?",
   "created_utc": 1701691253,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1wec",
   "message": "Let's be clear: he has a nonconsensual degradation kink.  He was getting off on using you, on your discomfort, on making you puke, *and* on berating you for it.\n\nNow, if you get off on all of that, too... you should still never see him again, because he didn't negotiate with you before to make sure you were on board.  \n\nNTA",
   "created_utc": 1701693014,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby2bpr",
   "message": "YOU didn't make a mistake. HE did.\n\nThis might teach him to respect his sex partners. \n\nDon't go back to this idiot. There are better guys out there.",
   "created_utc": 1701693274,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby2h93",
   "message": "NTA.  \n\n\nFor future reference, someone keeps pushing despite you being comfortable you make HIM uncomfortable. You got teeth, right?",
   "created_utc": 1701693365,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby2qm4",
   "message": "The only mistake you made was to be associated with this loser. He did not respect your boundaries. The puking is most definitely not your fault and you should not be embarrassed about it.\n\nEven if he wasn't pushing your head, sex is fun but can be messy and all kind of *shit* can happen. Do not stress over it, it is all normal. \n\nPlease in the future find yourself partners/hookups who are respectful of your boundaries and who understand that sex is messy.",
   "created_utc": 1701693517,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby2xaj",
   "message": "Op a little advice for next time, and hopefully there is no next time, a pinch in the balls will either make him nut or he will let go, same goes for scraping his dick with your teeth. And maybe as a last resort just bite it.",
   "created_utc": 1701693626,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby34vu",
   "message": "You should have puked in his rapey face. Stop apologizing!",
   "created_utc": 1701693749,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby3a81",
   "message": "NTA.\n\nBJ’s are performed to the comfort level of the person with the penis in their mouth. \n\nNot everyone can take it all the way into their throat and it shouldn’t be expected. \n\nNot everyone likes having their head pushed down, or even touched. \n\nNot everyone likes having the cum shot in their mouth. \n\nLiterally whatever the giver wants is how its supposed to go and if the receiver doesn’t like it they can gtfo and find someone else.",
   "created_utc": 1701693834,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby3k1n",
   "message": "The guy was forcing his dick down your throat against your will. How are you the asshole?",
   "created_utc": 1701693991,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby3ksj",
   "message": "NTA, if dude can’t handle the stank, dude don’t need to be pushing against your trach!",
   "created_utc": 1701694002,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby4cje",
   "message": "He's a selfish asshole only caring about your holes and his nut. He didn't care that he could have hurt you and made you uncomfortable enough to puke. If he wants a girl that can deep throat he should say so and then get lost finding her.",
   "created_utc": 1701694435,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxjxc5",
   "message": "I’ve thrown up quite a bit in my time and have NEVER gotten a reaction like this. At least 3 guys and none of them were ever mad at me like that. One even thought it was hot lol",
   "created_utc": 1701679156,
   "score": 2,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby29tk",
   "message": "Honey, stop hooking up.",
   "created_utc": 1701693243,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxti2a",
   "message": "i would make you use the vomit as lube and keep going",
   "created_utc": 1701687192,
   "score": 248,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxr7o3",
   "message": "I am indeed sad that you have to even think about this situation because he is the AH, Loser, and is being abusive, rude, insensitive, and an insulting creep. His rejection of you, is your gain and strength. Learn how to love yourself better and see the red flags blowing in the wind!",
   "created_utc": 1701685330,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxshv0",
   "message": "NTA - you need to get a nice sex toy. \n\nHe can EAD",
   "created_utc": 1701686388,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxtgvc",
   "message": "NTA. You can't control your gag reflex. You were never TA here.",
   "created_utc": 1701687165,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxtljw",
   "message": "NTA. He deserves more vomit on his stupid shirt.",
   "created_utc": 1701687269,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxu31m",
   "message": "I vomit maybe every 4 bjs with my partner, never have I ever felt the need to apologise. He’s big, I push myself passed my limits to please him, I don’t care if I vomit a little, he certainly doesn’t care if I vomit.\n\nWhat an ungrateful pig you had the unfortunate meeting with. I agree with everyone, block and delete. \n\nI hope he finds the absolute love of his life tomorrow but I hope that she finds bj’s repulsive.",
   "created_utc": 1701687650,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxusav",
   "message": "I think his reaction was born out of shame. \n\nAnd he was awful to you due to that shame.\n\nSome peoples egos are fragile, I dont think he missed the fact that sucking his dick made you sick to your stomach (I know, not the reason you threw up, but reason for his sub conscience shame) ...Says everything about him and nothing about you.",
   "created_utc": 1701688185,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxvi5a",
   "message": "NTA, block him",
   "created_utc": 1701688730,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwmah",
   "message": "It was not your mistake. He is a disgusting pig who shouldn’t be around women. NTA",
   "created_utc": 1701689547,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxwya9",
   "message": "This guy isn’t a man and will treat you like crap and never make you feel good about yourself . The best revenge is served cold.. when someone did this to me I cut them off then they were angry I cut them\nOff and sent me a gaslighting email to try to get me back and I corrected it for grammar and sent it back and blocked them",
   "created_utc": 1701689782,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxx0k7",
   "message": "No way. You were giving clear signals, he violated your consent.  NTA",
   "created_utc": 1701689827,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxyi0b",
   "message": "NTA one bit. He got what he deserved and needs to grow up. You tried to get his attention that something was wrong but he didn't even care to stop and see what was bothering you.",
   "created_utc": 1701690844,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxyswh",
   "message": "Honey, he forced you when you signaled him to stop. That’s sexual assault. Why are you apologising? Don’t text this guy. Tell him if he contacts you, you will go to the police. Please protect yourself. NTA.",
   "created_utc": 1701691046,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxz7z9",
   "message": "NTA. This guy is the asshole. I would say much harsher words but I don't wanna get banned for being \"demeaning\" to this \"consent-ignoring gentleman\".\n\nThis is a big amount not ok. It wasn't even your mistake. This whole thing was his fault. Next time a man forces your head onto his cock despite you obviously trying to get off... **Bite.**",
   "created_utc": 1701691321,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxz950",
   "message": "NTA - \n\nChrist. So this man sounds egotistical AF. After a few lads like that myself you are well and truly better off never seeing that boy again.",
   "created_utc": 1701691343,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxzg99",
   "message": "This is crazy and also so common. He was treating your body like an object for his sexual gratification and then he got angry when it turned out you aren’t an object after all. Some guys who watch a lot of porn, particularly young guys who watch a lot of porn, think that women are f**k toys and will treat you as such, physically and emotionally. You’re asking if you’re an asshole for what? Having a body with inbuilt reflexes? Yelling at someone for making you feel like shit after they throat f**ked you despite tapping out (which is a consent issue btw)? Come on, you know you’ve done nothing wrong to him. This guy is absolute trash",
   "created_utc": 1701691473,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxzmqj",
   "message": "Sounds to me like he was trying to get off on the feeling of you gagging on him.  This is someone who cares more about his orgasm than your consent or comfort.  Never talk to this tool again.",
   "created_utc": 1701691589,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxzn8k",
   "message": "Lmao NTA\n\nDudes be thinking deep throating is easy bc they watch 8 hours of porn a day 💀🤡",
   "created_utc": 1701691598,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kbxzs4a",
   "message": "NTA. Get a different guy. This one is an asshole.",
   "created_utc": 1701691687,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby0202",
   "message": "Nah, he pushed a consensual act to assault and had the gall to insult you when you didn't accept his terrible behavior.\n\nTo clarify, I would have bitten down long before that point.  Not enough to cause permanent damage, but sharply enough to get him to withdraw completely.\n\nAnd forcing someone to gag and getting mad about being puked on is like asking for anal and being upset that you wind up with poop on you.  That's where it comes from, he knows this, and you shouldn't be ashamed.",
   "created_utc": 1701691865,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby07xh",
   "message": "It’s his fault you threw up. Forget him.",
   "created_utc": 1701691970,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby0chl",
   "message": "NTA. Not even after the worse BJs of my life did the thought occur to me to say it was anything less than fantastic. You want no more BJ’s? That’s how you get no more. Perhaps I’m an appreciative guy lol",
   "created_utc": 1701692051,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby0l6x",
   "message": "I really hope this is rage bait, but if not, you're obviously NTA. And that's kinda like assault once you revoke your consent for a specific act. Obviously you couldn't speak, but he probably should have understood what tapping him meant. That's super gross and feels like he was just treating you like a sex object. Please leave this dude and hope he learns his lesson.",
   "created_utc": 1701692206,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby0o14",
   "message": "Look at how many MEN are telling you this guy is a disrespectful fuckwad. You deserve so much better. Dump him. And leave a bag of puke on his doorstep.",
   "created_utc": 1701692256,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby0qft",
   "message": "Therapy. Books about self esteem. Contact a women’s resource centre. Do anything to help you realise this isn’t normal",
   "created_utc": 1701692297,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby0wic",
   "message": "I do not allow men to grab my head or push it down ever!! I think it’s super disrespectful and disgusting!! That’s just me tho!! It’s one of my rules!! You want a blow job fine but ask for it just don’t grab my head and push it down!! I’m definitely not doing it then!!",
   "created_utc": 1701692402,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby102c",
   "message": "NTA\n\nI've had multiple girls puke on me. I don't enjoy the puke, but I do enjoy being forceful. \n\nThere's a major difference between him and I because I always have clear consent. While I enjoy being aggressive, I only enjoy it when the other person is enjoying it as well. I also don't get upset if I get puked on, I go grab a bottle of water, mouthwash, and a warm wet wash cloth. \n\nThis guy did something you didn't consent to, and got mad when it didn't pan out the way he desired. He's a major asshole.",
   "created_utc": 1701692463,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby10np",
   "message": "28 year old guy here\n\nHe sounds like a fucking asshole\n\nNTA",
   "created_utc": 1701692473,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1cyh",
   "message": "NTA although I think you are kind of an AH to yourself. Why did you apologize and offer to wash his shirt? Next time someone pushes you in a way you don't like you should take their balls in your hand and start squeezing.",
   "created_utc": 1701692679,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1ep2",
   "message": "Ha, fuck that guy.   He played a stupid game and won a stupid prize.   You should tell people that story because it's hilarious.  Especially if you go to college or work together or something.  Start calling him VJ\n\nYou are so NTA.  He sounds like he omly cares about himself in bed, which means he won't care about you at all otherwise.   Drop this guy, tell your friends how shitty he is so they dont go near him, and go find yourself a man who will actually listen to your wants and needs, especailly in bed.",
   "created_utc": 1701692709,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1jvk",
   "message": "NTA.\n\nSo, this guy sounds like an absolute jerk and deserves the laundry bill.\n\nJust in general, nobody can control their body's automatic responses. Sometimes something happens, something comes out of an orifice that we weren't planning, and there's a bit of an unpleasant mess. The civilised response is to take a break, clean yourselves up as necessary, and either continue, or call it a night and move on to something else. But no blame, and no recriminations. It's just a bit of laundry, not worth getting upset about.",
   "created_utc": 1701692798,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1lf7",
   "message": "\nYou did the right thing or left say your body did the right thing.\nLife isn’t a porn and many women can’t control their urge to vomit. There is a reason why your body did what it did.\n\nHe is a asshole and you should ignore him.\nAll the things he did were not ok.",
   "created_utc": 1701692825,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1ng6",
   "message": "He’s an asshole. Not you. I wouldn’t ever speak to this guy again.",
   "created_utc": 1701692860,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby1u6d",
   "message": "He brought it on himself - yr NTA. He forced you when you tried to tap out. Men like this need a kick in the nads. But throwing up was a good start. Don't sweat it - embarrassing for you, i get it, but him forcing his dick past yr gag reflex was the problem. As others have said - that is sexual assault. NEVER be alone with this dude again. Ever. he's a selfish prick and doesn't care about you. Block him on everything. Now. Love you, honey, that way you won't be tempted by abusive dicks like this.",
   "created_utc": 1701692975,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby2105",
   "message": "NTA\n\nYou have nothing to be sorry for and it wasn’t a mistake how you said. He fucked up and he is a trash. This has nothing to do with how you look so don’t put yourself down. That dude be watching too much porn.",
   "created_utc": 1701693093,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby26b7",
   "message": "Honestly, I kind of wanna go puke on him too. He's an asshole.",
   "created_utc": 1701693185,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby27kg",
   "message": "NTA. He came incredibly close to sexually assaulting you. It sounds like he isn’t mature enough to be sexually active. Adults don’t abuse and shame their partners no matter what happens while they’re intimate. He obviously isn’t at a point in his life he can be one—everyone deserves better than what he is, including you. Lose his number and move on.",
   "created_utc": 1701693206,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby2rv0",
   "message": "You dodged a bullet. The guy was an a$$hole. You sure have bit him.",
   "created_utc": 1701693538,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby30hb",
   "message": "Ugh what mistake? It really bothers me reading posts like this , literally to be young and naive! Listen to people you didn’t make a mistake, he did!!!!! Get away from him!\nThere are different kind of people in this world assholes and good ones! Assholes put you in a bad unhealthy position ( in this case literally) and make you feel guilty about it, mostly they are stupid ,ignorant and abusive, the good ones would NEVER do this to you, please don’t do this to yourself",
   "created_utc": 1701693679,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby31e0",
   "message": "Fuck that dude. Not literally...because don't do that ever again. He's the issue not you. Nta. That guy is not worth the half bj he got, he didn't stop. It's his fault.",
   "created_utc": 1701693693,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby3x0c",
   "message": "Nta...he is tho. This is all his own fault. Stick your finger too far down your throat you puke, same with a dick. You warned him.",
   "created_utc": 1701694194,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby40ym",
   "message": "TA for blaming yourself.",
   "created_utc": 1701694256,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby42h4",
   "message": "Any real man understands that if you get a girl to constantly gag they may throw up, and if they do oh well. Shower time and then back at it. I'm so glad ny boyfriend isnt like this, fully threw up once and he never made me feel like shit. You deserve somebody better who can give you a great time!",
   "created_utc": 1701694280,
   "score": 1,
   "submission_id": "18af6b7"
  },
  {
   "comment_id": "kby43x4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18af6b7"
  }
 ]
}