{
 "submission_id": "18aknrq",
 "title": "AITAH Cancelling cheating wife’s visa",
 "selftext": "My wife and I have been together 7 years we have a 5 year old son whom at the moment she allowed for him to come to the states to start school, to keep the story short I found pictures of her and her affair partner on his socials, once I found this I cancelled her visa interview and I told her I did but she thought I was bluffing and still went feeling entitled to a visa because of our son, now she wants me to take him back and take him out of school because I cancelled her visa. AITAH for canceling her visa at the last minute because I discovered the rumors of her cheating on me were true?",
 "created_utc": 1701697988,
 "permalink": "/r/AITAH/comments/18aknrq/aitah_cancelling_cheating_wifes_visa/",
 "score": 138,
 "url": "https://www.reddit.com/r/AITAH/comments/18aknrq/aitah_cancelling_cheating_wifes_visa/",
 "comments": [
  {
   "comment_id": "kbyd38h",
   "message": "No idea what is going on here because you have missed so much context on where you are, where she is, where your son is, what or who the visa is for, what your role is in the States, why a visa is needed, whether you are a US citizen and she is not, the status of your son etc.\n\nIf your wife is cheating, she should become your ex-wife. Simple. You should remove your consent to any visa for her if she requires your consent. \n\nThe rest is fluff. If she is going for a visa alone, and without needing your consent, you had no rights. But if you split up, depending on your country's legislation, you may be able to stop her removing your son from your country without your consent",
   "created_utc": 1701698862,
   "score": 50,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz0k4p",
   "message": "Get a lawyer and stop talking to your wife. You can use a parent app to discuss any child related issues. Do not talk to your wife. She is now your ex.\n\nYour attorney will file to keep the child in the states. If he goes back she will not return him.",
   "created_utc": 1701708426,
   "score": 92,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz9w3c",
   "message": "Visa is because of your relationship. No relationship, no visa",
   "created_utc": 1701711857,
   "score": 65,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbyxtz2",
   "message": "Remove her from all of your finances first before she saddles you with debt, it happened to a coworker, he asked for a divorce and got almost 60k in cc debt",
   "created_utc": 1701707411,
   "score": 59,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzb68c",
   "message": "Sounds fair and correct to stop sponsoring her visa - if your intention is for a divorce. Have her the divorce papers saved and try to have custody over your son so that he can attend school in the US. If she cheated and you want to divorce her for that, you probably even had to cancel the visa interview as the underlying facts had changed. NTA.",
   "created_utc": 1701712310,
   "score": 10,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzxtkl",
   "message": "NTA: DNA test ASAP",
   "created_utc": 1701720404,
   "score": 9,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbydnzh",
   "message": "How is that going to work out with the kid . Could her boyfriend sponsor her ?",
   "created_utc": 1701699134,
   "score": 49,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz5qgy",
   "message": "NTA. She literally bit the hand that feeds her. She better start looking for a back up plan.",
   "created_utc": 1701710351,
   "score": 34,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz01kz",
   "message": "You need a family law attorney who specializes in international custody. The most experienced tend to be members of the International Academy of Family Lawyers, which has a membership listing.",
   "created_utc": 1701708236,
   "score": 20,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzvzh9",
   "message": "You need to get a DNA test on that kid pronto...",
   "created_utc": 1701719745,
   "score": 6,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbyk763",
   "message": "NTA she literally fucked around and found out.",
   "created_utc": 1701702018,
   "score": 27,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzh7uj",
   "message": "No offense dude but your first mistake was knocking her up when she didn't even have her visa yet or green card and wasn't even living here.\n\nHow could you know what she was possibly doing in DR while you were here in the states?",
   "created_utc": 1701714483,
   "score": 6,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbyrq2n",
   "message": "You may want to get a paternity test..  she's proven she can't be trusted.",
   "created_utc": 1701705073,
   "score": 17,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc08c6a",
   "message": "Personally I don't think more context is needed. Your nta. I have zero tolerance for cheating and she cheated on you and was using you to get a visa. You'd think if she was trying to use you to become a citizen she'd stay faithful",
   "created_utc": 1701724237,
   "score": 6,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0yyxl",
   "message": "Nta- she shouldn't have been cheating.  Divorce her and tell her to f off.",
   "created_utc": 1701734494,
   "score": 5,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbyg39f",
   "message": "Reas up on. State dept. on the hague treaty and  etc\nAnd make it so she cant get any passport or take kid on  a plane or etc",
   "created_utc": 1701700236,
   "score": 21,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc1ajae",
   "message": "NTA and if she's already threatened to keep your son from you then you need to ensure you make her fight for every ounce of custody she gets.",
   "created_utc": 1701739184,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbye17n",
   "message": "NTA. She cheated and obviously is a terrible parent. Keep the kid here with you.",
   "created_utc": 1701699302,
   "score": 21,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz3owr",
   "message": "NTA\n\nYou shouldn't have told her at all that you were canceling sponsorship. You should have gotten more of a head start on the lawyer side of it and allowed her to go in 100% blind.",
   "created_utc": 1701709587,
   "score": 8,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzc7c1",
   "message": "NTA. Why would you continue with a marriage visa if she is cheating on you?",
   "created_utc": 1701712679,
   "score": 5,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzkuk3",
   "message": "NTA for not wanting to help her with her visa because she was cheating on you BUT you can't control the fact that she's retaliating by trying to not let you keep your son. And just because she was cheating on you doesn't necessarily mean you'll get custody of him. \n\nJust because reddit says you're NTA about one thing doesn't mean you're definitely going to win an international family law court case on something else.",
   "created_utc": 1701715776,
   "score": 7,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzi6k5",
   "message": "Okay im going to assume you are middle class. Get you a nanny and move your ex wife out immediately or she has ownership over the house during divorce",
   "created_utc": 1701714826,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzlod6",
   "message": "NTA. She knew what she was risking and completely disregarded the well-being of her own son when she decided to cheat on you. That doesn’t sound like a very good mother to me. It is her responsibility to make sure she can see him and if she wants that badly enough she can achieve that. You have to focus on raising your son now, she is no longer your responsibility.",
   "created_utc": 1701716070,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzz4lf",
   "message": "this belongs to r/pettyrevenge. NTA",
   "created_utc": 1701720882,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc02rxi",
   "message": "Just out of curiosity did you do a DNA test.",
   "created_utc": 1701722202,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0syck",
   "message": "OP, I'm sorry,  but you seem to have fallen down your smartphone's text app and now rolling down the qwerty hill\n\nTake a breath and start from the beginning. Let me present a proforma.\n\nHello, I am .... (age...), my wife....., we met ....years ago, have been together...., married.... have a son....\nNow we are from..... country, for....., we had to move to.....for my work/business...\nI have had hearda rumors....., I thought..... but then I found.....\nWhile this was happening my wife's visa interview was coming up.....\n\n\n\n\nSee, write in this pattern, so we can get some context\nAnd use spaces and paragraphs \n\nAs for YTA/NTA/ESH/NAH, I'm going with WDHS (What did he say?)",
   "created_utc": 1701732127,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc16s10",
   "message": "NTA look out for your best interests fam, seems like she did .....",
   "created_utc": 1701737637,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc17qx1",
   "message": "NTA - Lots of red flags with your wife here. I’m picking up on sociopathic tendencies. Big time! Keep her out and away for as long as possible. If you can get that divorce finalized with her out of the country you are in a position of strength. If you divorce her she can never cheat on you again. Cancel that visa and don’t look back. You got this bro.",
   "created_utc": 1701738039,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc19a2l",
   "message": "She cheated. You canceling her visa is understandable.",
   "created_utc": 1701738664,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzapyf",
   "message": "Nope and I would go to court and get full custody. Do not let him go for visits. He will disappear into the night.",
   "created_utc": 1701712150,
   "score": 5,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz7u1g",
   "message": "Don’t know if YTA, but I do know for sure you better lawyer up.",
   "created_utc": 1701711113,
   "score": 6,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc09mxw",
   "message": "Lol I read that as a Visa, like a charge card. With more reading that now makes sense. Get a lawyer. Do not continue with the visa. Good luck",
   "created_utc": 1701724726,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbywdwl",
   "message": "Sorry man. That's really crappy.\n     \nNTA. Remove every link you have with her. She does not deserve anything and clearly only wanted your money. \n   \nQuestion: is your son... yours?",
   "created_utc": 1701706866,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzfwlo",
   "message": "You need to talk to a lawyer that specialises in international custody because this could be considered parental alienation. Sponsorship and marriage are two separate things and custody is also separate. \nI’d advise you to talk to a lawyer, set aside your personal feelings and move forward with a divorce keeping your son’s best interests in mind. Don’t be spiteful and keep her child from her because then you would be the asshole.",
   "created_utc": 1701714017,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzdoo5",
   "message": "I wouldn't sponsor her but the custody part is gonna suck for at least 2 of you.",
   "created_utc": 1701713215,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzee4d",
   "message": "What role do you have that allows you to control her visa interview?",
   "created_utc": 1701713470,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzfjj6",
   "message": "NTA. Good riddance.",
   "created_utc": 1701713886,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzpzli",
   "message": "Nah",
   "created_utc": 1701717621,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc00zdh",
   "message": "Without reading all the details: don't forget your son and yours relationship in all of that. If you cut him off from his mom he might really resent you. \nI do think it's fair that you don't sponsor her though. It would tie you to her for as long as she is in the US and doesn't have her own green card based on her own status. Just don't be an *ss. Be the bigger person for your son.",
   "created_utc": 1701721551,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc03s5n",
   "message": "Idk what to say. It's a caveat that I've never had to deal with. What I would say to two parents is that cheating is a horrible act. But that all it does is limit or destroy a relationship between two adults. That it shouldn't be used by one person to limit another's ability to see their children. \n\nDoing this would definitely limit her ability to see her son but I also don't think you should be helping her in her quest to become a citizen especially seeing as she was using you the whole time. So I'm torn in terms of what you do.",
   "created_utc": 1701722567,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc04s2r",
   "message": "Im sorry you're going through this but I do wish it was on 90 day fiance",
   "created_utc": 1701722932,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc05e9u",
   "message": "NTA.  This is awesome.",
   "created_utc": 1701723153,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc10gm8",
   "message": "My dumb ass thought you were talking about a credit card lmao.",
   "created_utc": 1701735077,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc10xet",
   "message": "Nope",
   "created_utc": 1701735264,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc15bz6",
   "message": "NTA You mean a green card interview visa as spouse?\n\n7 years? She got damn lucky. Is she here illegally on a jumped tourist visa? Oh well.\n\nEven if you didn't cancel it you could sabotage it with bad answers when they interview YOU and they'll deport her anyway.",
   "created_utc": 1701737045,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbyx3z7",
   "message": "NTA after reading your clarifying details. Protect yourself and your relationship with your son.",
   "created_utc": 1701707137,
   "score": 5,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbyujx4",
   "message": "Nta you shouldn’t sponsor someone who is cheating on you. I would talk to a lawyer right away about your rights. Since youre dealing with someone from another country you have to learn their laws as well in case she has rights to keep your son there once he visits her. No parent should be kept away from their child but you have to make sure split custody will be enforced.",
   "created_utc": 1701706167,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzpimw",
   "message": "NTA\n\nShe cheated. You don’t have to support her visa anymore",
   "created_utc": 1701717453,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzxe3b",
   "message": "I did the same thing I cancelled an ex husbands visa and divorced him for cheating",
   "created_utc": 1701720246,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0batr",
   "message": "I’m sorry but I feel she was just using to get a green card in the first place. You’re so lucky so caught on early.",
   "created_utc": 1701725346,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0bij9",
   "message": "NTA. Get rid of her--she will make you a cuck if you don't.",
   "created_utc": 1701725427,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0fylw",
   "message": "I mean, possession is 9/10ths of the law. There is no way she can make a case that she can provide a better life for him in the DR.",
   "created_utc": 1701727105,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0v08t",
   "message": "NTA. Fight for your child, document everything and get all the legal help available as recommended by prior commenters and I wish you the best of luck. It will be a hard fight but worth it.",
   "created_utc": 1701732940,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzndww",
   "message": "My best advice is to be conscious about what your son needs. I definitely see how this can be hard because you guys were together for such a long time and therefore she has a bond with her child just like you do. You alienating her would not be good for your son but also her doing that to you would not be okay. I kinda thing it was a bit overboard to cancel the appointment considering how long and hard the process for getting an appointment is. Whether or not she cheated on you at some point you guys came to an agreement that live in the US would be the goal since it’s better for all parties. It would also allow her to have the opportunity to work out here and help provide for your son. Idk about opportunity’s in the DR but I imagine is not that well if she agreed to send you the child to go to school here. So it’s crappy on both ends. I don’t condone what she did at all she’s messed up but there’s a child involved in this so\nChoosing what to do isn’t as simple as black and white. I would’ve not cancelled the appointment and instead told her this is new parent plan son will be with you no matter what until her status is finalized. Once she is here based on what works schedule wise you could both have him 50/50 or you more whatever works best and due to her wanting a visa she would have to agree. Then finalize your divorce and make sure she knows you won’t be proving any support since son will be with you until she can get settled in the US with her own job or place. So in the end you get a good agreement for you that covers and protects time with your kid but also allows for minor petty revenge. That yes I got you a visa but good luck working and find your own place ON YOUR OWN. I’m not a lawyer so idk if this would be a possible plan but in the end you don’t come off as the asshole to your kid. Because he will get older and figure this all out. At least like this you come out looking like the person who put his sons needs over his emotions. It’s hard being a parent but I’m in the same boat as you. I just recommend if I could have done some things differently I would always lead with how would this affect my son? Is it worth it in the long run? No hate to you thought I’m sure you will figure this out with whatever you decided to do. Good luck",
   "created_utc": 1701716683,
   "score": 7,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzto1q",
   "message": "NTA get a lawyer and start drafting the divorce, also get your son’s passport locked for international travel. If she takes him with her I doubt you’ll ever see him again.",
   "created_utc": 1701718928,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzvtof",
   "message": "You did what any reasonable man would do in this situation. You got your kid with you and she is where she belongs.",
   "created_utc": 1701719688,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc04se8",
   "message": "Think about how this impacts your son.",
   "created_utc": 1701722935,
   "score": 3,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz1t5u",
   "message": "I’d be wary of the people advising you keep the child, especially if it’s not yours or you aren’t on the child’s birth certificate etc. Get paternity established and talk to a family law/immigration lawyer.",
   "created_utc": 1701708887,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzg7xo",
   "message": "NTA, though I am wondering if she was going after you for the green card and you were shooting way above your level by using the green card?  In other words a transactional marriage.  \n\nAs to the boy.  Are you comfortable being a singe parent of a motherless boy?  If not, you need to think again, because I am guessing he will resent you.",
   "created_utc": 1701714128,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzkxao",
   "message": "You also need to file for divorce and ensure she doesn't claim abuse!",
   "created_utc": 1701715803,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzn0gj",
   "message": "Are you certain your son is biologically yours?",
   "created_utc": 1701716547,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzw7yi",
   "message": "Not only NTA but also you are a king",
   "created_utc": 1701719829,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzxpef",
   "message": "NTA. You made the right choice. She isn't loyal nor trustworthy. There is no point in going through with the visa.",
   "created_utc": 1701720362,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzzvfi",
   "message": "Esh - you’re separating her from your son and your son hasn’t done anything wrong.\n\nYou should file for divorce and determine custody. That’s the first step.",
   "created_utc": 1701721153,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc08g26",
   "message": "Well, if she’s from another country and was cheating, you know she’s only interested in her or her son’s visa.\n\nNTAH. I smell trouble. It’s probably for the best to be done now.",
   "created_utc": 1701724279,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0kmbq",
   "message": "NTA but you need to get a lawyer to settle this custody issue. Also a paternity test. Last thing you need is a kidnapping charge.",
   "created_utc": 1701728893,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0lllk",
   "message": "Dude if your child is in the US...you should immediately file for divorce and custody of the child and I mean tomorrow Morning!!!!  You are dealing with an international child custody  case... If that child leaves the US, whatever country the child goes to, would likely not allow you visitation and not allow the child to leave. If you want a relationship with your child... FILE NOW",
   "created_utc": 1701729272,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0rwzb",
   "message": "Cheaters get what they get. If it’s unpleasant, uncomfortable, even downright painful, then so be it.",
   "created_utc": 1701731716,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0zry7",
   "message": "I think your son needs to see his mother. And he needs both parents. YTA. Try to work it out.",
   "created_utc": 1701734808,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc10d8u",
   "message": "Keep your son and send her back.",
   "created_utc": 1701735040,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc143ig",
   "message": "HUGE ESH\n\nyeah, she massively fucked up. But you unilaterally decided your son shouldn't get to see his mother for at least 5 more years, and you suck for that.",
   "created_utc": 1701736540,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0lz33",
   "message": "NTA\n\nFile for sole custody and get a paternity test ASAP",
   "created_utc": 1701729417,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0vsig",
   "message": "Nope. Fuck that bitch",
   "created_utc": 1701733253,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc11ipr",
   "message": "Yes, because if you do that you aren't thinking about your son.  I get you are angry and hurt.  BUT THAT IA HIA MOTHER and children don't divorce their parents and should NEVER EVER AUFFER because of so called adults.",
   "created_utc": 1701735499,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbywuu5",
   "message": "Is this post even real?\n\nIt looks like it was written by the 5 year old described in this story.\n\nJeesh.",
   "created_utc": 1701707042,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz9e9a",
   "message": "Good hope she rots in hell cheating bitch!",
   "created_utc": 1701711678,
   "score": 4,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzkw3t",
   "message": "Tbh esh, your son will suffer from his parents being in separate countries",
   "created_utc": 1701715791,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzxwtr",
   "message": "ESH. She’s horrible because she’s cheating obviously but you’re being emotional and impulsive which is no better. The only thing that matters is the kid and it doesn’t seem like anyone is thinking about him. Don’t punish him trying to punish his mother. And let this be yet another lesson about building families with people you’re not even in the same country with.",
   "created_utc": 1701720436,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0knal",
   "message": "Can I give a contrary view? It's surely best for the kid if both his parents are in the same country and can make some kind of co-parenting arrangement after you break up.\nSo could you come to an arrangement to get her into the USA still?",
   "created_utc": 1701728903,
   "score": 2,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbysa1m",
   "message": "NTA obviously",
   "created_utc": 1701705287,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0nged",
   "message": "NTA\n\nShe is nuts if she expects the person she cheated on to continue to want to make it easy for her to immigrate. \n\nShe can wait till her kid is 18 and see if he feels like sponsoring mom.",
   "created_utc": 1701729985,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0pbwy",
   "message": "NTA, her lover can sponsor her visa.   The custody is going to be a mess.",
   "created_utc": 1701730708,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0t9in",
   "message": "INFO\n\nHow does she have a Visa interview now after having been married so long? Is the Visa status based on you continuing to be with her? Did you lie to a Fed in order to cancel it or did they let you cancel it knowing it was you and not her?",
   "created_utc": 1701732249,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0wved",
   "message": " NTA. Her choices become her consequences.",
   "created_utc": 1701733686,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0xb9j",
   "message": "If she's cheating,  she doesn't deserve anything from you",
   "created_utc": 1701733857,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0xw89",
   "message": "Yes because at the end of the day that is your child you are hurting",
   "created_utc": 1701734082,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0ywi6",
   "message": "Get a DNA test. However, it is not right that you keep your young son from his mother.",
   "created_utc": 1701734468,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzdls1",
   "message": "Yes YTA. \n\nOkay, it sucks that she cheated on you.  But life is bigger than that now. You have a child.  You are going to have to explain to your kid that YOU are the reason she has immigration issues and can’t spend time with them.  You will always be the AH that took extreme action against her.  I doubt your kid will ever forgive you, especially when they are old enough to figure out your behavior.",
   "created_utc": 1701713185,
   "score": 248,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbz43pq",
   "message": "Ok now by doing this who is going to suffer? Your son. It sounds like he will grow up without his mother if you fight for custody. Yes cheating is wrong but keeping children countries apart from their other parent is morally horrible. If she has her visa she would stay in the states and not feel threatened to take him back to the Dominican Republic and you both can go through the US courts for shared custody. Think about your son’s future not your immediate knee jerk reaction and hurt feelings.",
   "created_utc": 1701709743,
   "score": 249,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzilie",
   "message": "Your son needs you.  Your wife chose this path when she cheated on you (assuming you do have incontrovertible proof of said cheating).  Divorce her and consider dating females who don’t cheat nor require visas/green cards.  Also, and this is most important, someone who will be kind and nurturing to your child.  Don’t be in a rush.",
   "created_utc": 1701714974,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kbzpzja",
   "message": "NTA",
   "created_utc": 1701717620,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0b5kr",
   "message": "NTA, but I do suggest getting a lawyer with experience in international law. You should definitely make sure he still has a way to visit his mother even if it means you fly to DR for supervised visits in a public place so her and her family can’t kidnap him. He’s much better off getting an American education considering you said the affair partner is a bum.",
   "created_utc": 1701725291,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0jew4",
   "message": "No way dude good for you, but you did complicate your own situation with your son involved.",
   "created_utc": 1701728431,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0njw4",
   "message": "NTA, I would’ve done the same thing, and for her to feel entitled she was using youbti get a visa. Sorry if this sounds cold, but at least I'm being honest. It seems she got with you and also had the baby with you, to make sure she was able to get a visa. There is a lot of men and women who do this everywhere around the world. To make sure they have a secured visa. Not saying all, but it's a lot more common. and they will stay for however long it takes until they get it. I'm sorry man that you have to go through this. I must be an AH because I'll get full custody of my child. Get them a visa or whatever process you have to go through to get your kid. Good luck buddy there's a lot more fish in the water she's not the only one. But most definitely I think you should get full custody of your kid.",
   "created_utc": 1701730024,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0oycb",
   "message": "get custody, but allow her visits. But make sure to keep and show the evidence of her cheating to the attorneys involved so they don't take him from you. I'd paternity tests don't matter to you and you're attached to him regardless of him being your son, do all that I recommended.",
   "created_utc": 1701730561,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc0rhki",
   "message": "NTA for cancelling her visa, file for divorce and get full custody of your child. I would also get evidence of her infedidelity/ also DNA test in case she tries to find a loophole into legally making you responsible of her since there is a child. Depending on the state you live in you can find more info to help you out.",
   "created_utc": 1701731546,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc13v3m",
   "message": "NTA. Fight for what you want with all your might.",
   "created_utc": 1701736446,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc13xyl",
   "message": "NTA Let the other guy get her the visa.  If she was worried about the visa she wouldn't have cheated.",
   "created_utc": 1701736479,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc19mpx",
   "message": "Paternity test or not. If you are listed on the child’s birth certificate. You are still considered the legal father and are responsible for the support and wellbeing of the child. Learning of the child’s true paternity and possibly not being the biological father should not change the love for the child. But the mother’s infidelity can definitely jeopardize her Visa application and status.",
   "created_utc": 1701738809,
   "score": 1,
   "submission_id": "18aknrq"
  },
  {
   "comment_id": "kc16acr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18aknrq"
  }
 ]
}