{
 "submission_id": "18al3lh",
 "title": "Aita for “ruining my boyfriends family Christmas”",
 "selftext": "So my(21f) boyfriend(25m) is very close with his family and I know they mean a lot to him. We have been together for a while now and are moving in together next month. He was deployed for several months, and returned home from deployment two days before Thanksgiving. Instead of spending any time together when he got home, we got up the next morning and went straight to his family’s house in Tennessee to spend the holiday with them. We agreed before he even got home that we will be spending Thanksgiving with his family and Christmas with my family back in Georgia where we live because I have younger siblings and lots of children in my family who still believe in Santa Claus and the Christmas magic. Plus my mom just remarried and this is the first holiday my little brother will be expected to spend with the new step family, who treat us very poorly because we are from her previous marriage. \n\nLong story short we had a great time up there for Thanksgiving. We stayed for almost a week. I took an unpaid vacation right before the holidays in order to make that happen for him with the understanding that I would get to be with my little brother for Christmas morning. While we were up there for the holiday, my boyfriends mom found out that we were planning on spending five days leading up to Christmas with her in Tennessee then driving back down to Georgia on Christmas Eve so I can spend Christmas with my family. This turned into a big fight where she insisted that he had to be home on Christmas day itself because Christmas means so much to his dad and his grandparents are coming. \n\nWe tried to explain, would be spending the entire week leading up to Christmas with them just not Christmas morning since there are children in my family who believe that’s when Santa Claus comes. His family is very upset that I am refusing to come up for Christmas and my boyfriend does not want to spend the holidays separate so we are at a bit of an impasse. I know he has been gone and he wants to spend time with his family. It makes sense to me and I would be ok with splitting the holidays and doing them separately but everyone in his family is an adult so I don’t see any reason we can’t just do Christmas on the 24th with their family if hes insistent he doesn’t want to spend Christmas away from me. Aita for refusing to cave on this? I think it’s only fair that we each get to spend a holiday with our family.\n\n*Edit* for the record, he IS pushing back against his family for this and advocating for me to see my brother for Christmas but I am starting to feel really guilty about the whole thing because I know his mom is putting a lot of pressure on him and that he feels terrible about disappointing his family. I don’t want to make it out as if he is just caving to their bs I’m just not sure if its worth his family being this upset or if I should just cave and do Christmas with them as to not rock the boat",
 "created_utc": 1701699338,
 "permalink": "/r/AITAH/comments/18al3lh/aita_for_ruining_my_boyfriends_family_christmas/",
 "score": 150,
 "url": "https://www.reddit.com/r/AITAH/comments/18al3lh/aita_for_ruining_my_boyfriends_family_christmas/",
 "comments": []
}