{
 "submission_id": "18aneev",
 "title": "My husband is mad about a vasectomy gift",
 "selftext": "I got my husband a gift basket on the day he got a vasectomy. It had a bunch of snacks he likes and some silly puns on post-it’s. i was trying to be cute and funny and lighten the mood a little. I put it on the seat of the car as I was driving him to the appointment.\n\nWhen he got in the car he grabbed the basket off of his seat. I said that’s for you! Without looking at anything in it, he put it on the car floor, said thank you uninterestedly, and opened Facebook on his phone to start scrolling.\n\nI asked him if he was going to look at it and he said he saw it. I asked if he was maybe going to actually see what I put in there, I thought it was cute and mildly humorous. He said it was not cute or funny, he gets the joke and he already saw it. He was snappy and had a mean tone.\n\nWe blew up into a huge fight on the way because he said my timing was bad. I told home it was rude to not even look through the stuff as I had put effort in and thought about him. He said that he was nervous and having a bad few days, this day was about him and I was making it all about me. Am I the asshole?\n\nUpdate: he was 110% on board with this. We talked very frankly about it for months beforehand, and he knew this was his decision alone\n\nI am on the autism spectrum and have a hard time reading people. This is in response to a few posters who asked why I wrote here. I knew i was off, sometimes the outside perspectives help me understand. Not an excuse to be a bitch. I see i should have waited to give him the gift, and should have been more emotionally receptive.\n\nUpdate #2: he’s doing fine, I’m taking care of him, he apologized for being mean and is happy about the snacks, i apologized for making it about me and stressing him out even more. Thank you!",
 "created_utc": 1701705995,
 "permalink": "/r/AITAH/comments/18aneev/my_husband_is_mad_about_a_vasectomy_gift/",
 "score": 201,
 "url": "https://www.reddit.com/r/AITAH/comments/18aneev/my_husband_is_mad_about_a_vasectomy_gift/",
 "comments": []
}