{
 "submission_id": "18anfy5",
 "title": "AITAH for telling my sister that she’s being a social climber by trying to manipulate her daughter in her relationship with her wealthy boyfriend",
 "selftext": "\nMy sister has four daughters, and for the past two years, she's been hyper focused on her second daughter's relationship with her boyfriend. The daughter, my niece, stared dating her boyfriend a while ago but her mother didn't find out until much later that her boyfriend is from a very wealthy and well known family. Not sure how she didn't know, but I suspect my niece didn't tell her this and my sister only found out after she met the boyfriend and found out whose son he is.\n\nEver since then, my sister is trying to manipulate and 'manage' her relationship to get her to push this guy into commitment. Telling her what to say to him, how to be with his family, etc. Then she gets mad when my niece does it her own way. \n\nShe recently told my niece not to move in with him when he asked her if she would. My sister told her to tell him that she would only do so when they are engaged in order to push a commitment. My niece didn't do this and has agreed to move in with him without an engagement. My sister was berating her in front of me and I lost my cool and told her that she shouldn't train her daughter to be a social climber and that she herself was acting like one.\n\n We had an argument and she said she had her daughter's best interest in mind and that this guy clearly loved her a lot, so getting him to commit was in her best interests. We haven't talked much since. Anyway, my niece is lovely and mature, so I am confident that she'll make the right decisions independently. But was I an asshole towards my sister?",
 "created_utc": 1701706112,
 "permalink": "/r/AITAH/comments/18anfy5/aitah_for_telling_my_sister_that_shes_being_a/",
 "score": 69,
 "url": "https://www.reddit.com/r/AITAH/comments/18anfy5/aitah_for_telling_my_sister_that_shes_being_a/",
 "comments": []
}