{
 "submission_id": "18aq51y",
 "title": "AITAH for not wanting sex with my husband two days after burying my grandpa?",
 "selftext": "Myself (39F) and my husband (40M) have already been having problems in our marriage as it is. I try to talk to him and he ignores everything I tell him. It’s little things that have built up. Like his family treating me bad and him allowing it, him never defending me when someone is saying things about me that are blatantly wrong, especially other females. Both of my parents had cancer at the same time a few years ago and when I found a lump in my breast and when I was crying while trying to tell him, he fired up his Xbox, put on his headset, and got into a party with friends. So I started making friends and going to concerts to get my mind off of all this stuff. I started to finally have some sort of support system. I guess that made him mad because I recently found out he met a girl at a concert and within a week he started bad mouthing me behind my back to her. They both called me being depressed and suicidal during my cancer scare and my mother’s cancer situation me just being a drama Queen and wanting a pity party. He was absolutely vile in the things he said to her about me. When I confronted him just three weeks ago, and called her out, he immediately came to her defense which is something he’s never done for me in our 18 years of marriage. This all happened that same day my grandpa was rushed to the hospital and it was also the anniversary of my other grandpas passing (which still hits me hard). \n\nFast forward to the last few days. I just lost my grandpa and we JUST had the funeral two days ago. I’m still grieving as I was very close to my grandpa. He went and was semi supportive. More to our two kids. However told me that since he went to the funeral, I now HAD to go to his nephews birthday party later that night. So I was forced to attend a party after a funeral in a house where I’m not liked to begin with. I’m not doing well mentally or emotionally at the moment with everything. \n\nToday, he leaves work early to come home and try to have sex with me. That’s it. That’s why he came home early. He got home, got a shower, and immediately came downstairs naked and just stood there. Made no attempt to even, I don’t know, try to get me in the mood or be romantic or anything. So I told him I wasn’t really in the mood (reasonably so I would have assumed) and he got mad. Told me it’s been a while, which it has, but I have had no desire to have sex with him after all he’s done lately. He stormed upstairs angry that I didn’t see him standing there and immediately drop to my knees. Had no understanding that the funeral of my grandpa is still fresh from two days ago and to boot, I have to go collect the flower arrangements from their house that my grandma wanted me to have later today. \n\nAITAH here for not being in the mood to have sex after what I’ve been going through lately? I literally got sick to my stomach and my chest felt like it was tightening when he came down expecting sex. In the past I’ve gave in when I wasn’t in the mood just because I felt like I wasn’t allowed to tell him no. Maybe I should have gave in again even though I didn’t want to.  I feel like this is another thing he’s going to go tell his new “friend” about to paint me as a horrible person rather than try to understand what’s wrong here and make an attempt to fix it.",
 "created_utc": 1701713288,
 "permalink": "/r/AITAH/comments/18aq51y/aitah_for_not_wanting_sex_with_my_husband_two/",
 "score": 34,
 "url": "https://www.reddit.com/r/AITAH/comments/18aq51y/aitah_for_not_wanting_sex_with_my_husband_two/",
 "comments": [
  {
   "comment_id": "kbzlxja",
   "message": "NTA\n\nI stopped reading after he was a jerk firing up his Xbox when you found a lump in your breast.\n\nWhyyyyyyyy are you with someone who treats you this bad?\n\nGood lord, grow a spine and get out of this relationship.",
   "created_utc": 1701716162,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzefv6",
   "message": "NTA in general but you’re being an AH to yourself by staying married to this man",
   "created_utc": 1701713488,
   "score": 162,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzic5w",
   "message": "\u0026gt; In the past I’ve gave in when I wasn’t in the mood just because I felt like I wasn’t allowed to tell him no.\n\nNo, NTA. You should not feel like you can't say no to sex.",
   "created_utc": 1701714882,
   "score": 137,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzpqnj",
   "message": "Why are you still with him? Especially how he treated you with the help of another woman, who he probably is cheating with.",
   "created_utc": 1701717533,
   "score": 85,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzkz3m",
   "message": "one word for you: divorce.",
   "created_utc": 1701715821,
   "score": 77,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzgj9u",
   "message": "divorce this idiot a**hole. you deserve better!",
   "created_utc": 1701714241,
   "score": 134,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzwvpt",
   "message": "I’m very sorry to tell you that he is abusive and is controlling you. When you said ‘I felt like I wasn’t allowed to tell him no,’ that is a BIG RED FLAG. I’m not surprised that you are ‘not doing well mentally or emotionally at the moment with everything.’ You are SURVIVING. You will only be THRIVING when you are no longer in this toxic situation.",
   "created_utc": 1701720063,
   "score": 60,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzfkdj",
   "message": "No, NTA.\n\nHe sounds absolutely horrible OP. Sounds like he can't even manage to treat you half-decently on most days and now that you are really suffering with grief he tries to wander in as if you should serve him sexually, then throws a temper tantrum? That is so heartless and beyond fucked up.",
   "created_utc": 1701713895,
   "score": 33,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzziub",
   "message": "NTA. Divorce him. He’s a POS who only cares about himself. The fact he defended some woman he doesn’t even know and could never defend you against his family, says a lot. If the house is in your name, tell him to pack his things and get out. You deserve so much better than that.",
   "created_utc": 1701721026,
   "score": 24,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzl8ca",
   "message": "NTAH. Your husband sounds like a dick. It's totally understandable that you're not in the mood for sex after everything you've been through. Screw him and his entitled attitude, focus on taking care of yourself right now honey.",
   "created_utc": 1701715912,
   "score": 23,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc00e5q",
   "message": "NTA. Not wanting sex on any day, at any time, for any reason is completely fine. You never need to explain it or have an excuse. No is no.",
   "created_utc": 1701721338,
   "score": 21,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc04nf6",
   "message": "NTA. But you are being an asshole to yourself by staying with this person. \n\nThis isn't love. This isn't support. \n\nHes using you to fulfill his own needs, and then he's shoving you in the sock drawer when he cannot use you. \n\nYou deserve better than this. \n\nRealistically, the only difference between this relationship and being single is the peace you would have in your home if you were single. \n\nPlease do what's best for you, mentally and physically. You are worth a lot more than being someone's bang-maid. You are a fully fledged human being deserving of love, support, and equal standing. Don't accept less than that from *anyone.*",
   "created_utc": 1701722885,
   "score": 19,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc09pee",
   "message": "“I don’t feel like it” is enough of a reason.",
   "created_utc": 1701724752,
   "score": 19,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzqudi",
   "message": "Get away from him!",
   "created_utc": 1701717924,
   "score": 11,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc03sjo",
   "message": "Read the second sentence and stopped reading, should have gotten rid of him already",
   "created_utc": 1701722571,
   "score": 13,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc03ux6",
   "message": "Why would you want to have sex with this man? Why would you want to be married to this man? You are better off alone.",
   "created_utc": 1701722595,
   "score": 13,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0a9uj",
   "message": "NTA get an exit plan together and get out of this relationship.",
   "created_utc": 1701724961,
   "score": 9,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc054lw",
   "message": "NTA but you know you don’t have to stay with him, right? Do you want your kids thinking his behavior is what they can expect from a partner, or that it’s okay to treat a partner like that? Be better to yourself and drop him like the turd he is.",
   "created_utc": 1701723057,
   "score": 10,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc09ltt",
   "message": "Your husband is abusive.\n\nMassively abusive.\n\nYou need to leave him.",
   "created_utc": 1701724715,
   "score": 14,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc04vys",
   "message": "NTA. This man doesn’t like or respect you. Have some respect for yourself and leave. Life is too short to share your life with someone who doesn’t show you love and care when you’re grieving or having a cancer scare.",
   "created_utc": 1701722971,
   "score": 7,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc07lv4",
   "message": "I don’t know what to say about these posts lately. Come on, this guy is your husband? He is no longer a man worthy of your time and energy. He doesn’t deserve you anymore. Cease and desists from him.",
   "created_utc": 1701723967,
   "score": 5,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc096ra",
   "message": "NTA\n\nBut, really, is this the life you want?  That man does not care about you. He says and does horrible things.  He treats you like rubbish. \n\nAlso, this is for everyone, not just OP\n\n*You do not need an excuse to not want sex.  Whether it be your husband, boyfriend or the stranger from down the pub.  No excuses are needed.  No is a complete sentence*",
   "created_utc": 1701724557,
   "score": 7,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fmp4",
   "message": "I don’t throw this around very often at all to begin with, but I’m gonna go with a great big\n\n🚨🚨🚨‼️‼️‼️🚨🚨🚨\n\n#DIVORCE\n\n🚨🚨🚨‼️‼️‼️🚨🚨🚨",
   "created_utc": 1701726979,
   "score": 8,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzxjfz",
   "message": "YTA to yourself for staying married to someone like this.\n\nYou know how short life is by your post, don’t waste on such an awful human being.",
   "created_utc": 1701720301,
   "score": 13,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc05ygz",
   "message": "First problem: “they said vile things about me, and I called HER out” don’t be that woman, that solely lays blame on the other woman. It must not bother you too damn bad, bc you are obviously excusing away his behavior, or at least focusing on her, while trying to give him a pass. YOU are doing this to yourself. People show you who they are, it’s on you to accept that. If you can’t/ won’t then it’s your own weakness keeping you stuck merely prolonging the inevitable. Remember she is likely going off of what HE tells HER. Why would he think it’s okay to ask for sex from you when he JUST got caught having an emotional affair. I’m sorry for your loss, but he is a big part of your emotional stress, and you are excusing his behavior away, so he will continue to walk all over you, bc he knows there is no repercussions. Yes this post is one big pity party when, you have no intention of doing anything to solve your problems",
   "created_utc": 1701723358,
   "score": 7,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc084un",
   "message": "Seriously? Is the bar so low that you’re staying with this pos?  Don't be an AH to yourself honey, he's a c**t",
   "created_utc": 1701724161,
   "score": 7,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0kv8j",
   "message": "I mean this in the nicest way possible, get your self respect back and take your kids and get out of this marriage! Is he also distant and cold to your kids? Are you a SAHM/wife? This is no way for you to live and specially your kids seeing this man emotionally incapable man. You guys deserve way better!",
   "created_utc": 1701728988,
   "score": 6,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0lfus",
   "message": "YTA for staying with him. He's cheating on you and doesn't love you. You have kids, do you want your kids to think this is a healthy relationship? Would you be content with your children being in your shoes in their relationships? NTA for standing up for yourself and your mental health. If you don't want to leave him, read him this post and tell him its couples therapy or divorce.",
   "created_utc": 1701729211,
   "score": 6,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc01vor",
   "message": "EHS.\n\nIt doesn't seem like this Is actually just a result of your grandfather's death. This seems like a result of your husband being a shitty person for a long time. Frankly, you need to leave him because you know that he isn't going to change and he doesn't want to. \n\nYou're TAH because you keep letting this man treat you worse than shit on the bottom of his shoe and show you time and again that he doesn't love you and he doesn't even like you. You've already said you've tried speaking to him, so why are you sticking around? He's not going to change and you know it. You show people how they can treat you and you've shown him that he can treat you like actual garbage and that you'll still stay. You can't complain or be upset with him doing what you've led him to believe he's able to do. \n\nHe's TAH for literally every single reason listed and probably a lot more. This man does not love you and I don't even think that he likes you, honestly.",
   "created_utc": 1701721877,
   "score": 14,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc06arw",
   "message": "Dude sounds like a genuine POS.",
   "created_utc": 1701723482,
   "score": 6,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzx99w",
   "message": "You deserve a better man.\nMan that respects you and supports you. \nA man that protects you and is by your side.\nYour man is not like that .\n\nYou are fragile this moment and he is making things much worse.\n\nI am sorry for your loss.\n\nOp NTA",
   "created_utc": 1701720199,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc032x3",
   "message": "NTA, but your husband definitely is. I hope you are soon able to call him your EX husband. He's selfish, disloyal, disrespectful, and abusive. Divorce him, and get a good attorney who will make sure he doesn't take advantage of you.\n\nSide note: you don't need to be grieving to say no to sex, either. If you don't want to, you don't want to. And that's okay, too. I'm very sorry for your loss.",
   "created_utc": 1701722313,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc047sm",
   "message": "Please do yourself a favor and carefully read this post again to yourself and realize that you deserve better. Please don’t stay married to him. He doesn’t respect you especially what your going through right now 🙏",
   "created_utc": 1701722726,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc05sm4",
   "message": "Hun. Do not stay in an unhappy marriage. This is so emotionaly abusive. You are going through emotional times and your \"husband\" is putting you down. Not just to you but to others. Disrespects your needs or wants. Blaming you for being human basically and grieving. Just take his sh**. But he does not have to take yours attitude. Honestly I want to deck him. Give him a taste of his own medicine. You deserve better!!",
   "created_utc": 1701723298,
   "score": 5,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc074rx",
   "message": "NTA.  Why are you married to this guy?",
   "created_utc": 1701723790,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc07e9t",
   "message": "I think it is time for a PI and a lawyer.",
   "created_utc": 1701723889,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc08co0",
   "message": "NTA but you need to gtfo away from this dude.",
   "created_utc": 1701724242,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc09k55",
   "message": "why are you with this loser",
   "created_utc": 1701724696,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc09kd0",
   "message": "Take this clown to the cleaners.",
   "created_utc": 1701724699,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0a89u",
   "message": "You’re only an AH for still being with this twatbag",
   "created_utc": 1701724945,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0azgq",
   "message": "NTA - Why would you want to sleep with him? He's awful.\n\nTell him sex is off the table until the relationship is healthier. \n\nAnd anyone who wants to tell me that \"sex is part of a healthy relationship\" can f off. A bad partner is not owed sex.",
   "created_utc": 1701725227,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0c9or",
   "message": "\u0026gt;In the past I’ve gave in when I wasn’t in the mood just because I felt like I wasn’t allowed to tell him no. Maybe I should have gave in again even though I didn’t want to.\n\nThat's rape, sweetie. It's called coercion because you feel you can't say no. It's rape.",
   "created_utc": 1701725712,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0eotu",
   "message": "This sounds like teenage drama from an immature husband. Sorry OP. Definitely NTAH. When he came downstairs naked you should have turned the Xbox on and put on the headphones.",
   "created_utc": 1701726625,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fvyy",
   "message": "I don’t throw this around very often at all to begin with, but I’m gonna go with a great big\n\n🚨🚨🚨‼️‼️‼️🚨🚨🚨\n\n#DIVORCE THIS POS\n\n🚨🚨🚨‼️‼️‼️🚨🚨🚨",
   "created_utc": 1701727078,
   "score": 5,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0osf4",
   "message": "NTA.\n\nDO NOT HAVE SEX WITH HIM, OR YOU MAY GET STDS.\n\nObviously, I can't for sure say you will or that he HAS cheated, but it wouldn't surprise me if he has, nor that he's caught something other than the sheer audacity to act entitled to your body whenever he feels like getting off, especially when he has the personality/behavior equivalent to wet cardboard. \n\nHowever, what I will say is that you should contact a divorce lawyer and/or get separated as soon as financially feasible. \n\nYou'll be better off by yourself rather than with this roach, but if you're not ready for it, at least move out and demand marriage counseling.",
   "created_utc": 1701730497,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc07ybi",
   "message": "\\\u0026gt;In the past I gave in when I wasn't in the mood just becaue I felt like I was allowed to tell him no.  \n\n\nTHAT IS SPOUSAL RAPE. OP. My god, I am so sorry. Please, please don't stay in this marriage.",
   "created_utc": 1701724094,
   "score": 9,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc00dir",
   "message": "NTAH as your partner he should always have your back and to let some stranger in on your personal business is way beyond douche bag. You need to reevaluate your relationship. I’m betting you need to move on. Let the new girl deal with his stupidity.",
   "created_utc": 1701721332,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0e9mc",
   "message": "Oh my God! Get rid of him!",
   "created_utc": 1701726465,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ec4y",
   "message": "NTA - you are never an AH for not wanting sex, you don't need a reason",
   "created_utc": 1701726491,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ede5",
   "message": "Leave him because otherwise not only will it affect you, his behavior will affect your children, too.",
   "created_utc": 1701726505,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0f4uu",
   "message": "Why is he still your husband? Get out,\nHe’s abusing you. YTA if you continue with this relationship in front of your children.",
   "created_utc": 1701726791,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0hmxp",
   "message": "NTA Why is his “friend” even talking to you about anything? Your husband is a pos. I wouldn’t want to even share the same room with him. If you’re able to be on your own, I would kick him to the curb.",
   "created_utc": 1701727748,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0jems",
   "message": "*LADIES, YOU ARE NOT REQUIRED TO ACCEPT BAD BEHAVIOR FROM YOUR PARTNERS.*  Get a divorce attorney and liberate yourself from this AH stat.",
   "created_utc": 1701728428,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ktdw",
   "message": "NTA and I would venture to say he’s already slept with the “new friend”",
   "created_utc": 1701728967,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0l5pn",
   "message": "NTA. Litteraly everything after \"sex\" in the title is irrelevant information.\n\nYou are never the AH fir not wanting sex. Full stop. You get to choose.",
   "created_utc": 1701729102,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0mw1z",
   "message": "If he’s so quick to defend the “friend” then he’s fucking his new “friend” btw. It sounds like your marriage is over tbh, he treats you like shit, you feel forced to have sex with him, and he is a giant POS. If and when you can, I’d leave.",
   "created_utc": 1701729768,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0o9yn",
   "message": "He clearly does not care about you. Get a divorce and find a man that actually cares about you.",
   "created_utc": 1701730299,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ubk0",
   "message": "YTA IF you stay with this...person.",
   "created_utc": 1701732667,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0vw14",
   "message": "Why are you with this man who clearly doesn't love you?",
   "created_utc": 1701733292,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0w7jo",
   "message": "OP needs to start going to counseling ASAP to help her cope with her grief and ongoing depression. Honestly, being married to her AH husband is definitely contributing to her depression. This marriage appears to be too broken to be fixed. His emotional cruelty has gone on for far too long. I’m also suspicious that his new female “friend” is not really just a friend either. Counseling and working on OP’s mental health should also occur while OP is speaking to a divorce attorney. This man sounds like he has been truly awful to OP for their entire marriage. This is not healthy for OP or her children.  The only thing that would make OP an AH is if she chooses to stay in this marriage and allow this abuse to continue.",
   "created_utc": 1701733421,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0wqly",
   "message": "NTA. But I’m going to say this: please for the love of all things holy, get into therapy! I know the general consensus is going to be to leave him, but I know that that is easier said than done. So, you need to get into therapy and really dig into why you’re okay with 18+/- years of abuse, manipulation and ill-treatment? Why you are okay with putting yourself through so much trauma to be with someone who does not love you, value you, care for you or even want you?\n\nI know that leaving is hard; so, the best thing for you is therapy or at least reading books, listening to podcasts, watching YouTube videos or ANYTHING that can start to shake this terrible treatment you are allowing him to inflict upon you. Please, please don’t keep accepting this man and what he is doing to your soul.",
   "created_utc": 1701733633,
   "score": 3,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzxp6c",
   "message": "I'm sorry for everything you went thru, NTA, you should've left long2 ago, but like people say better late than never, cut your loses girl",
   "created_utc": 1701720359,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc01r0n",
   "message": "NTA!! sorry to say that, but your husband seems like a fucking egoist.\n\n DIVORCE!!!!\n\nyou deserve way better. he should be there for you emotionally, and take a stance when his family treating you with disrespect.",
   "created_utc": 1701721830,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc068e4",
   "message": "Nta, this man from what you have said is only botherd about himself why are you with him, being in a relationship with him is going to effect your mental health even more",
   "created_utc": 1701723458,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc06rxj",
   "message": "NTA\n\nDo yourself a favour and divorce this asshole already!",
   "created_utc": 1701723657,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc09jdp",
   "message": "NTA!    I apologize if you ever feel like you had a normal healthy marriage. It is very unhealthy, and you deserve better. I am amazed when I hear how other people treat each other. You can do better. Even, if it feels uncomfortable at first. It all starts with you valuing yourself. Best of luck to you.",
   "created_utc": 1701724689,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc09ma6",
   "message": "NTA- I don’t say this lightly- please leave this man. He does not like you, he is probably on his way to having an affair if he isn’t already, and he treats you with absolutely no respect or empathy. He won’t change, he won’t get better, he won’t keep promises. Be kind to yourself, you deserve better than him.",
   "created_utc": 1701724720,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ae7b",
   "message": "You’ll only be an asshole if you stay married to this pathetic excuse of a man any longer.",
   "created_utc": 1701725005,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0b6vf",
   "message": "NTA please leave him. He’s a self-centred pos and will probably never change",
   "created_utc": 1701725305,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0d3uu",
   "message": "Why are you with a man who treats you so poorly, has no regard for your feelings at all, and expect you to just have sex with him no matter what traumatic thing has happened to you. You deserve so much better than this and you would be better off divorcing him.",
   "created_utc": 1701726027,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0dddc",
   "message": "This is not a healthy relationship and you deserve better. The man clearly doesn’t care about your welfare emotional or physical. I’ve been divorced since 2002, and I guarantee to you that being by yourself is better than being with somebody who is supposed to love you and yet proves very clearly that they don’t GAF.  Please make plans for a future that does not include this guy, because he is not good for you. \n\nAnd if he really cared about you he would be working on intimacy and closeness, both of which make it much more likely that you’re going to have sex but instead he’s just making demands and sulking like a teenage boy when you say no",
   "created_utc": 1701726129,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0e85i",
   "message": "Ugh. my gawd. I had a physical reaction to this. I am sick to my stomach reading this. \n\nHow can you think you are even remotely close to being an AH? You are NTA... not even a tiny bit. \n\nWhy are you with him? I hate your husband... he sounds awful",
   "created_utc": 1701726451,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0f739",
   "message": "Obviously NTA, take however much time you need to grieve. This seems like a no-brainer and nobody should ever be coerced or guilted into sex.",
   "created_utc": 1701726815,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ghjv",
   "message": "Your partner is an abusive POS. Nta for telling him no but you need to leave before he not only continues hurting you but teaches your kids this is what love looks like.",
   "created_utc": 1701727306,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0h8tn",
   "message": "NTA.\n\nNot in the mood? No sex. End of discussion. \n\nIt doesn't matter the reason. Just... no. \n\nHe can go have a wank in the bathroom if he is so desperate. Or he can figure out how to make his wife actually want him. Thst might even save the marriage. But as things are now, OP, I would say you will not stay for long with this person.",
   "created_utc": 1701727598,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0hnqd",
   "message": "NTA and please get a divorce. This is such a toxic marriage for you. Your husband is a total loser.",
   "created_utc": 1701727756,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0hx4q",
   "message": "He sounds like an insensitive, selfish knobhead! Why do you remain with this man?",
   "created_utc": 1701727857,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0j7b4",
   "message": "Why are you still with this man? Everything you listed is NOT \"little things that have built up\" -- most of those are major trust and respect issues. You need to call this one done and get the hell out of it. He is not a good partner for you. He's horrible, in fact. Take a step back and really look at how he treats you. \n\nTry this. Look in the mirror and say all this stuff while you look at yourself. Pretend it is a friend telling you all of these things. What would you tell her? You'd likely tell her to divorce the asshole. Take the advice you'd give a friend you love and love yourself enough to do it. NTA unless you stay married to this horrible excuse for a partner.",
   "created_utc": 1701728350,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0j95n",
   "message": "Your unsupportive, disrespectful, abusive husband doesn't understand why you don't want to have sex.  Tell him to ask the lady he was discussing you with to see why you don't want to have sex with him.  He said you have to go to his family because he was there for you with your family.  I would have divorced him over this alone.  My grandfathers funeral could never be comparable to a kids bday party.  WTH??  OP, please put you and your children and your mental health first.  Do it for you and your children.",
   "created_utc": 1701728369,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ji7v",
   "message": "NTA... why are you married to him? Why did you have kids with this twatermelon?",
   "created_utc": 1701728466,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0jx6z",
   "message": "He sounds absolutely VILE. NTA- your spouse isn’t entitled to your body. Also him talking shit to his friends about you is a red flag. He’s got to go",
   "created_utc": 1701728625,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0jyew",
   "message": "Too too much. What are you getting out of this? It's not love. You mentioned children. Do you have children with him? How long have you been with him? Has it always been this way? I'm sending Blessings.",
   "created_utc": 1701728638,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0k1zw",
   "message": "Ok...no.  After my first wife lost her best friend to a drunk driver...it was at least a month.  He needs to wait and respect you",
   "created_utc": 1701728676,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0k3m5",
   "message": "Jesus fucking Christ, why are you with this man? He sounds awful in every way. Of course you’re NTA for not wanting to have sex with him. Also, what a weird way to initiate sex🤢",
   "created_utc": 1701728694,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0k3rz",
   "message": "NTA but you need to get a divorce and then go see a psychologist. There's probably a reason you married such an abusive person, and even if you didn't have anything going on before being with him you might now.",
   "created_utc": 1701728695,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0lcy8",
   "message": "You are better than this, and so are your kids. Gird your loins, get some therapy, make a plan and leave as quick as you can can ♥️",
   "created_utc": 1701729179,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0lf6f",
   "message": "NTA \n\nI want to say more, but I have no kind words for that man.",
   "created_utc": 1701729203,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ma5g",
   "message": "So the way he initiates sex is to take all his clothes off and just stand there naked waiting to be serviced? Like, in the living room? \n\nThat is honestly the least sexy thing I can imagine.",
   "created_utc": 1701729536,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0mbjd",
   "message": "Ma’am your husband does not like you…. Please get away from him",
   "created_utc": 1701729550,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0moyu",
   "message": "Divorce babe, divorce..",
   "created_utc": 1701729693,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0neeo",
   "message": "NTA. I agree with everyone else telling you to leave him, but I know (from personal experience) that leaving is easier said than done. Please do some thinking about all of this, and read your own post. This man is not a good one, and you deserve much better. I'm sorry for your loss and I wish you luck.",
   "created_utc": 1701729964,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0nwed",
   "message": "NTA. You can refuse sex at any time for any reason or for no reason. Being married no longer implies consent. If he has sex after you say no, it is rape.",
   "created_utc": 1701730157,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0oihp",
   "message": "You're never the asshole for not wanting sex no matter the reason.",
   "created_utc": 1701730389,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0oijy",
   "message": "NTA. Your husband is abusive. Don't be his doormat anymore. He is incredibly selfish. It seems like he's entertaining himself by pushing your limits to see how much abuse you'll tolerate.",
   "created_utc": 1701730390,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ound",
   "message": "You deserve better than this.  I agree with the other posters who said his response to you finding a lump in your breast was to dive into an online game with his buddies:  I'd have packed and left that night, in the face of such callous indifference.  And as far as just showing up naked and expecting you to fall all over him -- has the man never heard of tenderness, foreplay or seduction?  If he isn't willing to go to marital counseling and sort this out, then your next step is to talk to a family law attorney and start planning your exit strategy.  This is not sustainable. \n\nPS:  I really don't give a flying f\\*\\*k what he \"tells\" his girlfriend. She has no relevance to this situation, because HE is the one that made the choice to become (emotionally? physically?) intimate with her instead of you.",
   "created_utc": 1701730522,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0pyru",
   "message": "Your husband is a fucking twat",
   "created_utc": 1701730952,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0q0iu",
   "message": "NTA. You don't ever have to have sex with him if you don't want to.  And quite frankly, I can see why you haven't wanted to.",
   "created_utc": 1701730971,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0q1fe",
   "message": "Girl leave him right now wtf ❗️ After him doing you dirty THAT MANY TIMES you can only blame yourself for staying. There is literally no reason and no way you can convince yourself to stay with such a piece of shit",
   "created_utc": 1701730981,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0rmio",
   "message": "Am I the only one who feels like he might be cheating?",
   "created_utc": 1701731600,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0s4fp",
   "message": "\u0026gt;Both of my parents had cancer at the same time a few years ago and when I found a lump in my breast and when I was crying while trying to tell him, he fired up his Xbox, put on his headset, and got into a party with friends.\n\nYou could have ended your whole story here. I generally roll my eyes at all the \"Leave him now\" comments on the thread, but he is emotionally abusive and you should consider leaving. This is not a healthy relationship, it is no wonder your not feeling well lately.\n\n\u0026gt;So I started making friends and going to concerts to get my mind off of all this stuff. I started to finally have some sort of support system. \n\nGo to that support group you have built, and get away from him for a time, see a therapist so you can make a clear headed decision to leave or stay. (Leave) \n\nNTA\n\nAlso you never owe anyone sex if you don't feel like it.",
   "created_utc": 1701731798,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0u6xs",
   "message": "NTA. Tell him to go fuck his new girlfriend, while you prepare to leave him or kick him out.",
   "created_utc": 1701732616,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ukju",
   "message": "Why on earth would you stay with this pos? Get out of there, find work if you don’t have a job and get yourself free of this misery!",
   "created_utc": 1701732767,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0wjoz",
   "message": "Please speak with a lawyer and a counselor",
   "created_utc": 1701733558,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0x5jr",
   "message": "NTA\n\nThere are no circumstances where you owe sex to anyone \n\nThis includes your husband \n\nThis includes every occasion with your husband \n\nIf your husband wants to have sex when you don’t want to and he’s not respectful of that and he doesn’t care more about your feelings and about sex \n\nThen I cannot say what I think of him because it’s too horrible \n\nI would not live under the circumstances, and I would not tolerate anyone who had this attitude as a partner",
   "created_utc": 1701733796,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0xkt5",
   "message": "Girl, you need to get into the mood to get out of that relationship.",
   "created_utc": 1701733959,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0xzsy",
   "message": "So let him. Let him tell her you're a terrible person, and while he's doing that, speak to a lawyer and draw up the divorce papers. \n\nLook, from what you've said OP, it doesn't sound like a physically dangerous situation, but it clearly is a mentally draining one. And FYI we no longer live in the times where marital rape is considered impossible. I'd think long and hard about what it is that's happening when you \"say yes\" because you feel you're not \"allowed to say no\"... jesus christ, what do they teach in school these days?! \n\nYou can say no, to anyone, at any time, at any point, and for any reason. A reason does not need to exist or be given, NO is a full sentence and \"not wanting to\" is more than enough reason to not do it.",
   "created_utc": 1701734119,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ys54",
   "message": "You outline an endless array of assholery from your husband, and then you want to know if you're the asshole?\n\nNTA. But seriously, you need to get a divorce. He obviously doesn't care about you at all, and the example you're setting for your kids is horrendous. \n\nFind your self-respect, straighten your spine, and serve him divorce papers. There is nothing in this marriage for you. Nothing. Don't waste another minute of your life with that man.",
   "created_utc": 1701734420,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc11swi",
   "message": "NTA.\n\nTake it from someone who survived in abusive relationship with a narcissist. 18 years is too long for this. Don't even stay 18 more minutes it's time to get out.\n\nPeople need to understand that ignoring your feelings and refusing to spend time with you when you need them is toxic. It's abuse. It's not love.\n\nListen well all of you. If any of you are in a situation like this I don't care if you've been there 5 years 20 years 30 years. It will not get better. It's time to leave.",
   "created_utc": 1701735610,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc15f5u",
   "message": "I didn't even make it through 1/4 of this post without wondering why you are still with this dude. Give yourself the respect you deserve and LEAVE this piece of trash. You deserve so much better OP, throw that whole ass man away.",
   "created_utc": 1701737081,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc16qv0",
   "message": "Omg leave this horrible person.",
   "created_utc": 1701737623,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbztcgl",
   "message": "Why are you married? It sounds like you hate each other.",
   "created_utc": 1701718812,
   "score": 4,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0b1kg",
   "message": "I know how it feels and you are not the AH. \n\nOne of my grandmas died when i was in highschool(17yo) and my parents had to let me home so they can go to the country side and make the funneral. I was devastated.  For emotional support I asked my bf to stay with me for the days my parents werent home.  All good until he told me that I should stop crying about that cause I cannot bring her back anyway and we should f$%k , to make the most as I was home alone.... I know .... so f-ng selfish for him , I couldnt believe what he just said ... well , he put pressure on me , and I cryed during the deed.... and he was the one feeling like shit after because of this ... wtf ? I am mourning and all you can think is s$x ? \n\nHe is the AH .",
   "created_utc": 1701725249,
   "score": 2,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0f2o4",
   "message": "I agree with all the other people.  DIVORCE him.  Now.  Yes, he will probably run to the other woman...but good!  Now he is her problem and he can be an AH to her.  Eventually she will toss him out.  Besides he sounds very controlling and childish.  Not a healthy relationship for you.",
   "created_utc": 1701726768,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0hboh",
   "message": "I swear these titles get more one-sided every day! “I said no to my husband one time after having sex every day for 10 years so he punched the tv and pawned off my grandma’s heirloom ring to spend on hookers and blow, AITAH?”",
   "created_utc": 1701727628,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbztyd8",
   "message": "NTA, but everyone is different. After major deaths in my family, my wife and I had sex. My older brother, we did it right before the funeral and my younger brother, right after. It gave me so much comfort. It wasn't a selfish kind of sex, it's more of I'm glad to be here with you in this moment alive. Both of my brothers were killed as a result of the Iraq war (one KIA and one suicide), and I myself did a tour there. It was a refresher from death, that even though he took people I loved, I was in the moment with a person I love more than life. It wasn't planned either, we just held each other mourning and it just led to sex.",
   "created_utc": 1701719029,
   "score": 255,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ujdm",
   "message": "Question.... Why'd you marry this guy?\n\nHe's wrong... but YOU chose him.  WTF?\n\nGranted this is just one side of the story.  I'm sure if we asked him, we'd hear things not included in this story.\n\nAs far as we know they've been married for 10+ years and he's given up because maybe its all whine \u0026amp; complain combined with a sexless marriage.  \\*shrug\\*  I dunno... and I guess I just don't care.  \n\nLeave him... or don't.  It's your life.",
   "created_utc": 1701732755,
   "score": 0,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc126r0",
   "message": "Sounds like you both have way bigger issues. I’d say maybe you both are assholes but not for this specific situation. Your relationship sounds like shit",
   "created_utc": 1701735766,
   "score": 0,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzejmv",
   "message": "I'm not reading a wall of text, add paragraphs please. Also, based on your title alone, seems like you should know the answer. Who would EVER be the AH for not giving sex to someone else if they didn't want to?",
   "created_utc": 1701713525,
   "score": 234,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0gkaw",
   "message": "It gets to a certain point where I can’t share too much sympathy. I really can’t comprehend why you’re still with him and letting him treat you like this… YTA to yourself.",
   "created_utc": 1701727335,
   "score": 255,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0i0oi",
   "message": "What does OP want us to tell her? OP has chosen this life. What is wrong with you OP?",
   "created_utc": 1701727895,
   "score": 255,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0nfck",
   "message": "ESH\n\nYou're not an asshole to him, but you are one to yourself.",
   "created_utc": 1701729974,
   "score": 255,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0r9xe",
   "message": "NTA. He’s an AH for expecting sex two days after such a difficult day for you. \nHowever, there seems to be more to this story that you’re not admitting to. How long has it been since you last had sex? How did you find out what he told this new girl?  Etc",
   "created_utc": 1701731462,
   "score": 255,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fhg2",
   "message": "NTA. (Stay with me here) It sounds like maybe you’re a little difficult and he’s grown used to it and doesn’t feel like defending you anymore.\n\nBut on YOUR side of things, you’re asking for empathy, support, human connection and validation-if that’s difficult for him, then ew. \n\nThose are not unfair things to ask for.",
   "created_utc": 1701726923,
   "score": 254,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0rpuj",
   "message": "Sometimes it's easier just doing it, less drama and stress. Plus you know he's happy atleast.  Just my thoughts",
   "created_utc": 1701731638,
   "score": 254,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0rs4v",
   "message": "A man is just a small child at heart. There is no inappropriate time to want sex with us, in fact if it’s a bit weird, that’s really good.",
   "created_utc": 1701731662,
   "score": 254,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc03qhb",
   "message": "The reason you didn't want to have sex with him is because you and he are having a lot of issues.  Had nothing to do with who you buried or when.  (I realized how flippant that sounds.  It was in response to your title.  I am sorry for your loss.)\n\nIn general, there is actually a sexual phenomenon which has been studied and written about.  An unexplained need to to have sex in the beginning of grief.  Sociologists hypothesize this is due to the life giving and nurturing aspects of sex.  My point being that your reaction is kind of the opposite of the norm.  That could be that you just process differently, but I suspect it has more to do with the person you have sex with and your reduced attraction to him right now due to strife than your grief.  \n\nIt is an important distinction in moving forward, whatever that will look like.\n\nI am sorry for what you are going through.",
   "created_utc": 1701722550,
   "score": 247,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0i5w6",
   "message": "OP is spineless!!",
   "created_utc": 1701727950,
   "score": 254,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0pjof",
   "message": "Yes give him you as he gives you him",
   "created_utc": 1701730790,
   "score": 252,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0einh",
   "message": "Dude has been treating her like trash for years and she is asking if she should or should not have sex with him… that is her concern. Some women deserve what they get",
   "created_utc": 1701726559,
   "score": 252,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0duol",
   "message": "Of course not. You were probably still tired and sore from all that shovelling.",
   "created_utc": 1701726310,
   "score": 249,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc093l2",
   "message": "That’s understandable. You’re not in the wrong. Now a week. It’s your granddad not your dad.",
   "created_utc": 1701724524,
   "score": 249,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzmt48",
   "message": "Yes",
   "created_utc": 1701716475,
   "score": 238,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kbzo838",
   "message": "What does your grandpa have to do with loving your husband.",
   "created_utc": 1701716985,
   "score": 192,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc03yvw",
   "message": "Nta in this situation but yta if you stay with a man who has no respect for you what so ever.",
   "created_utc": 1701722636,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0bg66",
   "message": "Don’t have to read anything but the title to say NTA!!!",
   "created_utc": 1701725403,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0can2",
   "message": "This man is definitely cheating or will! Get out while you can this is not a good situation and you are being mentally and verbally abused.  Be careful with him because it could turn to more than that if he gets frustrated enough as he looks down on you and as less than .\n\n\nGood luck.. but if I were you I'd be finding a place for my children and myself can go that's a safe place. Go to your grandma's with the kids for a few days. Maybe that will help sink things in for him, but I doubt it. He will probably be relieved jump on his XBOX with his friends, tell them the bitch is gone and then call the girl he bad mouths you too. \n\nMove on girl... Move on",
   "created_utc": 1701725722,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0cgaz",
   "message": "Girl you need to leave, you’ve proven to yourself you can find a better support system than he is being.",
   "created_utc": 1701725780,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fa0x",
   "message": "you’re a never TAH for not wanting to have sex !",
   "created_utc": 1701726846,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0ff15",
   "message": "NTA. I’d look for a good divorce attorney. From the first paragraph before you even told the story about what happened, I wanted you to leave this douche bag. He clearly doesn’t care about you. You’d be happier single…life is too short to be with someone who doesn’t appreciate you. Good luck.",
   "created_utc": 1701726898,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fod2",
   "message": "NTA - Your husband sounds like a complete douche. You two are or should be a unit, and you deserve support from him. He apparently takes you for granted. You definitely need to get away from him and his family.",
   "created_utc": 1701726997,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fsme",
   "message": "I hope you are OK. Sounds like you have done nothing wrong. Being emotional or having some trouble mentally is not something you should be punished for, and also not something to be ignored. Sounds like everyone is ignoring your needs, and expects you to ignore your feelings in order to do whatever others want you to do. \n\nBe kind to yourself, and know that you have done nothing wrong.",
   "created_utc": 1701727042,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0fv3j",
   "message": "Fuck no",
   "created_utc": 1701727069,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0g1ok",
   "message": "NTA but you should leave this man. It’s clear he does not care about you and you deserve better.",
   "created_utc": 1701727138,
   "score": 1,
   "submission_id": "18aq51y"
  },
  {
   "comment_id": "kc0r73v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18aq51y"
  }
 ]
}