{
 "submission_id": "18ar70m",
 "title": "AITAH for not giving my son’s half siblings mother half the money their father sends me?",
 "selftext": "\n\nSorry for the title being confusing. I had a hard time figuring out how to word it. I’ll try to lay out everything more clearly here. \n\nI have a son with a man named Michael. Michael has two other children with a woman named Kathleen. Neither of us is currently in a relationship with Michael and don’t exactly know where he is because he moves around a lot. Kathleen and I as well as Michael’s parents do keep in touch for the kids. \n\nEvery month Michael will send me money through his friend. Given Michael’s distain for her and her financial difficulties I assumed that he was not sending her any money. I didn’t want to seem like I was bragging or anything so I never brought up the money that Michael was sending me.\n\nApparently she always assumed I had a high paying job and only recently found out from Michael’s parents that was not true and it came to light that Michael was sending me money.\n\nSo now she wants me to give her half the money that Michael is sending me. She even suggested she was being generous since she should really get 2/3rds since she has two kids with Michael and I only have one.\n\nThe thing is giving away half the money would really be a big financial blow to me and my son. It would mean a drastic change in our lifestyle and we would have to move. I also wouldn’t be able to put aside any more money for emergencies or for his future education. So far I only have a small amount saved, but by the time he’s 18 it should be a good amount to get him started.\n\nI do realize this is unfair to Kathleen and her kids, but as my son’s mother I do feel like it’s my job to put him first and set him up for the best future I can. Ultimately I think we can all agree that Michael is the main asshole here, but I wonder if I am too. I can live with it if I am being an asshole too, but maybe knowing how much I am will help me with how I further interact with Kathleen.\n\nEdit. It keeps being brought up so I thought I should add that I do have a child support order. So does Kathleen. Kathleen hasn’t been able to hers enforced because Michael gets paid under the table and doesn’t have a bank account.",
 "created_utc": 1701716002,
 "permalink": "/r/AITAH/comments/18ar70m/aitah_for_not_giving_my_sons_half_siblings_mother/",
 "score": 33,
 "url": "https://www.reddit.com/r/AITAH/comments/18ar70m/aitah_for_not_giving_my_sons_half_siblings_mother/",
 "comments": [
  {
   "comment_id": "kbzqxi2",
   "message": "NTA\n\nKathleen needs to settle this with Michael, not you.",
   "created_utc": 1701717955,
   "score": 11,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbztf80",
   "message": "Nta.  This has nothing to do with you and is 100% a matter between her and the guy she has two kids with.  If she does go to courts, it would be against him, not you.  Technically, you have zero reasons to even communicate with her.\n\nHowever, you are getting money through the guys friend, so that's not exactly reliable.  I would not be basing my current lifestyle around such a nebulous source of money that could go away entirely at any point.",
   "created_utc": 1701718840,
   "score": 106,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzug15",
   "message": "NTA she is not entitled to your son’s money. She needs to go after her baby daddy for child support not you.",
   "created_utc": 1701719203,
   "score": 116,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzpwza",
   "message": "\"sharing\" child support between different baby-mama's isn't a thing. her situation is with Michael, and you have nothing to do with it. NTA.",
   "created_utc": 1701717595,
   "score": 38,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzmrfs",
   "message": "As far as you know, he might already be sending her money.\n\nNTA.  Don't give in to scammers and bullies.",
   "created_utc": 1701716458,
   "score": 137,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzvil5",
   "message": "NTA you need court ordered child support, both of you.",
   "created_utc": 1701719579,
   "score": 72,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzsq1y",
   "message": "Say no. \n\nBut you also need to consider he isn’t sending it to her for a reason. If you decide to give her the money he sends to you he might just decide to stop giving you money as well. Do you want to risk you son’s future?",
   "created_utc": 1701718590,
   "score": 198,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzujph",
   "message": "Well, this is ridiculous. Tell her to get court ordered child support, this is between Kathleen and Michael and the courts. It has nothing to do with you.\n\nNTA.",
   "created_utc": 1701719238,
   "score": 68,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzslw8",
   "message": "NTA and it’s not your responsibility… his parents also shouldn’t be discussing or telling your personal business",
   "created_utc": 1701718549,
   "score": 63,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzujyq",
   "message": "NTA. She needs to go through the courts to fix this, not you. If Michael finds out, he’ll stop sending you money so it’s pretty pointless.",
   "created_utc": 1701719241,
   "score": 21,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzxeqi",
   "message": "What Kathleen gets from Michael is none of your business, and Kathleen has no claim on the funds that you are receiving from Michael as that is none of her business.  For all you know the money your receive isn't even from Michael, it is from his friend.",
   "created_utc": 1701720253,
   "score": 18,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzn6le",
   "message": "Nta she and her kids are his responsibility, not yours. You are not obligated to give her anything.",
   "created_utc": 1701716610,
   "score": 66,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzwrkt",
   "message": "NTA-dont give her a damn thing. She can go to court and get a support order just as easily as you could. There is a reason why he doesnt pay for her kids though.  Maybe they arent actually his bio kids? Maybe she cant get a court order because she would need a parternity test?",
   "created_utc": 1701720023,
   "score": 37,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzuxdq",
   "message": "NTA \n\nKathleen needs to handle this with Michael. Her kids are not your responsibility. Not your problem OP",
   "created_utc": 1701719375,
   "score": 17,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzvwcf",
   "message": "NTA\n\nShe can go after her baby daddy in court, you have zero obligation to share funds with his other kids mother. \n\nHer kids are Her problem, not yours. If she asks again, block her.",
   "created_utc": 1701719714,
   "score": 16,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzv01d",
   "message": "NTA - you don’t owe Kathleen or her children $, Michael does.",
   "created_utc": 1701719400,
   "score": 14,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzowwe",
   "message": "NTA. That is up to her to figure out your only job is to protect and support your child.",
   "created_utc": 1701717235,
   "score": 30,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzuv1p",
   "message": "NTA. She needs to take him to court for child support, not try to guilt you into giving up part of what he's sending to you.",
   "created_utc": 1701719353,
   "score": 13,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzwtr8",
   "message": "NTA. This is between Michael and her, not uou and her.",
   "created_utc": 1701720044,
   "score": 9,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzxrax",
   "message": "Michael's children with another woman are not your financial responsibility. If anyone is TA here, it's Michael. \nIf you happen to live in the United States, you're legally entitled to a portion of Michael's income for the care and raising of your child. \nKathleen is as well, and she would do well to pursue a legal avenue for that.",
   "created_utc": 1701720381,
   "score": 8,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzyjud",
   "message": "NTA.  He chose to send you money but not to send her any.  He's probably an anus for that, but you have no obligation to share your child support with anyone else.  In fact, it would have a negative impact on your child.",
   "created_utc": 1701720671,
   "score": 7,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzyxzi",
   "message": "NTA. Michael is a deadbeat dad for her kids. Sad but true. For whatever reason, he cares more about you and your child. Do not give her anything.",
   "created_utc": 1701720814,
   "score": 7,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0axgo",
   "message": "aside from the obviois NTA here. Whta the kind of setup is this? If he magically decides to stopsending you money you need move?\n\nYou putting you and uou child entire life in someone elses hands? does that not bother you?",
   "created_utc": 1701725206,
   "score": 8,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0cycd",
   "message": "But OP needs to be prepared for a future where she as well doesn’t get the money, because as it is she gets money through a friend and doesn’t know where the father is. \n\nMy advice: don’t share the money and also live below your means and save like there’s no tomorrow.",
   "created_utc": 1701725968,
   "score": 7,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzy6gj",
   "message": "NTA. You didn't create her children. You don't owe her or her kids anything. She needs to get it from the kids dad. Do not put you or your child in a difficult situation. What if he finds out you give her money? Would he stop sending it?",
   "created_utc": 1701720534,
   "score": 6,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc09rix",
   "message": "If you give Kathleen money now and she manages to collect on the arrears he owes her, do you think she will give you the money back?\n\nI don’t think so either. \n\nHer issue is with Michael. Period.",
   "created_utc": 1701724775,
   "score": 6,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzt9zo",
   "message": "What would you get if court order or have a court order ? I wouldn’t give anything cause you don’t know what she does . Could be spent on booze etc . Younshould just block her unless there is a real\nReason not too",
   "created_utc": 1701718787,
   "score": 15,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzyzb9",
   "message": "It seems this question was answered previously years ago when this was first posted.",
   "created_utc": 1701720828,
   "score": 5,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzzhwq",
   "message": "NTA and she's wrong for asking. If she wants Michael to send her child support, there's a whole court system to make him do that. But your situation with your son's father has nothing to do with hers and your finances are none of her business.",
   "created_utc": 1701721016,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzzxdf",
   "message": "Nope, the money is for your child. She needs to file for support, if she wants money.",
   "created_utc": 1701721172,
   "score": 5,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00scl",
   "message": "What the hell is wrong with the grandparents? I would keep them at arms length since they enjoy stirring shit so much.\n\nYou don’t owe the ex or her kids anything.",
   "created_utc": 1701721481,
   "score": 5,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc031zw",
   "message": "Her kids and her choices are not your problem. You have no responsibility towards your kid's half-siblings. She can take it up with baby daddy.",
   "created_utc": 1701722304,
   "score": 5,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0498s",
   "message": "Stay out of it and worry about your own kid. NTA.",
   "created_utc": 1701722740,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc088mq",
   "message": "\"Apparently she always assumed I had a high paying job and only recently found out from Michael’s parents that was not true and it came to light that Michael was sending me money.\"\n\nWhy are they minding your business? They had no call to be discussing you or the fact that the father of your child is sending money to you. I'd put them on an information diet, since they feel it's OK to discuss your private financial situation. If they want to help her, THEY can.\n\nShe's out of line asking you for your son's child support money. NTA.",
   "created_utc": 1701724201,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0b9re",
   "message": "Another thought…since you are getting the Court Ordered amount, if you were to give her a part, he might be able to get your amount reduced by saying “she already gives away part of it, so obviously doesn’t need it”. \n\nOf course, that’s not true but it could look that way to a Court.",
   "created_utc": 1701725335,
   "score": 6,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0j88r",
   "message": "You have no idea what he sends her.  He could already be paying her.  \n\nI’m sorry for that kids but this isn’t your battle nor any of you business.",
   "created_utc": 1701728360,
   "score": 5,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00g26",
   "message": "NTA  Michael's friend is giving you the money that was meant for your child. If she wants money from Michael you can discuss it with friend and he can talk to Michael on her behalf. Also tell whoever told her that you won't be discussing anything but your child with them in the future. They can't be trusted to keep quiet about your matters.",
   "created_utc": 1701721357,
   "score": 9,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00h6h",
   "message": "NTA your priority is your kid. She can take him to court for her kids. And you don’t even know if she is being truthful about him not giving her money. He is probably sending an equal amount but she wants you to get less than her. That is not your problem.",
   "created_utc": 1701721368,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc01nlj",
   "message": "Is the money from the friend even from him or is it a friend acting kind? \n\nThis is between you, Michael, and his friend currently. The other baby mama and kids aren't your responsibility",
   "created_utc": 1701721796,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc05yhz",
   "message": "NTA.   \n\n\nThis is between Kathleen and Michael. I know she’s frustrated, she has a child support ruling he doesn’t follow… but she needs to deal with that legally. She should gather evidence that he has some kind of income and isn’t declaring it. The problem for you is that now she knows he pays you if she can gather evidence of that she can use that to prove to courts the fact he is capable. It might dry up Michael paying you.",
   "created_utc": 1701723358,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0631v",
   "message": "\"i will not give you part of the child support for MY son. If you need money from Michael, take him to court.\"  \n\n\nits Kathleens job to take Michael to court if he's not paying. Not yours to step up. And she should be ashamed of herself for putting you in this position.  \n\n\nPer your edit:  \n\n\nDoesn't matter. She should talk to his parents and not you.",
   "created_utc": 1701723404,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc08x2g",
   "message": "NTA and what you receive is not Kathleen’s business. Have a conversation with Micheals parents about not sharing your private info. FWIW many courts lean towards giving more to the older child when multiple family groups are involved.",
   "created_utc": 1701724456,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0dp4s",
   "message": "NTA. Yes,  it might be unfair to Kathleen and her children,  but it is not your job to support them.",
   "created_utc": 1701726252,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0j4jj",
   "message": "\u0026gt;So now she wants me to give her half the money that Michael is sending me. She even suggested she was being generous since she should really get 2/3rds since she has two kids with Michael and I only have one.\n\n\"No, but thanks for the generous offer.\"   \n\nNTA",
   "created_utc": 1701728321,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0qsf1",
   "message": "Tell her that the money is from your child support agreement and that Michael not upholding his support agreement with her isnt your concern or responsibility. This money is sent for your child with him not her children with him. \n\nShe can take him to court again if she needs, she can get proof hes sending you money and not her, she can get proof hes paid under the table. \n\nHer kids are not your responsibility. You shouldn't have to put yourself and your kids in a tough place because she wants the money.",
   "created_utc": 1701731271,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0uort",
   "message": "NTA this is something Kathleen needs to sort out on her own. Don’t get involved in this or you won’t be missing out on half the money , he will stop paying you completely.",
   "created_utc": 1701732815,
   "score": 4,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzzjqq",
   "message": "NTA- this is definitely Michael’s problem to deal with, not yours",
   "created_utc": 1701721035,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc002km",
   "message": "NTA at all. Her issue should be with Michael only, not you. Do not give her anything.",
   "created_utc": 1701721224,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc006g0",
   "message": "NTA\n\nIf Michael’s other kids mom wants child support, that’s between the 2 of them. It has nothing to do with you. Tell her that what goes on between her and Michael is their business and she needs to speak to him. \n\nYour job is to support your kids, not hers.",
   "created_utc": 1701721262,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00idt",
   "message": "You are a parent and mother to you son first, do what is best for him and his future. NTA",
   "created_utc": 1701721381,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc02cch",
   "message": "You're not responsible, Michael is. Dont let her guilt you. She needs to take this up with Michael.",
   "created_utc": 1701722046,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc04ooh",
   "message": "You aren't obligated to even have a relationship w this woman, and now she's demanding you give her money that was intended for you \u0026amp; your son?  Nah, NTA. \n\nThe only person in the wrong here is the children's father, not you. \n\nIt isn't up to you to figure out financial support for anybody but you \u0026amp; your son.  \n\nKathleen needs to sort this out with Michael, nobody else.",
   "created_utc": 1701722898,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc05g6x",
   "message": "Also think about this… if you give her money, then she is able to collect through the court system, will she split her money with you?  Pretty sure that would be a hard no.",
   "created_utc": 1701723173,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc08koj",
   "message": "This has nothing to do with you. She needs to raise this with HER BABY DADDY not YOU. Like who does she think she is. Michael should be sending her money not you. He has a reason why for not sending it.",
   "created_utc": 1701724326,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc09m5i",
   "message": "NTA.\nIt's not on you to get her some child support. That said, Michael sounds very shady. Going through the friend could be considered money laundering which may actually be what it is if Michael's income is from illegal sources. I doubt you'd get in trouble, but you ought to be prepared in case that income comes to a screeching halt.",
   "created_utc": 1701724718,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0cl36",
   "message": "This is not your problem. She and Michael need to sort it out.",
   "created_utc": 1701725830,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0ep8v",
   "message": "NTA\n\nThis is 100% Michael's problem.  Kathleen should absolutely take Michael to court over his failure to pay her child support.",
   "created_utc": 1701726630,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0ile0",
   "message": "NTA.\nShe is to a degree, but I can understand her trying it on.\nHe is a massive AH. Got to wonder what you both saw in him...",
   "created_utc": 1701728116,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0mkwp",
   "message": "I’d be afraid if he found out you gave her money, that he’d stop sending you money. Then none of his kids would be supported. NTA not your problem.",
   "created_utc": 1701729650,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0obkz",
   "message": "Never, ever set yourself on fire to keep someone else warm, OP!\n\nYour obligation is to your child only, not hers. In fact, i'd even go so far as to say you'd be negligent and doing your child a huge disservice if you took money that your child was legally entitled to and gave it to someone else's. \n\nDoesn't matter one iota that they're related and share a father. That money isn't yours to give away and is meant for and belongs to your child only. \n\nDo you really believe if the shoe was on the other foot (and who knows, one day it may very well be) that she'd take from her own children and give you 1/2 of their child support money? \n\nYah, didn't think so. Make no mistake, she wouldn't take the hit and the lifestyle downgrade for herself and her kids that you say you'd have to, if you were to do something this nonsensical. \n\nI also wouldn't consider rocking the boat and advocating on her behalf to your ex, or you may find yourself ghosted and in the exact same situation.",
   "created_utc": 1701730316,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0oi2w",
   "message": "NTA. \n\nThis is money designated, via a court order, specifically for your child. Kathleen has a separate court order for child support. She needs to work that out with the court and Michael. You are not the one that's responsible for paying her child support - Michael is.",
   "created_utc": 1701730385,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0ol4g",
   "message": "NTA, Kathleen has fuck all to do with how much you get. She should take this up with Michael. Do not give her a dime, especially because she considers herself so 'generous'.",
   "created_utc": 1701730417,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0opzj",
   "message": "NTA, she doesn't get to steal from your kids. She needs to go to Michael. He is the AH for not supporting all his kids",
   "created_utc": 1701730471,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0q3x9",
   "message": "NTA. Whether Kathleen is getting money or not has nothing to do with you or your son. There is not one tiny little reason on this planet why you should ever make your life and your son's life worse for her.",
   "created_utc": 1701731008,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0q4nv",
   "message": "NTA, why are you even having any dialogue with Kathleen? \n\nThis sounds like a her problem, not a you problem. Don’t make other people’s problems yours.",
   "created_utc": 1701731016,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0q926",
   "message": "Those are Michael's kids, not yours. It's up to Kathleen to go after Michael.",
   "created_utc": 1701731062,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0qdxz",
   "message": "NTA and not unfair. He has a child support case against him for both you and her. She needs to work this out with him and the state. What you get from him is none of her business. It sucks for her and her kids but the only personnhere who's the asshoke is him. Also he's going to shit his pants if he thinks waiting until his kids turn 18 absolved him from that money he owes.",
   "created_utc": 1701731113,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0qglh",
   "message": "NTA it has nothing to do with you.",
   "created_utc": 1701731142,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0qhgc",
   "message": "NTA and what are you going to do when Michael decides he doesn't want to send you anymore money? Are you saying you fully rely on that source of income? Cause you should probably plan for that not being a thing forever",
   "created_utc": 1701731151,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0qijp",
   "message": "NTA\n\nYOU have a child support order to support YOUR child.   Not hers.  YOURS.\n\n\nKathleen can go after Micheal if she wants.  She doesn't get to come after you.  My money is on that she is getting money the same as you.  She just wants more. \n\nAnd start grey-rocking Michael's parents.  They should not be sharing ANY information about you with ANYONE - especially Kathleen.",
   "created_utc": 1701731163,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0rcay",
   "message": "NTA Your child comes first. She should have thought about all of this and made him give her the money. Her kids, her problem.\n\nSuppose some other woman comes around to claim money? You're going to give it to her too? \n\nThis is Michael's problem, not yours.",
   "created_utc": 1701731488,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0rv6i",
   "message": "Her problem is with Micheal not you, if she was getting money from Michael do you think you would be entitled to that money?",
   "created_utc": 1701731696,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0sbu0",
   "message": "This issue is between her and the ex. That money is court ordered for your son. Sorry for her, but it isn’t to do with you",
   "created_utc": 1701731881,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0t1fl",
   "message": "NTA.  He isn’t giving her money for some reason \u0026amp; if you give her a portion he might stop sending you anything at all.   \nDo not jeopardize your situation for her … you can’t set yourself on fire to keep her warm.   \nHer fight is with him, not you",
   "created_utc": 1701732160,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0tpy3",
   "message": "Kathleen's problem isn't with you.  It's with Michael.  You don't owe her anything.",
   "created_utc": 1701732429,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0tztj",
   "message": "NTA\n\nShe has to take this up with Michael. The issue however is that if Michael can be convinced to give her more or whatever, that it will likely be deducted from the money YOU get. So there is still a very real possibility that your life style will end up changing.  \n\n\nHe might not like her, but she is right in the fact that she has TWO kids that she needs to take care of, while you only have one. Normally, you'd expect her to get more money. So when I say NTA, it's not because I'm siding with you. But because it's not your fault Michael gave you more money.  \n\n\nReally, be prepared to receive less money.",
   "created_utc": 1701732538,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc16uh2",
   "message": "The money he sends is child support, and if she’s not getting any from him herself, she needs to go to court.  The money he gives you is for YOUR child’s upbringing.",
   "created_utc": 1701737665,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc17qzh",
   "message": " NTA. That’s a baby daddy Michael problem, not yours.",
   "created_utc": 1701738040,
   "score": 3,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc02bnr",
   "message": "NTA lol cut her off she’s shameless and I wouldn’t be surprised if she’s already getting money sent to her lol",
   "created_utc": 1701722039,
   "score": 7,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0axtc",
   "message": "You're NTA. You're also not the person who owes Kathleen child support. Michael does!\n\nSo sorry, Kathleen! \n\nNow, having said that, any info about Michael's location/bank accounts that you could pass over to Kathleen is perfect 👍",
   "created_utc": 1701725210,
   "score": 5,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzzshl",
   "message": "NTA. If it’s that important to her she can go through the courts for a child support order.",
   "created_utc": 1701721124,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kbzzsl7",
   "message": "Nta. You clearly the favorite baby mama",
   "created_utc": 1701721125,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00b0c",
   "message": "NTA. She needs to go after him for child support.",
   "created_utc": 1701721307,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00eb2",
   "message": "NTA.  You are doing what is best for your child.  That is your only job.  This issue is between Michael and Kathleen, not you and Kathleen.\n\nIt sucks, and I do feel for the other kids, but there has to be a reason he doesn't send money to her.  The only thing he should be doing is making sure he has a college fund for the other two or send their money to his parents to keep - which he may be doing without either of you knowing it.",
   "created_utc": 1701721339,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00rbc",
   "message": "NTA. If she wants money from Michael, that's between her, Michael, and the courts.",
   "created_utc": 1701721471,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc00wx1",
   "message": "NTA\n\nKathleen needs to get her shit together, hire a lawer and file for child support, you don't owe her anything",
   "created_utc": 1701721527,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc01yv5",
   "message": "NTA if she needs money from him she needs to take it up with HIM not you. Also he could stop sending money to you if he finds out you allowed her to have it.",
   "created_utc": 1701721910,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc027x8",
   "message": "NTA.",
   "created_utc": 1701722001,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc02f40",
   "message": "NTA. That’s between her and Michael and maybe the state. Let her sue him for child support. It’s none of your business though she’s trying to make it so.",
   "created_utc": 1701722073,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc02wsk",
   "message": "Let her take hime to court for child support. You have your son and yourself to protect.",
   "created_utc": 1701722251,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc034px",
   "message": "NAH of you and Kathleen; of course Michael is TA in a major way! You are both just trying to do the best you can for your kids. Ultimately, you are not responsible for giving Kathleen money. Michael owes it to her, not you. This was not a windfall or inheritance; this is Michael paying his debt to you (or at least part of it). That he doesn’t also pay at his debt to Kathleen is reprehensible, but irrelevant to the matter at hand.",
   "created_utc": 1701722331,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc03cgu",
   "message": "NTA She shouldnt demand money from YOU but from BD! I wonder why she didnt ask him for the money? Or why isnt he on child suporte? Look if it where the other way around would she give you the money? Plus you need to think whats best for your kid and she need to ask money for the father. Not his other ex!",
   "created_utc": 1701722409,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc03dtu",
   "message": "NTA. Kathleen is a money grubber. You owe her jack. Let her deal with Michael for her own kids.",
   "created_utc": 1701722422,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc03jgw",
   "message": "NTA-Michael’s parents can give her money since they decided to involve themselves.",
   "created_utc": 1701722480,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc03t4h",
   "message": "Ntah lol tell her to pound sand dude, that money is for his kid with YOU. If he’s not sending her money that’s between them and their kids. Ignore her I think.",
   "created_utc": 1701722577,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc03x76",
   "message": "NTA- unfortunately Kathleen needs to confront Michael about this and keep dragging him back to court.",
   "created_utc": 1701722619,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc03zg1",
   "message": "Tell her she is NOT your financial responsibility. \n\nTell her to talk to Micheal and if she won't that's her problem",
   "created_utc": 1701722642,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc04tpy",
   "message": "Nta.  Not your monkey, not your circus. She needs to go to court to get child support..",
   "created_utc": 1701722948,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc04ygt",
   "message": "NTA\n\nDon’t give her shit. The money sent to you is for your kid. She can make her own arrangements.",
   "created_utc": 1701722996,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc057ey",
   "message": "NTA\n\nKathleen needs to sue Michael for child support (whatever that looks like where you live). He's the one who injured her, not you. You don't owe her anything.",
   "created_utc": 1701723085,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0588g",
   "message": "NTA \nThis is between Michael and Kathleen, not your circus and not your monkeys.  \n\nTell her to get it from Michael’s parents since they felt the need to share your private business.  You may want to proceed LV with then, they do not have you or your sons best interest at  heart.  Expect her to cut ties with you and your son.  Your priority is your son.\n\nPS Michael’s parents know how to reach him.  Do not tell them of kitchen how you receive Michael’s $.",
   "created_utc": 1701723092,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc058sw",
   "message": "NTA, if the situation was reversed,I bet she wouldn't give you a dime.",
   "created_utc": 1701723098,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc05ei7",
   "message": "NTA, this is between Michael and Kathleen, you stay out of it! I wouldn’t even bring it up to Michael out of worry he’ll cut some of the money he gave you for her.",
   "created_utc": 1701723155,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc06776",
   "message": "He should be paying child support for all of his kids, and I'm sure she needs the help, but it's not your responsibility to handle that. NAH.",
   "created_utc": 1701723446,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc06jff",
   "message": "Bro isn't that just child support?",
   "created_utc": 1701723569,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc06wwb",
   "message": "NTA. This is Kathleen’s battle with Michael, not yours. \n\n\nIs it unfair?? YES, it absolutely is. But it’s not unfair because of YOU, it’s because of him.",
   "created_utc": 1701723707,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc07ayr",
   "message": "NTA! This is not your problem and you need to say no. There is only messiness and drama to be had if you start redirecting money to your ex’s ex. It’s great that you have a relationship but this isn’t part of it. Kathleen needs to understand that she is in no way entitled to any of the money and you need to be a broken record with Kathleen when she asks. \n\n“No, that’s not going to happen. Get it from Michael.” Repeat over and over as needed, and don’t give reasons like you did here. It’s a no, and it’s not up fur discussion. You had nothing to do with making those kids or maintaining a healthy relationship between the two of them, so why would you pay your part? She is asking for charity and you are never the ah for declining to give it. That money is yours and is used for your son, and that’s that. \n\nDon’t be afraid to put distance in your relationship if she can’t accept your No. Sharing a baby daddy doesn’t equal having a relationship like friendship or family, you are not required to support her any more than a stranger on the street.",
   "created_utc": 1701723854,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0807t",
   "message": "NTA - it’s not your fault that Michael doesn’t support his other children and it’s not your responsibility to give up half the support that your child receives.  Heck, what if Michael finds out and stops sending you any money because he dislikes Kathleen getting some of it!!??? While I understand you feeling bad for Kathleen’s children, your priority and role is to do the best for your son.",
   "created_utc": 1701724113,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc08tbz",
   "message": "NTA. Tell her she needs to discuss this with him and not you.",
   "created_utc": 1701724417,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc09dx9",
   "message": "NTA - she may be already getting money, and just want more from you",
   "created_utc": 1701724632,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0a8v2",
   "message": "Once Michael finds out you are giving away half, it's very possible your child support will disappear. Don't kid yourself into thinking he wouldn't find out, things like this always come out. Stay in you own lane and take care of your son. She can deal with him, it's not your responsibility.",
   "created_utc": 1701724951,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0aag3",
   "message": "Kathleen needs to talk to Michael. Your private sites are just that private. Noneya",
   "created_utc": 1701724967,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0atf4",
   "message": "NTA.  You do not want to get in the middle of Kathleen and Michael’s issues.  This is for them and their lawyers to resolve.",
   "created_utc": 1701725164,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0avxu",
   "message": "NTA Once you start splitting the money with her, she can take you to court to try and force you to keep splitting it with her.    \nMichael is definitely the problem here but that's not your fault and should not be turned into your problem.   \n\n\nAlso she's not \"being generous\" by only demanding half. She has no legal right to demand any of it and it might be a good idea to limit contact with her.",
   "created_utc": 1701725190,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0bboh",
   "message": "NTA.. if he gets wind you are giving her half the money he could stop sending you any.. \n\nThink of your child and let her worry about hers..",
   "created_utc": 1701725355,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0cd8f",
   "message": "NTA. It is not on you to include Kathleen in your arrangement with Michael. You don't have any responsibility to Kathleen and her children legally as harsh as it is that they currently get nothing. Keep focusing on your kid and putting money aside for their future.",
   "created_utc": 1701725749,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0cfkb",
   "message": "NTA, she needs to take it up with the court. However, this is why he moves around. So he can't be tracked to be served. If you feel bad, help her track him down to get him in court.",
   "created_utc": 1701725772,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0ctya",
   "message": "NTA. The court ordered he pay a certain amount for your kid. The amount you get was not meant to be split in any way. That money is for your child and your child only.",
   "created_utc": 1701725923,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0cysq",
   "message": "NTA\n\nThis is not *your* responsibility. Her problem is with Michael so she needs to sort it out with him.",
   "created_utc": 1701725973,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0cz8g",
   "message": "In what universe is this YOUR problem.  Block her.",
   "created_utc": 1701725978,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0d769",
   "message": "NTA. That is a Kathleen/Michael problem, nothing to do with you.  She just wants the path of least resistance, ie take from your son and not have to go after Michael.  Mama Bear, tell her if she wants money, she needs to get child support from him.  Protect your cub’s own interest.",
   "created_utc": 1701726063,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0dgzm",
   "message": "Look at it this way.  Giving her money meant for your son WILL affect AND hurt him.  He is your first and only concern.",
   "created_utc": 1701726167,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0dk98",
   "message": "NTA. If Michael wanted to send her money he would do so, whether she and he got along or not.",
   "created_utc": 1701726201,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0enru",
   "message": "NTA\nHe could probably prove how much he’s sending you.  So if you all wind up in court he’ll have that it went to you.  If you give her part it has nothing to do with him and your support will look pain in full while hers is unpaid. So she can still get all of her money from him eventually and never pay you back.  \n\nYou are two separate families and two separate “debts”.  Hers has nothing to do with you.  You owe her nothing.  \n\nIf his parents think it’s their business to share yours and you should share then they can contribute to her income. They shouldn’t be sharing this information. \n\nAlso maybe if she fostered a better relationship with the dad then maybe she would get money sent to her.",
   "created_utc": 1701726614,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0fcxu",
   "message": "NTA. Its time for her to get a court order for child support",
   "created_utc": 1701726876,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0feuw",
   "message": "NTA.  You are not responsible for all his kids. Only yours. The money is given to you. It's yours and your son's.   What is Michael had other children?? Would she think you are responsible for paying everyone?",
   "created_utc": 1701726896,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0fxsh",
   "message": "I would not entertain one word of conversation with anyone regarding what you receive for your child. \n\nYou could easily say you’ve been advised by your legal team to say nothing.",
   "created_utc": 1701727097,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0fyie",
   "message": "If she wants support from her child’s father, she needs get it from him directly, not from a 3rd party (You)",
   "created_utc": 1701727104,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0g5hw",
   "message": "Tell Kathleen to fuck off and kick rocks. It’s not your fault or problem that your kids father isnt paying side support for HER kids who are your kids half siblings like he is doing with you. Doesn’t make you obligated to ’share’ YOUR kids money with her and deny YOUR kid ‘half‘ of the stuff the money HE needs just so HER kids can be supported off of YOUR sons money. What happens to her and her kids is none of your concern, and you are under no obligation to use YOUR child support money for HER kids just because their dad refuses to pay her the way he’s paying you. in what dream world does she live in that makes her think that would EVER happen that you will deny YOUR kids needs for the money to help HER kids needs? Especially if ‘sharing’ it would leave you barely enough for your kids needs? \n\nits survival of the fittest and first come first served with child support. Not your problem your ex isnt sharing the child support wealth with her, and not your responsibility to ’fix’ for her by denying yourself and YOUR kid the money YOU need for yourselves to survive on.",
   "created_utc": 1701727180,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0gf31",
   "message": "Whatever you're sent from the father of your child is for YOUR child. Any children he has with other women are NOT your responsibility. The mother of children not related to you needs to make her own child support arrangements or take dad to court, you have zero jurisdiction to get involved.  Further, depending where you live, IF YOU make any child support payments to someone else,  even if you have no relationship to them, the courts can use your past payments as evidence that you intended to support those other children and order that you continue to pay, and can even garnish your wages. BE VERY CAREFUL.",
   "created_utc": 1701727280,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0h0t3",
   "message": "Kathleen needs to chase child support from Michael, not you.",
   "created_utc": 1701727513,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0h7p6",
   "message": "INFO:  Why did Michael’s parents feel the need to stir the pot here?  Do they not like you or your child?  How do they know *anything* about your finances?",
   "created_utc": 1701727586,
   "score": 2,
   "submission_id": "18ar70m"
  },
  {
   "comment_id": "kc0ypvq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ar70m"
  }
 ]
}