{
 "submission_id": "18ar30v",
 "title": "AITA for interrupting my(50F) daughter’s(22F) sex because she was too loud?",
 "selftext": "*Burner, so my son doesn’t see*\n\nRecently, my(50F) daughter(22F) was in a car accident, and got out of the hospital 4 weeks ago. She unfortunately lost her leg, but all else is well. She’s very insecure about her injury, and while in the hospital only wanted her ex-boyfriend(23M) to sit with her. She begged him to take care of her while she recovered at home, and he agreed. They broke up the day of, over dumb stuff and are essentially still together which was made clear recently. \n\nThis afternoon, I came home early from visiting family. When I came inside I immediately heard my daughter having sex upstairs. I tried to go into our basement to avoid the noise, but still behind 2 floors and 4 doors I still heard the noises. I waited at least 20 minutes, before I went upstairs, and knocked on the door, and asked them to stop.  \n\nThey Did, but my daughter was embarrassed and I could hear her crying. About 20 minutes later, her boyfriend came out, and apologized, and told me my daughter was not happy at all. I talked to her, and she told me I should have just went outside or something. She’s really upset about it and it has me wondering AITA?",
 "created_utc": 1701715717,
 "permalink": "/r/AITAH/comments/18ar30v/aita_for_interrupting_my50f_daughters22f_sex/",
 "score": 39,
 "url": "https://www.reddit.com/r/AITAH/comments/18ar30v/aita_for_interrupting_my50f_daughters22f_sex/",
 "comments": [
  {
   "comment_id": "kc091it",
   "message": "Nta. If you’re fucking in someone else’s house you keep it down.",
   "created_utc": 1701724502,
   "score": 75,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0pk5d",
   "message": "Very wise to post this anonymously!\n\nNow your son won't know it's you.\n\nHis sister just lost her leg. He's been stressed enough lately.",
   "created_utc": 1701730795,
   "score": 193,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kbzr80y",
   "message": "NTA…her injury has nothing to do with loud sex.  Especially when she’s sharing space with others.  They could’ve been more considerate.",
   "created_utc": 1701718060,
   "score": 230,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0mvtt",
   "message": "NAH. They thought they were alone, so they were loud. Otoh, it's your house and you shouldn't have to tiptoe around or go back out for a walk. I probably would have just let them know I was home by turning on something loud or opening the door and closing it more loudly. Saves everyone some embarrassment.",
   "created_utc": 1701729766,
   "score": 98,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kbzvdvx",
   "message": "My opinion right or wrong here.  I'm going to go with the NAH judgement. \n\nIf I was in your shoes, knowing everything you described in this post, I probably would have went outside or turned around to run an errand or something.  Then, when BF isn't around, maybe let her know that you heard her, and ask if in the future she keep it down knowing others could also be in the house, especially your son (without knowing his age).  She probably didn't realize they were being as loud as they were, and was obviously not expecting you to be home.   Uncomfortable situation for everyone all around, but maybe could have been handled with a little bit more gentle touch (no pun intended).",
   "created_utc": 1701719533,
   "score": 122,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kbzw2eu",
   "message": "INFO : You \"came home early from visiting family\". Was there a prior discussion of your plans for the day with your daughter, where she was expecting to have the house to herself for a longer period of time?",
   "created_utc": 1701719774,
   "score": 57,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0k7sj",
   "message": "She’s just lost a leg??? Maybe she needs some serious counselling to begin with . You can’t think oh well she lost a leg but at least she’s alright . She needs professional support",
   "created_utc": 1701728738,
   "score": 74,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0whn5",
   "message": "This post screams bullshit",
   "created_utc": 1701733534,
   "score": 4,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc117xp",
   "message": "Nta, sure sex is natural but at the same time she needs to show respect for the parents and at the very least keep it down.",
   "created_utc": 1701735380,
   "score": 12,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc03z43",
   "message": "Nobody sucks here. You came home unexpectedly. She thought she and her boyfriend had the house to themselves. I think if I had been in that situation I would’ve found something to do out in the garage or something.",
   "created_utc": 1701722638,
   "score": 29,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc11m7b",
   "message": "*she told me I should have just went outside or something*\n\nYou did, for at least 20 minutes. NTA",
   "created_utc": 1701735537,
   "score": 11,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0y0gr",
   "message": "NTA. As others stated the obvious. When you are a guest in someone's house family or not, you keep the volume down to respectable levels that do not intrude on others PERIOD! IT's called respect.",
   "created_utc": 1701734126,
   "score": 13,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc18rjj",
   "message": "🤥",
   "created_utc": 1701738455,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc19sce",
   "message": "I mean if it’s your house OP then I mean it’s your rules and it doesn’t make you an ah to not want to hear your daughter fucking her maybe ex in your house",
   "created_utc": 1701738873,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc02oly",
   "message": "ESH but like gently, or maybe NTA both ways. I can see both povs. I think your daughter could’ve been more considerate of your space, and asking her ex to be around to take care of her while (assuming) in the presence of family is a lil hefty to ask for. Add having to listen in on their fuck, and that’s even more to ask for from family.\n\nOn the other hand, I think this could’ve been handled more gracefully on your part. Getting interrupted during sex really is really embarrassing unless you’re into that, and your daughter doesn’t sound into that. I’m assuming this was an intimate and special moment for her, even moreso after losing her leg, so having that special moment suddenly stopped could be hard on her.\n\nTldr: daughter needs to be more mindful of shared house, parent needs to be more mindful of smashing. I’d say no one’s really at fault here, it happens\n\nEdit: switched from mom to parent. Idk why I assumed",
   "created_utc": 1701722169,
   "score": 11,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0q1vs",
   "message": "NTA.",
   "created_utc": 1701730986,
   "score": 4,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0tpow",
   "message": "Sometimes you have to put your foot down",
   "created_utc": 1701732427,
   "score": 4,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc10cup",
   "message": "Lost her leg and not In rehab as an inpatient?! This story is fake",
   "created_utc": 1701735036,
   "score": 3,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc15xbq",
   "message": "I'm confused, what does your son have to do with all of this?",
   "created_utc": 1701737287,
   "score": 4,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0oind",
   "message": "#At least you didn't walk in and see her with her leg pinned behind her head.",
   "created_utc": 1701730391,
   "score": 6,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0srb3",
   "message": "NTA. You removed yourself by going down to the basement yet could still hear them going at it. Idc if you came home earlier than expected, it's still your house and you're allowed to come home when you want regardless of what anyone said. Even as a teenager I knew my mum could come home at anytime, it's common sense",
   "created_utc": 1701732051,
   "score": 5,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1354w",
   "message": "all these comments about you being the asshole. ITS YOUR HOUSE. you shouldn’t have to tell people when you’re gonna be home early. your daughter needs to have common courtesy, coming from a 21 year old. you don’t have to go outside or go out of your way to make it clear your home. just because she lost her leg doesn’t mean everything is about her.",
   "created_utc": 1701736150,
   "score": 5,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0s0ps",
   "message": "Someone else’s house? Nah. That’s rude. Keep it down or get a room.",
   "created_utc": 1701731758,
   "score": 5,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0a81t",
   "message": "NTA, you waited and gave her time to stop and she didn't its disrespectful in a cohabitation situation.",
   "created_utc": 1701724943,
   "score": 7,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0wqah",
   "message": "She said YOU should’ve gone outside?! That’s entitled! You should’ve told her next time keep it down, It’s not only her living there. Her attitude is unacceptable. \n\nNTA.",
   "created_utc": 1701733629,
   "score": 5,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0c3vt",
   "message": "\"Came home early\"\n\nYou could have done a U bolt right back out the door and gone for a coffee, a nice walk in the park, literally anything \n\nI know it's your house, but they were obviously not expecting you home at that point.\n\nYTA, just not a big one.",
   "created_utc": 1701725651,
   "score": 7,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0vzc5",
   "message": "Ngl that embarrassment might take away the confidence she had just gained in her body to allow herself to be open that way again.\nYes it's your house but they thought theywere alone so technically she was good to go. I personally would have just gone back out",
   "created_utc": 1701733329,
   "score": 4,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0rx13",
   "message": "There’s a joke somewhere here involving a third leg but I just can’t put my finger on it. \n\nNTA, it’s your house.",
   "created_utc": 1701731717,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0snca",
   "message": "NTA",
   "created_utc": 1701732007,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0x6tp",
   "message": "Absolutely nta",
   "created_utc": 1701733810,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc147ch",
   "message": "Kind of the AH, I mean they waited until you were gone. You came home EARLY and then spoke up when they didn’t sense your presence. I would have slammed a couple cabinet doors or something then gone back down stairs for a bit. It is your house, but she’s an adult and did everything possible to show you respect.",
   "created_utc": 1701736582,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0o6du",
   "message": "NAH but maybe text first",
   "created_utc": 1701730261,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0rchb",
   "message": "Considering how she just had an accident not too long ago, maybe being a wingman and letting her enjoy herself would have been the better option",
   "created_utc": 1701731490,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc11f8j",
   "message": "I'm gonna go with YTA on this one. You came home EARLY from an outing (I'm sure if your daughter knew you were home she would have not been having loud sex.) and you interrupted an intimate moment of your poor daughter who lost her LEG. That might have been the first time she was able to take her mind off that devastating injury and was being reassured that her partner would still find her attractive. (I am speaking as someone who has had internal surgery that left me with a very large 13in scar on my stomach, and was worried about intimacy afterwards.)\n\nHow early did you arrive home? And what was so important you couldn't have put headphones on or made a trip out to grab a drive-through coffee or something?\n\nI bet your daughter is now embarrassed as hell, sad because she lost her LEG, and probably emotionally drained from the whole drama of the breakup in the first place. Just cut the kids some slack. She's going through it.",
   "created_utc": 1701735460,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc13v0k",
   "message": "Whose house is this???  I understand that losing a limb is traumatic and recovery can be difficult, but you don’t lose your manners. She got caught; shit happens.  But to tell you that you should have left your own house?  I don’t think so.",
   "created_utc": 1701736445,
   "score": 3,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc10kkc",
   "message": "\"She unfortunately lost her leg, but all else is well\" \n\n\"She’s very insecure about her injury, and while in the hospital only wanted her ex-boyfriend(23M) to sit with her. She begged him to take care of her while she recovered at home, and he agreed\"\n\n\u0026amp;#x200B;\n\nyea there is definitely something wrong with the way those sentences formulated. What kind of a mother would say she just lost a just a leg like no big deal all else is well, she is just insecure ????  Already weird that your own daughter doesn't even want you around in this critical time even without this event alone\n\nasshole? probably a sociopath instead.",
   "created_utc": 1701735121,
   "score": 3,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0qrfy",
   "message": "I think if my daughter lost her leg, I might let her get some conciliatory dick at least one time.",
   "created_utc": 1701731260,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0n4tz",
   "message": "I would have left. She’s an adult and had a life changing injury, your discomfort could have waited an hour. Way to go. YTA",
   "created_utc": 1701729862,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0uohq",
   "message": "ESH - You really could have gone for a stroll to get a coffee or get groceries. You could have taken one for the team especially at a sensitive time when your daughter lost her leg. \n\nYour daughter on the other hand could have been a little quieter. An occasional \"fuck me hard baby\" scream would be palatable but on a full beast mode in your house is peak entitled behavior.",
   "created_utc": 1701732812,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0wqma",
   "message": "\u0026gt; she told me I should have just went outside or something. She’s really upset about it\n\n\"Okay, so maybe don't scream like a banshee or rip holes in the drywall while you're having sex. You lost your leg, not your manual to basic courtesy rules when you are residing in your parents' house. There's only so long you get to lean on that crutch.\"\n\n...too soon?",
   "created_utc": 1701733633,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc14r33",
   "message": "Not the asshole, she needs to grow the fuck up and get tougher skin. What the fuck is she embarrassed about? She was having LOUD sex. Why would she think she is okay to do that at all in your FAMILY house and NO you shouldn’t have to leave YOUR house when she’s having loud sex.\n\nYou need to talk to her and stop being a pushover. There is being kind and understanding and then there is being a doormat and a sucker.\n\nSHE is in the wrong. You would only have been the asshole if that was their place and you were intruding. She needs to understand that the FAMILY house isn’t where we have LOUD sex and if she can’t not have loud sex, then they need to do it somewhere else. \n\nAs well as how the hell is she not embarrassed having that kind of loud sex anywhere. She’s being ridiculous and she should stop being so entitled and spoiled",
   "created_utc": 1701736805,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0rybt",
   "message": "After all she's been through do you think at all she's trying to feel like her life hasn't changed in other aspects as well? Sounds like she might of needed to feel good instead of focusing on how her life changed to me",
   "created_utc": 1701731731,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0u62s",
   "message": "NAH",
   "created_utc": 1701732607,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc15uvj",
   "message": "Total asshole. She's 22 and you need to get the eff out of the house.",
   "created_utc": 1701737259,
   "score": 2,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc18es0",
   "message": "I think I would have cut her some slack you know? \n\nESH",
   "created_utc": 1701738312,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc10zcc",
   "message": "How sad for your daughter.\n\nWhy did you not just wait until it was over, then ask to speak to her privately? She’s a full adult, who is now an amputee. How traumatic.\n\nSex is very positive for recovery, etc, not to mention her self-esteem. I understand your dilemma, but tbh, what were you thinking would be the outcome when you did that? \n\nThe mention of her injury is so nonchalant, that part of me believes this is a troll post.\n\nBe better than this. You’re her __mother__ not a judicial appointee of the morality police. You were gone, she is an adult, and she needed the contact. Instead, she’s been humiliated.\n\nHow did your daughter enter the world? Was sex involved, or was she conceived immaculately?",
   "created_utc": 1701735285,
   "score": 255,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc153ea",
   "message": "YTA, unless you absolutely needed to be there. If you hear that, leave and discuss it later. Your recently dismembered daughter was having a good time and rather than let her have that moment you decided to ruin it.\n\nWTF is wrong with you and everyone here saying NTA?",
   "created_utc": 1701736946,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0lpbi",
   "message": "YTA. \n\nYou came home early and she has 1 leg. Was this the first time they did it after losing the leg?\n\nYou should have went back outside and sent a courtesy text saying “ hey gonna be home in 20 minutes “  or even 10 minutes. They’d have been able to finish up and no one would be mad or embarrassed",
   "created_utc": 1701729313,
   "score": 250,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0zcpe",
   "message": "YTA\n\nSex should only be interrupted in life or death scenarios. \n\nYou should have talked to her and imposed some ground rules, sure, but let a girl finish.",
   "created_utc": 1701734643,
   "score": 254,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0v9nq",
   "message": "Text \n\nYou text your daughter \n\nPlease text your daughter \n\nYou have a phone?\n\nShe has a phone?\n\nText text text",
   "created_utc": 1701733043,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc17sf5",
   "message": "YTA. You embarrassed your child at an intimate moment when you could have avoided it.",
   "created_utc": 1701738056,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0l8f8",
   "message": "NTA. She can't respect your house she can walk. Don't allow the boyfriend the spend the night.",
   "created_utc": 1701729131,
   "score": 248,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kbzl41u",
   "message": "Yta you made it more embarrassing. Especially since she's feeling insecure about her injury and body.",
   "created_utc": 1701715870,
   "score": 230,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc138ro",
   "message": "YTAH - don’t interrupt. You could have spoken with her privately after if you felt you needed to.",
   "created_utc": 1701736192,
   "score": 253,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc11nxx",
   "message": "I won't call any judgement, Guess they were't expecting You. It's your house yet still they weren't expecting company.\n\nSo, talking would've been fine afterwards, You could've used a headset or earphones and put some music.",
   "created_utc": 1701735556,
   "score": 255,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc12vbg",
   "message": "See I would of shouted up the stairs asking\n\n'Did you wrap it guys, not ready to be a grandmother' 🤭 \n\nThen start to play loud country music 😂",
   "created_utc": 1701736041,
   "score": 0,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0o87z",
   "message": "NTA your daughter is acting spoiled",
   "created_utc": 1701730280,
   "score": 251,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0qsby",
   "message": "Not sure what losing her leg has to do with this.\n\nI wouldn't have done what you did, personally i think YTA.\n\nI'd have just gone out for a walk and spoken to her more sensitively about it later.",
   "created_utc": 1701731270,
   "score": 250,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0qqjm",
   "message": "YTA. She is an adult. You came home early.",
   "created_utc": 1701731251,
   "score": 252,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0z6qx",
   "message": "Lol, a non-AH would at least wait until they're done 😆",
   "created_utc": 1701734579,
   "score": 254,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0s352",
   "message": "YTA. You came home early. Obviously when living with parents ( or roommates even ), you have to wait to have your loud wild sex until the other person/people aren't home.\n\nBetter course of action would have been to stay in the basement, put some headphones and music on, and addressed it later that you heard, ask her to keep it down, and for you to text when you're gonna be home early.",
   "created_utc": 1701731784,
   "score": 251,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0qps0",
   "message": "NTA but high fives to the BF for sure",
   "created_utc": 1701731242,
   "score": 253,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc09be9",
   "message": "It was probably obnoxiously fake moaning 🤣",
   "created_utc": 1701724606,
   "score": 241,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0qxvc",
   "message": "The cool thing to do would to have snuck out and then years later bring it up as a joke.",
   "created_utc": 1701731330,
   "score": 252,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc12ml7",
   "message": "Put in some earbuds, damn.",
   "created_utc": 1701735944,
   "score": 252,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc18f8z",
   "message": "If the sex was consensual and both parties are adults: YTA, for cockblocking.\nIf not, 100% NTA.\n\nJust tell her afterwards that she was too loud....",
   "created_utc": 1701738318,
   "score": 255,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1738t",
   "message": "We all have kneeds",
   "created_utc": 1701737767,
   "score": 253,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0dxil",
   "message": "This is why my dad has noise cancelling headphones..\n\nNothing helps the house shaking, though.. 🤣",
   "created_utc": 1701726339,
   "score": 233,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0wtz4",
   "message": "Am I the only person here who has seen the Lindsey Lohan classic “I know who killed me”",
   "created_utc": 1701733670,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0xlf4",
   "message": "Didn't I already read this?",
   "created_utc": 1701733965,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc0xztw",
   "message": "Not a chance this story is true",
   "created_utc": 1701734119,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc14si4",
   "message": "This post seems oddly similar to another one where the daughter lost a leg through a car accident as a result of her friend driving after a night out, and the bf became a full time carer, even though the daughter didn't really want him, but wanted to be with someone else, and was just abusing the bf ad a full time carer even though he was still studying",
   "created_utc": 1701736822,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc17eca",
   "message": "NTA-your adult kid has a lot of balls having loud sex in her parents house knowing they could come home at any time, and that’s from someone who lived with their parents til they were 27.",
   "created_utc": 1701737897,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc187o4",
   "message": "NTA \n\nBut next time maybe send a TEXT saying “home in 1”\n\nAnd walk out and bang the door loudly as you walk back in!",
   "created_utc": 1701738231,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc189j6",
   "message": "I mean it's kinda weird to just focus on them having sex instead of ignoring it? Like did you actively try to distract yourself or did you go into the basement and just stand around? There is also headphones/ ear buds, or just making noise yourself like maybe go flush the toilet or slam the door. I wouldn't want that embarrassment if I thought I'd have more time alone with my fiancée. Nobody sucks here or everyone does.",
   "created_utc": 1701738252,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc195iy",
   "message": "NTA - Don't have loud and obnoxious sex when the walls are paper thin, keep it at least marginally quiet in order to respect the poor ears of others",
   "created_utc": 1701738613,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc19dnl",
   "message": "NTA",
   "created_utc": 1701738705,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc19j3p",
   "message": "NTA - You and your daughter’s boyfriend need to have a candid conversation about what went on. Let him know that you don’t appreciate that kind of intrusive behavior in your house. Keep your daughter out of the conversation. She can listen from her bedroom while the two of you talk it out in the kitchen.",
   "created_utc": 1701738768,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1bcoa",
   "message": "It's your house. She can go elsewhere for the sex if she can can't control herself.\nNTA",
   "created_utc": 1701739518,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1c4kk",
   "message": "I’m actually going to go with YTA. You knew what your daughters been through, they OBVIOUSLY didn’t think anybody was home. I’m unsure where you could have gone, but knocking on the door and telling them to stop was definitely humiliating.",
   "created_utc": 1701739836,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1cedx",
   "message": "You conveniently left out IF your house rules permit recreational sex. EX! Boyfriends in her bedroom.\n\nSo either way YTA.\n\nThis is not what they meant when they said she'd need REHAB. And her wound is barely fcking healed.\n\nStart counting her opiates.",
   "created_utc": 1701739950,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1cg7r",
   "message": "YTA\n\ncould you not have waited till they were done and let them know?\n\ngo for a walk?",
   "created_utc": 1701739971,
   "score": 1,
   "submission_id": "18ar30v"
  },
  {
   "comment_id": "kc1cm1x",
   "message": "My daughter lost her leg... Let's talk about her steamy loud sex because this is definitely my main concern 😂",
   "created_utc": 1701740039,
   "score": 1,
   "submission_id": "18ar30v"
  }
 ]
}