{
 "submission_id": "18ar9nb",
 "title": "AITAH for wanting to divorce over a surname Update",
 "selftext": "A quick update as my DM's were full of requests.\n\nFrom the advice given on here I contacted the registration office and they told me that as long as you are married only one parent is needed for the name registration. I wanted to appeal to her better nature and got her, mine and her exes parents involved.\n\nHer sister tagged along for this mediation/discussion. Turns out my parents (and my three siblings via groupchat) are the only ones that agreed with me on either my surname or her maiden name. Her parents and sister (also her other siblings via groupchat ) agreed with her, saying I should do it as she was the one that carried her. Surprisingly her exes parents thought it would be a nice gesture to name my daughter with their surname and to my shock revealed the first name I agreed to that was her suggestion (which wasn't a female variant of her exes) was the name her ex wanted to name their child if they had had a girl instead. She blushed when that piece of information got out when I called her on it. I asked her if it would be fair to name our daughter after one of my exes to which she replied that I only had a body count of three and that two had the same name and both names were ugly. When everyone left I tried to reason with her but she slammed the bedroom door in my face and locked it.\n\nDuring the discussion with the parents I tried asking her exes parents if they would be ok with me naming their grandson after me after I adopt him and they said they would never allow either (adoption or name change). When I asked them if it was fair for my daughter to have their name they said they felt their grandson was closer to his sister than I was to her as a father and both should have the same surname. They also ridiculed my choice in both first and middle name for my daughter in addition to my surname. This is a couple that I up until that point had a reasonably good relationship with. I raised their grandson as my own and was very surprised that this is how they felt about me.\n\nIn the morning she didn't come out and I left her breakfast by the door. Hoping she would calm down enough by the time we would register to discuss it as adults. A few of her friends phoned and asked me why it was so important for me in the year of 2023 to give my surname to my child. I explained my side and why I had reservations. They still felt I was being unreasonable.\n\nOn the Tuesday before the name appointment (Thursday) she picked a fight with me and said she was going with her original name (female version of her ex). She went as far as saying that she would rather unalive herself than give HER DAUGHTER my name. So, I am a little ashamed about this but as I pictured that she would no longer be in my future I called the police on her saying she threathened to commit suicide. I am not proud of this, They came and took her despite her protesting she was ok and it was only said in the heat of the moment. I guess I egged on the police telling them it could be PP and that I felt it was not safe for her to be around our baby.\n\nI registered the name on my own without her blessing and participation. She was still not released by then. Our daughters first, middle and surname are all chosen by me. She obviously has some unresolved issues and I hope she gets the help she needs. There is something wrong with her as she instructed her exes parents to collect her son and my daughter to look after via her sister until she could get out. When her exes parents came by and tried to take the baby I told them to fuck off. They threathened with police and I told them to go ahead. So they left with their grandson.\n\nHer parents came by during the weekend and wanted the baby to take to her telling me not to be difficult. I told them no. We had a visit by a health visitor and the midwife. When she was released she didn't come home  and went to her parents. She has been there since, although she tried twice to take the baby from me (I changed the locks). She did drop off expressed milk for the baby, and has continued to do so via her sister.\n\nI contacted a solicitor for the divorce and for now I am keeping the baby as even the health visitor said that social services are going to get involved due to her mental state and I am the better option for care for now.\n\nThere is no saving my marriage and I doubt she ever loved me with other things that have come out since then. I will always  love her son and and hold out hope that some day when he is old enough to make his own decisions he will seek me out, but as my solicitor put it don't hold your breath for that to happen.\n\nMy older brother and his wife are staying with me to help out for now (Their children are all teens and they have done this new baby thing five times and all their children made it to teenhood, so I am listening to all their advice).\n\nSo there it is.\n\nOriginal: [https://www.reddit.com/r/AITAH/comments/17zrdcl/aitah\\_for\\_wanting\\_a\\_divorce\\_because\\_of\\_a\\_surname/](https://www.reddit.com/r/AITAH/comments/17zrdcl/aitah_for_wanting_a_divorce_because_of_a_surname/)",
 "created_utc": 1701716195,
 "permalink": "/r/AITAH/comments/18ar9nb/aitah_for_wanting_to_divorce_over_a_surname_update/",
 "score": 88,
 "url": "https://www.reddit.com/r/AITAH/comments/18ar9nb/aitah_for_wanting_to_divorce_over_a_surname_update/",
 "comments": []
}