{
 "submission_id": "18ar3t8",
 "title": "AITA for asking my mom’s BF to not stay over after my baby is born?",
 "selftext": "Hey y'all, so I’m about to pop at 36 weeks (yay me... and my aching back 😅).\n\nHere’s the sitch: I'm living with my mom, who’s almost 40yo, and my two lil bros, 5 and 7. My plan was to move out with my fiancé before our little one arrived, but now it's looking like a summer move at the earliest. I'm not working atm but helping out by babysitting my bros while mom works extra shifts.\n\nNow, mom's BF is pretty chill. He's over a lot, like all weekends and some weekdays too. Here's the thing – his smell is seriously messing with me these days (pregnancy nose is no joke 🤧), and I kinda feel like it'll be too much when the baby's here. So, I asked mom if he could hit pause on sleepovers for the first few months post-baby. She was kinda understanding at first, but then hit me with the \"if you don't like it, pay your own bills get your own place.\" Ouch, right?\n\nWe ended up in a bit of a shouting match, which I hate, but I just think the tiny apartment's gonna feel even smaller with a newborn, and having extra space (and air) without her BF around would help. It also just seems fair cause I’m not allowed to have my fiancé stay over on account of my bros. But she's making it sound like I'm being selfish or something.\n\nI get that it's her house, but it's also about to be my baby's house, and I thought maybe that counted for something? Idk. I don't wanna be a brat about it, but I'm honestly just tryna do what feels right for my baby.\n\nSo, lay it on me – AITA here for asking for a little BF-free zone after I give birth?",
 "created_utc": 1701715774,
 "permalink": "/r/AITAH/comments/18ar3t8/aita_for_asking_my_moms_bf_to_not_stay_over_after/",
 "score": 193,
 "url": "https://www.reddit.com/r/AITAH/comments/18ar3t8/aita_for_asking_my_moms_bf_to_not_stay_over_after/",
 "comments": [
  {
   "comment_id": "kbzp8ho",
   "message": "Wait, wait, wait... you don't pay your mom any rent, but she pays you to watch your siblings while she's out working to pay the bills?  \n\nThat's very sweet of her -- let the woman have her boyfriend over whenever she wants!  \nShe deserves it (especially since you said he's chill).  \n\n**Look to your fiance to fix the situation, not your momma.**",
   "created_utc": 1701717351,
   "score": 143,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzqhkn",
   "message": "YTA. Your entitlement is appalling! Don’t like him staying over? Get your own house! It’s not your baby’s house. It’s your mom’s and she’s being generous to let you stay there.",
   "created_utc": 1701717797,
   "score": 112,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzwkq0",
   "message": "Oh, I thought I was in r/choosingbeggars for a second\n\nYTA",
   "created_utc": 1701719956,
   "score": 147,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc00neg",
   "message": "You’re living rent free at her house and you got pregnant. She’s 40 and your bros are 5 and 7 so I’m guessing you’ll be a youngish mom unless your mom had you when she was like 16 or something….\n\nEither way, you are the one that got pregnant and your mom is allowing you to live rent free at her house… you sound like an incredibly entitled sponge",
   "created_utc": 1701721431,
   "score": 239,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbznr2s",
   "message": "YTA, Your trying to tell your mom how to run her home and trying to pull the he can't stay if mine can't stay thing. mom's house, mom has full say on anything that goes in her house.",
   "created_utc": 1701716816,
   "score": 119,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzpzui",
   "message": "yta.    she's 100% right.   \n\nand jesus.  \"mom, I think your boyfriend smells.  please tell him not to come to YOUR home, while my baby and I sponge off of you. \"",
   "created_utc": 1701717624,
   "score": 13,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzo2q0",
   "message": "\u0026gt; I get that it's her house, \n\nYep\n\n\u0026gt; but it's also about to be my baby's house\n\nNope.\n\nIt sounds like you're just looking for an excuse to keep the BF away.  If you think smell is an issue, wait until your baby starts on solid food.  Would it be okay to kick you out because of that?\n\nYTA",
   "created_utc": 1701716932,
   "score": 46,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzteaz",
   "message": "YTA. Go stay with your baby daddy.",
   "created_utc": 1701718831,
   "score": 210,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzuyg4",
   "message": "YTA. It’s her house, if you don’t want people over then get your own place. If you are your fiancee can’t afford a place together you should have waited to have a baby until you can afford things on your own.",
   "created_utc": 1701719386,
   "score": 94,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0b1xj",
   "message": "YTA. ~~INFO: how old are you and the fiance?~~\n\nEdit: Nevermind, read through your old posts. So you're 19, living at home, don't live with your fiance, seemingly plan to keep your baby, don't pay rent, groceries, utilities, etc, and just expect to boss your mom around in HER house and decide for her who can and can't stay? YTA. Get your own place, stop mooching, step up and be an adult.",
   "created_utc": 1701725253,
   "score": 14,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzsuf0",
   "message": "YTA. Not your house, not your rules. Time for you to grow up a lot.",
   "created_utc": 1701718633,
   "score": 62,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzp7ps",
   "message": "YTA\n\nMom is letting you stay and you want to ban her bf?",
   "created_utc": 1701717343,
   "score": 57,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzxdl2",
   "message": "Pregnant moocher wanting to lay down her rules in her mother's house \u0026amp; gets upset when she doesn't get her own way. Of course she's an AH",
   "created_utc": 1701720241,
   "score": 56,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzwhvs",
   "message": "No, it's actually not going to be your baby's house soon. It will still be your mother's house, and both you and your baby will be living there thanks solely to her generosity.\n\nDon't be a choosy beggar. Your mother's right, if you don't like it, get your own place.\n\nYTA.",
   "created_utc": 1701719928,
   "score": 129,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzqj0n",
   "message": "You're screwed, no job, no place to live but your mother's home (where does the baby's father live?).  I suggest you wear a mask with a slight perfume to offset the BF's smell.",
   "created_utc": 1701717811,
   "score": 46,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc04g1n",
   "message": "YTA. It’s not your house or your baby’s house at the end of the day, your mom is helping you by letting you stay at her house, rent free Im assuming, you don’t get to tell her who is or isn’t allowed at her home. \n\n\n“ ‘If you don’t like it, pay your own bills and get your own place’ ouch, right”\n\nYeah truth hurts",
   "created_utc": 1701722810,
   "score": 48,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzm9qq",
   "message": "Yeah, YTA. She’s completely right. It’s her house and you can move out if you don’t like it",
   "created_utc": 1701716282,
   "score": 129,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzm369",
   "message": "Yes YTA.   It’s not your place.  You wanna make rules? Get your own place.",
   "created_utc": 1701716217,
   "score": 83,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzybqk",
   "message": "YTA. Her home, her bf. She is correct, if you don’t like it, you can move out. You sound extremely young and naive on how the real world is. This baby is gonna give you a major wake up call.",
   "created_utc": 1701720588,
   "score": 40,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzmf7h",
   "message": "I'm sorry but you know your the asshole. Your mom is letting you stay in her house without paying bills. Her BF can come over when ever she wants him too. You need to move into your own place to make the rules. You're coming off as entitled. YtA",
   "created_utc": 1701716337,
   "score": 53,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ad6t",
   "message": "\u0026gt; But she's making it sound like I'm being selfish or something.\n\nBecause you are... You are the one who got pregnant while being unable to house or provide for a child. .beggars are not choosers.",
   "created_utc": 1701724995,
   "score": 28,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc00391",
   "message": "YTA. You're not concerned with your baby's safety or wellbeing here, you're concerned about your own comfort and that of your nose. \n\nYour mother can invite anyone she wants to her home, just as you will to your own home.",
   "created_utc": 1701721231,
   "score": 24,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc078ie",
   "message": "YTA. \nIt’s her house.  Not yours, not your baby’s. \nYou live there rent free and don’t work. You expecting your mom to take care of your baby too?\n\nSounds like it’s time for you to grow up.",
   "created_utc": 1701723828,
   "score": 20,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0cgea",
   "message": "YTA\n\n\u0026gt;but then hit me with the \"if you don't like it, pay your own bills get your own place.\" Ouch, right?\n\nShe's right.\n\n\u0026gt;but it's also about to be my baby's house\n\nNo. You don't pay rent, you're just staying there. You are not putting a roof over your baby's head, your mother is. Sorry, you're being a brat. If you don't pay, you don't get a say.",
   "created_utc": 1701725781,
   "score": 22,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ibcx",
   "message": "YTA\n\n\u0026gt;I get that it's her house,\n\nThis. \n\n\u0026gt;but it's also about to be my baby's house, and I thought maybe that counted for something?\n\nNo.\n\n\u0026gt;It also just seems fair cause I’m not allowed to have my fiancé stay over on account of my bros.\n\nAgain. It's not your home. Your mother can do whatever she want in her home. You are a bit paying guest.\n\n\u0026gt;I'm not working atm but helping out by babysitting my bros while mom works extra shifts.\n\nTo pay for your stay, because you don't pay.",
   "created_utc": 1701728009,
   "score": 19,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzmyr7",
   "message": "YTA. \nFreeloaders don’t get to make rules",
   "created_utc": 1701716530,
   "score": 56,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ayg9",
   "message": "I suggest you demand your fiance get you and your baby a home with space and air.\n\nWhilst you are living with and off your mother, you don't get a say in anything.  The only reason she is doing extra shifts is to keep you and your baby, so please don't attempt to suggest you are contributing you are not.  You are causing your mother to have to spend more time away from her young children to finance your decisions. \n\nToo right she doesn't need your fiance living with and off her too. \n\nJust because you'd decided to get pregnant and have a baby your mum is having to pay for doesn't mean you get any say, at all in how things are run in your mum's home, where you live for free. \n\nShe's right, if you don't like the smell, and you need more space and more air, you and your fiance provide it for yourselves. \n\nYou are not your mothers equal just because you' and your equally irresponsible fiancé have produced another mouth for her to feed, cloth, and house.\n\nYour delusion is truly assholish.\n\nYta",
   "created_utc": 1701725216,
   "score": 19,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc05ff7",
   "message": "Lmfao not you telling your mom what to do in her own house. Get a grip. YTA.",
   "created_utc": 1701723165,
   "score": 18,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc039oo",
   "message": "Yta. This reads like it was typed by a kid. That baby is doomed.",
   "created_utc": 1701722381,
   "score": 35,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0c29y",
   "message": "YTA. It’s her house and she pays the bills. You’re being an entitled shrew",
   "created_utc": 1701725634,
   "score": 17,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0cz8z",
   "message": "OP, if you can't afford to house yourself - what in the world are you doing have a baby?  The apartment is too small - you are very, very lucky that your Mom is generously allowing you to stay there.  Where is this fiancee of yours in all this?  Why doesn't he step up and help you with housing?\n\nYou saying that your Mom's bf smells and thats why he can't stay - seriously OP.  You don't say how old you are, but you are about to become someone's mother and you have a lot of maturing to do in a very short space of time.\n\nDid it ever occur to you that your mother might not be happy with sharing a space with you and a newborn in a small apartment?  Yet, all you do is show ingratitude and demanding that she rearrange her life around your life.\n\nTake alook around your Mom is supporting you, a soon to be infant, two small children and herself by working not only one but two jobs while you have no job.  I would suggest you get you happy butt up and find a job and start bringing in some income into the household - yes OP pregnant women do work.\n\nDo you have any idea how much diapers cost?  Educate yourself.  Who is going to be paying for those diapers, the baby food, the baby clothes, the baby equipment, the baby's doctor appointment - is jobless you going to be paying for the baby's expenses.  No, that would be your overburdened mother with two jobs and three kids of her own now having to shoulder responsibility for your child OP.",
   "created_utc": 1701725978,
   "score": 14,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc03fk0",
   "message": "His smell?  Stick Vicks in your nose.",
   "created_utc": 1701722440,
   "score": 13,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc07icq",
   "message": "YTA \n\nYou sound very disrespectful and ungrateful, your mother is allowing you to stay in HER home you are engaged and about to have a baby, grow up and start respecting your mother who is giving you a roof that your fiancé isn’t providing.",
   "created_utc": 1701723932,
   "score": 13,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc07il9",
   "message": "Wait till that first nappy change🤣🤣🤣",
   "created_utc": 1701723934,
   "score": 13,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0gj5p",
   "message": "YTA.  Lemme get this straight…your baby daddy can’t afford a place for you and his kid and you’re trying to make the rules in someone else’s home that you’re bringing another person to live in?  Are you shitting me?  Tell your baby daddy to get a second job and go find a place you can breathe at princess.",
   "created_utc": 1701727323,
   "score": 12,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzv40p",
   "message": "YTA your mooching off your mother. You don’t get to decide who comes to her home. If you don’t like her visitors then your mom is right get out and start paying your own bills.\n\nAnd after the baby is born it’s still isn’t your baby’s home it is still your mothers home.",
   "created_utc": 1701719437,
   "score": 23,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzwo9t",
   "message": "YTA --not sure how you actually typed that without realizing???  If you aren't happy at your mom's then move in wherever your bf is living and problem solved.",
   "created_utc": 1701719990,
   "score": 11,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc08s8j",
   "message": "YTA. Not your house nor your baby’s, not your rules. You don’t have a job, you don’t pay bills. You live there rent free. You sound entitled. What makes you think you have ANY right to tell your mother what can happen in her home?",
   "created_utc": 1701724405,
   "score": 11,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0cpqk",
   "message": "Not your baby's house.It is the house your mother lets you and your baby live in...\n\nBIG difference.\n\nYour mom is working extra shifts.I wonder why.\n\nAnyway, what is right for your baby is for baby's parents to get their shit together and provide a home.  \n\n\nYTA",
   "created_utc": 1701725879,
   "score": 11,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzxzal",
   "message": "Move out. You can't tell your mum who she can and can't have at HER house",
   "created_utc": 1701720462,
   "score": 10,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ha05",
   "message": "Where is your fiancé in this? Why can’t you live with him?\n\nYou’re 19, about to have a baby, living with your mom.\n\nYou need to grow up ASAP! Maybe you should pay rent and part of the bills to get a cold dose of reality. Your mom is paying for you, your unborn child, and 2 young children. \n\nSit down and have your mom pull out her bills. Compare it to her paycheck. Then, do the same with your paycheck, oh wait!\n\nYou are in no position to make demands when you watch a 5YO. The 7YO should be in school.",
   "created_utc": 1701727611,
   "score": 10,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbzuq91",
   "message": "YTA! The sheer audacity of this generation is astounding! Ma’am that’s not how the world works! If you’re a guest in someone’s home you don’t make the rules, you follow them! 🤦🏽‍♀️",
   "created_utc": 1701719305,
   "score": 23,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e9b5",
   "message": "YTA.  I can already tell how insufferable you are by your username and the fact that every single post you've made is about you being pregnant.  Go off #MamaBear.     If you want to set the rules, you should have fucked a dude with a house, or get your finances in order and buy your own.",
   "created_utc": 1701726463,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0i67i",
   "message": "YTA. You're acting extremely entitled to a house that isn't yours.",
   "created_utc": 1701727953,
   "score": 9,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc012zr",
   "message": "YTA. It's your mom's house and she can have whoever she wants over. If you're not paying the rent or any bills, you get no say.",
   "created_utc": 1701721588,
   "score": 9,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc07gyj",
   "message": "YTA and a choosy little beggar.",
   "created_utc": 1701723917,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc09nmg",
   "message": "YTA. The audacity! You are free loading off your mother and now trying to dictate who she has over? Nope, not happening. Find your own place, pay your own bills, and you can decide who gets to visit.",
   "created_utc": 1701724734,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e7vs",
   "message": "YTA. Person who pays the bills rules the Republic. You need to pay equal share to have a vote.",
   "created_utc": 1701726448,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0g0h1",
   "message": "Beggars can’t be choosers.\nYou are living in a home due to your mother’s kindness. \n\nYou do not ever get to dictate the rules in a home which you are a guest in.\n\nYATAH an entitled one at that. STFU or GTFO.",
   "created_utc": 1701727125,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0iajx",
   "message": "Gawd. Girls getting pregnant whilst still children themselves. Mother only 40 with 3 kids and a boyfriend...all crammed into 1 apartment...living off the \"skin of an oilrag\" as they say ...this is just all so damn sad. Just utterly tragic.",
   "created_utc": 1701728001,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0pge2",
   "message": "You think your nose is sensitive now. Wait till your baby starts solid foods. Anything that comes out of your baby's rear end from that point on is going to smell like dumpster garbage that's been marinating in in a dumpster in the sun for 6 weeks and followed with being cooked on a hot tin roof in the blazing summer sun.\n\nWhen this time comes, I hope your mother asks you to stay out of the house for a few months until the baby no longer smells.\n\nYou don't pay money towards rent, utilities, or groceries. Sounds like you are staying there completely free of all responsibility. If you don't want her stinky bf around, put on your big girl panties and go live somewhat else.\n\nEven though you've been watching the other 2 kids, the response from mom about going to live somewhere else tells me that she's not hard pressed on being able to find a sitter if you left. \n\nPlus, I don't think you understand that you babysitting every once in a while when your mom grabs an extra shift probably doesn't even cover the cost of what your equal share in rent would be. Let along cover the cost of your use of gas, electric, water, and the food you consume. \n\nYou're right. It is her house, which you FINANCIALLY do not contribute to. You are completely an entitled gaping AH.",
   "created_utc": 1701730756,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc01nii",
   "message": "Boyfriend might decide to do less sleepovers all on his own with a newborn in the house.",
   "created_utc": 1701721794,
   "score": 14,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc06l1d",
   "message": "Ouch?  It's the truth.  Biggest blessing I ever received was getting to live with my dad while pregnant/raising a baby.  You should be kissing her ass daily girl.  YTA.\nRegarding the boyfriend's smell, talk to him directly.  If he's ever been around anyone pregnant, he should have some understanding.  Maybe he will voluntarily make himself scarce.  But to demand anything from anyone like that is rude as hell.",
   "created_utc": 1701723586,
   "score": 14,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc06wm1",
   "message": "What type of \"smell\" are we talking about?  Is it a lack of hygiene, a dietary preference, products he uses...?  Is this something only you seem to notice or do others?  \n\nIn any case, YTA for attempting to think the solution is banning him rather than to potentially address the smell.",
   "created_utc": 1701723705,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc08i2t",
   "message": "Put a smear of mentholatum under your nostrils like one would at an autopsy. YTA",
   "created_utc": 1701724300,
   "score": 7,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc08rs1",
   "message": "\u0026gt;I get that it's her house\n\nApparently you don't, because if you did, you wouldn't be trying to dictate who she's allowed to have over.    \n\nYTA.",
   "created_utc": 1701724400,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc095e9",
   "message": "I mean she’s right lol you can’t dictate who she allows over in her open house YTA",
   "created_utc": 1701724543,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0b5dy",
   "message": "YTA- stop, before you talk yourself out of a roof over your head. You’re overstepping, being entitled and you’re wrong. \n\nPregnancy nose isn’t an excuse to act up, in any case it goes after birth. Your mum has been very gracious, quit while you’re ahead!!!",
   "created_utc": 1701725289,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e2oo",
   "message": "YTA.  \n\nYour mom pays the rent.  She's working extra shifts to pay the rent and support you financially.  She gets to make the rules.\n\nYou have no standing or agency to dictate whether or not her BF can stay there.\n\n\u0026gt;I get that it's her house, but it's also about to be my baby's house, and I thought maybe that counted for something?\n\nNice try, but no.\n\nIf you want to do what feels right for your baby, get your own place and then you can make up all the rules you want.",
   "created_utc": 1701726394,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ig98",
   "message": "YTA. I have lived with my mother (step dad and brother) whilst pregnant for 6 months whilst my husband settled into a new work role and found an appropriate rental, and then again 18 months  later for a few weeks after we relocated AGAIN for my husband’s work because we needed a pet friendly place in Melbourne. I paid board and helped with chores both bloody times. I certainly didn’t dictate what she could and couldn’t do in her own house. If I didn’t like it I could have left. You are leeching off your mother.",
   "created_utc": 1701728061,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ivwd",
   "message": "Also to add….heightened sense of smell goes away post baby.  Your mum is right. Her house that you don’t pay rent in? You have no right to say he can’t be around especially as he seems like a good guy. YTA",
   "created_utc": 1701728229,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0pt5d",
   "message": "YTA, not your house. You dont pay bills, and you make money to babysit as she works to support you. Stop demanding ANYTHING from her, at all.\n\n\u0026amp;#x200B;\n\n\"Ouch, right?\" -- umm no. If you dont like it, you CAN pay your own bills and support yourself and your child.\n\n\u0026amp;#x200B;\n\nYou need to go apologize, gravel, beg for forgiveness, and tell her you understand how much she is giving up for you.",
   "created_utc": 1701730891,
   "score": 7,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc03nl0",
   "message": "Yeah I get your concerns but it is her home and she calls the shots.",
   "created_utc": 1701722521,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc04ngi",
   "message": "YTA your crashing for free deal with her bf or move out",
   "created_utc": 1701722885,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc07pf1",
   "message": "Unless you are paying rent and bills, then you get no say. YTA.",
   "created_utc": 1701724003,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc07t32",
   "message": "YTA you have no say in who your mother has in her house and if you don’t like\nHis smell you can find somewhere else to live",
   "created_utc": 1701724040,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc086qj",
   "message": "It’s your nose that’s bothered, not the baby. YTA and the entitlement!!",
   "created_utc": 1701724181,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0iood",
   "message": "You are about to have a baby, don't have a job, live with your mom who pays for everything and you think you have a right to tell your mom's bf that he can't come over? Girl you are out of your mind.",
   "created_utc": 1701728151,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0t2tj",
   "message": "YTA \n\nThe baby probably won't notice or care. It's not going to stop being your mom's house when the baby arrives either. Your mom is 100 percent correct to tell you to leave if you don't like it. \n\nHe can't be smellin too bad since your mother is sleeping with him so it's probably just pregnancy side effects messing up your sense of smell. If it bothers you that much then you and fiance should get your own place sooner.",
   "created_utc": 1701732176,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0f5k8",
   "message": "You chose to get pregnant at 19 while living with your mom and having no job. Be grateful your mom is allowing you to stay in her home without paying any bills or rent, be grateful you’re not in shelters or working a minimum wage job. You’ve had plenty of time to- 36 weeks to be exact, to find a job to save up for when your child comes. You did not do this. You are about to become a mother. You will be 100% responsible for everything to keep this child alive and healthy, but seem woefully unprepared. Stop fixating on how many people are in your mom’s house and start worrying about what’s about to happen in 5 weeks. This is the time to grow up. No one owes you anything. But you’re about to owe everything to the child you chose to bring into this world. It’s time to stop posting Reddit baby bump selfies and worry about the cost of diapers, formulas, and onesies. YTA.",
   "created_utc": 1701726798,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ht3i",
   "message": "YTA. You’re living there rent free and you expect her to not let her bf stay over? You didn’t say how old you are so there’s not really any context. Why not move in with your fiancé instead?",
   "created_utc": 1701727814,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0hvl2",
   "message": "YTA\n\nIf you want to control the comings and goings of guests, you'll need your own house. Not something you can ask of someone where you're staying free.",
   "created_utc": 1701727840,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0i99z",
   "message": "YTA- It's her house, not yours. She can and should have over whomever she pleases so long as they aren't harming anyone, and you not enjoying his scent is not harm. Live with it or get out.",
   "created_utc": 1701727986,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0kh1b",
   "message": "YTA. Get it together.",
   "created_utc": 1701728837,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ppny",
   "message": "Yeah YTA.  It really doesn’t matter how you try to twist it.  It is your mom’s house and she has a right to do things the way she wants.  You should deal with it until you move.",
   "created_utc": 1701730853,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0tdmk",
   "message": "YTA sorry. When you have your own place you can dictate who comes and goes. I don't think everyone's going to be very happy about having a screaming baby in the house either.",
   "created_utc": 1701732294,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0vv3x",
   "message": "YTA\n\nUnfortunately you seem to have fallen into the \"my baby should come before all others\" mindset which brings with it a profound sense of entitlement that quickly washes away after the third night in a row with no sleep",
   "created_utc": 1701733282,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kbztqb0",
   "message": "YTA as it’s your mom’s house and this her say in you can and can not stay there.\n\nLike she said, if don’t like it, then get your own place.",
   "created_utc": 1701718950,
   "score": 8,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc05iri",
   "message": "It's her house.... her rules go. \n\nWork harder and move out.",
   "created_utc": 1701723199,
   "score": 9,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0cww7",
   "message": "Move out. You have no say in your moms house. You thinks she wants to raise another baby at 40? Get out.",
   "created_utc": 1701725953,
   "score": 7,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc036u4",
   "message": "Not your house so not your place to set rules.\n\nYTA",
   "created_utc": 1701722352,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc07oel",
   "message": "YTA. She is paying the bills and she is entitled to have her boyfriend over in her own house. \n\nNewborns don't take up a lot of room, they're either gunna be in someone's arms getting cuddles or in somewhere safe for them to sleep. \n\nYour nose sensitivities should stop after you give birth anyway.",
   "created_utc": 1701723993,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc097ki",
   "message": "YTA. If you don’t want him around after giving birth you need to move out. You’re in her house presumably for free. You don’t get to make the rules about overnight guests here.",
   "created_utc": 1701724566,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0fe67",
   "message": "😂😂😂😂. You’re right - the place is small and about to get smaller. So you should definitely get out. YTA",
   "created_utc": 1701726889,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0g174",
   "message": "So your Mum is working extra shifts and your telling her that she can't relax with her boyfriend after everything she has done and is still doing for you? Dude you're the AH. You maybe pregnant, and babysitting, but try thinking about what your mum's going through right now.",
   "created_utc": 1701727133,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0gbi9",
   "message": "YTA Aside from the sheer audacity of even asking that…your “pregnancy nose” might disappear after the baby is born.  I had an awful metallic taste in my mouth that went away within hours of delivering my daughter.",
   "created_utc": 1701727242,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0htb5",
   "message": "YTA. Time to figure it out, sweetie. You’re that baby’s mother, not your mom.  Your pregnancy nose goes away the second pregnancy does, so that’s a bullshit excuse. If you don’t want someone in your home… get your own home.",
   "created_utc": 1701727816,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ingd",
   "message": "This is a joke, right? YTA. \n\nShe’s right - move out.",
   "created_utc": 1701728138,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0jro7",
   "message": "YTA. It’s your mom’s house and she’s graciously allowing you, your fiancé, and your soon to be newborn to live there rent free. \n\nYou need to be kissing her feet. She has the right to bring anyone she wants into HER home. If she wants to being a crew fresh from a fishing boat that just ate garlic roasted baked beans and have them set up shop, it’s HER HOME. \n\nYou need a reality check.",
   "created_utc": 1701728565,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0jy18",
   "message": "The only two words you wrote here that matter is \"Her house\".",
   "created_utc": 1701728634,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0jzfh",
   "message": "YTA. \n\nIt is not your house. You are a guest crashing at your moms house with the intent being to help you get on your feet and *independant* as an adult starting their own family. \n\nYou are using resources in the home (food/utilities)  but not contributing to the price of those resources. \n\nYou do not have a job, the only contribution you are making is babysitting the younger siblings while your mom works extra hours (presumably to pay the increase in bills your presence has created.)\n\nIt was extremely kind of your mom to put a roof over your head. But that does not mean it is your home or that you have any say in who is or is not a part of that home. You are a guest. Your time there has an expiration date. If you do not like a person in the home, your only option is to move out. \n\nYou might have had a more valid reason for asking your mom this if the boyfriend was abusive or doing drugs. But he's not. Your sole problem is \"smell\" and \"too many people in the apartment.\" The apartment that is not yours. The apartment that you are a temporary guest in. \n\nYour mom is a grown woman paying her own bills. Your mom and your mom alone decides who enters or does not enter that house. Not allowing your fiance in the home is NOT the same thing as allowing her boyfriend. She let you stay there because you're her kid and she loves you. She feels an obligation towards helping you. She does not have nor feel that obligation towards your fiance regardless of if she likes him or not. Your fiance not being there is motivation for you to get on your own two feet instead of moving him into an already cramped apartment and mooching off your mom with your growing family. \n\nYou don't have to like the rules. When you have your own place, you can make the rules. But for now, this isn't your house. It's the place you're staying, and you need to reign in that entitlement. Your mom gave you a great deal: not paying rent, groceries, utilities, etc.  If you don't like the deal, you don't have to accept it. But you can't demand more than what you got on the basis of \"family\". If the apartment is cramped, it's because you and a brand new human are occupying space that was meant to house your mother, your siblings, and your mothers partner.",
   "created_utc": 1701728649,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0liwy",
   "message": "YTA\n\n\u0026gt;\"if you don't like it, pay your own bills get your own place.\"\n\nYour mom summed it up nicely. You are overstepping.",
   "created_utc": 1701729244,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0nvb7",
   "message": "YTA - her house, her boyfriend can come by whenever she wants him to. You living there does not make it “also the baby’s house”.",
   "created_utc": 1701730145,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0p70r",
   "message": "YTA.  Are you for real? Please make better life decisions when baby gets here.  Unreal.",
   "created_utc": 1701730656,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0q2wf",
   "message": "YTA. You’ve got a lot of nerve",
   "created_utc": 1701730997,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0qzad",
   "message": "I mean, I get your point. but it's her house, she pays the bills. it is sort of unreasonable to ask",
   "created_utc": 1701731346,
   "score": 4,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0650f",
   "message": "YTA. Her house her rules. Move if you don't like it",
   "created_utc": 1701723424,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0p1lm",
   "message": "maybe you shouldn’t have a kid if you cannot afford your own fucking house or place to live without your mother. what an entitled brat.",
   "created_utc": 1701730596,
   "score": 7,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0cgol",
   "message": "Why are you popping kids that you can’t even afford? You should have gotten your shit together before bringing another life to this world, and also married before you carried!",
   "created_utc": 1701725784,
   "score": 9,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0cbcn",
   "message": "Stop mooching and move out.\nYou’re living off her in her home… while you are apparently young, irresponsible l, and unemployed.\n\nHahahaha. It’ll be fun when life sorts you out.",
   "created_utc": 1701725729,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ciau",
   "message": "YTA. if you’re grown enough to be pregnant, engaged and starting your family you and fiancé can get your own housing instead of trying to tell your mother what to do with hers.",
   "created_utc": 1701725801,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e1o1",
   "message": "YTA. Abortion exists for people who don't have their life sorted out",
   "created_utc": 1701726383,
   "score": 5,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0i9k7",
   "message": "YTA and if it bothers you so much then you need to move out and quit being a moocher. It’s way past time for you to grow up.",
   "created_utc": 1701727989,
   "score": 7,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc09ei5",
   "message": "YTA ita your moms house never yours never your baby's. If you can't repect her space then move out",
   "created_utc": 1701724638,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc09zw1",
   "message": "YTA It is your mom's place and you are living there rent free. If you think mom's bf smells bad wait until your newborn blows out a couple of those diapers.",
   "created_utc": 1701724859,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0bmqk",
   "message": "YTA, her house. The air will be much better in your own place. You are living off her in her home, so it might be wise to shut up and deal with it.",
   "created_utc": 1701725470,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0btq9",
   "message": "YTA. Who's house is...oh wait, you already answered that, and yet with that information, you still asked this incredibly ridiculous request. Seriously, who tries to dictate to someone else who they can and can't have in THEIR own home. The audacity with you is unreal.",
   "created_utc": 1701725545,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0c4zl",
   "message": "Yes you definitely are the AH here it’s your mom‘s house you pay zero bills you have no job you watch your brothers, so your mom can work extra, honey if you have a fiancé, then go live with him you want to do what’s right by the baby then go live with your fiancé go live with the dad of the baby. It’s not your mom’s problem.",
   "created_utc": 1701725663,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0do8x",
   "message": "YTA.  Doing what’s right for your baby is keeping a roof over their head. Keep the peace and apologize to your mom. Having a newborn baby around is no joke and she’s sacrificing by having you stay (which I would do in a heartbeat for my daughter). \n\nThis is not going to be your newborns home. This is where you are currently staying yes, but until you pay the rent/mortgage and an equal share of bills, then a place is not your home. \n\nOn a positive note: once baby is out your hormones will change again and that hyper strong pregnancy nose will likely go away. \n\nAlso want to add that many air fresheners and scented candles (smoke AND chemicals) are not safe around babies so be careful.",
   "created_utc": 1701726243,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e06s",
   "message": "YTA. You're the definition of a choosing beggar.",
   "created_utc": 1701726367,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e1hn",
   "message": "You don’t pay rent so you don’t get a say. It’s her house her rules. You literally said yall are trying to move so it’s not your babies house it’s not even your house.   If you don’t want her boyfriend around find your own spot. She makes the rules and allows who she wants in her house. You can’t just say you don’t want her boyfriend there. Maybe mom doesn’t want you and a baby there.",
   "created_utc": 1701726381,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0e9sn",
   "message": "YTA, sucks but it’s her house",
   "created_utc": 1701726467,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ejiz",
   "message": "I mean YTA cause I’m assuming you’re an adult, so your mom has every right to be feeling some type of way… funny how you listed everyone’s ages except yours be glad she’s even letting you stay cause had we got into △⃒⃘ shouting match over it I would’ve put made you go stay with your “fiancé “",
   "created_utc": 1701726569,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0etvd",
   "message": "YTA. It's not your house. It's not your baby's house. \n\nMove out. Grown enough to create a life; get engaged.....got to move out.",
   "created_utc": 1701726678,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0f51t",
   "message": "Yeah, YTA. It’s not your place , so you don’t get a vote as to who is and isn’t welcome. Mom is right; if you don’t like it then get your own place. She’s a grown woman. She doesn’t need your permission to have her partner stay over.",
   "created_utc": 1701726793,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0fo8k",
   "message": "YTA - You live with your mum, so her house, her rules.\n\nYou’re free to move if you don’t like how your mum lives her life and who is in her life but what on earth makes you think you can dictate her when her boyfriend should stay over or not? If you don’t pay the bills, you have no say. Your mother is right on that one!\n\nIt’s not her fault if you decided to have a kid when you can’t afford one / aren’t in a stable situation.",
   "created_utc": 1701726995,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0fvy6",
   "message": "YTA - move out if you want the privacy. In no way is it about to be your baby’s house, I’d lose that attitude before you lose more. You don’t want to be a brat but this is textbook definition of being one. Your mom is doing you a huge favor by even letting you stay, not all parents would be ok with a newborn in the house.",
   "created_utc": 1701727077,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0glvz",
   "message": "YTA. It’s your mom‘s house. If she wants her boyfriend to stay over, that’s her business. It’s not your business even if you pay rent, it’s still her house. If your name is not on the deed, you don’t make the rules.",
   "created_utc": 1701727352,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0gs36",
   "message": "YTA. Let me count the ways……\n\n\u0026gt;It also just seems fair cause I’m not allowed to have my fiancé stay over on account of my bros. \n\nNope. She pays the bills, you don’t. She gets to decide who can be there and who can’t.\n\n\u0026gt;But she's making it sound like I'm being selfish or something.\n\nBecause you are. \n\n\u0026gt;I get that it's her house, \n\nCorrect. \n\n\u0026gt;but it's also about to be my baby's house, \n\nWrong. You choosing to have a kid while still living with your mom and not paying bills doesn’t make it your baby’s house. \n\n\u0026gt;I don't wanna be a brat about it, \n\nThen stop being one.\n\n\u0026gt;but I'm honestly just tryna do what feels right for my baby.\n\nBULLSHIT. You are trying to get what you want under the guise of bUt my bAbY. \n\nLet’s be honest, how much of this stems from you being mad she won’t let you bf stay over?",
   "created_utc": 1701727419,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0h8qj",
   "message": "YTA. Apparently you don’t get that it’s her house.",
   "created_utc": 1701727597,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ir7x",
   "message": "YTA. It’s not your house or your babies house. Your living there rent free mooching off your mom and now your trying to lay down rules for her to follow in her own house.",
   "created_utc": 1701728178,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0js2d",
   "message": "YTA\n\nNot your house, not your rules. Your mum is right - if you want to make your own rules, get your own house.",
   "created_utc": 1701728569,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0k0wn",
   "message": "This is actually embarrassing for you ahahaha",
   "created_utc": 1701728664,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0k5cs",
   "message": "YTA.  Not your house not your business.\n\nYou sound young and immature.\n\nThis is a you and your baby’s fathers problem to fix.",
   "created_utc": 1701728713,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0kylo",
   "message": "YTA, how can someone write this out and not be embarrassed for themselves?",
   "created_utc": 1701729024,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0lgr6",
   "message": "YTA. Your mother is working extra shifts to pay all the bills while you don't work. How about you and your \"fiancé\" move out and support yourselves like actual adults?",
   "created_utc": 1701729220,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0lolm",
   "message": "If you're unhappy with the free room and board being provided to you as an adult who decided to procreate without the ability to take care of yourself let alone an entire other human, leave.",
   "created_utc": 1701729305,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0nv27",
   "message": "YTA. She's letting you stay there for free, you don't work and you just watch your siblings. Get over yourself. If it's too much, get a job and leave. It's not your place to make demands when you contribute nothing.",
   "created_utc": 1701730143,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ny52",
   "message": "Y.....T......A...... without question.",
   "created_utc": 1701730175,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ouj5",
   "message": "This is a new level of entitlement. I’m\nembarrassed for you that you think you are so powerful that you can control your mom’s significant other’s comings and goings.",
   "created_utc": 1701730520,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0oxsq",
   "message": "YTA Your mom's right. If you want to dictate who stays at your home, get your own place.",
   "created_utc": 1701730555,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0p1rd",
   "message": "Wow, you’re entitled. You don’t get to say who can and can’t be in your mothers house. What’s wrong with you? You’re living (presumably) rent free, and bill free, while your mom has to work extra shifts? Best hope your kid doesn’t treat you the way you treat your mom. You’re going to get your ungrateful ass kicked out if you keep this shit up.\n\nYTA, and your little family needs to start paying some bills.",
   "created_utc": 1701730598,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0phvt",
   "message": "YTA. It's your mother's house. She is kindly letting you stay there. You DO NOT get to say who stays there and who does not. You can in your own home. \n\nYou are about to be a mother OP, your world is about to implode. I was 16 when I had my first baby. I had my own little flat with my hubby. I did my own housework, cooked the meals (badly, I'm not the cook my mum was), looked after my baby, all with no help. When my kids got older I worked to help out. I eventually trained to become a midwife. You need to stop with this entitement. If you don't like the living conditions, move out.",
   "created_utc": 1701730771,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0pm8f",
   "message": "YTA you can’t expect anything when you don’t pay rent or bills however I understand when I had my baby my hormones were all over the place and before I felt like I had too protect my baby and did some unreasonable stuff apologize to your mom and just explain that you expect to feel pretty vulnerable after giving birth and if she can it would be helpful for your adjustment period if boyfriend didn’t come over for at most the first month after that your hormones should settle a little just explain it to her as being a bit pregnancy crazy and write it off if she says no it’s not the end of the world maybe take her boyfriend aside and kindly tell him that your nose is very sensitive and he smells a bit and boyfriend might take care of the problem himself",
   "created_utc": 1701730817,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0q908",
   "message": "Yta you can't dictate who your mum has over in her own home especially if you are not paying any rent, your mum is still young herself ofcourse she will still want her bf over",
   "created_utc": 1701731062,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0qfxw",
   "message": "A couple months? Isn’t there a sub for main characters? YTA very very much. Grow up!",
   "created_utc": 1701731135,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0qlqq",
   "message": "YTA.\n\nYour mom is letting her stay in her home rent free, and she's going to be affected by your crying baby when you give birth. There's nothing wrong with a crying baby, because that's what they do, but it's a major disruption to everyone living with you. So you are imposing on your mother now and will be imposing on her and inconveniencing everyone after the baby comes, yet you have the gall to ask your mother not to let her boyfriend visit because you don'tlike the way he smells?\n\nThere's only one sensible solution to your problem. Get your own place.",
   "created_utc": 1701731198,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0reot",
   "message": "If you think being told to support yourself when you are an adult making adult decisions is \"ouch,\" you are way too immature to have a kid.",
   "created_utc": 1701731514,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0rwfq",
   "message": "YTA If you are adult enough to decide to be a parent you are adult enough to get your own place if you don’t like anything about your moms tiny apartment.  Perhaps she is working extra shifts to support YOU.  And this is not ’about to be my baby’s home’. It’s Mom‘s home.",
   "created_utc": 1701731710,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0sqfi",
   "message": "YTA, you're in her home, paying for nothing but making a demand about who SHE has over? It nice you watch your brothers cause that sounds like the only thing you do to help out in a mayor way. Let your mom have her boyfriend over. Especially cause if you have no income she is probably going to be helping to support your child while you live there.",
   "created_utc": 1701732041,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0suav",
   "message": "“I don’t wanna be a brat about it, but I’m honestly just tryna do what feels right for my baby” \n\nHow will your moms bf’s odor effect your baby AT ALL? \n\nYour fiancé and yourself need to grow up and pull your own weight in life. \n\nScary to see kids having kids",
   "created_utc": 1701732083,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0t2wm",
   "message": "Idk, man, if my mom was generous enough to let me live at home and pay absolutely no bills at all, I'd be a lot more understanding and would never try to tell the woman who pays my bills and owns the roof over my head \"hey, keep your boyfriend at home because I don't like how he smells.\" I would just like to know where you found the audacity to think she had the right to even entertain that thought",
   "created_utc": 1701732177,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0t4qc",
   "message": "YTA. Never mind the fact that you’re pregnant with a child you can’t even provide a home for, you’re dictating how your mother inhabits her own??",
   "created_utc": 1701732197,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0tv6j",
   "message": "It is not nor your baby’s house, it is your mom’s. She gets to say who comes and goes in her house. The nerve… YTA",
   "created_utc": 1701732486,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0ugo8",
   "message": "Girl… if anything ask him to bathe. I get pregnancy nose. Mine never went away. However, you pay no rent! You should be doing everything to babysitting, cooking and cleaning for mom. She works extra shifts ffs! (I am sure you’re no help on the bills and that is why she has to work more.) Let her have her man over when she wants him over. Stuff some earplugs in your nose if it’s really bad or stay in your room that you pay no rent for.",
   "created_utc": 1701732725,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0uip9",
   "message": "Yes, YTA. You pointed out that your mom won’t let your boyfriend stay overnight because of your brothers. Which might make sense *except* that her boyfriend stays over, and *you are pregnant.* Any kind of moral high ground was lost long ago. You \u0026amp; your mom can both give it up. They might not know what sex is, but your brothers already know adults don’t have to be married to have sleepovers and babies.\n\n\u0026gt; I get that it’s her house, but it’s also about to be my baby’s house…\n\nNo. No, it isn’t. It’s about to be where your baby (and you) *lives,* but not the baby’s house. It’s your mother’s house. She makes the rules, and she is right: If you don’t like it, get your own place, pay your own bills, figure it out for yourself. You are not in a position to be demanding, sweetie. You are going to live with your mother \u0026amp; brothers and, clearly, your mother’s boyfriend. Talk to your fiancé. Figure out how you can move in with him, the father, someone who should be helping you with money and child care. The fact the he’s left it all up to you ~ and your mother ~ shows a lack of maturity.",
   "created_utc": 1701732747,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0xp78",
   "message": "The nerve. You are in for a really rude awakening once your mom stops helping you. You are the inconvenience in this story not the other way around. YTA and you also have some serious nerve.",
   "created_utc": 1701734007,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc10mx4",
   "message": "YTA.  It's her house and you are the one crowding it by adding another baby. You either need to figure out how to move in with your finance sooner or learn to keep your mouth shut. What you are asking isn't close to reasonable.",
   "created_utc": 1701735147,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc133yq",
   "message": "YTA. \n\nYour mom pays the rent/mortgage, not you. \n\nYour mom pays for heat, not you. \n\nYour mom pays for water, not you. \n\nYour mom (probably) pays for all the food, not you. \n\nYour mom gets to make all the rules, not you. \n\nIf you want to be the one making the rules, you get to do all of the above and move out. You’re too young to be having a baby if you can’t understand that you don’t get to tell anyone anything in a house you don’t pay anything for.",
   "created_utc": 1701736137,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc13atq",
   "message": "\u0026gt;Ouch, right?\n\nEh, no? You pay nothing to live there and are actively adding to the list of burdens by having a child you can't take care of. Sorry but YTA, get your shit together.",
   "created_utc": 1701736215,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc13bmm",
   "message": "Actually, it’s your Mom’s house  and she’s letting you stay there. I understand your sense of smell is dialed up, however your baby does not and will not care what your Mom’s bf smells like. You are way out of line here. Apologize to your Mom, avoid her BFwhen he comes over ( yes, you get the inconvenience here),  keep your mouth shut about your Mom’s company. When you move out you get to do what you want.",
   "created_utc": 1701736224,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc15zf6",
   "message": "YTA. Your mother is right, you are being selfish. She is entitled to have her boyfriend stay in the home she alone is paying for whenever she likes. If the conditions in the home don’t suit you anymore due to your pregnancy, you’re welcome to start paying rent for a home in which you make the rules and control access anytime.",
   "created_utc": 1701737311,
   "score": 3,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0et6f",
   "message": "So you think you can look after the kids as well as your newborn? Unlikely.  It's not your house. It's not your baby's house. You are a temporary guest.\n\nDeal with it.  YTA",
   "created_utc": 1701726670,
   "score": 6,
   "submission_id": "18ar3t8"
  },
  {
   "comment_id": "kc0pf7s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ar3t8"
  }
 ]
}