{
 "submission_id": "18aspfk",
 "title": "AITA for telling my MOH she can't bring a plus one to my wedding?",
 "selftext": "I’ve been friends with “Jenny” since we moved into the dorms freshman year of college. We’ve been best friends for about 10 years now. We’ve always been close, talked about everything. The only fallout we've had was \\~7 years ago when she was hanging around a group of kids from her sorority who snorted Adderall in their free time--that sort of thing. Once that was finally over with, we went back to our normal relationship. We even stuck together while I went through graduate school. I didn’t have much in the way of free time, but the time I did have was spent hanging out with her and with my BF.\n\nOne thing about Jenny is that she’s always been a bit of a flake. I'm generally low maintenance, and I welcome spending an afternoon or two on my couch, so I usually don't take it too personally. However, there are times where she has no-call no-showed to some pretty important events, like my grad school graduation. Now to the meat of the problem.\n\nWhen my bf (now fiancé) proposed to me last year, I asked Jenny to be my maid of honor. She excitedly accepted. After that, hanging out with Jenny essentially became an impossible task. She cancelled trying on wedding dresses with me multiple times- most of my other close lady friends had recently moved out of state, so I ended up having to go alone. And she would continue to cancel plans or say she didn’t have enough time to hang out. The cancellation would usually happen hours *after* we were supposed to see each other, sometimes wouldn’t even hear back until the following day. If I tried to set something up she would say she was too busy with her studies.\n\nI tried to give her the benefit of the doubt since she had started nursing school recently. Meanwhile, her Snapchat stories were full of her partying, going to concerts, hanging out with her new nursing school friends. I asked her about this and she said that’s how she relaxes when she’s busy..\n\nAfter about 6 months of this, I was getting frustrated and I decided to stop reaching out. A couple more months pass and the appointment for my wedding dress fitting was coming up. At this point, I message her saying that I felt distant from her, asked if I had done something wrong, or if our friendship was no longer something she wanted. I told her that I missed her and would love to see her at the fitting. She assured me I had done nothing wrong, she just had a lot of stressors in her life. She also tells me she dropped out of nursing school, so I figure she may have felt bad about that and maybe that’s one of the reasons for distancing herself.\n\nCue to the day in question. She unexpectedly brings her new bf of a couple months to the fitting, which she was late for. She is already aware of our wedding invitation policies. My fiancé has a huge family and so we are only inviting +1’s for serious relationships, people who are married, who know both the bride and the groom. We don’t want strangers at our wedding. She asks if I was still only inviting serious LTRs as +1s. I tell her yes. If I don’t have enough money to invite all of my cousins who are dear to me, then I’m not going to invite a random +1.\n\nThen, she proceeds to ask me, in front of her new bf who I’ve met 5 minutes prior, if she can bring him to the wedding. I told her absolutely not. That they have been dating for 2 months, we don’t know him, she’s in the bridal party so he would be by himself the entire time. Her bf did not seem upset or surprised by this response. I also got the impression that this was really the only reason she showed up to the dress fitting.\n\nA week later, I get a notification on Facebook: “Jenny married Mike”. I’m flabbergasted. If she isn’t even telling me she’s getting married, then I guess we really aren’t friends anymore. Later that night I randomly get a text message telling me that she was incredibly insulted of my snap judgment of her relationship. That she couldn’t believe I said no about +1 in front of Mike. That she would never judge me and my fiancés relationship “regardless of how long you’ve been together.” (We’ve been together 8 years..). That she is not comfortable being my maid of honor anymore and wishes us the best of luck.\n\nI responded that after bailing on me for a year, she immediately asks me to invite her bf who I just met, in front of said bf. And that I will update her invitation.\n\nTLDR: Friend accepts MOH position. Flakes on me for the subsequent year. Introduces me to her brand new BF and asks if he can come to my wedding. AITA for saying no?",
 "created_utc": 1701719819,
 "permalink": "/r/AITAH/comments/18aspfk/aita_for_telling_my_moh_she_cant_bring_a_plus_one/",
 "score": 72,
 "url": "https://www.reddit.com/r/AITAH/comments/18aspfk/aita_for_telling_my_moh_she_cant_bring_a_plus_one/",
 "comments": [
  {
   "comment_id": "kbzxsdg",
   "message": "NTA, This is your wedding and you already have everything planned out to how you wanted it to be. Do yourself the favor and make another trusted and dear friend/family member your MOH. She doesn't seem to have a good track recorded of being there when you needed her.",
   "created_utc": 1701720392,
   "score": 95,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kbzz0qj",
   "message": "The +1 was just the straw that broke the camel's back. She stopped being a friend long before that. It sucks, I'm sorry, but move on. NTA",
   "created_utc": 1701720842,
   "score": 62,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kbzzecb",
   "message": "NTA,  but this is no friend,   a real friend would have prioritized you over other friends and fulfilled her MOH obligations better.    If you can possibly replace her , I would and when she asks why be sure to mention all the flaky stuff and say,  \"sorry, i need someone committed and I can not seem to count on you for anything\"   (what part of no plus one did she not understand?)",
   "created_utc": 1701720980,
   "score": 29,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc05vb6",
   "message": "NTA.  \n\nGah, I'm exhausted just reading this.  \n\nHonestly, the person I feel the most sorry for here is Mike.  Mike could legitimately be great (except for choosing Jenny, I guess), but the way she set this up there was basically no chance for you and your fiance to ever get to know and like Mike.  She could have said \"hey, I want you guys to meet this new guy I'm seeing, let's have a fun evening doing X\" and there would be some chance.  Now Mike will forever be the guy she used as a crowbar to pry a +1 out of your hands... for what?  So she could feel even more important?  So she could feel better than your cousins or other friends?",
   "created_utc": 1701723326,
   "score": 23,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0023m",
   "message": "Nta she deliberately put you on the spot in front of him, trying to force the issue.",
   "created_utc": 1701721219,
   "score": 13,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc068w8",
   "message": "NTA looks like your friend was looking for an out for awhile and she took it with the +1. Personally I'd have given the bridal party a plus one but your wedding your choice and it wasn't unreasonable. Even aside from that she should have been removed and downgraded to a guest from her actions alone.",
   "created_utc": 1701723463,
   "score": 11,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0godi",
   "message": "NTA. I'm hoping that you've completely uninvited her from the wedding. You don't want to be dealing with toxic shit on your big day.",
   "created_utc": 1701727379,
   "score": 11,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0vxoc",
   "message": "NTA. But she’s not a friend. I’d be closing the door on that and moving on.",
   "created_utc": 1701733311,
   "score": 6,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0yc3c",
   "message": "Hang on. Is she still invited? WITH  her new husband? Girl. If this is the case…. you’re TA to yourself. This girl is NOT your best friend, let alone your friend, and she really hasn’t been since your engagement. She should have been removed as your MOH when she’s lying to your face about being so busy, but obviously not so busy that she can’t go party with her new buddies. That’s how she relaxes when she’s so busy? Riiiiiight. She was literally trying to see how far she could push her behavior and you would still accept it. Then SHE got to pull out of being your MOH despite doing nothing you would think an MOH would love to do, especially if you’re allegedly best friends, and act like SHE was wronged for not being allowed a +1, but if she was uncomfortable with that she should have turned down the role if she knew in the beginning. Yet she shows up with this dude at a FITTING, which is already inappropriate, and asks about having a +1 in front of the boyfriend, hoping that you would cave because he was right there and wouldn’t feel comfortable saying no to his face. Just cut your losses with this person because she clearly only cares about herself.",
   "created_utc": 1701734247,
   "score": 5,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0mva7",
   "message": "She isn't your friend, stop chasing the friendship!",
   "created_utc": 1701729760,
   "score": 4,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc019pr",
   "message": "Nta",
   "created_utc": 1701721656,
   "score": 3,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0ls6h",
   "message": "Seems like Jenny has never truly been a friend.",
   "created_utc": 1701729344,
   "score": 3,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc07ub7",
   "message": "Yeah, you're definitely not the asshole here. Your friend sounds like a real flake and you've been more than patient with her. Stick to your wedding invitation policy and don't feel bad about it. Plus ones are for serious relationships only!",
   "created_utc": 1701724053,
   "score": 2,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0zdta",
   "message": "Sounds like Jenni never moved on from the Adderall crowd and has some definite issues, addiction wise or mentally unwell wise.\n\nNTA",
   "created_utc": 1701734655,
   "score": 2,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc1bwsc",
   "message": "NTA but just let her go.",
   "created_utc": 1701739746,
   "score": 2,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kbzzcif",
   "message": "Not allowing to let your MOH to bring a plus one is just plain silly. I'm sorry. She wasn't some random, she was literally a key player in the wedding.\n\nNow, it sounds like y'alls friendship was otherwise burning out, so I'm reading this whole plus one ordeal as the cherry on top of a failing friendship.\n\nSo, NTA in general. But again, a bit silly to expect the MOH to be chill about you revoking her plus one.",
   "created_utc": 1701720961,
   "score": 238,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0kkwj",
   "message": "ESH ..... you knew what kind of friend she was...",
   "created_utc": 1701728878,
   "score": 250,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0d7zp",
   "message": "NTA and I doubt I would send her an invite",
   "created_utc": 1701726071,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc0fxsa",
   "message": "Nta she wasn’t a good friend, she really saved you the time. \n\nHave a wonderful wedding and don’t fall for it when she tries to pull you into the drama",
   "created_utc": 1701727097,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc100k6",
   "message": "This person isn't flaky. They are a bad friend. She's consistently been bailing on you, in a manner that is rude and just plain mean. \n\n\u0026amp;#x200B;\n\nThis friendship has run its course. I'm sorry.",
   "created_utc": 1701734900,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc11cuc",
   "message": "You need a different maid of honor pronto. Don't avoid the conflict and tell her directly.",
   "created_utc": 1701735434,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc123d3",
   "message": "You briefly mentioned a break in the friendship during a period when Jenny was using drugs.  Based on some of the things you've mentioned-- basically going noncontact/no show, dropping out of nursing school, marrying a guy she's only been dated for a couple of months-- do you think she could be using drugs again?\n\nI know +1s are a sore subject with some and the pressure to keep the expenses of the wedding contained-- but I'm still of the mind that when you're putting extra financial burdens on the wedding party all of the wedding party should have the option of a plus one. Admittedly, Jenny hasn't been much of a MOH and it does look like she only showed up (late) for the fitting to pressure you into inviting her BF.  The question now is do you consider this a friendship worth keeping or would you like to bring it to a conclusion and move on.  If the friendship has indeed run it's course look for ways to bring it in for a smooth landing that honors all of the memories you have together and leaves the door open to reconnect at some point in the future.\n\nDo you still keep in contact with any mutual friends with Jenny?  If so they might be able to give you some insight into what's going on with her.",
   "created_utc": 1701735728,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc12toq",
   "message": "She is doing you a favor by dropping out",
   "created_utc": 1701736023,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc13ied",
   "message": "NTA. Tell her to stay at home like all the other times she didn’t fulfill her MOH duties. She’s not a friend and hasn’t been one for quite a while.",
   "created_utc": 1701736301,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc164h1",
   "message": "Ugh, it's annoying and upsetting, but you haven't REALLY lost a friend.  She wasn't one to begin with.\n\nIn 10 years time,  you'll look back in this and wonder why you ever put up with this disrespect, honestly.\n\nNTA.",
   "created_utc": 1701737367,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc16ues",
   "message": "Info: \nWhen you reached out to her, were you checking on her life too, or was it all just about you? \n\nYou think she avoided you because she was embarrassed about dropping out of nursing school. Maybe she’s going through something tough and for some reason didn’t want to let you in. \n\nIf she has a history with drug use (important enough to be part of your friendship story), maybe she’s using again but you were too clued out to think to ask if she’s ok. \n\nIf anything, her rushing into a relationship could be another sign that all is not right in her world. But you turn even that into how it affects your seating plan — not a red flag for how she might be doing.",
   "created_utc": 1701737664,
   "score": 1,
   "submission_id": "18aspfk"
  },
  {
   "comment_id": "kc1aeol",
   "message": "The only question I have is why it took until she quit being a maid of honor?  She should have been removed from the position half a year ago.\n\nNTA and kick her out of the entire wedding.  She isn't your friend",
   "created_utc": 1701739132,
   "score": 1,
   "submission_id": "18aspfk"
  }
 ]
}