{
 "submission_id": "18auig0",
 "title": "AITAH for telling off a girl that my fiance had a crush on in highschool?",
 "selftext": "So, I (23F) and my fiance (Jake 23M) (fake names for the sake of this post) knew each other in high school but started dating about a year after it ended. We now live together, and life is good. \n\nBack in high school, I was friends with Alex. Hindsight, she was very toxic and we weren't good people together. After high school ended, we drifted apart, and I ended up deleting her off social media because of her behavior. A bit of background about Alex, one thing she did a lot in high school was date around the friend group. Then, when the date didn't pan out, she used the guy's crush on her as a means of bullying the girls they dated after her. For example, an Alex and a guy Sam went on 2 or 3 dates, and it didn't work out. When Sam started dating Becca, Alex would make remarks like \"OH her took you to *ice cream place* he took me to *frozen yogurt* guess he is broke this week LOL\" Very teenage girl drama. \n\nWell, Alex and Jake went on one date in high school, as you could guess. I had honestly forgotten about it until I ran into her recently. I was making small talk about me and Jake's life, engagement and such, Alex started chucking saying \"well its a good thing he got over me, or it wouldn't be happening.\" I hadn't spoken to her in 4 years at this point, and it took me a moment to remember they went out. I just made a face and replied, \"That is a weird thing to bring up. Do you still think about high school dates that much?\"\n\nShe went a bit pale and started stuttering saying \"well he seemed serious at the time and people said he was upset after the date\" I just said \"yeah that was like 7 or 8 years ago get over yourself\". It was awkward, so I just left her there to continue my errands.\n\nJake got a text from a mutual friend with Alex saying I was a jerk for \"berating her in public\" and \"made her feel bad for a joke.\" Jake doesn't think I was wrong it was weird to bring up his brief high school crush to his fiance.",
 "created_utc": 1701724437,
 "permalink": "/r/AITAH/comments/18auig0/aitah_for_telling_off_a_girl_that_my_fiance_had_a/",
 "score": 196,
 "url": "https://www.reddit.com/r/AITAH/comments/18auig0/aitah_for_telling_off_a_girl_that_my_fiance_had_a/",
 "comments": [
  {
   "comment_id": "kc0qe2v",
   "message": "NTA. You didn't berate her. You told her how weird it is for her to obsess over every dude she went on a date with in high school for this long. You're right. She needs to get over herself.",
   "created_utc": 1701731115,
   "score": 122,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc0i3yf",
   "message": "She deserved it. And your mutual friend deserves to be blocked.",
   "created_utc": 1701727929,
   "score": 74,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc0fmou",
   "message": "Your mutual \"friend\" is a fucking piece of shit. Block him or her everywhere.",
   "created_utc": 1701726979,
   "score": 132,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc0yt8r",
   "message": "NTA!! Good for you queen holy shit. You not only didn’t berate her but you sure embarrassed her which is deserved. She must have a sad boring life if she’s bringing up high school stuff 7-8 years later.",
   "created_utc": 1701734432,
   "score": 25,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc10bqn",
   "message": "OMG LOL 😆 😂 🤣 \nImagine graduating highschool, growing and maturing to become a decent human being to then be confronted by the past and taking it like a fucking boss. \nYou are awesome. Never EVER doubt that. You didn't do anything wrong. You grew up and matured, that's literally all that happened. Your ex-friend and ex-mutual friend clearly peeked in highschool and has refused to acknowledge it. I do recommend getting your side of the story out first before they do in case they try to rally any other friends or people you know and try to ruin your reputation. Control the narrative. Your bf is awesome and definitely a keeper. He won't tolerate any insults towards his girl, a real man. You found a good one, and hopefully, this relationship ends with a ring on your finger.😉",
   "created_utc": 1701735024,
   "score": 23,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc0b24e",
   "message": "You didn’t berate her. You just put her in her place! Well done. 👏 👏",
   "created_utc": 1701725256,
   "score": 28,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc14tb9",
   "message": "Some people truly peaked in high school and cling to it like limpets. She gets an ego boost from imagining that she had all this impact on guys she says once or twice, and it's pretty pathetic.\n\nGood on you for calling her out.",
   "created_utc": 1701736831,
   "score": 8,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc173ou",
   "message": "Nope not at all...in fact good for you! Everything you did was perfect! Great communication with your partner...this marriage is going to work out great 👍. Sounds like new friends are needed",
   "created_utc": 1701737773,
   "score": 6,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc17vr1",
   "message": "Some people need to be reminded they forgot to grow up. Nta.",
   "created_utc": 1701738093,
   "score": 3,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc18ucq",
   "message": "That was an awesome response haha",
   "created_utc": 1701738486,
   "score": 3,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc19kpj",
   "message": "Your response is one of those things most of us would think of after the interaction was over. Good on you for saying it. NTA.",
   "created_utc": 1701738786,
   "score": 3,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc13l82",
   "message": "NTA. Thats not even really telling her off.",
   "created_utc": 1701736333,
   "score": 1,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc1byld",
   "message": "Jake needs to tell mutual friend that Alex needs to get over herself for her behavior about him in regards to you.",
   "created_utc": 1701739767,
   "score": 1,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc1cj46",
   "message": "NTA! You handled that shit like a queen 👸🏾 Alex is just embarrassed and mad that you're right. She's mad about you not being afraid to call her out on her bullshit",
   "created_utc": 1701740004,
   "score": 1,
   "submission_id": "18auig0"
  },
  {
   "comment_id": "kc1cofj",
   "message": "She sounds like a lame-o. NTA. I think your comeback is funny and shut her down. Love it.",
   "created_utc": 1701740066,
   "score": 1,
   "submission_id": "18auig0"
  }
 ]
}