{
 "submission_id": "18av6lx",
 "title": "AITAH for calling out my parents for sexualizing me as a teen?",
 "selftext": "I am fuming.\n\nJust got off the phone with my (f25)  mom (f60). We are in a big argument and maybe you can help me settling this debate. I told my mom that I didnt appreciate being sexualized as a teen. She said that never happened and that I was remembering wrong. Everything that took place in this description happened when I was between the ages of 12-16.\n\nExample #1:\n\n\\- My father would \"jokingly\" and constantly slap my ass every time I got up off the couch. I told him to stop, every single time, and he just giggled and kept doing it. For years.\n\nI told my mom that, and she said that he was just being silly and fatherly and joking around with his daughter.\n\nExample #2:\n\n\\- I told her about another scenario. One time I was walking from my bedroom to the bathroom to take a shower. (Btw, the bathroom is not even 2 yards away from my bedroom). I was fully clothed, wearing pants, an open cardigan, and a tank top underneath. Seems pretty innocent, right? Not for mom. I wasnt wearing a bra. I was fully covered but not wearing a bra. Now, keep in mind, I always wore a bra around the house. My parents were very strict about modesty. Heres the kicker: My mom told me to cover up, that there were boys in this household (my own brothers) and that it was inappropriate in any circumstance for me to be braless inside the home.\n\nOnce I brought that up, she said this, \"That wasnt sexual. You are the one who is making it sexual. If I wanted you to cover up to protect my boys from seeing body parts then I will do that. But it isnt about anything sexual, it is about modesty.\n\nThe whole conversation ended with her saying that this is too much to deal with, she couldnt believe I was doing this to her when she loved me all my life, and then she hung up.\n\nSo, TELL ME. PLEASE. Am I the asshole?\n\nedit: spelling",
 "created_utc": 1701726198,
 "permalink": "/r/AITAH/comments/18av6lx/aitah_for_calling_out_my_parents_for_sexualizing/",
 "score": 50,
 "url": "https://www.reddit.com/r/AITAH/comments/18av6lx/aitah_for_calling_out_my_parents_for_sexualizing/",
 "comments": []
}