{
 "submission_id": "157zlwx",
 "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 516, Part 1 (Thread #662)",
 "selftext": "",
 "created_utc": 1690171329,
 "permalink": "/r/worldnews/comments/157zlwx/rworldnews_live_thread_russian_invasion_of/",
 "score": 210,
 "url": "https://www.reddit.com/live/18hnzysb1elcs",
 "comments": [
  {
   "comment_id": "jtb9kbs",
   "message": "\"I held a meeting on the European Union and our integration. This year we are to start negotiations on membership. 🇺🇦 is fully prepared for this - we are doing what is necessary on our part. And we are doing everything possible to ensure that the 🇪🇺 is also fully prepared. Exactly this year.\"\n\nhttps://twitter.com/ZelenskyyUa/status/1683553025263017984",
   "created_utc": 1690239507,
   "score": 1,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtb9gfm",
   "message": "\"A meeting on the export of our agricultural products. We believe in the agreement with the European Commission, but we are preparing for any scenario.\n\nOur position is clear: blocking exports by land after September 15, when the relevant restrictions expire, is unacceptable in any form. We are in touch with all stakeholders to find a solution that suits everyone.\"\n\nhttps://twitter.com/ZelenskyyUa/status/1683496755457916931",
   "created_utc": 1690239462,
   "score": 1,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtb509q",
   "message": "The Georgia-based Conflict Intelligence Team:  \n\"Sitrep for July 21-24, 2023:\n\n  \n– Drone raid damages buildings close to the Ministry of Defense in Moscow;  \n– The RuAF continue to strike Odesa, including the UNESCO protected city center;  \n– Igor Strelkov has been transferred to the Lefortovo detention center.\"  \nhttps://notes.citeam.org/dispatch-jul-21-24",
   "created_utc": 1690237561,
   "score": 1,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtb4vsv",
   "message": "[Meanwhile in Russia: propagandists on Vladimir Solovyov's show discussed current events and American politics, claiming that Russia already lost WWIII and is now waging WWIV.](https://youtu.be/NSU7gktyLjE)",
   "created_utc": 1690237510,
   "score": 1,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtb0rpp",
   "message": "Anyone else notice more anti-defense spending posts making it to the frontpage lately? \n\nNot that they were unheard of before. But I swear I see the same *this is why we don’t have healthcare* posts a lot more since Russia invaded Ukraine. \n\nIt’d be a natural thing for them to try to amplify.",
   "created_utc": 1690235800,
   "score": 1,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtawj38",
   "message": "AFP: Lithuania asks EU to use Baltic ports for Ukrainian grain exports.\n\nLithuania has called on the European Union to use Baltic ports to export Ukrainian grain after the Black Sea Grain Initiative's collapse, Agence France Presse (AFP) reported on July 24.\n\nhttps://twitter.com/KyivIndependent/status/1683589521193984002",
   "created_utc": 1690234110,
   "score": 30,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtavwuh",
   "message": "[So, Moldova and Ukraine very recently reopened their rail link bypassing Transnistria.](https://www.rferl.org/a/ukraine-moldova-romania-train-transdniester-shipping-export-import-salt-grain-basarabeasca-berezino/32360850.html)\n\nThere is also another rail link, but this one goes from Ukraine to Romania and goes through one kilometer of Moldovan territory. See 45.4697941, 28.2140389\n\nSo given that the grain that goes to Odesa port arrives by rail, why not ship it mostly through rail into Romania and from there to many ports on the Black Sea? Russia can't attack Romania and other NATO members.\n\nIt may slow down operations versus peak export, but it's still better than nothing. I'm not suggesting to sell the grain to Europe, just change where the grain gets exported from.\n\nFor example, the port of Constanța in Romania is the largest on the Black Sea and the fourth largest in Europe.\n\nEdit: I guess I answered my own question lol\n\n\u0026gt;Romania's Constanta port, Ukraine's main alternative route for grain since Russia's withdrawal led to the collapse of the Black Sea shipment deal, has capacity to handle extra cargoes until mid-August, the head of the port's business association said.\n\n\u0026gt;It has handled roughly a third of Ukraine's grain exports since the start of the war.\n\nhttps://www.reuters.com/world/europe/romanian-port-can-ship-more-ukraine-grain-after-collapse-black-sea-deal-2023-07-21/",
   "created_utc": 1690233863,
   "score": 26,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtavi3p",
   "message": "Based on Deep State UA’s map, Ukraine has liberated 285km2 since June 1 and 86km2 of that since July 1. Keep in mind that Deep State UA tends to be very conservative, on a 48-72 hour delay, and waits for visual and/or official confirmation.",
   "created_utc": 1690233704,
   "score": 28,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtap57f",
   "message": "In the EU, the plan to increase the production of projectiles for Ukraine was finally approved and put into effect, which provides for the investment of an additional €500 million in industrial capacity.\n\nhttps://twitter.com/Maks_NAFO_FELLA/status/1683568186124320772?t=W9yGPclpREC1C6vpRfIxqw\u0026amp;s=19",
   "created_utc": 1690231240,
   "score": 38,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtam0so",
   "message": "\u0026gt;Since the Vilnius NATO summit Putin feels emboldened to escalate, pulling out of the grain deal, attacking Odesa and now a Danube port.\n\u0026gt;\n\u0026gt;We must make sure our determination to help Ukraine to victory, and NATO membership, is better understood. Time to double-down on our efforts.\n\nhttps://twitter.com/GLandsbergis/status/1683467602004267008",
   "created_utc": 1690230064,
   "score": 26,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtalh0f",
   "message": "\u0026gt;In 2022, the people of Germany transferred 1.012 billion euros to help Ukrainians affected by the war, according to Central German Institute for Social Affairs (DZI).\n\nhttps://twitter.com/khpg/status/1683563334866444290",
   "created_utc": 1690229854,
   "score": 38,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtakpit",
   "message": "\u0026gt;The German Bundeswehr's \"current inventory of high-explosive projectiles in caliber 155 mm is around 20,000,\" according to a report of Germany's finance ministry.\n\nhttps://twitter.com/HoansSolo/status/1683461193246167041\n\n\u0026gt;This seems like something you probably don’t want in the public domain? That’s less than a week’s worth of shells at Ukraine’s rate of consumption.\n\nhttps://twitter.com/shashj/status/1683538739702710284\n\n\u0026gt;In the Bundeswehr, the lack of artillery ammunition has been normal for years. The troops currently have a considerable number of ready-to-use Panzerhaubitze2000 artillery systems, of which 14 have already been handed over to the Ukraine in the current year. However, the shells for this are so rare that the artillerymen on the home front are only rarely allowed to train with live shells. For example, when a minister or a state secretary stops by. Otherwise the soldiers have to be satisfied with practice ammunition.\n\u0026gt;\n\u0026gt;The government recently involuntarily made public how dramatic the situation is. For months after the start of the war in Ukraine, Berlin tried to keep secret the exact number of artillery shells available. Even parliamentarians were brushed off with the remark that disclosure would endanger the welfare of the state. But then, a few weeks ago, the finance department mentioned in a confidential submission to the Bundestag that the troops currently only have around 20,000 155-millimeter projectiles.\n\u0026gt;\n\u0026gt;The number was tantamount to an oath of disclosure, so a SPIEGEL report on the paper caused a stir internationally. Because according to NATO specifications, the Bundeswehr should actually have enough ammunition available for artillerymen to be able to hold out in intensive combat for 30 days. For that they would need at least 230,000 rounds. Officially, this rule will not apply until 2031, but the NATO strategists were still somewhat shocked at how hollow the German holdings are.\n\nhttps://www.spiegel.de/politik/deutschland/pistorius-macht-munitionsproduktion-zur-chefsache-a-285331bb-ba6b-4645-bf42-cb0e8d28b8c9",
   "created_utc": 1690229560,
   "score": 44,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtakli3",
   "message": "\"President of Ukraine Volodymyr Zelenskyy said that the country is fully prepared for negotiations on EU membership.\n\n\"Held several political meetings, in particular on the EU, our integration in this matter. We have to come to the beginning of negotiations on membership. Ukraine is fully prepared for this. We are doing what is necessary on our part and doing everything possible to ensure that the EU’s readiness is also complete,\" he said in a video message on Monday.\"\n\nhttps://twitter.com/Flash_news_ua/status/1683566942026702850",
   "created_utc": 1690229517,
   "score": 27,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtajxip",
   "message": "\"The simple math of war. The issue of protecting the key grain export port of Reni on the border with Romania (NATO) is one additional Patriot or SAMP/T system that will immediately go into operation, as the Ukrainian military knows how to work with these systems. The issue of protecting the historic center of Odesa and the Black Sea ports, which are strategically important for the Global South, is virtually the same. The value to global markets of losing these ports is thousands of times greater than the cost of just two missile defense systems. Conclusions? They are obvious.\"\n\nhttps://twitter.com/Podolyak_M/status/1683509327041028096",
   "created_utc": 1690229264,
   "score": 19,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtajqf1",
   "message": "Visually confirmed losses today is at parity, heavy for both sides.\n\nhttps://twitter.com/rebel44cz/status/1683560987142619137\n\nhttps://twitter.com/rebel44cz/status/1683560757676367872",
   "created_utc": 1690229189,
   "score": 13,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtahp9s",
   "message": "I didn't see this posted before and it's sadly a Shitter link..\n\nhttps://twitter.com/sentdefender/status/1683489463953940481\n\n\"A Polish Army Convoy consisting of roughly 200 Pieces of Equipment including KTO Rosomak 8x8 Wheeled-Armored Vehicles was spotted recently heading towards the Polish-Belarusian Border.\"\n\nLawl I hope Wagner tries something.",
   "created_utc": 1690228403,
   "score": 31,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtact54",
   "message": "Frontline report: \n\nUkrainians expand control over the Dnipro islands, strike Russian сommand post across the river.\n\nhttps://euromaidanpress.com/2023/07/24/frontline-report-ukrainians-expand-control-over-the-dnipro-islands-strike-russian-%d1%81ommand-post-across-the-river/?swcfpc=1",
   "created_utc": 1690226521,
   "score": 64,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtaasdx",
   "message": "\"This is a process that will continue and will gain momentum. The fact that \"cotton\" is taking place in Moscow, directly in the square where the key institutions of the security and defense sector of the terrorist state, the aggressor state are located, means that even such objects and the sky above them are no longer controlled by Putin's regime,\" GUR representative Andriy Yusov said regarding the night attacks on Moscow.\n\nhttps://twitter.com/NOELreports/status/1683424995484094464?t=eqr0c9Cz3I_W8zcMrzL9pQ\u0026amp;s=19",
   "created_utc": 1690225740,
   "score": 38,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jtaalvl",
   "message": "\u0026gt;On Monday, the spokesman of the German Defence Ministry, Mitko Müller, confirmed that Berlin has reached an agreement with Warsaw to build a maintenance and repair hub for Leopard 2 tanks damaged in the battlefield in Ukraine.\n\nThat was nice to see.",
   "created_utc": 1690225670,
   "score": 58,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jta94zr",
   "message": "\u0026gt;“The only difference is they see us as aggressors because we’re in their territory. Maybe it's true, but I don't want to go into that nuance.”\n\nYeah I guess we shot like some missiles and killed your family or whatever, but we're both slavic. Why are you focusing on the details?",
   "created_utc": 1690225101,
   "score": 59,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jta8zk8",
   "message": "🇺🇦 On the outskirts of Klishchiivka (Bakhmut direction) ZSU destroyed a large group of russians\n\n👀 This is a unit of Russian 72nd or 57th brigade.\n\nNSFW\n\nhttps://twitter.com/Maks_NAFO_FELLA/status/1683549900913385482?t=7QysSrVfAmcXdeto96ToaQ\u0026amp;s=19",
   "created_utc": 1690225042,
   "score": 47,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jta7q42",
   "message": "Something burns in occupied Makiivka, Donetsk region.\n\nhttps://mstdn.social/@noelreports/110770321914371287",
   "created_utc": 1690224558,
   "score": 34,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jta7ndg",
   "message": "\"Horror, lies and disillusionment: Ex-Wagner fighter talks Bakhmut and mutiny\"\n\n[https://www.euronews.com/2023/07/24/horror-lies-and-disillusionment-ex-wagner-fighter-talks-bakhmut-and-mutiny](https://www.euronews.com/2023/07/24/horror-lies-and-disillusionment-ex-wagner-fighter-talks-bakhmut-and-mutiny)\n\n\\---------\n\nSasha – himself a great admirer of Vladimir Putin – painted a picture of confusion around Wagner’s abortive mutiny in June, although he had already returned home when it happened.  \nHe said colleagues told him many commanders, wishing to remain loyal to the Russian president, refused orders to march on Rostov-on-Don, a Russian stronghold near the Ukrainian border, where Wagner seized a military base.  \nAnalysing the clash between Wagner boss Yevgeny Prigozhin and the Putin-backed Russian military - with regular troops reportedly attacking mercenary bases - Sasha was curt.  \n“I’ll put it simply: I don’t like Shoigu \\[the Russian defence minister\\].”  \nBefore the Wagner rebellion on 23 June, which saw it march on Moscow, tensions had been escalating between Prigozhin and the Russian defence establishment, with the mercenary boss openly slamming their campaign.  \nHaving faced down “really good” Ukrainian artillery, Sasha felt gratitude to be home in one piece.  \n“I sleep very well at night. Don't have any nightmares. I got back with all my limbs. I was never wounded. I was quite lucky compared to others.\"  \n“After what I’ve been through, things change and you have different priorities in life such as family,” he continued. “I have brothers… parents \\[and\\] a woman I love”.  \n“That’s also why I don't want to fight anymore. I don't want to risk it all a second time,” he added.",
   "created_utc": 1690224529,
   "score": 25,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jt9yc9c",
   "message": "New Russian update from around Bakhmut and yeah, they’re having a blast. On a side note, shoutout to the Ukrainian Girkin-impersonator for starting to post with English translation ☺️\n\nhttps://twitter.com/girkingirkin/status/1683530991799812107?s=46\u0026amp;t=atIpeQGVIhaOOydeLGsHZw\n\nEdit: Other Russian channels are reporting fighting ongoing in Klishchiivka proper, of course they stated there’s far more AFU losses than Russian. As per the usual.\n\nEdit 2: Probably unsurprising by this point but… the VDV took a beating in Klishchiivka. Quite a few dead bodies.\n\nhttps://twitter.com/noelreports/status/1683541286979026975?s=46\u0026amp;t=atIpeQGVIhaOOydeLGsHZw",
   "created_utc": 1690220661,
   "score": 39,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jt9y6xz",
   "message": "https://www.rferl.org/a/russia-military-reserves-age-raised/32516751.html\n\nRussia literally committing self-androcide 💀",
   "created_utc": 1690220605,
   "score": 33,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jt9x4nj",
   "message": "Hard to imagine this war going for much longer than another year. At current rate, we will have 450k Russian casualties when we reach summer 2024.",
   "created_utc": 1690220202,
   "score": 23,
   "submission_id": "157zlwx"
  },
  {
   "comment_id": "jt9twrs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "157zlwx"
  }
 ]
}