{
 "submission_id": "1588rvv",
 "title": "Poland to launch scheme for “de-concreting” and regreening small towns",
 "selftext": "",
 "created_utc": 1690200316,
 "permalink": "/r/worldnews/comments/1588rvv/poland_to_launch_scheme_for_deconcreting_and/",
 "score": 216,
 "url": "https://notesfrompoland.com/2023/07/23/poland-to-launch-scheme-for-de-concreting-and-regreening-small-towns/",
 "comments": [
  {
   "comment_id": "jt8v0j3",
   "message": "\u0026gt;Poland’s government has announced that a scheme providing small towns with funding to reduce concrete spaces, increase greenery and improve water retention will launch next month.\n\n\u0026gt;Recent years have seen many Polish municipalities remove greenery and replace it with concrete or other similar materials. The trend has been labelled betonoza (“concretitis”) by critics, who note that, as well as being less aesthetically pleasing, concrete worsens water retention and increases temperatures.",
   "created_utc": 1690204685,
   "score": 212,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt917jr",
   "message": "I’m glad that Poland is trying to step in the right direction and I wish them all the success. I sure hope that other countries follow suit.",
   "created_utc": 1690207503,
   "score": 126,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9ool6",
   "message": "they spent the last few decades covering parks with parking lots that nobody uses to make small towns \" feel modern\", glad to see they see the mistakes of this way of thinking.",
   "created_utc": 1690216960,
   "score": 46,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9qhai",
   "message": "We all need to.\nYou will be cooler in Summer, the air will be healthier, you are less likely to be flooded, people are happier with more green, animals find food and shelter, plants store carbon.\nUnseal the earth, wherever you can.\nIf I could, I would replace as much as possible where we really need perfectly smooth surfaces by elevating on stilts, and make as many breaks for trees as doable.\nAlso greening roofs, and vines on the walls.\nA city can be greener than the countryside if cleverly done.",
   "created_utc": 1690217643,
   "score": 31,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9igy7",
   "message": "As far as schemes go, this one sounds nice",
   "created_utc": 1690214562,
   "score": 21,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jtaakuj",
   "message": "Nobody loves cement like the Chinese. Lived in Hong Kong for many years. If you ever saw grass (very rare) it was always called, \"a temporary absence of cement.\"",
   "created_utc": 1690225659,
   "score": 7,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9kzv5",
   "message": "A term I've come to increasingly like is 'rewilding'\n\nBasically undoing the manmade structures and letting nature take an area back over.",
   "created_utc": 1690215550,
   "score": 9,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jta2kbp",
   "message": "I feel like every city everywhere needs to be making the same effort to do this.",
   "created_utc": 1690222475,
   "score": 5,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jta3l6i",
   "message": "This is something that needs to be done worldwide, particularly in the US where there are five parking spots for every car and nearly 300 million cars. If people aren't going to take greenhouse gases seriously the least they can do is increase vegetative cover.",
   "created_utc": 1690222922,
   "score": 4,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jtayps3",
   "message": "Poland’s government is weird man. On one hand they’re extremely homophobic and then they pull stuff like this",
   "created_utc": 1690234981,
   "score": 1,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9bgnp",
   "message": "Wait… So Poland is \"trying that in a small town\"⁉️\nInconceivable‼️",
   "created_utc": 1690211778,
   "score": 5,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9ejx7",
   "message": "Is this the same Poland that is attacking the EU's climate roadmap as \"green communism?\"",
   "created_utc": 1690213021,
   "score": 4,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9iagz",
   "message": "De-communisation.",
   "created_utc": 1690214491,
   "score": 0,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt9zphh",
   "message": "Here in Ireland we need to stop the trend of people tearing out their front gardens to make room for 2+ cars, it's insane, especially since a lot of people replace it with just dark concrete or gravel.  At the very least use some paving and leave some green.",
   "created_utc": 1690221183,
   "score": 1,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jt90jhl",
   "message": "Apparently Russia may try and help them",
   "created_utc": 1690207208,
   "score": 237,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jtarkma",
   "message": "We should all be doing this.",
   "created_utc": 1690232169,
   "score": 1,
   "submission_id": "1588rvv"
  },
  {
   "comment_id": "jtaswf1",
   "message": "Removing concrete is extremely expensive, at least in the states. I hope they're ready for the sticker shock.",
   "created_utc": 1690232685,
   "score": 1,
   "submission_id": "1588rvv"
  }
 ]
}