{
 "submission_id": "15q6vka",
 "title": "AI improves breast cancer detection rate by 20 percent",
 "selftext": "",
 "created_utc": 1691952676,
 "permalink": "/r/worldnews/comments/15q6vka/ai_improves_breast_cancer_detection_rate_by_20/",
 "score": 186,
 "url": "https://www.politico.eu/article/ai-improves-breast-cancer-detection-rate-20-percent-swedish-study/",
 "comments": [
  {
   "comment_id": "jw1unlw",
   "message": "This is where AI will really shine, big juicy clumps of data that only a few extremely skilled people look at and really understand. The AI never needs to understand much, just have variables and a solid goal and they'll look for patterns or descepancies.",
   "created_utc": 1691959605,
   "score": 22,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1df03",
   "message": "I welcome our digital overlords with open arms.",
   "created_utc": 1691952980,
   "score": 161,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1ulpm",
   "message": "“Please state the nature of the medical emergency”",
   "created_utc": 1691959585,
   "score": 36,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1k62r",
   "message": "Been waiting for the vending machine doctor for a long time...",
   "created_utc": 1691955603,
   "score": 28,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw38iks",
   "message": "As a medical professional myself, people who say that radiologists’ job is being threatened by this has no idea of the versatility that a radiologist, or any doctor, provides to the system.\nLike you guys know they don’t just sit around and read mammograms only, right? The bulk would also consist of CT and MRIs and interventional radiology. And you guys know that they don’t just differentiate between cancer and non-cancer right? if a radiologist can only tell me if a particular image is cancer or not cancer, they wouldn’t be very useful good radiologist.\nWhat I see from this, if it’s as good as it say, is that it’ll assist radiologists in these types of work, allowing them to do other things.",
   "created_utc": 1691981077,
   "score": 7,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1rxyi",
   "message": "I am so grateful for this",
   "created_utc": 1691958566,
   "score": 12,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1cpd8",
   "message": "Article:\n\n**Results from a study in Sweden show the potential of using artificial intelligence in mammography.**\n\nArtificial intelligence is able to accurately detect 20 percent more breast cancers from mammograms than traditional screening by radiologists, according to early results from a Swedish trial published overnight.\n\nThe study is the first randomized controlled trial to look at using AI in breast cancer screening and comes amid a dramatically shifting landscape for the technology and how it’s regulated.\n\nThe interim results, published in the Lancet Oncology late Tuesday, found that using AI-supported analysis of mammograms, alongside either one or two radiologists, was as good as using two radiologists without AI and led to 20 percent more cancers being detected. \n\nThere was also a significant reduction in workload for radiologists, with the doctors having to spend 44 percent less time reading mammograms.\n\nThe trial, which is still ongoing, was conducted in Sweden and looked at over 80,000 women. Half the participants had two radiologists look at their mammograms without AI, while the other half had their mammograms analyzed by AI and a radiographer — except in cases where AI generated the highest risk score, in which case two radiologists assessed the screening.\n\nThe results come amid a significant uptick in interest around the potential opportunities and risks that AI poses for medicine and the world more broadly. AI is increasingly being deployed in medical settings, but there is also concern about how algorithms are trained and validated in these spaces, as well as the potential for bias and over-diagnosis. \n\nMeanwhile, the EU is planning stringent regulation around the use of AI and the European Medicines Agency is working on assessing the risks and benefits of the technology for drug development.\n\n**More to be done**\n\nDespite the positive findings, lead author Kristina Lång from Lund University in Sweden said the interim safety results “are not enough on their own to confirm that AI is ready to be implemented in mammography screening.” Lång and her colleagues are waiting for further results from the trial that will indicate whether using AI reduces the number of cancers detected between screenings and so if it is worth rolling out. \n\n“The greatest potential of AI right now is that it could allow radiologists to be less burdened by the excessive amount of reading,” said Lång. She said AI could eliminate the need for a second radiologist to read the mammogram, allowing radiologists to help more patients. \n\nCommenting on the results, Stephen Duffy, professor of cancer screening at Queen Mary University of London, said that reducing the burden on radiologists’ time was “an issue of considerable importance in many breast screening programmes.” But he said there could be concerns that using AI might over-detect harmless lesions.\n\nAs well as being the first randomized trial looking at using AI to help read mammograms, the study was one of the first to look at AI in the field of radiology. An editorial in European Radiology in January argued that randomized controlled trials were important for monitoring the safety of AI systems, which can produce “unpredictable and undetectable errors, not explainable by human logic.”",
   "created_utc": 1691952706,
   "score": 9,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1icyu",
   "message": "AI is going to take over the medical field within the next few years, not decades, years.",
   "created_utc": 1691954897,
   "score": 19,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw2xm9i",
   "message": "I keep reading these articles as “AL” doing something technical.",
   "created_utc": 1691976010,
   "score": 5,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw38ol3",
   "message": "How does that compare with the canine detection rate?\n\nA trained dog can detect breast cancer in urine up to 100% accurately.\n\nhttps://pubmed.ncbi.nlm.nih.gov/34200793/",
   "created_utc": 1691981157,
   "score": 2,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw25u2r",
   "message": "*properly designed computer software.\n\nKeen for the AI buzzword to die again just like it did after the 80s.",
   "created_utc": 1691964021,
   "score": 2,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw26386",
   "message": "\u0026gt; led to 20 percent more cancers being detected.\n\nI hope one day the people (or AI) writing these articles understands that showing us the positive detections without false-positives is completely useless.",
   "created_utc": 1691964124,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw2ycrl",
   "message": "In related news:\n\n20% of doctors accused of not actually \"Checking for lumps\".",
   "created_utc": 1691976341,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw33ugg",
   "message": "AI just reached its teenage years and found a way to touch as many boobs as possible.",
   "created_utc": 1691978861,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw2gge8",
   "message": "How do we know AI aren't simply causing a 20% increase in breast cancer?? These machines cannot be trusted! /s",
   "created_utc": 1691968415,
   "score": 0,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw2ownx",
   "message": "Are you telling me that this damn AI is going to take my Booby Inspector job from me? I just bought the official shirt!",
   "created_utc": 1691972102,
   "score": 0,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw3ape6",
   "message": "So essentially costs went up 20% too. There's never any discussion of how we're going to make AI economically viable. We can't afford the health systems we have now. What's the plan for exponential growth in the rate of diagnosis and number of patients needing care?",
   "created_utc": 1691982152,
   "score": 0,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw340os",
   "message": "Did they use Palantir’s AI?",
   "created_utc": 1691978939,
   "score": 0,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1mi6j",
   "message": "Surprised it's only 20 percent tbh. LLMs are perfect candidates to diagnose based on scans and images, the high quality training data is already there to be harnessed. I have a pet theory that a text model could diagnose schizophrenia based on a writing sample and be way more accurate than any criterion in the DSM",
   "created_utc": 1691956486,
   "score": 251,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw2gb6s",
   "message": "This is the shit AI was made for! Not writing bad data-scraped articles for the AV Club.",
   "created_utc": 1691968353,
   "score": 254,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw36v53",
   "message": "statistical analysis is not AI you dumb f\\*\\*\\*s",
   "created_utc": 1691980275,
   "score": 253,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw1w64w",
   "message": "I hypothesize that I can detect breast cancer and I'm conducting research right now. If anyone would like to participate in my study inbox me.",
   "created_utc": 1691960182,
   "score": 246,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw2kn30",
   "message": "How can I get them to read my mammogram",
   "created_utc": 1691970226,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw3acj6",
   "message": "\u0026gt; Machine Learning\n\nFTFY",
   "created_utc": 1691981975,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw3pt4n",
   "message": "Ai sluttery used for good 😺",
   "created_utc": 1691990704,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw3wfgp",
   "message": "This is really old news. AI have proven to be just as effective if not more when reading mammo, CT, MR, and X-rays when compare to radiologist and will only to increase. Imaging AI looking at a chest X-ray and listing down all of the impressions such as tumor, cancer cells, or any irregularities. Unfortunately, this is never be allow to be practice in the United States. The radiology association is against this and been lobbying against any thing would replace any job in the radiology field.",
   "created_utc": 1691995373,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw3xex8",
   "message": "AI will make a massive difference in womans health, because of all the times they simply didn't bother to look properly at scans before.  \nNow when AI flags it, they can't ignore it.",
   "created_utc": 1691996114,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw3xlzm",
   "message": "I work in the field and the major setback that i see is that hospitals and IT personnel are not technically prepared.\n\nThere is still a lot, a TON of legacy software and engineers are mostly used to work on windows, plus there is a lot of regulations that have to be followed, and rightly so.\n\nThe biggest push for AI in healthcare is the lack of radiologists, the limit for now is investments and a workforce that still doesn't trust the results despite all the studies that are coming out in recent years.",
   "created_utc": 1691996261,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw42cki",
   "message": "I have heard that AI is better at diagnosing various diseases than doctors, which makes it a great tool for decision support. \n\nI wonder about the downsides though, hypocondriacs diagnosing themselves online and then ordering sus medicine from third world countries when they don't get the response they want from healthcare perhaps? But being able to make a first diagnosis online would also be extremely valuable, for the patients, for the health care workers, for the health care system, for the taxpayers, for everyone in short.",
   "created_utc": 1691999942,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw4fpsz",
   "message": "Wow these fake doctors pretending to doctor while AI does all the work, I can write “look for unusual masses” too that doesn’t make me a doctor!",
   "created_utc": 1692009993,
   "score": 1,
   "submission_id": "15q6vka"
  },
  {
   "comment_id": "jw4m6sa",
   "message": "doctors are the weakest link",
   "created_utc": 1692013889,
   "score": 1,
   "submission_id": "15q6vka"
  }
 ]
}