{
 "submission_id": "15qelz9",
 "title": "Iran backs Japan’s call for Kuril Islands talks with Russia amid Moscow ‘betrayal’ in Gulf territorial dispute",
 "selftext": "",
 "created_utc": 1691971493,
 "permalink": "/r/worldnews/comments/15qelz9/iran_backs_japans_call_for_kuril_islands_talks/",
 "score": 182,
 "url": "https://bne.eu/iran-backs-japan-s-call-for-kuril-islands-talks-with-russia-amid-moscow-betrayal-in-gulf-territorial-dispute-285361/",
 "comments": [
  {
   "comment_id": "jw2xsba",
   "message": "Does Russia think it has enough friends to piss off one of less than a dozen countries willing to give it direct military support? What's the gain here other than pissing off any country willing to supply it with arms, ammo and supplies?",
   "created_utc": 1691976085,
   "score": 7,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw2y76a",
   "message": "Russia is a country that regularly abandons its own allies.  Russia will never come to the rescue or have their allies' back when they're getting invaded or are involved in a diplomatic dispute.  In this case they're not backing Iran in their diplomatic dispute.  In the case of Armenia, Russia refused to send aid after they got invaded.  Russia is a worthless ally.  There's no point in making any deals with them since they break deals all the time.",
   "created_utc": 1691976270,
   "score": 189,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw338i1",
   "message": "TIL geopolitics is just a version of high school dramas between nations.",
   "created_utc": 1691978583,
   "score": 210,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3flud",
   "message": "Russia is really trying its best to upset everyone and it’s certainly in no position whatsoever to do so. Putin has failed miserably everything he does goes tits up",
   "created_utc": 1691984679,
   "score": 124,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw2xhuq",
   "message": "LMAO such close allies Russia has. So delicate and so shifty.",
   "created_utc": 1691975957,
   "score": 107,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw43cw0",
   "message": "Nothing east of the Urals should belong to Russia",
   "created_utc": 1692000729,
   "score": 21,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw2zjav",
   "message": "Didn't have that on my 2023 bingo card.",
   "created_utc": 1691976885,
   "score": 56,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw39ssa",
   "message": "this is getting more noncredible by the day",
   "created_utc": 1691981705,
   "score": 59,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3q7ak",
   "message": "Russia will NEVER voluntarily negotiate away the Kuril islands.  \n  \nRussian naval base at Vladivostok needs a safe route for its nuclear submarines to the Pacific Ocean from the Sea of Japan.  Vladivostok is a warm water sea port.  \n  \nThe Kuril islands are part of a chain parallel to the Sea of Japan.  Russia does not want western military facilities to plant devices that track or block or destroy submarines \u0026amp; naval vessels.  \n  \nPrediction:  if (a big IF) Russian Federation collapses, China will buy up or move into eastern Siberia.  They will console Japan by giving them Kuril Islands.  China has plenty of warm water sea ports onto the Pacific Ocean.",
   "created_utc": 1691990964,
   "score": 43,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw2veen",
   "message": "Love to see the child like back and forth between Russia and it’s “allies”",
   "created_utc": 1691975003,
   "score": 56,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3unyd",
   "message": "Well now Russia is making it's own version of the Shahed drones it doesnt need to reply on Iran so much anymore. It's all take take take with Russia until they no longer need you",
   "created_utc": 1691994053,
   "score": 5,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw2oaur",
   "message": "Very low but nonzero chance this will give america an excuse to involve itself more directly with Ukraine. \n\nJapan is a right-and-propper ally to America.",
   "created_utc": 1691971834,
   "score": 75,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw4gyo2",
   "message": "Just a well-known tit for tat policy and nothing serious. UAE can't do shit  about the 3 islands and its claims are really stupid.  How can a country that does not even have 50 years of history claim the islands that have always been under Iran's control?  (more than 12,000 years). You idiots have been ours sometime in the history. Maybe we should follow the Russians and reclaim all our mother lands.",
   "created_utc": 1692010788,
   "score": 1,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3q2i6",
   "message": "It's highly unlikely that this will mean anything-Iran probably just wants some more handouts from Moscow. But we can always dream...",
   "created_utc": 1691990876,
   "score": 10,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3nyhx",
   "message": "Iran is a candidate for BRICS++++ and them doing this shows just how dysfunctional and aimless BRICS is. It's literally a 3 headed dragon pulling in different directions. China is the driving force, but doesn't really have the buy-in from India and Russia, and India and Russia in turn will do things that piss off potential BRICS partners.\n\nGranted no where in hell Russia cares what Iran thinks about the Kurils, and this is just for show, but it is not a good sign of a cohesive counter to NATO and the American-led international order.",
   "created_utc": 1691989507,
   "score": 16,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw2zum7",
   "message": "Well, now this is an interesting turn of events.",
   "created_utc": 1691977030,
   "score": 6,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw42ri0",
   "message": "Really speed running getting the whole world against them.",
   "created_utc": 1692000267,
   "score": 2,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw4bdpq",
   "message": "Moscow owes money for drones, plus is stealing Iran technology to build in Russia with Chinese parts. Slava Ukraine",
   "created_utc": 1692006951,
   "score": 2,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw4hm5l",
   "message": "whappend between russia and iran?",
   "created_utc": 1692011197,
   "score": 1,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3sx2n",
   "message": "This would be the perfect time to take back the kuril islands if you're Japan, Russia is a little pre-occupied.",
   "created_utc": 1691992813,
   "score": 5,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3o4dn",
   "message": "Japan should start a special military operation to secure the Kuril Islands from fascists.",
   "created_utc": 1691989609,
   "score": 5,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw32bk7",
   "message": "Put that one on my “I didn’t see that coming!” 2023 bingo card.",
   "created_utc": 1691978164,
   "score": 0,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3rkt9",
   "message": "Oh, those wily Persians!",
   "created_utc": 1691991885,
   "score": 1,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw493no",
   "message": "Now is the best time for Japan to take their historic lands back, it's same argument Russia used for Ukraine regions so they can't complain about it. And all their troops are busy. It's not war, just a special military operation",
   "created_utc": 1692005237,
   "score": 1,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw4g7c8",
   "message": "That's interesting... Aren't those the islands that have been under dispute since WWII? Japan and Russia have never signed a peace treaty. They're technically still at war.\n\nEDIT: Yes, those are the islands I was thinking of.",
   "created_utc": 1692010308,
   "score": 1,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw40x2l",
   "message": "Russia (and Iran) have a tendency to screw over any country that aligns with them. Corruption spreads",
   "created_utc": 1691998809,
   "score": 255,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw39t3u",
   "message": "World politics, about as ridiculous as any of the Housewives reality TV series.",
   "created_utc": 1691981709,
   "score": 253,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3lg7k",
   "message": "UN=League of Nations.",
   "created_utc": 1691987966,
   "score": 247,
   "submission_id": "15qelz9"
  },
  {
   "comment_id": "jw3v8vg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qelz9"
  }
 ]
}