{
 "submission_id": "15qh8de",
 "title": "Australia PM considers national public holiday because of Women's World Cup",
 "selftext": "",
 "created_utc": 1691978671,
 "permalink": "/r/worldnews/comments/15qh8de/australia_pm_considers_national_public_holiday/",
 "score": 107,
 "url": "https://www.forbes.com.au/news/sport/matildas-public-holiday-womens-world-cup/",
 "comments": [
  {
   "comment_id": "jw3chlv",
   "message": "* Yep, don't jinx it.\n* The proper Australian approach is the one Bob Hawke adopted in 1983 and doesn't involve waiting a week. Immediately after the result the media interviews the PM who declares \"any boss who sacks anyone for not turning up today is a bum.\"",
   "created_utc": 1691983058,
   "score": 131,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3h4tu",
   "message": "It's a good plan, now everyone's excited for the results, I mean a holiday on the line will get people passionate about a game they may of not tuned into before, it's pretty good exposure.",
   "created_utc": 1691985500,
   "score": 86,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3cpkv",
   "message": "He doesn’t have direct control of holidays but he‘s all but promised (weeks ago) that if the women got to the finals then it was a public holiday. Main reason I’m following the football (good way to get the nation even more invested)\n\nHe now seems to be moving the goal posts to only “if they win” so he’s probably moving down a few preferences next election if we get to the final and he doesn’t follow through 🙃",
   "created_utc": 1691983170,
   "score": 47,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw41uy1",
   "message": "Up the Tillies",
   "created_utc": 1691999551,
   "score": 6,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3549e",
   "message": "The dumbest part of this article is this bit:\n\n\u0026gt;National party leader, David Littleproud, said the move could be costly.\n\n\u0026gt;“I think we’ve just got to understand that someone’s got to foot that bill and businesses out there are doing it tough,” \n\nOh those poor businesses..",
   "created_utc": 1691979445,
   "score": 122,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3cmpi",
   "message": "Australian Prime Minister is reportedly considering the possibility of declaring a national public holiday in honor of the Women's World Cup. The move comes as a part of a broader review of policies aimed at promoting gender equality and recognition of women's achievements in sports. The proposal reflects growing momentum to celebrate women's sports on a national scale.",
   "created_utc": 1691983129,
   "score": 21,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3n2ak",
   "message": "Any reason for a holiday is a good reason.",
   "created_utc": 1691988945,
   "score": 6,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3rhxe",
   "message": "And anyone that gores to work is a bum .. Bob Hawke",
   "created_utc": 1691991829,
   "score": 8,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw470p6",
   "message": "it will all be moot when they lose to the English Wednesday...",
   "created_utc": 1692003623,
   "score": 1,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw478l5",
   "message": "Yeah nah.",
   "created_utc": 1692003794,
   "score": 250,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw46llc",
   "message": "Got to laugh.  Always try not to get ahead of yourself..  The US team had already won it in their minds too .. oops..",
   "created_utc": 1692003295,
   "score": 252,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3a0ib",
   "message": "What a bloody stupid idea.",
   "created_utc": 1691981810,
   "score": 215,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw469cg",
   "message": "[removed]",
   "created_utc": 1692003029,
   "score": 249,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3jcr6",
   "message": "Aussie Netball girls won their World Cup last week. They don't get a look in from Albo for a public holiday. Possibly because Albo couldn't walk the crowds there in Cape Town as if had won. With Albo there's always a slice in it for himself.",
   "created_utc": 1691986745,
   "score": 222,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3rw32",
   "message": "Surprise public holidays without prior notice is the kind of thing a dictatorship does.\n\nProperly disrespectful to the lives and plans of the general public.\n\nWtf happens to the surgery I've been waiting for when the 'great leader' declares that the staff should have the day off.\n\nEdit: ITT entitled and selfish pieces of shit who don't give a fuck about others as long as they get a day off.",
   "created_utc": 1691992099,
   "score": 198,
   "submission_id": "15qh8de"
  },
  {
   "comment_id": "jw3serb",
   "message": "We here in the US are declaring a National Day of Mourning because our Women's Soccer'  Team got more involved in Politics than playing soccer.",
   "created_utc": 1691992453,
   "score": 208,
   "submission_id": "15qh8de"
  }
 ]
}