{
 "submission_id": "1587tyu",
 "title": "Hundreds of thousands of people fled Russia after it invaded Ukraine — and now the countries that took them in are seeing a boost in their economies",
 "selftext": "",
 "created_utc": 1690197716,
 "permalink": "/r/worldnews/comments/1587tyu/hundreds_of_thousands_of_people_fled_russia_after/",
 "score": 238,
 "url": "https://ca.style.yahoo.com/hundreds-thousands-people-fled-russia-095327835.html",
 "comments": [
  {
   "comment_id": "jt8jp6f",
   "message": "Most of these refugees are both highly skilled and highly motivated - and probably willing to integrate in order to avoid ever going back. Win win for everyone except Russia.",
   "created_utc": 1690198586,
   "score": 12,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8rp9h",
   "message": "Brain drain is a real thing.  The suffering it causes will last.",
   "created_utc": 1690203056,
   "score": 1,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8qeia",
   "message": "My team got a really good  QA engineer. She put in her visa paperwork to come to the US right after the first Crimean invasion and has been in the states for a few years now. She has no plans to ever return.",
   "created_utc": 1690202388,
   "score": 103,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8nzac",
   "message": "The converse of this is that when the dust settles, Russia will be even more of a third world country",
   "created_utc": 1690201088,
   "score": 41,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8uq1f",
   "message": "Russia brain drain.",
   "created_utc": 1690204545,
   "score": 108,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9aar9",
   "message": "Many Russians came across the Mexican border with article 42 ending. Nothing wrong with that, they can't sit around and wait for the visa lottery in the mean time. I'm housing my buddy who is awaiting his ICE appointment next year for a path to citizenship.",
   "created_utc": 1690211300,
   "score": 48,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9zjlm",
   "message": "Sounds like a lot of the intelligent Russians, that were able to, took off. Any state that loses a large chunk of the educated population in a small window of time is going to have a tough future ahead of them.",
   "created_utc": 1690221121,
   "score": 14,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9pdvr",
   "message": "I was talking to a friend who's from Indonesia about this. He said his country has taken in the most Russian immigrants since the war started and it's generally seen as a hood think as they are mostly skilled and somewhat affluent.",
   "created_utc": 1690217231,
   "score": 12,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9fwgd",
   "message": "When you have good people but your government is garbage...",
   "created_utc": 1690213555,
   "score": 45,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9uwzb",
   "message": "My family and I (me, my wife and my mother) are such refugees.  \nMarch 1, 2022 we landed in Turkey. Then they flew to Mexico, and on March 22, 2022 they asked for political asylum on the border between Tijuana and San Diego. After that, we were sent to the detention center and released on May 9 and 11, 2022, taking our passports.  \nWe are now contributing to the US economy while we await the decision of the immigration court in our case in New York City.",
   "created_utc": 1690219358,
   "score": 34,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9by7j",
   "message": "The ones with money fled just like in Ukraine, the ones with the means and connections just moved real estate and bank accounts.",
   "created_utc": 1690211975,
   "score": 20,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9qg15",
   "message": "Really should shout this from the rafters for all of the nationalist, right wing, conservatives out there: Immigration is good for the economy!",
   "created_utc": 1690217630,
   "score": 10,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9zphk",
   "message": "It's been a huge brain-drain for Russia, nothing as bad as what befell the Russian empire after 1917, but this has permanent ramifications for Russia's workforce. People are going to adapt more and more to countries that compensate them exceedingly better in terms of pay, in terms of, oh, I don't know, civil liberties, a sense of security-\n\nI hope many expats remain tied to their families and fellow travelers back in the Federation to hopefully help enact and secure regime change when the time is right.",
   "created_utc": 1690221184,
   "score": 11,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8peww",
   "message": "I hadn't realized it'd been long enough for those types of effects to be measurable.",
   "created_utc": 1690201867,
   "score": 37,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt91vot",
   "message": "There are more and more talks about new wave of mobilization(that technically is still ongoing). More and hight ranking politicans talk about problems on frontline with vacations and fatigue of peoople from last wave of mobilization. \n\nDraft offices hire new workers constatly. And multiple new law from state Duma that rise fines for draft dodgers.\nFine for failure to arrive after recieving draft nocite raised from 3k rubles to 50k rubles.\nFine for not submitting information in time in draft office raised from 500 rubles to 15k for individuals and 500k rubles for companies.\n\nSo soon there will be new wave of runners.",
   "created_utc": 1690207797,
   "score": 13,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt90g63",
   "message": "Because immigrants are great for countries if they are treated well and regulated well.",
   "created_utc": 1690207167,
   "score": 76,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9byds",
   "message": "Turns out having well educate migrant workers boosts your economy. Who knew?",
   "created_utc": 1690211977,
   "score": 22,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8zty3",
   "message": "The smart ones left",
   "created_utc": 1690206896,
   "score": 22,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt8w9ee",
   "message": "Russia is the biggest loser they are losing young professionals. While other countries gain",
   "created_utc": 1690205273,
   "score": 28,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt94jdm",
   "message": "The people with money and means left. Now it’s just asskissers and pensioners left on Putin’s Titanic.",
   "created_utc": 1690208929,
   "score": 8,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt96c6d",
   "message": "Russian brain drain.",
   "created_utc": 1690209677,
   "score": 7,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jta450p",
   "message": "Adidas track suit sales also rocketed.",
   "created_utc": 1690223149,
   "score": 6,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9fgi2",
   "message": "Migrants are a net economic benefit, always have been.",
   "created_utc": 1690213381,
   "score": 23,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtaj94m",
   "message": "I've never understood the right's opposition to migrants.\n\nNot to dehumanise, but to an economist it's like a firesale for labour.",
   "created_utc": 1690229002,
   "score": 3,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtas7va",
   "message": "Russian immigrants both from before and after 2022 can be a bit of a mixed bag.\n\nSome people I met were smart and hardworking. Others were less smart but still had a good work ethic.\n\n Some were really full pro-Russian nationalistic and full of weird explanations and theories to support their ideas.\n\nSome were quite progressive in their politics.\n\nMost could and would drink alcohol in prodigious amounts and even the smart ones had a strained relationship with western ideas of occupational safety and personal risk management.\n\nBy and large they were just people like everyone else.\n\nElderly Russian women living in the west in my very limited experience are best staid clear of.\n\nThe real test will come a generation down the road when the ones who staid have had families of their own. Often kids in that sort of situation can get some real weird ideas and fall into bad ideologies.",
   "created_utc": 1690232418,
   "score": 3,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtb1e1i",
   "message": "The unfortunate thing is that the more decent and intelligent people leave Russia, the higher percentage of people there will be in Russia who support Putin and the war.",
   "created_utc": 1690236053,
   "score": 1,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9dnnd",
   "message": "Yeah dictatorial countries tend to have a brain-drain due to highly educated professionals who aren’t friends with the ruling regime wanting to live somewhere with better standards of living where they won’t potentially be murdered for being educated as has happened a couple of times throughout modern history",
   "created_utc": 1690212663,
   "score": 3,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9nxk8",
   "message": "I mean, people who flee Russia are more likely to be educated. An authoritarian shithole like Putin's Russia isn't a good place for free-thinking individuals.\n\nThis brain drain is gonna cost Russia billions in the long term.",
   "created_utc": 1690216675,
   "score": 6,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9zica",
   "message": "I Wonder if there is an anti leopards ate my face sub.\n\nSomething like  'stray dog I took in, found my ring' or something",
   "created_utc": 1690221109,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jta3e41",
   "message": "The best russian brains are already out of his country. Good job vlad",
   "created_utc": 1690222839,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jta3jml",
   "message": "Well they moved to countries that don't have the brightest economy or industry. It's not like they moved to Israel or Western Europe where their impact will be close to zero.",
   "created_utc": 1690222904,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jta5y03",
   "message": "People make economies work.",
   "created_utc": 1690223860,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jta9q1j",
   "message": "Same happened initially with Venezuelans. When the upper middle class and well educated left the country, they increased their GDP. Now you have more economical refugees that probably would vote for Chavez if he was a zombie.",
   "created_utc": 1690225329,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtag685",
   "message": "I guess the initial batch of refugees were actual conscientious objectors. Everyone now is just afraid of getting drafted",
   "created_utc": 1690227819,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtakvuh",
   "message": "People with money, who left Russia, now spend their money in other countries. Who would have thought?",
   "created_utc": 1690229629,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtalct1",
   "message": "What an interesting phenomenon. Perhaps we could coin this unprecedented event henceforth, \"Immigration\".",
   "created_utc": 1690229810,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtarvz4",
   "message": "People with the will and drive to up and leave are likely to apply that will and drive to everything they do.",
   "created_utc": 1690232290,
   "score": 2,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtb23wk",
   "message": "I know some folks in the Czech Republic that are telling a bit of a different story. Ukrainian refugees flowed in and at first everyone was super willing to help them out but it's been years now and tensions are rising a little. I like the spin this article is putting on it by focusing on the numbers but let's tap the brakes a bit on how economically great it is that so many people were forced to flee to neighboring countries. None of it's a net positive, I don't think.",
   "created_utc": 1690236348,
   "score": 1,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jtb4fr0",
   "message": "Not surprising. The smart people want nothing to do with this genocide and bailed. The idiots who remain are those apolitical types with their head in the sand. \n\nThere needs to be a T-shirt made for Russians that just says \"I'm apolitical\"",
   "created_utc": 1690237322,
   "score": 1,
   "submission_id": "1587tyu"
  },
  {
   "comment_id": "jt9lfsr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1587tyu"
  }
 ]
}