{
 "submission_id": "158f7ue",
 "title": "Fukushima fish with 180 times legal limit of radioactive cesium fuels water release fears | Fukushima",
 "selftext": "",
 "created_utc": 1690215550,
 "permalink": "/r/worldnews/comments/158f7ue/fukushima_fish_with_180_times_legal_limit_of/",
 "score": 116,
 "url": "https://www.theguardian.com/environment/2023/jul/24/fukushima-fish-with-180-times-legal-limit-of-radioactive-cesium-fuels-water-release-fears",
 "comments": [
  {
   "comment_id": "jt9rdlz",
   "message": "They're trying to conflate \"This fish lives close to the reactor\" with \"Fish far away from the reactor will be made dangerously radioactive due to the water release planned.\"\n\nThat's equal parts dishonest and stupid, so I expect people to eat it up with a spoon.",
   "created_utc": 1690217986,
   "score": 69,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtab6p1",
   "message": "Someone should arrest those fish!",
   "created_utc": 1690225892,
   "score": 50,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtacyqh",
   "message": "Look at it this way, you no longer need wasabi for your sushi!",
   "created_utc": 1690226581,
   "score": 41,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtax0sk",
   "message": "The fish lived right next to the reactor that failed. Of course it'll be filled with radiation. That has nothing to do with the treated water.          \n\nIt's like banning people from Wuhan out of fear of the corona virus even if they haven't lived there in over 3 years.",
   "created_utc": 1690234305,
   "score": 25,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jt9t3xg",
   "message": "Just boil it longer.  cesium gives it a nice crunchiness",
   "created_utc": 1690218660,
   "score": 47,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtarf51",
   "message": "A soccer mom crashing her SUV in a bad way leads to more loss of life than this entire disaster and it happens daily. The amount of attention bad faith actors and idiots have put on the radiation from this incident would be laughable if it wouldn't put us off the one thing that could help climate change. In 100 years the historians will be puzzled by our stupidity about this.",
   "created_utc": 1690232112,
   "score": 20,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtavidx",
   "message": "Radioactive anchovies are a key ingredient in making a great cesium salad.",
   "created_utc": 1690233707,
   "score": 3,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jt9pvoe",
   "message": "I guess we'll just have to raise the acceptable legal limits on cesium.\n\nNothing to see here",
   "created_utc": 1690217416,
   "score": 34,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb6mrl",
   "message": "The whales are gonna get spiderman powers and then it's payback time.",
   "created_utc": 1690238255,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtaps7q",
   "message": "In Florida they'd just make roads out of the fish",
   "created_utc": 1690231486,
   "score": 3,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta1g3u",
   "message": "Make the plant owners and politicians eat the fish.",
   "created_utc": 1690221844,
   "score": 3,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtafmrm",
   "message": "Naturally, this can only mean one thing; it’s Kaiju time.",
   "created_utc": 1690227612,
   "score": 3,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta0ufp",
   "message": "In February 2022, the IAEA Task Force released its first report, the IAEA Review of Safety Related Aspects of Handling ALPS-Treated Water at TEPCO's Fukushima Daiichi Nuclear Power Station. The report clearly stated that the Task Force \"commented on the importance of defining the source term for the discharge of ALPS (Advanced Liquid Processing System) treated water in a sufficiently conservative yet realistic manner.\" \n\nSource terms of contaminated water include the composition of radionuclide and the activity of simulation of nuclides dispersion. As the premise of marine environmental monitoring, the accuracy and reliability of the source term-related data is crucial. However, Japan's data statistics and monitoring on the source terms are disappointingly full of loopholes. \n\nFirstly, the types of radionuclides that TEPCO monitors are relatively few, making it far from being able to reflect the correct radionuclide dispersion in the contaminated wastewater.\n\nThe Fukushima nuclear-contaminated wastewater, coming from the wastewater which was directly in contact with the core of the melted reactor, theoretically contains all the hundreds of types of radionuclides in the melted reactor, such as fission nuclides, a uranium isotope, and transuranic nuclide.\n\nBut TEPCO at first only listed 64 types of radionuclides including H-3 and C-14 as a (data) foundation for the works including monitoring and analysis, emission control, and environmental impact assessment. These 64 radionuclides did not include the uranium isotope and certain other α-nuclides, which have long half-lives while some are highly toxic.\n\nTEPCO's exclusion of the radionuclides mentioned above has greatly compromised the effectiveness of its monitoring work, as well as the credibility of its environmental impact assessment result, the insider stressed.\n\nAs for sampling and monitoring, TEPCO initially only sampled and monitored nine nuclides in the nuclear-contaminated water except tritium, including Cs-134, Cs-137, Sr-90, C-60, Sb-125, Ru-106, I-129, Tc-99, and C-14 (as well as gross α and gross β).\n\n\"TEPCO's plan of only monitoring a few types of radionuclides is unscientific,\" the insider told the Global Times.\n\nLater, during the review process of the IAEA Task Force in 2022, TEPCO changed the number of radionuclide types it was monitoring and analyzing to 30, and then decreased it to 29 this year. This is far from enough to provide a complete assessment of the extremely complex nuclides in the Fukushima nuclear-contaminated wastewater.\n\nSecondly, there are missing activity concentration values for multiple radionuclides in TEPCO's monitoring scheme.\n\nTEPCO's public report on the 64 radionuclides only provides activity concentration values for 12 radioactive nuclides other than tritium, while over 50 other nuclides do not have specific activity concentration values. The report, while only offering gross α and gross β values, doesn't disclose the respective concentration levels of many highly toxic radionuclides in the Fukushima nuclear-contaminated wastewater, such as Pu-239, Pu-240 and Am-241. \n\n\"[TEPCO's] current plan only monitors some of the nuclides and the gross α and gross β values, which cannot accurately indicate the fluctuations or changes in the activity of each nuclide after treating the contaminated wastewater due to the fluctuation of the nuclide source term composition,\" said the insider. \n\nThis operation of TEPCO has largely increased the uncertainty of the [nuclide] source item information of the nuclear-contaminated wastewater, and thus greatly increases the difficulties of making subsequent monitoring plans and marine ecological environmental impact assessment, he added.\n\nThirdly, TEPCO didn't make conservative assumptions in many aspects of its monitoring data, and some of the assumptions it made were somewhat \"negligent.\"\n\nIn the process of treating the nuclear-contaminated wastewater, the slight particle shedding of chemical precipitants and inorganic adsorbents in the ALPS may cause some radionuclides to exist in a colloidal state, the insider explained.\n\nTherefore, TEPCO's assumption that all nuclides in nuclear-contaminated wastewater in the ALPS are water-soluble is obviously invalid, said the insider. \"TEPCO should scientifically and comprehensively analyze whether colloidal nuclides are present in the nuclear-contaminated wastewater based on the long-term operation experience of its ALPS system,\" he noted.",
   "created_utc": 1690221614,
   "score": 3,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jt9ousc",
   "message": "safe to eat though",
   "created_utc": 1690217027,
   "score": 0,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jt9stwe",
   "message": "Article states its fish near the plant. \n\nI'm not saying Japan's government is infallible, but if there's any government body out there determined to actually resolve an issue efficiently and without cutting corners because of money or other reasons - it's Japan's. The IAEA also approved of this plan and gave it the green light.\n\nThey may need to do some adjustments of their original plan, whether that be the flow of release or other factors. (I'm not a scientist, environmentalist, doctor, or any sort of specialist when it comes to this topic) but it's pretty clear they're not going to poison the ocean surrounding their island.",
   "created_utc": 1690218551,
   "score": 251,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtamisc",
   "message": "I’ve wondered from reading about China’s 10000 meter deep hole they are drilling in search of natural gas (I had no idea there was gas down that deep): can Japan dig a hole several miles deep and just pump this water down into it slow enough until it’s all gone?",
   "created_utc": 1690230251,
   "score": 2,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb4qh0",
   "message": "I’ve said this for awhile. They’ve told people they can go back but the radioactivity has been beyond the legal limit for awhile. I believe a lot of the lying has to do with the push for nuclear energy and of course money unfortunately. But we can’t forget that all it takes is one accident. \n\nWe need to remember that while nuclear is a good TEMPORARY option, there’s a major risk. And we need to be rapidly working for an alternative.",
   "created_utc": 1690237447,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb5ac9",
   "message": "Wait.  The Japanese government claims it is safe.  Hard to believe they would mislead.",
   "created_utc": 1690237679,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtai1df",
   "message": "I want to eat it.  I want the fish powers!",
   "created_utc": 1690228530,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtaxx8x",
   "message": "It’s too bad Japan can’t develop a way to make hydrogen from the water. If they could develop a process to mitigate the water by creating hydrogen energy the system would be available the next time a reactor has a meltdown around the world. The water could be transported to Fukushima to go through the process and the liquid hydrogen produced could be used by the military.",
   "created_utc": 1690234664,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtabuhb",
   "message": "Nobody saw this coming.",
   "created_utc": 1690226149,
   "score": 254,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jt9rfw7",
   "message": "okay but how many eyes did it have?",
   "created_utc": 1690218010,
   "score": 254,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta26q1",
   "message": "no shit.\nmost of the PR is centered around tritium, and talk about how the planned released tritium is less than what other plants are releasing (at 20 TBq a year, which is lower than most active plants, especially compared to Canada, French, and United States)\n\nbut tritium is just one radio active material, and is relatively benign at that. there also isn't a real legal limit on how much tritium can a plant release (otherwise France La Hange at 11400 Tbq would be more than any other civilian nuclear plant combined), but there is actually a limit to things like  iodine 131 and caesium 137, which japan has been quite silent about since the very beginning.\n\nbut of course geo politics will trump any other concerns and this will just be swept under a rug.",
   "created_utc": 1690222310,
   "score": 248,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtaqc05",
   "message": "Double and give it to the next person",
   "created_utc": 1690231699,
   "score": 0,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtas6oq",
   "message": "We’ve made some tests: it‘s perfectly safe. Don’t you worry so much!",
   "created_utc": 1690232405,
   "score": 0,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtasr4e",
   "message": "Just some Radioactive fish.  Nothing to see here folks. Move along.",
   "created_utc": 1690232626,
   "score": 254,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtaydrs",
   "message": "The issue of tritium was always a blind to the much more serious contamination leaching out of the reactors into the ground and groundwater. Fukushima is calculated to cost over a trillion US$ by the time they clean it up though I doubt the site will be safe anytime this century.",
   "created_utc": 1690234849,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta47s0",
   "message": "Eating fish in 2023 ? Not me",
   "created_utc": 1690223179,
   "score": 251,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb6ec5",
   "message": "Is this headline deliberately trying to be dishonest and confuse people by spreading fear?",
   "created_utc": 1690238153,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta15tf",
   "message": "I had a much higher regard for the Japanese, but it seems like ,like most humans ,they too are very stupid",
   "created_utc": 1690221734,
   "score": 244,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtalw69",
   "message": "Maybe it got there on its own…\nWe can’t take that chance!\nYou always say that! I want to take a chance",
   "created_utc": 1690230015,
   "score": 254,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb052a",
   "message": "Color me….surprised? Scared? Nihilistic at the inevitability of our demise?",
   "created_utc": 1690235547,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtav83z",
   "message": "Yeah no shit sherlocks. What do yiu think will happen in 50 or 100yrs of dumping millions of gallons daily? The entire sea of Japan will be polluted and everything in and around it. I wouldn't be surprised if shit made it to Hawaii waters by then, because all their trash ends up here.",
   "created_utc": 1690233596,
   "score": 253,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta6edb",
   "message": "Can we translate this is radiographyes per year?",
   "created_utc": 1690224038,
   "score": 255,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb87qt",
   "message": "Except they've already extensively proven the water is safe and people are just morons.",
   "created_utc": 1690238934,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jta7kbf",
   "message": "Another good reason to go vegan",
   "created_utc": 1690224495,
   "score": 238,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtanglf",
   "message": "So if you eat this fish, does this mean you could potentially become Mermaid Man or Barnacle Boy?",
   "created_utc": 1690230605,
   "score": 254,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb2v9e",
   "message": "Look at all these Reddit radiation experts happy to eat radioactive fish.",
   "created_utc": 1690236664,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb9b7v",
   "message": "\"the impact on the public and environment will be minuscule\"\n\nFuck right off with that shit, Tepco!",
   "created_utc": 1690239402,
   "score": 1,
   "submission_id": "158f7ue"
  },
  {
   "comment_id": "jtb9udf",
   "message": "I don't get it, can't they just increase the legal limit of cesium?",
   "created_utc": 1690239626,
   "score": 1,
   "submission_id": "158f7ue"
  }
 ]
}