{
 "submission_id": "158hpai",
 "title": "‘Trying to make the world starve’: Russian drones destroy grain warehouses at Ukraine ports",
 "selftext": "",
 "created_utc": 1690221006,
 "permalink": "/r/worldnews/comments/158hpai/trying_to_make_the_world_starve_russian_drones/",
 "score": 68,
 "url": "https://www.theguardian.com/world/2023/jul/24/russian-drones-destroy-grain-warehouses-ukraine-danube-ports",
 "comments": [
  {
   "comment_id": "jtahz19",
   "message": "Russia is risking bringing other nations into this fight.",
   "created_utc": 1690228505,
   "score": 178,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jt9ztoh",
   "message": "Russia is attacking the world by proxy. He needs to be sanctioned so heavily that even his allies need to think twice.",
   "created_utc": 1690221228,
   "score": 22,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jta0ujg",
   "message": "He’s trying to force the world into pressuring Ukraine into a bad “peace” treaty, that wouldn’t be worth the paper it’s written on. He would simply spend a year or two restocking the military and then just attack again, banking on the world growing tired of being involved with war and the economic crisis it creates, to just let him accomplish what he’s trying to do now. Also you can bet that he would also be banking on the further rise in right wing governments across the west to be less willing to help Ukraine.",
   "created_utc": 1690221615,
   "score": 112,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtaqw8w",
   "message": "Wouldn’t be the first time Russia starved Ukraine",
   "created_utc": 1690231912,
   "score": 26,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtammy0",
   "message": "This war has shown us just how absolutely pathetic Putin actually is.",
   "created_utc": 1690230294,
   "score": 44,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtamng8",
   "message": "That wouldn’t be the first time…\nI recommend reading about the Great Hunger in Ukraine… that was also Russia’s doing.",
   "created_utc": 1690230300,
   "score": 24,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jta46d6",
   "message": "They basically admitted this too",
   "created_utc": 1690223164,
   "score": 16,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtacvnk",
   "message": "Holodomor 2.0.",
   "created_utc": 1690226548,
   "score": 22,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtafmc9",
   "message": "Beside being it a retaliation for Crimea and Moscow, Russia also wants to sell her own grain with a big price up which would enable her more funds for the country and thus the war.",
   "created_utc": 1690227608,
   "score": 17,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtaxcoa",
   "message": "Fuck Russia, CUT THEM OFF FROM THE REST OF THE WORLD. They are fucking selfish assholes.  Fuck them.",
   "created_utc": 1690234438,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtay8gq",
   "message": "Pull all food contracts with Russia.",
   "created_utc": 1690234790,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb11a6",
   "message": "To those many who still disassociate this war with the climate crisis... Behold.",
   "created_utc": 1690235909,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb43ih",
   "message": "They failed to freeze Europe and they will fail to starve the world. They are ideologically bankrupt and can’t seem to grasp that all of this is a losing battle. Just give up already Russia, it’s not working",
   "created_utc": 1690237179,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb4rnr",
   "message": "Time for the same world to make Russia one big parking lot.",
   "created_utc": 1690237461,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtarsnc",
   "message": "Oh how I yearn for the Russian navy to begin sinking too. Just for effect lol",
   "created_utc": 1690232255,
   "score": 3,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtaor0p",
   "message": "The world is going to starve because there are world wide crop failures due to extreme weather events from climate change.\n\nRussia would be insane to destroy the grain warehouses in Ukraine. If they were smart they would have shipped it back to Russia so when the pain of the crop failures are felt they'd have a bargaining chip when it comes to trade.",
   "created_utc": 1690231094,
   "score": 3,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb12tm",
   "message": "This war will lead to a revolution in drone and anti-drone technology (obviously).  While drones aren't new to the battlefield, the degree and utilization of cheap drone technology has gotta be causing militaries the world over to rethink modern warfare.\n\nA cheap drone can wreak havoc for relatively little costs, are far more expensive to shoot down then to build and take almost no risk on the part of the user.",
   "created_utc": 1690235926,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb436c",
   "message": "Considering a good sized percentage of that was supposed to go to China... that could end very, *very* badly for Russia...given that China is one of the few countries still supplying arms to them.",
   "created_utc": 1690237175,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jta9fng",
   "message": "WW3 inbound",
   "created_utc": 1690225216,
   "score": 251,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb521d",
   "message": "Yo, what happened to the ole \"we don't negotiate with terrorists*?\n\nIt's time to end this charade, enough people have suffered and died. And we shouldn't wait until some mouthbreathing russian drunk blows up Zaporizhzhia.\n\nTime for NATO to declare an ultimatum and enter Ukraine and send the Russian terrorists home - be it with pulse, or without.",
   "created_utc": 1690237582,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb0iaf",
   "message": "Yeah, but get too close to said ports with your fucking fishing boat and suddenly you're the supposed warmonger.",
   "created_utc": 1690235693,
   "score": 1,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtanirt",
   "message": "Bad Russia, not good. But west should have acoustom yo such things, they did the same in the past (insert Winston Churchil killing millions in the indian subcontinent by starving\nWhen he deliberately forced and divert all the locally grown food to fed his WW soldiers..the infamous one man made Bengal famine).",
   "created_utc": 1690230628,
   "score": 230,
   "submission_id": "158hpai"
  },
  {
   "comment_id": "jtb9gmu",
   "message": "They’re just trying to encourage a low-carb lifestyle to combat obesity in developed nations.  Putin’s doing us a favour! /s",
   "created_utc": 1690239464,
   "score": 1,
   "submission_id": "158hpai"
  }
 ]
}