{
 "submission_id": "158jvbc",
 "title": "68% of Israeli startups taking legal and financial steps due to judicial overhaul - like withdrawing cash reserves, changing HQ location outside Israel, relocation of employees and conducting layoffs",
 "selftext": "",
 "created_utc": 1690225809,
 "permalink": "/r/worldnews/comments/158jvbc/68_of_israeli_startups_taking_legal_and_financial/",
 "score": 13,
 "url": "https://www.calcalistech.com/ctechnews/article/b1vq5wqqn",
 "comments": [
  {
   "comment_id": "jtaj9hl",
   "message": "Independent judiciaries are extremely important to a free market.",
   "created_utc": 1690229006,
   "score": 3,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtb2t2q",
   "message": "The Tel Aviv startup scene has been super hot.  This is a huge loss for everyone.",
   "created_utc": 1690236638,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtagz5g",
   "message": "From what I've read the overhaul sounds like a fascist power grab, but what about it is worrying to startups?",
   "created_utc": 1690228129,
   "score": 159,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtb6gb0",
   "message": "Fascism is actually fucking disastrous for business and everywhere from Israel to Florida we see businesses fleeing from governments that go full on fascist.\n\nWhen you don't have an independent judiciary, I, as a startup, could start a business, only for the government to seize it and leave me no recourse because the government owns the judges and they simply refuse to even hear my case.\n\nThink about the fact that in the US, if the government wants to take action against a citizen, they must enter proceedings through a court, where an independent judiciary ensures that there is at least as much fairness and procedure as possible.\n\nThis is essential to any free country.  One of the most essential elements.\n\nNetanyahu is a dictator and has abandoned the pretense of democracy.  No one should allow this to stand, and it will have the greatest negative effect on the Israeli people themselves",
   "created_utc": 1690238177,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtambl6",
   "message": "Right wing parties are terrible for the economy.  Right wingers ruin every country they control.  They are not \"pro-business\" as they often claim.  Right wingers are LIARS.  Never trust them and never put them in power, and if they ever do get power, do what you can to remove them from power.  The survival of every nation depends on keeping right wingers out of power.  Right wingers betray every nation they control.  Right wingers are the biggest threat to the national security of every country, mainly because they can attack from within.  They have an advantage that no external enemy has.  Netanyahu and his allies have done more damage to Israel than all of Israel's foreign enemies combined.  They are the only ones who can destroy Israel and they are succeeding.  I hope the protesters continue blocking roads.  They should also block the business entrances of every business that supports or funds Netanyahu and his allies.",
   "created_utc": 1690230177,
   "score": 215,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtavv56",
   "message": "And just like that Israel is a complete joke.",
   "created_utc": 1690233845,
   "score": 47,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtarg5v",
   "message": "Israel puts heavy pressure on the US to stamp out any citizen led boycott of Israeli companies, then drives them out themselves. Truly amazing work .",
   "created_utc": 1690232122,
   "score": 18,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtb3ge4",
   "message": "Israel is getting a stink like 1980s south africa, positive spin can only cover so much.",
   "created_utc": 1690236909,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtb2y4e",
   "message": "Oof",
   "created_utc": 1690236697,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtarmr9",
   "message": "It's going to have to be a whole bunch of this kind of thing to make a difference.",
   "created_utc": 1690232193,
   "score": 3,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtb5kuu",
   "message": "Good. Unfortunately when people try to do this because apartheid is bad, it's called \"anti-Semitism.\"",
   "created_utc": 1690237802,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtaz39l",
   "message": "I’m okay with this.",
   "created_utc": 1690235128,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtb89ko",
   "message": "Israelis gonna BDS themselves",
   "created_utc": 1690238957,
   "score": 1,
   "submission_id": "158jvbc"
  },
  {
   "comment_id": "jtaybph",
   "message": "Israel is beautiful and strong they will return to normal quickly",
   "created_utc": 1690234826,
   "score": 1,
   "submission_id": "158jvbc"
  }
 ]
}